[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCmKurapML4BF9Bjtj4RbvXw", "title": "Better Days - The Piano Guys (Lyric Video)", "description": "► STREAM on all platforms: http://thepianoguys.lnk.to/tpg10\n► TPG SHEET MUSIC https://smarturl.it/TPG10_SheetMusic\n► BUY our ALBUM \"10\" here: https://smarturl.it/TPG-Album-10\n► Get ALL our ALBUMS here: https://thepianoguys.com/collections/albums\n► Learn about our beliefs here: https://smarturl.it/TPG_Beliefs\n\n[Al van der Beek here] This song came to me as an answer to a prayer. A few months ago my family and I were going through some very emotional trials and even though I knew they would eventually pass it was difficult for me to see beyond our current circumstances. One morning as I was sitting in the studio feeling the weight of everything that was going on I felt prompted to get on my knees and pray. I didn’t want to pray, but the feeling that I should pray was very insistent. After several strong impressions, that I tried my best to ignore, the following quote came to mind: “If you don't feel like praying, pray until you do!”. I definitely didn’t feel like praying but I reluctantly gave in and got on my knees and started to pray out loud. I started to pour out all the desires and emotions of my heart to God. I didn’t ask Him to take away my trials, but I pleaded with Him to reassure me in that very moment that I would see things as He sees them and that I could have sufficient faith and trust that we would get through this as a family. After my prayer I sat there in tears..waiting..listening.. pondering and feeling overwhelmed with gratitude and love. \n\nI was then prompted to watch a video, titled “Good Things to Come” — You can watch it here https://youtu.be/8nczw6xHJ0I - I have watched and shared this video many times, but this time I watched it with a fresh pair of eyes and an entirely new perspective and understanding. Immediately my mind was flooded with ideas and inspiration and I started to write them all down.\n\nBelieve in good things to come\nThere will be better days\nDon’t you quit\nKeep walking\nWhen you’re drowning, keep swimming\nWhen you’re losing keep winning  \nKeep trying\nHelp and happiness ahead\nSome blessings come soon, some come late, and some come in heaven\nDo you believe in good things to come?\nDon’t chase the storms\nFollow the sun\nFollow the Son. \n\nI stopped thinking and I started writing. The lyrics and the music just came to me and two days later the entire song was finished. I knew that this was God’s way of letting me know that He was listening and that He cared and understood what my family and I were going through. It wasn’t a life or death situation, but the amazing thing was that it mattered to Him. His answer to my prayer was so specific and personal there is no way I can take credit for writing this on my own. I hope this will encourage and uplift anyone who is going through a difficult time right now. Even amidst the most challenging of times we can all have the reassurance and confidence that there will always be good things to come and “Better Days”. \n\nLyric video created by https://lyricvids.com\n\nCredits:\nWritten by Al van der Beek & Steven Sharp Nelson\nAl van der Beek, vocals\nSteven Sharp Nelson, cello\nAll other instruments produced and performed by Al van der Beek\nRecorded, mixed & mastered by Al van der Beek at TPG Studio in Utah\n\nWho are The Piano Guys?\nhttps://thepianoguys.com/pages/about", "link": "https://www.youtube.com/watch?v=Te-nyCZoLRM", "date_published": "2021-01-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]