[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Lous and The Yakuza: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nBob Boilen | January 27, 2021\nThere's an elegant vibe as Lous and The Yakuza perform a Tiny Desk from the Book Bar in the Hôtel Grand Amour in Paris. And while the music is smooth, upbeat and warm, what lies beneath in Lous backstory, in her French lyrics, is, at times, deep and disturbing.\n\nLous — an anagram for \"soul\" — is Marie-Pierra Kakoma, a 24-year-old artist based in Belgium but born in the Democratic Republic of the Congo. She came to Belgium because her family escaped war in the Congo. They were refugees. For her Tiny Desk (home) concert, she opens with her 2019 single, \"Dilemme.\" The song conjures up images of growing up in the Congo and Rwanda: \"Living haunts me, everything that surrounds me made me mean,\" she sings in French. Her songs are often set to Congolese rumba rhythms, filled with resilience, beauty and resistance.\n\nThese songs come from her 2020 album, Gore, and are steeped in a life that saw her mother imprisoned in the Congo for being Rwandan, then become separated during their escape to Belgium. They were eventually reunited, butLous was a troubled teen and spent a period of time adrift before pulling her life together in pursuit of music and art. There's much to uncover and discover here. This Tiny Desk (home) concert is a deep journey.\n\nSET LIST\n\"Dilemme\"\n\"Bon Acteur\"\n\"Dans La Hess\"\n\"Solo\"\n\"Amigo\"\n\nMUSICIANS\nLous: vocals\nJoseph Nelson: keys\nJamiel Blake: drums\nSwaeli Mbappe: bass\nAyelya Douniama: vocals\nMyriam Sow: vocals\n\nCREDITS\nVideo: Lenny Grosman, Robin Conrad and Loris de Oliveira\nAudio: Charles Darnaud\nDirectors: Lenny Grosman and Robin Conrad\nCamera: Loris de Oliveira\nFOH Engineer: Florent Livet\nMonitor Engineer: Antoine Lalbat\nProduction: Jim Schachmes and Brieux Ferot\nStage Manager: Maddly Mendy-Sylva\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nTiny Production Team: Kara Frame, Morgan Noelle Smith\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann", "link": "https://www.youtube.com/watch?v=dzgEjZyN9ec", "date_published": "2021-01-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Sevana: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nAbby O'Neill | January 26, 2021\nThese days it's nice to have an audience cheer you on, even if it's just the lighting crew. Burgeoning Jamaican soul singer Sevana and her six-piece band shot and recorded this Tiny Desk (home) concert at the Kingston Creative Hub back in September 2020 (the interludes you'll hear about the pandemic are reflective of that time). Sevana, a member of Protoje's In.Digg.Nation collective, showcases her vocal range by jumping delicately between traditional R&B, Caribbean gospel and soul, with touches of reggae interspersed.\n\nSevana was nervous for this shoot, but her humility and honesty shone through. On \"Blessed,\" an infectious ode about the miracle of life and faith, she welcomes us with open arms into her church and demonstrates the wide range of her multi-octave voice. She closes out the four-song set with her most recognizable tune, \"Mango,\" a dancehall-influenced love song. These Tropical percussive vibes are sure to send a surge of warmth and joy out to the masses, especially for all of those immersed in below-freezing temperatures in the dead of winter.\n\nSET LIST\n\"If You Only Knew\"\n\"Blessed\"\n\"Be Somebody\"\n\"Mango\"\n\nMUSICIANS\nSevana: vocals\nNicolas Groskoef: electric guitar\nAlmando 'Mundo Don' Douglas: electric guitar\nJean- Andre Lawrence: samples, effect\nRhoan Johnson: keys\nKawain Williamson: bass\nMark Reid: percussion\n\nCREDITS\nVideo: Yoram Savion Jik-Reuben Pringle Dennis Fyffe Shanice Mitchell Travis-John \"Habibi\" Bailey\nAudio: Fumiaki \"Superman\" Ogata, Whitson Williams, Keinotain Johnson, STT Entertainment and Production\n\nTINY DESK TEAM\nProducer: Abby O'Neill\nVideo Producer: Morgan Noelle Smith\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Bob Boilen, Kara Frame, Maia Stern\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann", "link": "https://www.youtube.com/watch?v=LMQp9x3hkMc", "date_published": "2021-01-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]