[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "ID@Xbox Showcase Livestream", "description": "Tune in for a look at upcoming independent titles and new announcements for Xbox including The Artful Escape, Ollie Ollie World, Library of Ruina, and RPG Time.\n\n#xboxshowcaselivestream #xboxshowcase", "link": "https://www.youtube.com/watch?v=S4Ss5a6p698", "date_published": "2021-08-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Tales Of Arise Preview", "description": "Tales of Arise feels like the biggest step forward in the Tales series so far, and we delve into its world through this hands-on chapter one preview.\n\n#talesofarise", "link": "https://www.youtube.com/watch?v=UHVCUEABbPA", "date_published": "2021-08-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Valve's Steam Deck - First Impressions", "description": "Valve's hand-held Steam Deck has been announced with plans for a December 2021 release. Tune in as Jan from Giantbomb.com discusses his hands-on impressions with Tamoor and talks about everything from the portable console's look and feel, to its functions and features.\n\nValve's portable PC console, the Steam Deck, is set to release in December 2021. Until then, GameSpot and Giant Bomb have teamed up to discuss a recent hands-on event in which Jan Ochoa was able to playtest the console for himself. Joined by Tamoor Hussain, Jan discusses his impressions including how it feels in-hand and how well it runs a selection of Steam titles including DOOM Eternal, Hades, and Control.\n\nOn top of its performance, Jan discusses his first impressions such as size, button layout and build quality. He compares it closely to the Wii-U gamepad as a light console with similar thumb sticks. Jan also put the console through its paces with some game-swap testing, changing of video settings and maxing out brightness to test battery strength.\n\nThe Steam Deck will launch in December of 2021. Valve is offering three models starting at $399 with a higher model costing $649. Stick with GameSpot and Giant Bomb for more coverage of the Steam Deck when it launches later this year.\n\n#valessteamdeck #pcconsole #steamdeck", "link": "https://www.youtube.com/watch?v=83ftXPVULGY", "date_published": "2021-08-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]