[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Flock of Dimes: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nStephen Thompson | Aug, 10, 2021\nFlock of Dimes may be a \"solo\" project for Wye Oak's Jenn Wasner, but she couldn't pass up an opportunity to invite a few friends over. You'll spot their familiar faces all over this video: Mountain Man's Amelia Randall Meath, Molly Sarlé and Alexandra Sauser-Monnig, percussionist Matthew McCaughan from Bon Iver... you even get full attendance from Sylvan Esso, given that Meath is seated alongside her partner Nick Sanborn. (He doesn't play in the set, but he did co-produce Flock of Dimes' latest album, so Wasner asked him to sit in and bring a book to read.)\n\nThe result is a communal set — filmed at Sylvan Esso's new studio in Durham, N.C., called Betty's — that doesn't merely re-create three of the songs from this year's Head of Roses. These acoustic performances actually shed new light, thanks to radiant and radically different arrangements, while fully capturing the warmth we look for from Tiny Desk concerts. (Plus, with nine people in the frame, it's a cast large enough that when they clap between songs, they almost sound like a crowd.)\n\nSET LIST\n* \"Two\"\n* \"Price Of Blue\"\n* \"Awake For The Sunrise\"\n\nMUSICIANS\n* Jenn Wasner: vocals, guitar (Flock of Dimes)\n* Amelia Randall Meath: backing vocals (Mountain Man, Sylvan Esso)\n* Alexandra Sauser-Monnig: backing vocals (Mountain Man, Daughter of Swords)\n* Molly Sarlé: backing vocals (Mountain Man)\n* Joe Westerland: percussion (Megafaun)\n* Matthew McCaughan: percussion (Bon Iver)\n* Alan Good Parker: guitar (Natalie Prass, Matthew E. White)\n* Michael Libramento: guitar (Hiss Golden Messenger, Dr. Dog, Floating Action)\n* Head of Roses co-producer Nick Sanborn\n\nCREDITS\n* Video: Spencer Kelly\n* Audio: Chris Boerner\n* Filmed at Betty's in Durham, NC\n\nTINY DESK TEAM\n* Producer: Bob Boilen\n* Video Producer: Maia Stern\n* Audio Mastering: Andy Huether\n* Tiny Production Team: Kara Frame, Josh Rogosin, Gabrielle Pierre, Bobby Carter\n* Executive Producer: Keith Jenkins\n* Senior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #flockofdimes", "link": "https://www.youtube.com/watch?v=pF2ga0O2dN4", "date_published": "2021-08-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Ben Howard: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nBob Boilen | August 9, 2021\nHaving spent time with Collections from the Whiteout, Ben Howard's sonically adventurous fourth album, I was curious to see how he would adapt these songs to the Tiny Desk (home) concert format. So when the opening shot shows Ben in a room alone, an acoustic guitar in hand, it was both an \"oh yeah!\" and an \"uh-oh\" moment. Gone were all those textures that he, Aaron Dessner, and a load of talented musicians had worked on, but front and center was that delicate, reflective voice that I love. It's a voice that, in the recent past, was often swarming in effects and buried in reverb.\n\nSo as Ben Howard opens his Tiny Desk with the album's opening track, I found myself zeroing in on the oblique and painterly images of \"Follies Fixtures\": \"Walk with me to the burning spire. / We can count the dеad on Ender's pyre. / The dusty towns whеre the number's found / Don't quite match the missing.\" He later premieres a new tune, \"Oldest Trick In The Book.\"\n\n\"Thanks for having me and allowing me to play the slight variations of songs that I'm forced to settle with at the moment,\" Ben says, and with that he kicks on the drum machine and plays the music that drew me to his work in 2021. Watch those fingers on the guitar and hear that tone. \"Far Out,\" indeed.\n\nSET LIST\n • \"Follies Fixture\"\n • \"Far Out\"\n • \"I Forget Where We Were\"\n • \"Oldest Trick In The Book\"\n\nMUSICIANS\n • Ben Howard: vocals, guitar, drum machine\n\nCREDITS\n • Video: Allan Wilson\n • Audio: Richard Thomas, Josh Rogosin\n\nTINY DESK TEAM\n • Producer: Bob Boilen\n • Video Producer: Kara Frame\n • Audio Mastering: Josh Rogosin\n • Tiny Production Team: Maia Stern, Gabrielle Pierre, Bobby Carter\n • Executive Producer: Keith Jenkins\n • Senior VP, Programming: Anya Grundmann\n\n#tinydesk #nprmusic #benhoward", "link": "https://www.youtube.com/watch?v=5VHlrsZbgBI", "date_published": "2021-08-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]