[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Apex Legends | Stories from the Outlands –  Northstar", "description": "Check out the all new Apex Legends | Stories from the Outlands - Northstar trailer! Stories from the Outlands - Northstar takes us into the Titanfall universe and shows off a potential new legend in, Valk! \n\n#ApexLegends #Titanfall #Valk", "link": "https://www.youtube.com/watch?v=h-AsMeFRPJE", "date_published": "2021-04-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil Village Preview", "description": "We got a glimpse of an hour of Resident Evil Village footage that primarily focused on the the village, and Lady Dimitrescu's castle. Resident Evil Village looks like a combination of Resident Evil 7 and the more action-oriented Resident Evil 4. The village portion of the game has heavy Resident Evil 4 vibes, with Ethan fighting through hordes of werewolf-like creatures. In the castle, though, Ethan will have to deal with the vampiric Lady Dimitrescu and her daughters. The castle looks like a big change of pace from the more action-heavy village are, as you'll primarily be avoiding Lady Dimitrescu and her daughters, rather than fighting them. Resident Evil Village's next demo, which drops at 5 PM PDT Saturday, April 24, will allow you to explore the Castle for 30 minutes on PlayStation 4 and PlayStation 5.", "link": "https://www.youtube.com/watch?v=pNsufTHEra4", "date_published": "2021-04-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Zelda BOTW Pro Speedrunner and Combat Expert React to New Viral Clips", "description": "We gathered Breath of the Wild pro speedrunner Limcube and combat expert RinHara5aki together to break down some speedruns, combat, glitches, and more.\n\nBreath of the Wild is the game that keeps on giving, with people still finding new things four years later. Luca Jakobi, aka \"Limcube,\" and Max Blumenthal, aka \"RinHara5aki,\" specialize in two separate fields of Breath of the Wild and react to interesting new viral Breath of the Wild clips. \n\nLimcube previously has done reacts videos and consistently speedruns Breath of the Wild to this day, even performing runs for Games Done Quick. He optimizes speedruns, as well, to make new routes. RinHara5aki is one of the first to delve into Breath of the Wild combat specifically, and with his videos amassing more than 13 million views, he continues to document and push the game's evolving combat system.\n\nIn the video above, the pair breaks down what's going on behind the scenes, how difficult the techniques are, and how they're performed. Complex glitches such as Extended Shield clips, Horse Slides, Spaceships, Shield Block Resets, and others are examined.", "link": "https://www.youtube.com/watch?v=plywqaNzMv8", "date_published": "2021-04-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 6's Murder Robot Rumor And Warzones Endgame", "description": "Battlefield 6 rumors include robots, Osprey aircraft, and a desert island map reveal while Call Of Duty keeps adding fantasy content to Warzone and we look at if it could wind up like Call Of Duty: Mobile\n\nBattlefield 6 leaks continue to drop, each one sounding better than the next. This week Richie Bracamonte and Aaron Sampson discuss the latest near-future BF6 rumors as well as the state of Warzone, which might be headed the way of COD Mobile. They’ve also rounded up some good news and some user comments submitted by you!\n\nWith Battlefield 6 fast approaching, Aaron discusses how it appears to be shaping up. Fans have come up with concept art based on leaks and rumors. These include osprey aircrafts, Boston Dynamics robots and more near-future tech that classic fans are sure to love. It’s also this kind of tech and gameplay that attracted millions to 2019’s Modern Warfare reboot.\n\nSpeaking of Call of Duty, Warzone continues its slow-paced Zombie event that’s leading to something bigger. Richie and Aaron discuss the lull of the current event and how it’s been handled much better in previous events such as the “Know Your History” and “Haunting of Verdansk” events and modes. The upside being the recent date announced to kick off season 3 and possibly end our time with the Verdansk map as we know it. \n\n00:00 - Intro\n00:16 - Battlefield 6 Rumors\n03:30 - Can WZ become COD Mobile? \n09:04 - Bad News, Good News, & Comments", "link": "https://www.youtube.com/watch?v=V1S-Z-rxPHU", "date_published": "2021-04-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Mass Effect Lore: The First Contact War", "description": "This week in our Mass Effect lore series, Jordan delves into The First Contact War between humans and Turians. It may happen before the events of the Mass Effect trilogy, but it's a key event that sets the stage for humanity's place in the galaxy in Mass Effect 1.", "link": "https://www.youtube.com/watch?v=athBV4PjiGg", "date_published": "2021-04-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil Village Demo Gameplay (PS5)", "description": "Get a glimpse of 27 minutes of gameplay from the Resident Evil Village Demo, which showcases combat, crafting, exploration and more in the Village area. We fight off lycans and make our way through the village in the latest demo on the PlayStation 5. The next demo on April 24th, will allow you to check out the castle area. Here you'll most likely run into Lady Dimitrescu and her three daughters. You'll have from 5pm PDT to 1am PDT to try out the demo.", "link": "https://www.youtube.com/watch?v=uvfii6Zb_8E", "date_published": "2021-04-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]