[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "Inside Japan's Nuclear Meltdown (full documentary) | FRONTLINE", "description": "A devastating earthquake and tsunami struck Japan on March 11, 2011 triggering a crisis inside the Fukushima Daiichi nuclear complex. This 2012 documentary reveals how close the world came to a nuclear nightmare. \n\nThis journalism is made possible by viewers like you. Support your local PBS station here: http://www.pbs.org/donate​.\n\nIn the desperate hours and days after the Fukushima nuclear disaster, the fate of thousands of Japanese citizens fell into the hands of a small corps of engineers, firemen and soldiers who risked their lives to prevent the Daiichi nuclear complex from complete meltdown. FRONTLINE tells the story of the workers struggling frantically to reconnect power inside the plant’s pitch-dark and highly radioactive reactor buildings; the nuclear experts and officials in the prime minister’s office fighting to get information as the crisis spiraled out of control; and the plant manager who disobeyed his executives’ orders when he thought it would save the lives of his workers.\n\nLove FRONTLINE? Find us on the PBS Video App where there are more than 300 FRONTLINE documentaries available for you to watch any time: https://to.pbs.org/FLVideoApp​ \n\n#Documentary​ #InsideJapansNuclearMeltdown\n\nSubscribe on YouTube: http://bit.ly/1BycsJW​\nInstagram: https://www.instagram.com/frontlinepbs​\nTwitter: https://twitter.com/frontlinepbs​\nFacebook: https://www.facebook.com/frontline\n\nMajor funding for FRONTLINE is provided by the Ford Foundation. Additional funding is provided by the Abrams Foundation; the John D. and Catherine T. MacArthur Foundation; Park Foundation; the Heising-Simons Foundation; and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation, and additional support from Koo and Patricia Yuen.", "link": "https://www.youtube.com/watch?v=qRKScRgsUaE", "date_published": "2021-03-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]