[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCHnyfMqiRRG1u-2MsSQLbXA", "title": "The Discovery That Transformed Pi", "description": "For thousands of years, mathematicians were calculating Pi the obvious but numerically inefficient way. Then Newton came along  and changed the game. This video is sponsored by Brilliant. The first 314 people to sign up via https://brilliant.org/veritasium get 20% off a yearly subscription.\n\nHappy Pi Day! (for a few days ago...)\n\nReferences:\nArndt, J., & Haenel, C. (2001). Pi-unleashed. Springer Science & Business Media — https://ve42.co/Arndt2001\n\nDunham, W. (1990). Journey through genius: The great theorems of mathematics. Wiley — https://ve42.co/Dunham1990\n\nBorwein, J. M. (2014). The Life of π: From Archimedes to ENIAC and Beyond. In From Alexandria, Through Baghdad (pp. 531-561). Springer, Berlin, Heidelberg — https://ve42.co/Borwein2012\n\nSpecial thanks to Alex Kontorovich, Professor of Mathematics  at Rutgers University, and Distinguished Visiting Professor for the Public Dissemination of Mathematics National Museum of Mathematics MoMath for being part of this Pi Day video.\n\nSpecial thanks to Patreon supporters: Jim Osmun, Tyson McDowell, Ludovic Robillard, jim buckmaster, fanime96, Juan Benet, Ruslan Khroma, Robert Blum, Richard Sundvall, Lee Redden, Vincent, Lyvann Ferrusca, Alfred Wallace, Arjun Chakroborty, Joar Wandborg, Clayton Greenwell, Pindex, Michael Krugman, Cy 'kkm' K'Nelson, Sam Lutfi, Ron Neal\n\nWritten by Derek Muller and Alex Kontorovich\nAnimation by Ivy Tello\nFilmed by Derek Muller and Raquel Nuno\nEdited by Derek Muller\nMusic by Jonny Hyman and Petr Lebedev\n\nAdditional Music from https://epidemicsound.com \"Particle Emission\", \"Into the Forest\", \"Stavselet\", \"Face of the Earth\", \"Firefly in a Fairytale\"\n\nThumbnail by Gianmarco Malandra and Karri Denise", "link": "https://www.youtube.com/watch?v=gMlf1ELvRzc", "date_published": "2021-03-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]