[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "Nostalgia and efficiency - MATE Desktop Tour", "description": "Download Safing's Portmaster for FREE and take control of your network traffic: https://safing.io/portmaster\n\nGet your Linux desktop or laptop here: https://slimbook.es/en/\n\nIt's time we started taking a look at MATE, the last major desktop environment I have never used. All I know about MATE is that it's basically a continuation of the GNOME 2 desktop, which I have used for a long time back when I started using Linux in 2006 on Ubuntu Dapper Drake. Let's see if that is true, and if GNOME 2, or MATE, is still up to the challenge in 2021.\n\nBecome a channel member to get access to a weekly patroncast and vote on the next topics I'll cover:\nhttps://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nSupport the channel on Patreon: \nhttps://www.patreon.com/thelinuxexperiment\n\nFollow me on Twitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\nFollow me on ODYSEE: https://odysee.com/@TheLinuxExperiment:e\nOr join ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\nThe Linux Experiment merch: get your goodies there! https://teespring.com/en-GB/stores/the-linux-experiment\n\n\n## What is MATE\n\nMATE, written like \"mate\", but pronounced MA TAY, like a special kind of tea-like beverage, saw the light of day in August of 2011. It's one of the projects that spawned from GNOME announcing GNOME 3 and the GNOME Shell: some people wanted to use the new underlying foundations but retain a more traditional desktop, and created Cinnamon, and some others just wanted to keep things as-is, and created MATE.\n\n## The desktop\n\nThe layout is very simple: you have 2 slim panels, on the top, and the bottom of the screen. The top one hosts most system controls, like the three part menu, shortcuts, and system applets. The bottom one lets you interact with windows and desktops, with the show desktop button, the window list, and the virtual desktop switcher.\n\nThe menu is one of the things I miss most from the GNOME 2 days: it separates cleanly the Applications, the places you'd want to browse, and the System preferences. It's probably the most sensible menu layout I've ever used, and no other desktop I've been working with has ever came close to its practicality.\n\nThe rest of the desktop though, isn't really to my liking anymore. Small icon shortcuts in the top panel can't measure to a dock in terms of mouse aiming, and the default applets aren't really information packed, or super useful in terms of interacting with your system. The sound applet just gives you volume, without a way to select an audio output or input, the date and time applet doesn't let you see calendar appointments, and there is no notification applet that lets you go back to notifications you might have received and missed.\n\nThe window list isn't really to my liking either, since I'm so used to docks, or icons-only task managers, and it doesn't feel very space efficient.\n\nSome other things have aged a bit: the lack of animations of the window manager, notably.\n\n## Look and feel\n\nSpeaking of looks, I used the default Menta theme for GTK, the windows, and the icons. Here again, you definitely feel the older GTK look and feel, with soft gradients, plain color highlights, and big, raised buttons.\n\nIt's pleasing enough to use, although the green tint to the highlights and the icons isn't really my personal preference. The icons look exactly like older GNOME icons, in the Tango style, which isn't really my thing either, but they're consistent, recognizable and colorful at least. It's a bit refreshing to see a desktop that hasn't gone towards flat design, even though it does make it feel straight out of the early 2000s.\n\nMATE makes use of menubars in their applications.\n\n## Configuration\n\nMATE is pretty configurable. You'll find plenty of menus, hardware monitors, disk mounters, and other googly eyes in there, and you can create new panels, stack them on the same screen edge, make them autohide, expand to the full width of the screen, change their background color... You name it.\n\nIn terms of settings for the desktop itself, MATE gives you both the system menu, sorted between Preferences, and Administration, as well as an all in one Configuration panel.\n\nOptions are numerous here. You have the all important acceleration profile settings for the mouse, all the options to change the theme, the icons, the mouse cursor, the fonts, the wallpaper and anything else, you can edit the main menu itself and reorder it, you can enable centered window placement, and you can change the default apps for a lot of filetypes, among a ton of other settings. \n\nIn terms of RAM usage, MATE on Fedora, on a cold boot with 16GB of RAM, uses 1.1 to 1.3 Gb. It's definitely a bit heavier than XFCE out of the box, but barely. This makes it really suitable if your computer is a potato or if you want to have as much unused RAM as possible.", "link": "https://www.youtube.com/watch?v=1Tx4NdPpDcI", "date_published": "2021-07-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]