[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 Portal Reveal - Everything You Missed", "description": "Battlefield 2042 has gotten two detailed trailers for its new Portal mode, which allows players to customize matches on six different remastered maps from 1942, Bad Company 2, and Battlefield 3. Let’s take a deep dive into all the details you might have missed. \n\nEA Play Live had some major announcements, including a Dead Space remake and a massive new mode for Battlefield 2042 that almost doubles the number of maps available at launch from the main All-Out Warfare experience. Battlefield Portal adds six remastered maps across 1942, Bad Company 2, and Battlefield 3. These maps allow players to fully customize a massive list of options, including pitting armies from different eras against one another, choosing what weapons and attachments they fight with, picking win conditions, what vehicles are available, and even using a logic editor to program modes like gun game or protect the VIP. \n\nIn this video, we’re going through the Battlefield Portal reveal trailer frame by frame to break down all the details you might have missed. You can see a new specialist and gadget, how the HUD works, how weapons seem to handle, and even how fast the new robot dog named Ranger can get destroyed. Some of these modes look ridiculous, like EOD bots versus tanks and wingsuits versus airplanes. Some other things you can spot in the trailers are greater destruction on the 1942 map El Alamein, the new low tide area on Bad Company 2 map Valparaiso, and the return of the tracer dart. Each of the returning maps runs on the latest Frostbite engine, has remastered visuals, and some maps have added areas to accommodate 128 players. \n\nBattlefield 2042 beta dates will happen in September, following technical alphas to test cross-platform play, cross-save, and cross commerce. We’re still awaiting more information on Hazard Zone, which is an alternative to battle-royale modes. Battlefield 2042 releases on October 15 if you preorder specific editions and October 22 for everyone else.\n\n#Battlefield2042", "link": "https://www.youtube.com/watch?v=cFZLEhw_Qbc", "date_published": "2021-07-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To MORE Battlefield 4 Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the insane weaponry of Battlefield 4, including the French FAMAS rifle, the Chiappa Rhino revolver, and the Javelin Anti-tank Missile System.\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of Battlefield 4, and compares them to their real-life counterparts.\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can purchase Jonathan’s book here - https://www.headstamppublishing.com/bullpup-rifle-book\n\nYou can check out Jonathan on the Fighting on Film podcast here - https://www.youtube.com/playlist?list=PLNsrU8HuCAzaizIqbAcNZ5VUQW789z3ZF\n\n#firearms #Battlefield4", "link": "https://www.youtube.com/watch?v=OolGxrGNXKY", "date_published": "2021-07-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts: LMGs in Video Games (Bonus Episode)", "description": "In this Bonus episode of Firearm Expert Reacts, Jonathan discusses the history of the light machine gun, how they differ from heavy machine guns, and of course, how they work in video games.\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArm...\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/ \n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. -\nhttps://royalarmouries.org/support-us/membership/\n\nYou can purchase Jonathan’s book here - https://www.headstamppublishing.com/bullpup-rifle-book\n\n#firearms", "link": "https://www.youtube.com/watch?v=X4-_ExDxo5w", "date_published": "2021-07-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]