[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Global disinformation", "description": "Mystery anti-Pfizer campaign offer\n\nhttps://www.bbc.co.uk/news/world-europe-57250285\n\nSeveral French social media influencers\n\nMysterious financial offer to spread negative publicity about Pfizer vaccine\n\nLeo Grasset on YT\n\nhttps://www.youtube.com/watch?v=dSlh4ONU01M\n\nColossal budget was offered\n\nfrom a client who wants to remain incognito\n\naddress the agency appeared to be bogus\n\nLinkedIn profiles of the agency's alleged employees he had managed to find later disappeared\n\nhe noticed that everybody there has worked in Russia\n\nPresent the material as your own independent view\n\nfalse claim, Pfizer deaths 3 times that of AstraZeneca\n\nEt Ça Se Dit Médecin, offered €2,050 ($2,510; £1,775) for a 30-second story on his account\n\nEuropean External Action Service \n\nThe European External Action Service is the diplomatic service and combined foreign and defence ministry of the European Union.\n\nhttps://euvsdisinfo.eu/eeas-special-report-update-short-assessment-of-narratives-and-disinformation-around-the-covid-19-pandemic-update-december-2020-april-2021/\n\nDisinformation around the COVID-19 pandemic, measures taken to contain it and vaccine roll-out campaigns continues to be significant. \n\nvaccine-related disinformation increased and contributed to spreading fear and mistrust in any type of vaccine.\n\nsince the beginning of 2021 state-sponsored disinformation also intensified, targeting in particular Western-developed vaccines.\n\nRussia and China, in particular, continue to intensively promote their own state-produced vaccines around the world. \n\nis combined with disinformation and manipulation efforts to undermine trust in Western-made vaccines, EU institutions and Western/European vaccination strategies. \n\nBoth Russia and China are using state-controlled media, networks of proxy media outlets and social media, including official diplomatic social media accounts, to achieve these goals. \n\nViral origins\n\nhttps://www.foxnews.com/politics/fauci-not-convinced-covid-19-developed-naturally\n\nQ, Katie Sanders\n\nare you still confident that it developed naturally?\n\nA, Dr Fauci\n\nNo actually \n\nI am not convinced about that\n\nI think we should continue to investigate what went on in China until we continue to find out to the best of our ability what happened\n\nCertainly, the people who investigated it say it likely was the emergence from an animal reservoir that then infected individuals\n\nbut it could have been something else, and we need to find that out\n\nWHO-convened global study of origins of SARS-CoV-2: China Part\n\nhttps://www.who.int/publications/i/item/who-convened-global-study-of-origins-of-sars-cov-2-china-part\n\nTeam of 17 international experts\n\nUnknown animal species, very likely\n\nLab-leak idea extremely unlikely\n\nImported on frozen food\n\nPresident Biden\n\nhttps://www.washingtonpost.com/world/2021/05/27/wuhan-lab-theory-evidence/\n\nU.S. intelligence community does not believe there is sufficient information on different scenarios\n\nasking the U.S. intelligence community to redouble its efforts\n\npartner with like-minded partners around the world to press China to participate in a full, transparent, evidence-based international investigation\n\nWorld Health Assembly, calls to significantly expand upon the WHO-backed investigation\n\nOpen letter\n\nhttps://science.sciencemag.org/content/372/6543/694.1\n\ngreater clarity about the origins of this pandemic is necessary and feasible to achieve \n\nWe must take hypotheses about both natural and laboratory spillovers seriously until we have sufficient data. \n\nA proper investigation should be transparent, objective, data-driven, inclusive of broad expertise, subject to independent oversight\n\ntheories of accidental release remained viable", "link": "https://www.youtube.com/watch?v=AoSHkuc0hp8", "date_published": "2021-05-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]