[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCSiPjfAJBgbFlIUsxOWpK0w", "title": "La chanson de Maxence // Michel Legrand // POMPLAMOOSE", "description": "Gardenview out now, listen on Spotify (https://sptfy.com/gardenview) or wherever you listen to music.\n\n This might be my favorite song on the upcoming French record.\n\nSave this song on Spotify: https://spoti.fi/2r3Yqkh\nFollow us on instagram: https://instagram.com/pomplamoosemusic\nBecome a patron of our music (to vote on the songs we cover and get merch and stuff like that): http://www.patreon.com/pomplamoose\n\nA cover of Michel Legrand's \"La chanson de Maxence\" by Pomplamoose.\n\nMUSICIAN CREDITS\nVocals: Nataly Dawn\nAccordion: Jack Conte\nHi Strung Guitar: John Schroeder\nChromatic Harmonica: Ross Garren\nUpright Bass: Eliana Athayde\nAcoustic Guitar: Erik Miron\nClarinet: John Tegmeyer\nDrums: Ben Rose\nBackground Vocals: Sarah Dugas\n\nAUDIO CREDITS\nEngineer: Tim Sonnefeld \nAssistant Engineer: Branko Presley\nMixing/Mastering: Caleb Parker\nProducer: John Schroeder\n\nVIDEO CREDITS\nVideo Production/Direction: Ricky Chavez, George Sloan\nCamera Operators: Merlin Showalter, Sammy Rothman, Dijon Herron, Charlene Gibbs\nArt Design: George Sloan, Susannah Honey\nVideo Editor: Cleveen Dominguez\nColorist: Charlene Gibbs\n\nRecorded at The Village in Los Angeles.\n\nLYRICS (French / English)\nJe l'ai cherchée partout / I’ve searched for her everywhere\nJ'ai fait le tour du monde / I’ve been around the world\nDe Venise à Java, de Manille à Angkor / From Venice to Java, From Manilla to Angkor\nDe Jeanne à Victoria, de Vénus en Joconde / From Jeanne to Victoria, from Venus to Joconde*\nJe ne l'ai pas trouvée et je la cherche encore / I haven’t found her and I search for her still\n\nJe ne connais rien d'elle et pourtant je la vois / I know nothing about her and yet I see her\nJ'ai inventé son nom, j'ai entendu sa voix / I’ve made up her name, I’ve heard her voice\nJ'ai dessiné son corps et j'ai peint son visage / I’ve sketched her body and painted her face\nSon portrait et l'amour ne font plus qu'une image / Her portrait and love have become a single image\n\nSa démarche ressemble aux souvenirs d'enfant / Her walk resembles childhood memories\nQui trottent dans ma tête et dansent en rêvant / That run through my head and dance as they dream\nSur son front, ses cheveux sont de l'or en bataille / On her brow, her hair is tousled gold\nQue le vent de la mer et le soleil chamaillent / That the ocean wind and the sun tease\n\nJe pourrais vous parler de ses yeux, de ses mains / I could speak to you of her eyes, of her hands\nJe pourrais vous parler d'elle jusqu'à demain / I could tell you about her until tomorrow\nSon amour, c'est ma vie mais à quoi bon rêver? / Her love is my life, but what good is this dream?\nJe l'ai cherchée partout et je ne l'ai pas trouvée / I’ve looked for her everywhere and I haven’t found her\n\nJe la chercherai à jamais / I’ll search for her always\n\n*La Joconde is another name for the Mona Lisa, from the Italian La Gioconda, which is the feminine version of her husband's last name, del Giocondo. It means jocund or jolly, lighthearted.", "link": "https://www.youtube.com/watch?v=NilqH1UjR6Y", "date_published": "2021-05-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]