[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Karol G: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nAnamaria Sayre | May 27, 2021\nColombian reggaetonera Karol G floats between styles on this wistful Miami set with the breeziness of a pop star who knows no boundaries – or maybe it's the calculus of an artist who has built a career on subverting them. Her personal, unapologetic flourish has allowed her to top the Billboard charts of a genre with limited female participation, and even less superstardom.\n\nHer signature bichota energy is subtle, yet pervasive in her stripped-down Tiny Desk (home) concert. Flanked by an illuminated all-women band, Karol G's authentic command of the intimate moment and its intended audience is unmistakable. She's stepping down from atop the glossy sets and sparkly stages to share secrets — lessons learned during her sudden ascent about humility, grace and empowerment — with the millions of niñitas who will watch this concert, enraptured by her effortless confidence and smooth Spanish bars.\n\nWithout a doubt, Karol G strikes a perfect balance here of vulnerability and star power, taking us on a journey through her many iterations. She deftly moves from a ballad-like rendition of urbano mash-up \"Créeme/A Ella\" to a soulful performance of trap corrido \"200 COPAS\" (her proclaimed favorite song at the moment) with Mexican Regional cariño Danny Felix. Closing with a first-ever live performance of the dreamy duet \"CONTIGO VOY A MUERTE,\" she marks the end of the concert with a nod to her roots. Intertwined with fellow Colombiano Camilo, Karol G expresses gratitude and pride; she is the unguarded depiction of a superstar eternally enamorado with her fans and her country.\n\nSET LIST\n\"Créeme/A Ella\"\n\"200 COPAS\"\n\"CONTIGO VOY A MUERTE (feat. Camilo)\"\n\nMUSICIANS\nKarol G: vocals\nSus Vasquez: guitar\nAnastasiia Zaichenko: bass\nGuilliana Merello: drums\nBryn Bliska: keyboard\nCamilo: vocals\nDanny Felix: guitar\n\nCREDITS\nVideo: José Emilio Sagaró, Chris Cabrera\nAudio: John Buitrago, Will Madera, Fernando Argento\n\nTINY DESK TEAM\nProducer: Abby O'Neill\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Kara Frame, Bob Boilen, Gabrielle Pierre\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #karolg", "link": "https://www.youtube.com/watch?v=MQSos6YvrKk", "date_published": "2021-05-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]