[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "KDE Plasma 5.22 - Wayland users are going to be pleased", "description": "The first 1000 people to use the link will get a free trial of Skillshare Premium Membership: https://skl.sh/thelinuxexperiment06211\n\nToday, we're going to take a look at Plasma 5.22, the next release of KDE Plasma. There are no groundbreaking changes here, as expected, since Plasma 5.21 released about 3 months ago, and it mostly focuses on improving support for Wayland, but there are some nice quality of life imporvements in here as well. \n\nBecome a channel member to get access to a weekly patroncast and vote on the next topics I'll cover:\nhttps://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nSupport the channel on Patreon: \nhttps://www.patreon.com/thelinuxexperiment\n\nFollow me on Twitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\nFollow me on ODYSEE: https://odysee.com/@TheLinuxExperiment:e\nOr join ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\nThe Linux Experiment merch: get your goodies there! https://teespring.com/en-GB/stores/the-linux-experiment\n\n\n## Quality of life improvements\n\nIn the plasma desktop itself, you'll find many smaller improvements. The first one is the adaptive transparency for panels and their widgets. This feature will let you have panel transparency when you just have open windows floating around, and have them turn opaque when you have a maximised window.\n\nThe new Menu introduced in Plasma 5.21 took ages for it to move to another application category when you hovered over it. This annoying delay is now gone, and it makes the menu a lot more responsive and a lot nicer to use.\n\nIn the digitalclock, you can now choose to display the date next to the time at all times, instead of having it displayed under it if the panel was big enough.\n\nThe audio applet lets you select a profile for each of your audio peripherals, right from the applet, instead of having to dig into the settings.\n\nUsers of Klipper, the clipboard manager, will now be able to press Meta+V to get the clipboard history displayed at the current mouse cursor's location.\n\nYou can now change the text size in sticky note widgets.\n\nIn the task manager, when you hover over an app's icon, you get a thumbnail of that app and the highlight will only happen when you hover over the thumbnail itself. This behaviour is also the default.\n\nIn the notifications area, notifications about files will now show which app will be used when you click the \"open\" button.\n\nWhen downloads initiated from a webbrowser are waiting for an action from you to resume or really start the download, the notification will also let you know.\n\nFinally, when you're broadcasting or sharing your screen, do not disturb mode will automatically enable itself.\n\nKrunner can now display multiple lines of text for search results.\nKrunner also won't display duplicate results from different runners.\n\nIn terms of applications, Plasma 5.21 introduced a new System monitor, well, it's now the default and replaces KSysguard.\n\nIn the system settings, the first page you'll see is a \"quick settings\" page, that shows some of the most frequently accessed settings, namely switching from a light theme to a dark theme, changing the animation speed, the wallpaper, or the single click/dual click behavior in the file manager.\n\nPlasma introduced offline updates in the previous release, and in Plasma 5.22, you can now enable or disable that behavior, so everyone can have their cake and eat it too. At least on distros that support that feature.\n\nJust a quick note: on KDE neon, you can still update manually in place, without a reboot, if you're using the command line, only updating through discover triggered that \"reboot to update\" behavior.\n\n## Wayland\nFirst, the Plasma Activities are now supported on Wayland. THis is a feature I haven't really used yet on my KDE Desktop. Think of them as groups of virtual desktops: each activity has their own virtual desktops, widgets, and wallpapers.\n\nExclusively on Wayland, when you're using the global menu applet, you'll see a \"search\" item on the right side of the menu, that lets you search through all items in the app's menu.This is something you could do in the Unity desktop, or on MacOS, and it's a really fantastic feature, taht I wish would come to X.org as well.\n\nKwin also has received a huge update to better support the wayland protocol. First, performance is improved on non-Nvidia GPUs for fullscreen windows.\nPlasma also supports variable refresh rates and freesync screens when using wayland, and you can also hot plug GPUs, and Kwin will adapt automatically.\n\nVertical and horizontal maximization, when you drag a window to the edges of the screen should now work correctly as well, and you're now able to use the \"Present Windows\" effect more reliably, to get an exposé-like view.\n\n\n\nThis video is sponsored by Skillshare", "link": "https://www.youtube.com/watch?v=RKrVnUzxL08", "date_published": "2021-06-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]