[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "12 Essential Ratchet & Clank: Rift Apart Tips (4K)", "description": "If you're picking up Insomniac Games' latest PS5 exclusive, Ratchet And Clank: Rift Apart, here are 12 essential tips to help you get the most from the interdimensional adventure. \n\nRatchet & Clank: Rift Apart has finally arrived for the PlayStation 5, and if our review is anything to go by it's an absolute banger, taking full advantage of the console's hardware and DualSense capabilities. But like previous Ratchet games it's got a lot more going on than its light-hearted appearance may let on.\n\nIn order to best prepare yourself for the whacky interdimensional adventure ahead, we've gathered together 12 crucial tips for the game, from the best weapons for the job, where to spend your hard-earned Raritanium, and how best to deal with puzzles to how to take advantage of Rifts while you're battling enemies. \n\nFor more on Ratchet & Clank: Rift Apart, including our review (in glorious 4K), make sure to subscribe to youtube.com/GameSpot. Ratchet & Clank: Rift Apart is available now for PlayStation 5. Footage used in this video was captured on PS5 in Fidelity Mode.", "link": "https://www.youtube.com/watch?v=0NylbZHYJB0", "date_published": "2021-06-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Back 4 Blood Beta and Boss Reveal | Summer Game Fest 2021", "description": "A brand new Back 4 Blood trailer showcasing a new boss and details on the beta was shown. Back 4 Blood is a new game by the creators of Left 4 Dead, with an open Beta beginning August 5th, and Back 4 Blood itself releasing October 12th.", "link": "https://www.youtube.com/watch?v=k73Uk8vhc6o", "date_published": "2021-06-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 - Both Playground & Combat Zone", "description": "DICE finally got to show off the next generation of Battlefield in Battlefield 2042. With it's focus on a playground sandbox, what does this mean for the franchise and Battlefield veterans?", "link": "https://www.youtube.com/watch?v=u_xvhH9LkH0", "date_published": "2021-06-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Best Trailers from Summer Game Fest 2021", "description": "We round up the most exciting trailers from Summer Game Fest 2021.\n\nGeoff Keighley was excited at the end of Summer Fest 2021. And for a good reason, too. Elden Ring! Here is a selection of the best trailers from Summer Game Fest 2021. \n\n00:03 - Elden Ring\n02:57 - Death Stranding\n05:35 - Tiny Tina's Wonderlands\n07:10 - Metal Slug Tactics\n08:53 - Jurassic World Evolution 2\n10:12 - Call of Duty Season 4\n11:12 - Escape from Tarkov - Battle for Concordia (Streets of Tarkov teaser #3)\n13:41 - Evil Dead The Game\n16:05 - Bloodhunt", "link": "https://www.youtube.com/watch?v=jfiEJxmjaG0", "date_published": "2021-06-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Bloodhunt World Premiere Trailer | Summer Game Fest 2021", "description": "The brand new Swedish studio, Sharkmob, released details on Blood Hunt, which will take place in the Vampire: The Masquerade universe. In Blood Hunt you'll be joining the hunt by utilizing weapons and supernatural powers to fight off against vampires, or even become a vampire yourself.", "link": "https://www.youtube.com/watch?v=FTMIK_q_C6I", "date_published": "2021-06-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty Full Presentation | Summer Games Fest 2021", "description": "Call of Duty Warzone and Cold War Season Four is on its way with new maps and operators, plus expanded zombies content. Collateral will include 6v6 and 12v12, Amsterdam will be a 2v2 map, and Hijacked 6v6. Season Four will be a free content update and releases June 17, 2021.", "link": "https://www.youtube.com/watch?v=XqpcuhVWyb4", "date_published": "2021-06-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Chivalry II Launch Trailer | Summer Game Fest 2021", "description": "The sequel to Chivalry is here, today: Chivalry II. The epic medieval sword and board battler makes it's return with new battlefields. Chivalry: Medieval Warfare first launched in 2012, so Medieval II has been a long time coming.", "link": "https://www.youtube.com/watch?v=Oec8aFtn4Jo", "date_published": "2021-06-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Dark Pictures Anthology: House Of Ashes Story Trailer | Summer Game Fest 2021", "description": "House Of Ashes is the next installment in the The Dark Pictures Anthology series. The trailer takes the horror to an underground storage facility in Iraq that is being infiltrated by a group of soldiers. But what they find down there is beyond anything they could have ever imagined.", "link": "https://www.youtube.com/watch?v=z9nvp51482o", "date_published": "2021-06-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Day of the Devs Summer Game Fest Live", "description": "Tune in for Day of the Devs to see news, announcements, trailers and more. Brought to you by Double Fine and IAM8Bit as part of the Summer Games Fest.\n\n#summergamefest", "link": "https://www.youtube.com/watch?v=PzPUzXG5c4o", "date_published": "2021-06-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Elden Ring Gameplay World Premiere | Summer Game Fest 2021", "description": "Fromsoftware's Elden Ring has finally received its first trailer in 2 years. This time, we get to see Elden Ring gameplay, including horseback riding, desolate locations, and horrific creatures. The gameplay looks to be utilizing Fromsoftware's classic slow-paced action style and the presence of an unending curse, resembling the story of Dark Souls. We got to see dragons, giants, medieval backdrops, magic, and more in this Norse inspired game with its world crafted by both Hidetaka Miyazaki and George R.R. Martin. Elden Ring's release date is currently set at January 21, 2022.\n\nCheck out the Elden Ring Gameplay Reveal Trailer! This is the first look at Elden Ring gameplay footage that the world has seen and the first look at the game since the Elden Ring teaser trailer. \n\n#EldenRing #FromSoftware #DarkSouls", "link": "https://www.youtube.com/watch?v=71HHtVh0Jdo", "date_published": "2021-06-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Escape From Tarkov New Map Premiere | Summer Game Fest 2021", "description": "The hyper-realistic tactical first person shooter, Escape From Tarkov, is getting a new map. During the 2021 Summer Game Fest, a new urban environment showing off a parking garage, abandon store fronts, vehicles, destructible environments, and more. Things get tense in this new map to escape.", "link": "https://www.youtube.com/watch?v=XksUfnU3p2E", "date_published": "2021-06-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Final Fantasy 7 Remake: PS4 Pro vs. PS5 Comparison", "description": "Final Fantasy 7 Remake's PlayStation 5 update revamps the graphics and performance of the game, so we put it side-by-side with the original PlayStation 4 Pro version", "link": "https://www.youtube.com/watch?v=mqerSqu6dek", "date_published": "2021-06-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Giancarlo Esposito Far Cry 6 Interview | Summer Game Fest 2021", "description": "Actor Giancarlo Esposito spoke with Geoff keighley during Summer Game Fest 2021 about his role as Gus in Far Cry 6, his thoughts on being a villain, and his characters passion for his country.", "link": "https://www.youtube.com/watch?v=AuXS0_6OkvE", "date_published": "2021-06-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Jurassic World: Evolution 2 | Summer Game Fest 2021", "description": "Jeff Goldblum stopped by Summer Game Fest to reveal the world premiere of an upcoming Jurassic World game. The game looks to be based directly on the Jurassic Park and Jurassic World films with the familiar Jurassic Park vehicle driving past. The game was announced to be coming in 2021. Premiered at Summer Game Fest 2021.", "link": "https://www.youtube.com/watch?v=lZysAwJzvIY", "date_published": "2021-06-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Monster Hunter Stories 2 Story Trailer | Summer Game Fest 2021", "description": "Monster Hunter Stories 2 is coming to the Nintendo Switch July 2021. This new trailer showcases grand cinematics, imaginative monsters, and over-the-top melodrama.", "link": "https://www.youtube.com/watch?v=dimycnMwDQw", "date_published": "2021-06-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Season Four Gameplay Trailer | Call of Duty: Black Ops Cold War & Warzone", "description": "Check out the Season Four Gameplay Trailer for Call of Duty: Black Ops Cold War & Warzone!", "link": "https://www.youtube.com/watch?v=YoFWilE1Y9E", "date_published": "2021-06-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Summer Game Fest Kick Off Livestream", "description": "Tune in for a bunch of World Premieres, news, announcements, and a live performance by Weezer. Tune in for the Summer Game Fest Kick Off livestream on June 10th at 11am PT hosted by Geoff Keighley. Summer Game Fest is produced by the producers of The Game Awards and will be ready to unveil potentially some of the biggest games this year. \n\n#SummerGameFest #SGF #GeoffKeighley", "link": "https://www.youtube.com/watch?v=_8WtLn9J6SY", "date_published": "2021-06-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Tina Tiny's Wonderlands World Premiere Trailer | Summer Games Fest", "description": "Wonderlands is a high fantasy take on the looter shooter, filled with unicorns, dragons, and a Borderlands-like attitude. The game also features an all-star cast with Andy Sandberg, Ashly Burch, Will Arnett, and many more. The game is expected to release early 2022. Premiered at Summer Game Fest 2021.", "link": "https://www.youtube.com/watch?v=fiMqyqHetKY", "date_published": "2021-06-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 - Everything You Need To Know", "description": "The Battlefield 2042 reveal trailer only covered a fraction of what you should know. Here's everything we learned from our preview session with DICE including the release date, in-game gun customization, the new specialist class system, map breakdowns, new conquest mode, massive player count, and if there will or won’t be a battle-royale.", "link": "https://www.youtube.com/watch?v=aWfdKk7-KJ0", "date_published": "2021-06-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 Reveal Trailer Premiere", "description": "Check out the world premiere for the Battlefield 2042 Reveal Trailer! Battlefield 2042 is the next installment in the Battlefield franchise and is set to release in the fall of 2021! \n\n#Battlefield2042 #Battlefield", "link": "https://www.youtube.com/watch?v=belABLkA7J8", "date_published": "2021-06-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 Trailer - Everything You Missed", "description": "Battlefield 2042 has a release date, a new class system, increased player count, massive maps, upcoming alphas, and more. Let’s break down the reveal trailer and point out where each of these changes can be seen. \n\nBattlefield 2042 (previously referred to as Battlefield 6) is the next confirmed entry in EA's big shooter franchise. The game takes place in the near future and makes some major changes to the series. Maps will be larger than previous games, the player count has been raised to 128 on next-gen platforms and PC. Conquest mode is getting a makeover with Sectors full of objectives to fight over causing matches to go between moments of calm and huge forces colliding in one place. 2042 will not have massive destruction but it will include the return of Levolution, ground deformation, and extreme weather events including sandstorms and tornadoes. 2042 will also sport a revamped class system that uses ten Specialists in the place of the classic Engineer, Recon, Support, and Assault classes. Specialists are fully voiced and each has a unique gadget and ability. \n\nIn this video, we’re going to take a look at the reveal trailer which is not actual gameplay but shows off the game’s maps, Specialists, vehicles, and mechanics. We’re taking you through frame by frame so that you have a full understanding ahead of the Gameplay Reveal on June 13th at E3 2021. \n\nBattlefield 2042 will have a technical playtest in early July with more announcements at EA Play Live on July 22nd. And the totally not battle-royale mode Hazard Zone will be in alpha pre-launch, followed by an open beta at a later date. Battlefield 2042 releases on October 22nd, 2021 for PC, PlayStation 5, PS4, Xbox Series X/S, and Xbox One.", "link": "https://www.youtube.com/watch?v=fimQ1F9YXXE", "date_published": "2021-06-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]