[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCyl5V3-J_Bsy3x-EBCJwepg", "title": "Pro-Trump Manatees, Arminian Riots, and Big Tech Censorship", "description": "Today on The Babylon Bee Podcast, Kyle and Ethan talk about the week’s biggest stories like how Arminians are storming the gates of Heaven to protest election, wild manatees are suddenly coming out in a strong show of support for Donald Trump, and censorship is hitting anyone to the right of Stalin thanks to “Big T.” Kyle’s favorite bird to pronounce eats an alligator, samosas fly into space, and the squirrels are up to something! \n\nIt’s another The Babylon Bee news show!\n\nWatch The Babylon Bee animation on our animation playlist: https://bit.ly/BeeAnimation  \n\nSubscribe on iTunes: https://podcasts.apple.com/us/podcast/the-babylon-bee/id1468715531\n\nSubmit Your Own Headlines: https://babylonbee.com/plans\n\nThe Official The Babylon Bee Store: https://shop.babylonbee.com\n\nFollow The Babylon Bee:\nWebsite: https://babylonbee.com\nTwitter: http://twitter.com/thebabylonbee\nFacebook: http://facebook.com/thebabylonbee\nInstagram: http://instagram.com/thebabylonbee", "link": "https://www.youtube.com/watch?v=SfaNhY-Wddk", "date_published": "2021-01-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCyl5V3-J_Bsy3x-EBCJwepg", "title": "Abigail Shrier Looks At The Science of Gender Dysphoria", "description": "On The Babylon Bee Podcast, Abigail Shrier talks about the lack of science coming from transgender advocates regarding the transitioning of teenage girls. She talks to Kyle and Ethan questioning the wisdom of putting hormones into pre-pubescent teenagers. \n\nSee the full show here:\nhttps://youtu.be/_C6YTHGg0fA\n\nSubscribe to The Babylon Bee to help us continue spreading the truth no one wants to hear.\n\nHit the bell to get your daily dose of fake news that you can trust.", "link": "https://www.youtube.com/watch?v=tsMW02FHxTQ", "date_published": "2021-01-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCyl5V3-J_Bsy3x-EBCJwepg", "title": "How Social Media Is Encouraging Kids To Become Trans", "description": "On The Babylon Bee Podcast, Abigail Shrier shares how teenage girls are being told by trans activists on social media that becoming trans could be the cure to their anxiety and lack of friends. Kyle and Ethan get an insight into how transitioning is being celebrated to the point that it's attracting anyone craving social status.\n\nSee the full show here:\nhttps://youtu.be/_C6YTHGg0fA\n\nSubscribe to The Babylon Bee to help spread wholesome family content to the internet. \n\nHit the bell to get your daily dose of fake news that you can trust.", "link": "https://www.youtube.com/watch?v=6ef0QCH7jVk", "date_published": "2021-01-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]