[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Tiny Desk Meets globalFEST: Edwin Perez, Elisapie, Nora Brown, Rokia Traoré", "description": "January 14, 2021 | Bob Boilen\nThe Tiny Desk is teaming up with globalFEST this year for a thrilling virtual music festival: Tiny Desk Meets globalFEST. The online fest includes four nights of concerts featuring 16 bands from all over the world. From Monday, Jan. 11, through Thursday, Jan. 14, we'll be streaming new performances at 8 p.m. ET on NPR Music's YouTube channel and NPR.org.\n\nEvery January, I attend globalFEST at a New York City nightclub and see some of the most fantastic music I'll experience all year. Now, given the pandemic's challenges and the hardening of international borders, NPR Music and globalFEST is moving from the nightclub to your screen of choice and sharing this festival with the world. Each night, we'll present four artists in intimate settings (often behind desks donning globes), and it's all hosted by African superstar Angélique Kidjo, who performed at the inaugural edition of globalFEST in 2004.\n\nFor the final night of Tiny Desk Meets globalFEST, we have Edwin Perez's presentation of salsa dura, First Nations advocate and singer-songwriter Elisapie performing in Montreal, 15-year-old Appalachian banjo player Nora Brown, and globalFEST alum Rokia Traoré performing from Mali.\n\n0:00 INTRO\n2:26 EDWIN PEREZ\n21:43 ELISAPIE\n38:23 NORA BROWN\n53:08 ROKIA TRAORÉ\n\nBelow you'll find short descriptions about each act, written by the globalFEST team.\n\nEDWIN PEREZ\nFrom the basement of the Bowery Electric in downtown Manhattan, composer and vocalist Edwin Perez and his 10-piece band come together to put on a show. With a strong backbeat and enough room to move around, Perez's up-tempo energy brings the party and keeps it going. The theme of the night is salsa dura music, which originated in New York in the 1970s and gained acclaim thanks to acts like the Fania All-Stars and Spanish Harlem Orchestra.\n\nSET LIST\n\"La Salsa Que Me Crió\"\n\"No Puedo Respirar\" (I Can't Breathe)\n\"Mi Tierra\"\n\nELISAPIE\nElisapie returns to Tiny Desk for a show-stopping performance from Montreal, with the disco globe of our dreams helping to light her set. Elisapie, in both her songs and work, is a resounding advocate of First Nations culture in Canada. In her set, she harnesses an incredible energy with electrifying, emotive vocals.\n\nSET LIST\n\"Qanniuguma\"\n\"Wolves Don't Live by the Rules\"\n\"Arnaq\"\n\nNORA BROWN\n30 feet below the surface in Brooklyn, 10th grader Nora Brown brings incredible, surprising depth to the Appalachian music she plays. Over the course of her Tiny Desk Meets globalFEST concert, surrounded by innumerable globes and instruments, she infuses new life and energy into the traditional songs of Addie Graham, Virgil Anderson and Fred Cockerham. Nora weaves together songs and storytelling, speaking of the great history of the music that came before her and at which she excels.\n\nSET LIST\n\"The Very Day I'm Gone\"\n\"Miner's Dream\"\n\"Little Satchel\"\n\nROKIA TRAORÉ\nRokia Traoré performed at globalFEST in 2005, the music festival's second year, and it's a thrill to present her meditative performance as part of Tiny Desk meets globalFEST. Her work is rooted in the Malian musical tradition, but defies the confines of a single culture. Born in Mali to a diplomat father, Traoré had a nomadic upbringing that exposed her to a wide variety of international musical influences. She joins us from Blues Faso, a theater inside her Foundation Passerelle in Mali, which she created to support emerging, interdisciplinary artists, from music and the performing arts to visual arts and photography.\n\nSET LIST\n\"Souba Lé\"\n\"Tiramakan\"\n\"Fakoly\"\n\n---\n\nTINY DESK TEAM \nProducer: Bob Boilen \nVideo Producer: Morgan Noelle Smith\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Kara Frame, Maia Stern\nExecutive Producer: Lauren Onkey \nSenior VP, Programming: Anya Grundmann \n\nGLOBALFEST TEAM \nCo-Directors: Shanta Thake, Isabel Soffer, and Bill Bragin\n2021 Curators: Shanta Thake, Isabel Soffer, Bill Bragin, and Viviana Benitez\nEvent Producer: Ian Thake \nHost: Angélique Kidjo\nSocial Media Manager: Valerie French\nPublicity: Brendan Gilmartin, Chart Room Media \nLegal Services: Tamizdat\nLegal Services: Duane Morris\nProducer: THE OFFICE performing arts + film \nVideo Production: MODEMA Studios \n\nTHE OFFICE performing arts + film consists of Diane Eber, Rachel Chanoff, Laurie Cearley, Olli Chanoff, Erica Zielinski, Gabrielle Davenport, Catherine DeGennaro, Noah Bashevkin, Lynn Koek, Bruna D'Avila, Chloe Golding, Kyla Gardner, Zion Jackson, Tess Peppis, Scout Eisenberg \n\nMODEMA Studios consists of Jammal Lemy (director and editor), Matt Deitsch (producer), Theo Braun (audio), and Gary Blake (editor) \n\nSpecial Thanks: Joshua Feigenbaum, Mona Golub, Steven Kirkpatrick, Daniel C. Smith, Ken Umezaki \n\nglobalFEST 2021 funders include The Andrew W. Mellon Foundation, National Endowment for the Arts, NYC Department of Cultural Affairs, The Québec Government Office in New York", "link": "https://www.youtube.com/watch?v=PG3kd3_v6js", "date_published": "2021-01-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "mxmtoon: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nJanuary 15, 2021 | Bob Boilen\n\"Hi, I'm mxmtoon, and I'm doing my Tiny Desk at the world's biggest desk!\" And so it begins, from an eerily empty New York City office building, mxmtoon sings songs filled with dreams and anxieties. Much of the music comes from her recent 2020 EPs, Dawn and Dusk. Those EPs included collaborations with Carly Rae Jepsen and Tune-Yards' Merrill Garbus. For this Tiny Desk (home) concert, her sweet voice and ukulele are accompanied by Nicole Wakabayashi on piano and Cale Hawkins on guitar.\n\nIt's been almost two years now since we first played the Oakland-based mxmtoon on All Songs Considered. She was just 18 then, singing about crying in her \"prom dress\" (which I'm thrilled she is performing here). Her melodies are simple, with the words up front mighty and personal. One of the first songs she released is called \"Feelings Are Fatal,\" which she also performs. It's a candid song about emotions and why we're often afraid to share them. It's a model for what mxmtoon does so well: humble, honest songs, sung here behind a massive desk.\n\nSET LIST\n\"Fever Dream\"\n\"Prom Dress\"\n\"Feelings Are Fatal\"\n\"Wallflower\"\n\"Bon Iver\"\n\nMUSICIANS\nmxmtoon: vocals, ukulele\nNicole Wakabayashi: piano\nCale Hawkins: guitar\n\nCREDITS\nVideo: Derrick Belcham\nAudio: K. Marie Kim\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Bob Boilen, Kara Frame, Morgan Noelle Smith\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann", "link": "https://www.youtube.com/watch?v=UH1lce2Wzmc", "date_published": "2021-01-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Tiny Desk Meets globalFEST: Vox Sambou, Aditya Prakash Ensemble, Rachele Andrioli, Martha Redbone", "description": "January 13, 2021 | Bob Boilen\nThe Tiny Desk is teaming up with globalFEST this year for a thrilling virtual music festival: Tiny Desk Meets globalFEST. The online fest includes four nights of concerts featuring 16 bands from all over the world. From Monday, Jan. 11, through Thursday, Jan. 14, we’ll be streaming new performances at 8 p.m. ET on NPR Music’s YouTube channel and NPR.org. \n\nEvery January, I attend globalFEST at a New York City nightclub and see some of the most fantastic music I'll experience all year. Now, given the pandemic's challenges and the hardening of international borders, NPR Music and globalFEST is moving from the nightclub to your screen of choice and sharing this festival with the world. Each night, we’ll present four artists in intimate settings (often behind desks donning globes), and it's all hosted by African superstar Angélique Kidjo, who performed at the inaugural edition of globalFEST in 2004. \n\nFor the third night of the festival, we have Vox Sambou’s energetic Hatian funk from Montreal, Carnatic Indian music from Aditya Prakash Ensemble, a blend of old and new with Italian singer-songwriter Rachele Andrioli, and an expansion and exploration of American Roots music from globalFEST alum Martha Redbone.\n\n0:00 INTRO\n1:07 VOX SAMBOU\n17:01 ADITYA PRAKASH ENSEMBLE\n32:51 RACHELE ANDRIOLI\n48:45 MARTHA REDBONE\n\nBelow you’ll find short descriptions about each act, written by the globalFEST team.\n\nVOX SAMBOU\nThere are few performers as “alive” as Vox Sambou, whose energy and soul transcends the virtual space. He starts his performance at Tiny Desk Meets globalFEST with a short moment between himself and his son, overseen by a painting of his mother, highlighting the ways we pass down traditions from generation to generation. Based in Montreal, Quebec, Vox Sambou writes and performs in Hatian-Creole, French, English, Spanish and Portuguese. His music is a joyous fusion of Haitian funk, reggae and hip-hop. \n\nSET LIST\n\"African Diaspora\"\n\"My Rhythm\" \n\"Everyone\"\n\nADITYA PRAKASH ENSEMBLE\nPerforming from their home base in Los Angeles, Aditya Prakash Ensemble highlights songs borne from South India's Carnatic tradition. Aditya uses his voice as an instrument to tell powerful, emotive stories -- which he reimagines in a fresh, dynamic way.  Aditya Prakash Ensemble’s modern take on traditional music mixes in jazz and hip-hop and features a diverse L.A. ensemble.\n\nSET LIST\n\"Greenwood\"\n\"Vasheebava\" \n\"Payoji\"\n\nRACHELE ANDRIOLI\nRecording from southern Italy, Rachele Andrioli’s performance highlights her mix of old and new, of traditional music and modern technology. Her trance vocals and loop pedals create a sound all her own, mixing music from Italian, Indian, Lebanese, Albanian and Romani cultures and traditions.\n\nSET LIST\n\"Te Spettu\"\n\"Pranvera Filloi Me Ardh\"\n\"Ederlezi\"\n\nMARTHA REDBONE\nhttps://www.martharedbone.com/\nMartha Redbone performs her Tiny Desk Meets globalFEST performance from her home studio in Brooklyn’s Navy Yards. Native and African-American singer-songwriter Martha Redbone is known for her mix of folk, blues and gospel from her childhood in Harlan County, Ky., which she  infuses with the eclectic grit of pre-gentrified Brooklyn. Inheriting the powerful vocal range of her gospel-singing African-American father and the resilient spirit of her mother’s Cherokee, Shawnee and Choctaw culture, Redbone broadens the boundaries of American Roots music. \n\nSET LIST\n\"The Garden of Love\"\n\"Talk About It\"\n\"Underdog\" \n\n---\n\nTINY DESK TEAM \nProducer: Bob Boilen \nVideo Producer: Morgan Noelle Smith\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Kara Frame, Maia Stern\nExecutive Producer: Lauren Onkey \nSenior VP, Programming: Anya Grundmann \n\nGLOBALFEST TEAM \nCo-Directors: Shanta Thake, Isabel Soffer, and Bill Bragin\n2021 Curators: Shanta Thake, Isabel Soffer, Bill Bragin, and Viviana Benitez\nEvent Producer: Ian Thake \nHost: Angélique Kidjo\nSocial Media Manager: Valerie French\nPublicity: Brendan Gilmartin, Chart Room Media \nLegal Services: Tamizdat\nLegal Services: Duane Morris\nProducer: THE OFFICE performing arts + film \nVideo Production: MODEMA Studios \n\nTHE OFFICE performing arts + film consists of Diane Eber, Rachel Chanoff, Laurie Cearley, Olli Chanoff, Erica Zielinski, Gabrielle Davenport, Catherine DeGennaro, Noah Bashevkin, Lynn Koek, Bruna D'Avila, Chloe Golding, Kyla Gardner, Zion Jackson, Tess Peppis, Scout Eisenberg \n\nMODEMA Studios consists of Jammal Lemy (director and editor), Matt Deitsch (producer), Theo Braun (audio), and Gary Blake (editor) \n\nSpecial Thanks: Joshua Feigenbaum, Mona Golub, Steven Kirkpatrick, Daniel C. Smith, Ken Umezaki \n\nglobalFEST 2021 funders include The Andrew W. Mellon Foundation, National Endowment for the Arts, NYC Department of Cultural Affairs, The Québec Government Office in New York", "link": "https://www.youtube.com/watch?v=1sdOIpRJuvE", "date_published": "2021-01-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]