[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "9 Hours With Persona 5 Strikers: Our Biggest Takeaways", "description": "Michael Higham and Jean-Luc Seipke breakdown what you can expect from this Persona 5 Sequel and give their impressions of the first few hours.\n\nPersona 5 Strikers, the action-based follow up to the original RPG Persona 5, is right around the corner and we've been able to play about five hours of the game. Here, Jean-Luc and Michael break down their experience and talk in-depth about how it adopts many elements of the original game. \n\nThis new story kicks off during summer vacation after the events of Persona 5. Everyone's anticipating the return of main protagonist Joker's return to Tokyo so they can hang out and enjoy some time off together. Of course, there's an evil lurking about, and in the opening hours, it's a fashion and pop idol who has been using the Metaverse to manipulate fans. It's not exactly hard-hitting, but it is an excuse to fight shadows with all the style you'd expect from the Phantom Thieves.\n\nWhile it may be low stakes narratively, combat is anything but. The musou-style action gameplay also incorporates mechanics from Shin Megami Tensei and Persona, including spell casting, elemental affinities, follow-up attacks, and SP management. It's an exciting and bombastic translation of Persona 5's sensibilities, but it can get a bit messy with the number of things happen at once in real time and types of challenges the tougher enemies present.\n\nThe new character Sophia, a phone-based AI that turns human in the Metaverse, is a nice addition as she fits quite well with the rest of the cast and even works as your shopkeeper. While Strikers cuts back on the social simulation mechanics of the original game, you still get to walk around the real world and talk to your friends. And when it's time to go dungeon crawling, there are plenty of elements that shake up what you might expect from a Persona game.\n\nIf you want more coverage, be sure to read our in-depth preview of Persona 5 Strikers, or check out our full gameplay clip to see the game in action. Persona 5 Strikers launches on PS4, Switch, and PC on February 23, and stay tuned for future coverage of the game.", "link": "https://www.youtube.com/watch?v=H729jlXyYAQ", "date_published": "2021-01-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Best Gaming News From CES 21", "description": "CES looked a little different this year, as the annual tech show was held entirely virtually due to the global health crisis. Despite the shakeup in how the show was programmed, there were plenty of big announcements and reveals that caught our attention. \n\nWhile CES is usually a show focused primarily on consumer tech, this year's event also had a number of important takeaways for gaming. In this video, we're rounding up some of the most exciting and interesting announcements from the show, including 8K TVs, RGB facemasks, and updates on PlayStation. The video also covers the latest for gaming laptops, Nvidia's RTX 3060 graphics card, and new gaming monitors from ASUS, among many others. \n\nBe sure to check out the full video to find out everything new and exciting from CES 2021. And stick with GameSpot for all the latest on games, tech, and entertainment!\n\n00:00 - Intro\n00:23 - PlayStation\n01:11 - NVIDIA Reflex\n01:39 - NVIDIA 3060 GPU\n02:45 - Laptops\n04:09 - Razer\n05:51 - TVs/Monitors\n07:09 - Outro", "link": "https://www.youtube.com/watch?v=OBZeor8TDTo", "date_published": "2021-01-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Cyberpunk 2077: Updates, Free DLC, Next-Gen Versions", "description": "Projekt Red's co-founder Marcin Iwinski has issued an apology for Cyberpunk 2077’s buggy launch, in particular on PS4 and Xbox One. Lucy, Jake, and Jean-Luc break down their new roadmap, including upcoming patches, free DLC, refunds, and PS5 and Xbox Series X versions. \n\nIt’s pretty common knowledge that Cyberpunk 2077 had a less than perfect launch, with many players encountering a number of bugs during their playthroughs, whether they played on PC on console. However, no group suffered more than those on PS4 and Xbox One, who encountered everything from huge frame rate drops and low textures to unsightly glitches and abrupt crashes. CD Projekt Red co-founder Marcin Iwinski has issued an apology, an explanation, and a roadmap for the future. \n\nIn the video above, Lucy James, Jean-Luc Seipke, and Jake Dekker dissect CD Projekt Red’s apology and help unpack what went wrong with Cyberpunk 2077’s launch. Much of the issues with the PS4 and Xbox One versions of the game were due to the streaming technology used, according to Iwinski, and the ambitious nature of the game led to difficulties adjusting this aspect of the game for last-gen consoles. \n\nIwinski also gave updates about upcoming free DLC and future patches to fix bugs in the game, as well as the free PlayStation 5 and Xbox Series X/S upgrades coming in the second half of the year. For a deep dive into the apology, check out the video above, and make sure to subscribe to youtube.com/GameSpot for all the latest updates. \n\n00:00 - Intro\n01:11 - Why is there such a gap between the PC and console versions of Cyberpunk 2077?\n03:55 - Testing didn't show any of the console version issues?\n06:27 - Updates Roadmap (Patches, Next-Gen Console Update, etc.)\n07:20 - CD Projekt Red has a newfound commitment to avoiding crunch\n08:55 - Free DLC coming to Cyberpunk 2077\n09:45 - Cyberpunk 2077 refunds\n11:02 - Outro", "link": "https://www.youtube.com/watch?v=jXzFG5gHB9M", "date_published": "2021-01-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New Pokémon Snap Trailer", "description": "New Pokémon Snap arrives on April 30!", "link": "https://www.youtube.com/watch?v=r8iU8zEr7r8", "date_published": "2021-01-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Worst Game Launches Of All Time", "description": "Bugs and glitches and crashes, oh my! In lieu of Cyberpunk 2077 releasing in a messy state, we look back, and round up other notoriously rough video game launches.\n\nEvery once in a while a game comes out that happens to launch in pretty rough shape. Quite often, the game is updated over time and eventually reaches a much more playable state. But those who first picked up the game at launch can be left feeling like they paid full price for a game still in early access.\n\nKurt Indoniva details 11 such games. A few were so bad, their legacy continues to live on--we're talking games like Assassin's Creed Unity and Fallout 76, titles that are often used as a comparison point for when new games have rough launches. \n\nOthers, such as No Man's Sky and Star Wars: Battlefront II, have managed to somewhat overcome the memory of what they once were, with their respective studios patching them in experiences that are largely viewed with a positive lens now. And then there are very recent releases, like Anthem and Cyberpunk 2077, which haven't had the chance to showcase whether they'll be successful after their disastrous launches.\n\nAs you may have noticed, most of the games in this list are fairly recent. 2012's Diablo III is the oldest of the bunch. This isn't our way of saying that games only have bad launches now and they all released in perfect condition back in the day--far from that. But the most prominent launch disasters have all occurred within the last decade.", "link": "https://www.youtube.com/watch?v=l2pxxiqALW8", "date_published": "2021-01-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]