[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Apex Legends Emergence - Everything You Need To Know", "description": "Apex Legends Season 10 kicks off in August, introducing a ton of new content for its battle royale and Arenas modes.\n\nApex Legends Emergence is right around the corner. Season 10 of Respawn's battle royale introduces Seer as a new playable legend, makes substantial changes to World's Edge, and implements major balancing changes to several weapons and characters. Caustic mains, rejoice! Emergence gives y'all a nice buff.\n\nBelow, we go over everything we currently know about Apex Legends Emergence. That includes the lore and abilities for Seer, the three maps coming to Arenas, the new Rampage LMG, and the return of Disruptor Ammo. That's right--the bane of Season 2 has finally returned. All that and more is detailed below.\n\n#apexlegends #apexseason10 #apexlegendsseason10", "link": "https://www.youtube.com/watch?v=bDeVJRFrNfA", "date_published": "2021-07-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Apex Legends Emergence Gameplay Trailer", "description": "Check out the all new Gameplay trailer for the new season of Apex Legends, Emergence!\n\n#apexlegends #apexlegends", "link": "https://www.youtube.com/watch?v=2J24jbmJrG0", "date_published": "2021-07-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "I Played Cyberpunk 2077 7 Months Later", "description": "How does Cyberpunk 2077 fair 7 months later and far more patches in? Is it playable? How intense are the glitches? How is it? Who is it? What is it? Life itself.\n\n#cyberpunk2077", "link": "https://www.youtube.com/watch?v=1aAKt7RLkE4", "date_published": "2021-07-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "MARVEL Future Revolution Livestream with Greg Miller", "description": "(Presented by Netmarble) Join Persia as she explores the world of MARVEL Future Revolution with representatives from the game and Marvel superfan, Greg Miller from Kinda Funny! Also, look out for big news and a special in-game prize for every viewer!\n\nPre-register for #MARVELFutureRevolution now and receive a free costume at launch!  Find out more details here: https://mar.by/_mbcV\n\n#marvelfuture #marvel", "link": "https://www.youtube.com/watch?v=0lW7q2r289k", "date_published": "2021-07-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "BOTW's World Record-Setting Combat Technique Is Weird", "description": "This unorthodox technique in Breath of the Wild might actually give you a workout... or carpal tunnel.\n\nIn the video above, we explain how this technique works and why it works so well. And its ability to break world records of speed killing a gold lynel (Without ancient arrows). Combining a glitch while mounted with motion controls creates an unorthodox technique that holds the spirit of Skyward Sword controls, and destroys enemies quickly.\n\n#botw", "link": "https://www.youtube.com/watch?v=Ii6AguASzyg", "date_published": "2021-07-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]