[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Convalescent plasma, no benefit", "description": "RECOVERY trial closes recruitment to convalescent plasma treatment for patients hospitalised with COVID-19 \n\n15 January 2021\n\nhttps://www.recoverytrial.net/news/statement-from-the-recovery-trial-chief-investigators-15-january-2021-recovery-trial-closes-recruitment-to-convalescent-plasma-treatment-for-patients-hospitalised-with-covid-19\n\nRECOVERY trial is being conducted by the registered clinical trials units with the Nuffield Department of Population Health in partnership with the Nuffield Department of Medicine\n\n176 hospitals across the whole of the UK\n\nSince May 2020, randomised comparison of convalescent plasma vs. usual care alone\n\nConvalescent plasma has been widely used as a treatment for COVID-19 but\n\nTo date there has been no convincing evidence of the effect of convalescent plasma on clinical outcomes in patients admitted to hospital with COVID-19\n\nOn the advice of the Data Monitoring Committee (DMC), recruitment to the convalescent plasma arm of the RECOVERY trial has now closed\n\nNo convincing evidence that further recruitment would provide conclusive proof of worthwhile mortality benefit\n\nEither overall or in any pre-specified subgroup\n\nN = 10,406 randomised patients\n\nDeaths, 1,873 \n\nNo significant difference in the primary endpoint of 28-day mortality\n\nConvalescent plasma group (Experimental group)\n\n18%\n\nUsual care alone group (Control group)\n\n18%\n\nRisk ratio 1.04 (p = 0.34)\n\nFollow-up of patients is ongoing\n\nFinal results will be published ASAP\n\nRecruitment to all other treatment arms – tocilizumab, aspirin, colchicine, and Regeneron’s antibody cocktail – continues as planned.\n\nProfessor Martin Landray, (Oxford)\n\nOnce again, the RECOVERY trial is demonstrating the value of large randomised trials to properly assess the role of potential treatments. \n\nProfessor Peter Horby\n\nThis is the largest ever trial of convalescent plasma and it was only possible thanks to the generous donation of plasma by recovered patients \n\nand the willingness of current patients to contribute to advancing medical care. \n\nWe owe them all a great debt of gratitude\n \nWhilst the overall result is negative, we need to await the full results before we can understand whether convalescent plasma has any role in particular patient subgroups\n\nDr Gail Miflin\n\nWe await the full results with interest, there is no doubt that this trial will provide a real answer to an important question\n\nNHSBT has helped deliver the largest ever randomised control trial of convalescent plasma\n\nThe story so far\n\nhttps://www.recoverytrial.net/news\n\nRECOVERY trial finds no benefit from azithromycin in patients hospitalised with COVID-19 \n14th December 2020\n\nLopinavir-ritonavir is not an effective treatment for patients hospitalised with COVID-19 \n5th October 2020\n\nNo clinical benefit from use of lopinavir-ritonavir in hospitalised COVID-19 patients studied in RECOVERY \n29th June 2020\n\nLow-cost dexamethasone reduces death by up to one third in hospitalised patients with severe respiratory complications of COVID-19 \n16th June 2020\n\nNo clinical benefit from use of hydroxychloroquine in hospitalised patients with COVID-19 \n5th June 2020\n\nCurrent RECOVERY trial arms\n\nLow-dose Dexamethasone (now only recruiting children)\n\nColchicine (commonly used anti-inflammatory)\n\nTocilizumab (an anti-inflammatory treatment given by injection)\n\nConvalescent plasma (collected from donors who have recovered from COVID-19 and contains antibodies against the SARS-CoV-2 virus)\n\nRegeneron’s antibody cocktail (a combination of monoclonal antibodies directed against coronavirus)\n\nAspirin (commonly used to thin the blood).", "link": "https://www.youtube.com/watch?v=48FqFqd0MvI", "date_published": "2021-01-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "International travel and increasing cases", "description": "Email for pictures and video clips\ncampbellteaching@hotmail.com\n\nMultiple choice questions\n\nAustralian Tennis Open:\n\na. Good idea\n\nb. Crass commercial insanity\n\nc. Opportunity for highly infectious VOCs to enter Australia \n\nd. Opportunities for cross infection during travel\n\nUK football, mass hugs and chanting in the dressing room:\n\na. Good idea\n\nb. Potential source of superspreading event\n\nc. Worst possible example imaginable at the current time\n\nd. Illustration of one rule for the elite and another rule for us Plebs\n\nBrazil\n\nManaus, Amazonas state, health system has collapsed\n\nSevere oxygen shortages, some hospitals have run out\n\nhttps://twitter.com/pamtaketomi/status/1349741379031805953\n\nRapid rise, infections from new variant\n\nHealth professionals, many people could die due to lack of supplies and assistance\n\nInfections linked to a new variant of the virus.\n\nBrazilian mutation\n\nSouth America, Portugal and Cape Verde barred from entering UK\n\nArgentina, Brazil, Bolivia, Chile, Colombia, Ecuador, French Guiana, Guyana, Paraguay, Peru, Suriname, Uruguay and Venezuela\n\n(South Africa, Namibia, Zimbabwe, Botswana, Eswatini, Zambia, Malawi, Lesotho, Mozambique and Angola, the Seychelles, Mauritius)\n\nMutations associated with a rapid increase in cases\n\nGrant Shapps, Brazilian variant not in the UK as far as we are aware\n\nNext few days, then we should know\n\nReactivity\n\nFirst detected in travellers going to Tokyo, then traced back to South America\n\nVaccines?\n\nMore cases all at the same time\n\nChina\n\nHighest single-day infections since 1 March.\n\nCases, + 144\n\nHebei province, 22 million people in lockdown\n\n20,000 rural residents sent to state-run quarantine facilities\n\nInfection driver, asymptomatic cases in rural areas\n\nFirst detection of SARS-CoV-2 spike protein N501 mutation in Italy in August, 2020. \n\nhttps://www.thelancet.com/journals/laninf/article/PIIS1473-3099(21)00007-4/fulltext\n\nVOC-202012/01, spreading in UK, global threat\n\nN501Y, involves one of the six key amino acids of the SARS-CoV-2 receptor-binding domain\n\nAngiotensin-converting enzyme 2 (ACE2) receptor\n\nN501T detected in Italy in August\n\nUK\n\nhttps://coronavirus.data.gov.uk\n\nCases, + 46,169 + 45,553 + 48,682 = 3,118,518\n\nEstimated R number \n\n1 to 1.4 \n\nDaily infection growth rate range, of 0% to + 6% (8th January 2021)\n\nCases, + 48,682 = 3,260,258\n\nCases, last 7 days, 370,839 (down 7.4%)\n\nHospitalised, + 4,193 + 4,240 + 4,256 = 36,797 (3,626)\n\nLast 7 days, 26,914 (up 34%)\n\nDeaths, + 529 + 1,243 + 1,564 + 1,248 = 86,015\n\nLast 7 days, 7,507 (up 50.3%)\n\nUK death certificate deaths, 93,030\n\nVaccinated, first dose, 2,918,252 (Jan 15th)\n\nSecond dose, 437,977\n\nUnited States\n\nhttps:/covid.cdc.gov/covid-data-tracker/#trends_dailytrendscases\n \nhttps://covidtracking.com/data\n\nhttps://www.washingtonpost.com/graphics/2020/national/coronavirus-us-cases-deaths/?itid=lk_inline_manual_5\n\nCases, + 213,885 + 219,090 + 222,944 = 22,982,927\n\nUp 4.4 % in past 7 days\n\nNational positivity, 11.9%\n\nHospitalizations, 128,947 (23,891) (7,878)\n\nDeaths, 379,451\n\nUp 19.5% in past 7 days\n\nUS, Vaccinations\n\nFirst doses, 11,444,000\n\nSecond dose, 1,230,000 (0.38%)\n\nIndonesia\n\nRestrictions rather than full lockdowns\n\nMasks must be worn everywhere outside the home in Jakarta and West Java, subject to sanction\n\nEUA for the Sinovac vaccine on 11 January 2021\n\nPresident Jokowi received the first vaccination on 13 January\n\nOxford to follow\n\nhttps://www.bbc.co.uk/news/live/world-55673006\n\nSocial media influencers\n\nYounger workers aged 18 to 59\n\nProfessor Amin Soebandrio\n\nWe are targeting those that are likely to spread the virus\n\nGermany\n\nDeaths, + 1,113\n\nSpread of 2020 12 variant\n\nPortugal\n\nWent into lockdown overnight\n\nHungary\n\nPM Viktor Orban, keen to start using China vaccine\n\nNational medicine authority", "link": "https://www.youtube.com/watch?v=YQJ1kUiXlYU", "date_published": "2021-01-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]