[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "7 Reasons COD Zombies Is Great", "description": "For more than 13 years, Call of Duty's Zombies has been a fan-favorite game mode. Let's find out what the series has done right to make this possible.\n\nCall of Duty's Zombies mode has been around for almost as long as the series entirely. Dating back to 2008's Call of Duty: World at War, the side mode (that almost wasn't) took over and became a phenomenon over night.  In this video, Richie Bracamonte explains why the series is so fun and the reasons why it's so great.\n\nFrom humble beginnings, to the sprawling multiverse it has become, Zombies mode has had many successful staples of gameplay that have helped it succeed for more than 10 years. These include gameplay mechanics like perks, wonder weapons and the hunt for the illustrious Easter eggs. As the years went on, more and more secrets were uncovered that led to a grand story. Across multiple titles through the Black Ops series, we saw strong character development and several additions to the mode that only made for a stronger experience.\n\nToday, Zombies mode is still going strong. New maps are regularly added, as well as new modes and ways to play. The story continues to expand on a seasonal basis, and fans are still chomping at the bit for more content just like they were in 2008. Stay tuned to GameSpot for Zombies updates and more nostalgic videos just like this one.\n\n#cod #codzombies", "link": "https://www.youtube.com/watch?v=Q0KAL0R0okE", "date_published": "2021-07-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Fallout 3’s Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of Fallout 3, including the ridiculous Railway Rifle, the Alien Blaster, and the clunky Microwave Emitter.\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of Fallout 3 and compares them to their potential real-life counterparts.\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nIf you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can purchase Jonathan's book here - https://www.headstamppublishing.com/bullpup-rifle-book\n\nYou can check out Jonathan on the Fighting on Film podcast here - https://www.youtube.com/playlist?list=PLNsrU8HuCAzaizIqbAcNZ5VUQW789z3ZF\n\n#firearms #fallout3", "link": "https://www.youtube.com/watch?v=FspvZxv-qWc", "date_published": "2021-07-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Steam Deck Everything We Know", "description": "Valve surprised the gaming community this week with the announcement of the Steam Deck, a new foray into dedicated PC gaming hardware.\n\nThe portable device bears more than a passing resemblance to Nintendo's popular handheld-console hybrid, the Nintendo Switch, given its general size and form factor. But unlike the Switch, the Steam Deck is built to play your Steam library on-the-go, and the impressive-looking piece of tech is launching this December. Here is everything we know so far, including the various versions, incompatible games, design, battery, specs, accessories, and preorder information. \n\nTimestamps:\n00:25 - SKUs/Versions\n01:38 - Games \n02:24 - Incompatible Games\n03:19 - Design\n04:39 - Battery\n04:58 - Hardware Specs\n06:08 - Accessories\n06:54 - Preorder Info\n\n#steamdeck", "link": "https://www.youtube.com/watch?v=luRHTpUNTEg", "date_published": "2021-07-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "TennoCon LIVE with Persia and L1fewater", "description": "(Presented by Warframe) Join Persia and Warframe Expert, L1fewater, as they react to and discuss every huge announcement from TennoCon 2021, an event dedicated to all things Warframe!\n\nFor more info about TennoCon and Warframe, visit https://www.warframe.com/landing?utm_medium=paid-media&utm_source=gamespot&utm_campaign=2021-07-TennoCon-Costream-GameSpot\n\n#tennocon", "link": "https://www.youtube.com/watch?v=kYoXkqBcyBg", "date_published": "2021-07-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "12 Biggest Changes In Zelda: Skyward Sword HD", "description": "With the recent release of The Legend of Zelda: Skyward Sword HD on the Nintendo Switch, we’ve rounded up all the biggest and smallest changes we could find between the new HD remaster and the Wii original.\n\nAfter Wind Waker HD and Twilight Princess HD changed a few things from their original releases, it was safe to assume Nintendo would do the same with the announcement of Skyward Sword HD in the February 2021 Nintendo Direct. But what exactly was changed? Well, we played both games to 100% completion and put them side by side to try and spot as many differences as we could, big and small.\n\nSome of these changes include button controls for the entire game, brand-new camera controls, a new autosave system, character names added to text boxes, amiibo functionality, and a bunch of others, but you’ll have to watch the video to see everything. So stop reading this description and go do that if you haven’t already.\n\nThe Legend of Zelda: Skyward Sword HD is now available for the Nintendo Switch. Alongside the game, Nintendo released a pair of Joy-Con controllers themed after the Master Sword and Hylian Shield, and a Zelda & Loftwing amiibo figure. If you’re looking for more Skyward Sword HD videos, we’ve got you covered here on GameSpot:\n\nWii vs. Switch Graphics Comparison: https://youtu.be/G8wbQMKIQzA\nVideo Review: https://youtu.be/oEEjbLxaCes\n10 Minutes of Gameplay: https://youtu.be/yacvlG1HBco\nLivestream: https://youtu.be/DgL3jDZdPzk\n\n#zelda #LegendofZelda:SkywardSword", "link": "https://www.youtube.com/watch?v=P3E8zT0eAwI", "date_published": "2021-07-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 - Even More Things To Know", "description": "Battlefield 2042 details cross-play and progression, robot dog jeep stuff, call-in tablets, AI Soldiers, unique specialist gadgets, a watered-down class system, so many rocket launchers, the lack of some playable interior spaces, and teases for EA Play Live happening soon.\n\nBattlefield 2042 is about to release a ton of information at EA Play Live, but don’t tell that to DICE community managers who tracked down Daniel Berlin, Senior Design Director to answered a lot of questions ahead of time in a massive blog post. \n\nWe now have confirmed details about many different aspects of the game. There will be cross-play and progression, both of which are being tested later this summer. We learned about the robot dog, whose name is Ranger, and how it will follow you and protect you with its life. We learned that players use call-in tablets to bring vehicles down mid-battle and also that the system is limited by team points that vary based on map and mode. There were details around how AI soldiers will fill or balance matches. AI soldiers will also do many of the same tasks as players but can’t be specialists. It was confirmed that Sundance’s wingsuit is a unique piece of gear and nobody else gets one. We learned about the new loadout system where anyone can make a choice between carrying a rocket launcher or bringing items such as ammo or health packs. Finally, we got more details on maps such as out of bounds being expanded, skyscrapers not having much in the way of interior spaces, and penguins being confirmed on the Breakaway Map. \n\nBattlefield 2042 releases October 15 or 22, depending on which version you get, and makes a lot of changes to the formula, such as a new specialist system, larger maps, a freeform weapons system, a revamped Conquest mode with sectors, storms such as tornadoes, map-altering events like rocket launches, and a massive 128 player count. Up next, we are expecting to learn about the not-battle-royale Hazard Zone mode, remastered classic maps, and what the newly branded Ripple Effect studio, formerly DICE LA, is making.\n\n#battlefield #battlefield2042", "link": "https://www.youtube.com/watch?v=FUdPuU7V6MY", "date_published": "2021-07-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Valve's Steam Deck - Who's It For?", "description": "If you enjoyed this discussion why not check out the GameSpot After Dark podcast!\nSpotify: https://open.spotify.com/show/5qmuPYfpj7R7yHXEtKBocG?si=l4eHPhXETPKJjZjWKilMPg&dl_branch=1\nApple: https://podcasts.apple.com/us/podcast/gamespot-after-dark/id1476085691\n\nValve has revealed a portable gaming device the Steam Deck that brings PC-quality gaming to a handheld device. But does it have a place in our gaming lives? The After Dark crew discuss who they think Valve's new handheld PC is for and if it is a Nintendo Switch competitor.\n\n#valvesteamdeck", "link": "https://www.youtube.com/watch?v=R_gHUktD0Ws", "date_published": "2021-07-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]