[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Bartees Strange: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nLars Gotrich | February 22, 2021\nBartees Strange and his band are in a basement, surrounded by electrical wiring and DIY sound-proofing, but also green plants that no doubt have names. In Falls Church, Va., the indie rocker is a stone's throw from the much-missed Tiny Desk space in D.C., yet offers a set just as cozy and crammed.\nJust a cursory listen of Live Forever, one of NPR Music's 50 Best Albums of 2020, reveals a seeker with several destinations in mind: hip-hop bombast meets sprawling indie-rock riffs and mind-numbing electronic beats. \"Sonically it doesn't make sense,\" Bartees Strange told NPR Music, \"but it makes sense because it's me and I think that's like an important part of music – the person.\"\nFor his Tiny Desk, Bartees Strange keeps the bluesy rock and roll bravado of \"Boomer\" and the loping smooveness of \"Mustang,\" stripping down the drum kit to include a sheet music stand as an extra cymbal. In between songs, he shouts out the musicians giving him joy lately: Yves Tumor and The National's Aaron Dessner, whom he calls \"the indie rock Michael Jordan.\"\nIt's in the back half where Bartees Strange does the switch-up, as \"In A Cab\" flows seamlessly into \"Flagey God.\" On record, these are louder and noisier songs that explore very different sides of his 20-sided die, but here, they become laid-back jazz club jams, deceptive in their ease, but beautifully ornate as the arrangements open up to his world.\nSET LIST\n\"Boomer\"\n\"Mustang\"\n\"In A Cab\"\n\"Flagey God\"\nMUSICIANS\nBartees Strange: vocals, guitar\nGraham Richman: keys\nJohn Daise: bass\nDan Kleederman: guitar\nCarter Zumtobel: drums\nCREDITS\nVideo: Britain Weyant\nAudio: Chris Connors, Bartees Strange\nAssistant Camera Op: Luke Piotrowski\nTINY DESK TEAM\nProducers: Lars Gotrich, Bobby Carter\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nArt Director: CJ Riculan\nTiny Production Team: Bob Boilen, Kara Frame, Morgan Noelle Smith\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann", "link": "https://www.youtube.com/watch?v=8xoYo-rU_Xs", "date_published": "2021-02-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]