[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Tiny Desk Meets AFROPUNK", "description": "LaTesha Harris | April 23, 2021\nTiny Desk Meets AFROPUNK is the electrifying kick-off to AFROPUNK's \"Black Spring\" festival. The virtual celebration, hosted by Jorge \"Gitoo\" Wright, features performances from ChocQuibTown, Calma Carmona, Luedji Luna and Nenny. AFROPUNK, born out of a 2003 short film by the same name, is an international movement and music festival centered on Black exploration and rebellion. Starting as a way to create space for the unacknowledged presence and influence of Black culture in a predominantly white punk scene, AFROPUNK has since evolved into a distinct, multi-genre experience.\n\n\"Black Spring\" was created to spotlight outstanding talent in Afro-Latine and Afro-Caribbean music across the globe. The Tiny Desk Meets AFROPUNK program aims for the same. The showcase's four artists have come to the Tiny Desk to honor their homes and celebrate the art their heritage has inspired. Learn more about them below.\n\nChocQuibTown\n\"¡Tú sabes!\" Carlos \"Tostao\" Valencia exclaims after Colombian hip-hop trio ChocQuibTown performs its first song, the energetic \"Somos Pacífico.\" \"ChocQuibTown, straight from Colombia, from the Pacific coast,\" he says. \"We call it Africa inside Colombia, we got the flavor, we got the flow.\" ChocQuibTown — named after the coastal area the trio hails from — is a family affair comprised of siblings Miguel \"Slow\" Martinez and Gloria \"Goyo\" Martinez, the latter of which is married to Valencia. In 2000, the trio formed to promote their neglected corner of Colombia's culture; today, ChocoQuibTown's music blends the traditionality of Afro-Latin jazz with the modernity of hip-hop to create a singular, yet versatile sound.\n\nSET LIST\n\n\"Somos Pacífico\"\n\"De Donde Vengo Yo\"\n\"Pa Olvidarte\"\n\"Qué Lástima\"\n\"Lo Que Quieras Tú\"\n\"Cuando Te Veo\"\n\nNENNY\nWith warm maroon box braids nearly sweeping the floor and glitter adorning her eyes, NENNY's presence demands full attention before she even opens her mouth. Dressed in a flowy, all-white outfit accented with a pastel checker pattern and surrounded by a matching four-piece band, the 18-year-old Portuguese singer-songwriter and rapper appears otherworldly, almost heavenly, as she harmonizes with her backing electric guitar and jumps across the room, dancing with her entire body. NENNY first appeared on heads' radar in 2019 with her single \"Sushi.\" She's continued to impress with several more singles and the release of her debut project, 2020's Aura.\n\nSET LIST\n\n\"Bússola\"\n\"Wave\"\n\"Tequila\"\n\nLuedji Luna\n\"I feel that we are living in a crazy moment in a crazy time and music has been a safe place for me — the only safe place for me,\" Luedji Luna says in a low, alluring voice as she explains the purpose of her latest album, Bom Mesmo É Estar Debaixo D'Água. The album, much like the Brazillian singer-songwriters's Tiny Desk performance, is a respite from these times. Elements of jazz and blues are infused with African rhythms as Luna uses music to express her ongoing struggles for autonomy as a Black woman. She performs from her coastal hometown of Bahia in the city of Salvador, Brazil, where African culture flows in abundance. Luna is a powerhouse, entrancing and elegant, soulful and spiritual, as she uses her platform to discuss individual and systemic forms of anti-Blackness.\n\nSET LIST\n\n“Lençois”\n“Erro”\n“Chororô\"\n\nCalma Carmona\nFrom her hometown of San Juan, Puerto Rico, Calma Carmona delivers a bewitching Tiny Desk performance. Her voice rarely rises above a whisper as she sings over impassioned Afrobeats during her three-song set — but when it does, it's a gritty, intimidating growl. Carmona got her start in 2013 when the Latin soul singer-songwriter released her first EP and opened for Beyoncé's The Mrs. Carter Show World Tour in Puerto Rico.\n\nSET LIST\n\n\"When I Was Your Girl\"\n\"Ella Se Mueve\"\n\"Vibra\"\n\nTiny Desk Meets AFROPUNK\n\nExecutive Producer: Cyrus Dennis:\nExecutive Producer: Allen Lamb\nExecutive Producer: Anthony Maddox: \nExecutive Producer: Tina Farris\nExecutive Producer: Dominic \"Suede\" Pearson\nTalent Producer: Warren Bokwe: \nTalent Coordinator: Saira Anderson\nProduction Coordinator: Venessa Gonzalez\nCreative Director: Sango Amoda\nHost: Jorge \"GITOO\" Wright: \nEditor: Brian Anderson: \nWriter: Jordana Jason \nAssociate Producer: Mokotsi Rokundo \nSPECIAL THANKS TO\nPop & Pour - Washington Heights New York\n\nTINY DESK TEAM\n\nProducer: Abby O'Neill\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Bob Boilen, Kara Frame\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann", "link": "https://www.youtube.com/watch?v=Oj9nUXIPPYM", "date_published": "2021-04-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Making Popular Music in the Midst of Change and Transition: PopCon 2021Keynote Panel", "description": "NPR Music is proud to present the keynote panel conversation for the 2021 Pop Conference, hosted by New York University’s Clive Davis Institute of Recorded Music. The keynote is titled \"Fluxed: Making Popular Music in the Midst of Change and Transition.\"\n\nTo kick off a four-day special “Convergence” version of the annual Pop Conference, the keynote conversation invites a panel of four artists thriving within the highly volatile environment of contemporary popular music to discuss how the spirit and realities of change both challenge and inspire them. From taking on the themes of transformation and precariousness in their own music, to fully exploring what new technologies can communicate, to coping with a radically altered social and economic landscape, musicians must act at the forefront of new 21st-century modes of being. This open-ended conversation connects the transforming craft and business of music-making to the art of capturing musical meanings in a highly turbulent world.\n\nThe panel’s participants are leaders in reimagining what music and its cultures can be: singer-songwriter-auteur Devonté Hynes, whose work under many different names (Blood Orange, Lightspeed Champion) exemplifies the refusal to adhere to outdated categories; producer and musician Rostam, who has been instrumental in defining the anti-genre sound of 21st century pop; singer, songwriter and producer Roísín Murphy, whose dance-inspired music finds the point where past meets future, and Tamara Lindeman, who records as the Weather Station and models how the singer-songwriter role is changing in response to both exploding musical categories and a world in crisis. Ann Powers, NPR Music Critic and author of many books, most recently Good Booty: Love and Sex, Black and White, Body and Soul, moderates. The event is produced by Jason King.\n\nTHE FULL POP CONFERENCE SCHEDULE\nhttps://popcon2021.sched.com/\n\nTHE POP CONFERENCE WEBSITE / REGISTRATION:\nhttp://popconference.org\n\nFOLLOW Pop Conference:\nTwitter - https://www.twitter.com/popconorg\nInstagram - https://www.instagram.com/popconorg\n\nFOLLOW Keynote Panelists:\nDevonté Hynes: https://www.instagram.com/devhynes\nRostam: https://www.instagram.com/matsor,  https://www.twitter.com/matsoR\nRoísín Murphy: https://www.instagram.com/roisinmurphyofficial,  https://www.twitter.com/roisinmurphy\nTamara Lindeman: https://www.instagram.com/theweatherstation,  https://www.twitter.com/TheWeatherStn\nAnn Powers: https://www.instagram.com/annkpowers,  https://www.twitter.com/annkpowers\n\n\nFOLLOW New York University’s Clive Davis Institute of Recorded Music:\nTwitter -  https://www.twitter.com/clivedavisinst\nInstagram - https://www.instagram.com/clivedavisinst\n\nFOLLOW NPR Music:\nTwitter -  https://www.twitter.com/nprmusic\nInstagram - https://www.instagram.com/nprmusic\nFacebook - https://www.facebook.com/nprmusic\n\n#popcon2021 #nprmusic", "link": "https://www.youtube.com/watch?v=Y7ByQy2UTJ4", "date_published": "2021-04-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]