[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "THE BEST SCREEN I've seen in a laptop - Slimbook Executive Review", "description": "Improve your VM patching workflow with QEMUCare: https://tuxcare.com/live-patching-services/qemucare/sysadmin/?utm_campaign=TC-QEMU-TLE-September&utm_source=youtube&utm_medium=paidsocial \n\n\nGet your Linux desktop or laptop here: https://slimbook.es/en/\n\n\n\n\nToday, we're taking a look at the SLimbook Executive. It's a 14 inch ultrabook with great I/O, excellent design, and, mostly, THE best display I've seen in any laptop I've ever used.\n\n\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nJoin us on our new Discord server: https://discord.gg/xK7ukavWmQ\nTwitter : http://twitter.com/thelinuxEXP\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\nFollow me on ODYSEE: https://odysee.com/@TheLinuxExperiment:e\nOr join ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\n\n\n00:00 Intro\n01:21 The Device\n04:04 The Display\n04:53 Keyboard and Touchpad\n05:56 CPU Performance\n07:12 Xe Graphics\n08:12 Battery Life\n\n\n## Device\n\nLet's start with the basics. It's a 14 inch laptop that weighs about 1kg. It's super light. It has a wonderful 3K screen that we'll talk about a bit later in the video, and it's made out of the same magnesium alloy that equips the Slimbook Pro X Line, or the KDE Slimbook. It's really study.\n\nThe design kinda reminds me of older macbook airs, the ones that had ports.\n\nIn terms of hardware, it comes with an intel i7 CPU, it suppots wifi 6 with an intel AX200 chip, and it comes with plenty of I/O.\n\n\nOn the right, you have USB-C + Thunderbolt 4, a regular USB 3 port, an HDMI 2.0 port, and that barrel charger\nOn the left, you have a  USB-C port with video out support, another regular USB 3.0 port, a full size SD Card reader, and a 2 in 1 headphone jack\n\nAccording to SLimbook's website, the laptop can be charged using USB-C, with a 90W charger, but it's not included in the box.\n\nThe dual Speakers are serviceable, if not amazing, and the in-built  microphone works fine.You also get the usual 720p potatocam that we often get in laptops, but with facial recognition, that works with slimbook face, an app that lets you unlock each password prompt using, your face.\n\nBoth USB C ports can be used to drive displays, so you can plug up to 3 external displays on that thing, and the RAM and the SSDs both are user replaceable, which is pretty cool.\n\n## Display\n\nNow, let's talk about that display. It's a 3K panel, at a 2880 by 1800 resolution. This is really high for a 14 inch device, and Slimbook defaults to 150% fractional scaling. It has a 90hz refresh rate, that you can't seem to downgrade to 60hz if you want to save battery life, and it has a nice anti glare coating.\n\nThis display gets bright, at 400 nits, and has really good color accuracy and viewing angles. It's a stunning display. Probably the best I ever used in a laptop.\n\n## Keyboard and touchpad\nNo, for the keyboard and the touchpad. The keyboard is basically what I remember older macbook keyboard to be, which is to say, excellent, even though I've gotten used to larger keys nowadays. It has a good sound, great tactile feel, the keys aren't mushy and bounce back quickly, and the key travel is fine for an ultrabook. \n\nThe touchpad is made out of glass, and it's super large, and super nice to use, especially with the out of the box inclusion of gestures in Slimbook OS.\n\n\n## Performance and battery life\n\nIn terms of performance, the Executive comes with an Intel core i7 1165G7. It's a 4 core, 2.8Ghz CPU, from intel's 11th gen.\n\nOn Geekbench 5, it gets 1638 in Single-Core, and 4453 in Multi-Core  with all performance tuned to the max thanks to SLimbooks inbuilt power control utilities.\n\nhttps://browser.geekbench.com/v5/cpu/9760552\n\nCompared to the Ryzen 7 4800H on the Pro X 14, this CPU is... a bit disappointing. It's better in single core performance, 34% higher, as a matter of fact, but 45% lower in multi core, which is normal, as the Ryzen 7 has 8 physical cores, compared to the 4 in the Intel CPU of the Executive.\n\n\nIn terms of graphics, this laptop comes with Intel's Xe graphics, and it's the first time I've tried these on a device. I can safely say Intel has made LEAPS compared to the previous generation of integrated UHD graphics, but these are still unsuitable for gaming on AAA titles.\n\nPlaying Hades or other smaller indie titles won't pose any problems, but in Shadow of the TOmb Raider, at 1080p, FPS didn't go past 15 in low settings.\n\nAs per Battery life: the Executive is quoted for 12h max, with a 65Wh battery, but in real world use, I got 6hours and 35 minutes running the display at mid brightness, at a balanced power setting, looping youtube videos over wifi.", "link": "https://www.youtube.com/watch?v=JjNfT41SvT0", "date_published": "2021-09-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]