[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "BOTW's Most Powerful Glitch Of 2021 BLSS Explained", "description": "Breath of the Wild's newest discovery, BLSS, or Bow Lift Smuggling Slide, is the best long distance travelling technique in the entire game.\n\nIn the video above, we explain how to perform BLSS for yourself at home, and the origin story of how it was first found. Its combination of multiple glitches together created one of the most useful techniques in a game all about traversing the world. Get a glimpse of us flying from one corner of Hyrule to the other in just 4 minutes with this new game breaking glitch.\n\n#botw", "link": "https://www.youtube.com/watch?v=SHFbg9HDxiE", "date_published": "2021-09-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 Delayed To After Call Of Duty | GameSpot News", "description": "Battlefield 2042 gets delayed to November 2021. Nintendo Switch adds fan-requested Bluetooth audio functionality. Splitgate’s developer, 1047 Games, raises $100 Million. \n\nIn this video, DeVante talks about the delay of Battlefield 2042 from October 22 to November 19, 2021. The game will release after competitor Call of Duty: Vanguard and not long before Halo Infinite. \n\nLater on, DeVante breaks down the Nintendo Switch’s latest update that introduces Bluetooth audio output functionality, as well as Splitgate developer 1047 Games raising $100 Million and retaining their independence.\n\n#battlefield #battlefield2042", "link": "https://www.youtube.com/watch?v=9JpcrXyI-hY", "date_published": "2021-09-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Dying Light 2: Stay Human Delayed Again | GameSpot News", "description": "Dying Light 2: Stay Human has been delayed to February 2022. PlayStation’s new firmware is releasing September 15 and the Xbox App on Windows 10 PCs get streaming functionality built in. \n\nIn this video, DeVante talks about the delay of Dying Light 2: Stay Human from December 2021 to February 2022. \n\nLater on, DeVante breaks down the PlayStation 5s new firmware update, set for release on September 15, 2021. As well as Xbox’s PC app update that allows for easier streaming of games from the cloud or consoles.\n\n#dyinglight2 #stayhuman", "link": "https://www.youtube.com/watch?v=icfdAF-7RUI", "date_published": "2021-09-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "20 Best PS5 And PS4 First-Person Shooters To Play", "description": "Here are our picks for the 20 best Playstation shooters. \n\nThe best PlayStation shooters come in all shapes and sizes. No matter what kind of FPS player you are, the best PS4 and PS5 shooters have something to keep you entertained by yourself or with friends. All of our picks are arranged in alphabetical order and playable on both PS4 and PS5.  \n\nTimestamps\n0:00 Introduction\n0:24 Apex Legends\n0:47 Battlefield 1\n01:13 Bioshock: The Collection\n02:31 Borderlands 3\n03:01 Call of Duty Modern Warfare Remastered\n03:31 Call of Duty: Warzone\n03:54 Destiny 2\n04:25 Doom (2016)\n05:00 Doom Eternal\n05:45 Fallout 4\n06:26 Far Cry 5\n07:01 Metro Exodus\n07:28 Overwatch\n07:56 Prey\n08:31 Rage 2\n08:54 Rainbow Six Siege\n09:24 Superhot\n09:52 Titanfall 2\n10:20 Wolfenstein: The New Order\n10:52 Wolfenstein II: The New Colossus\n\n#ps5 #ps4", "link": "https://www.youtube.com/watch?v=pHshNUc-cuo", "date_published": "2021-09-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Deathloop: 9 Things To Know Before You Play", "description": "At a glance, Deathloop, Arkane's newest game, might seem like its past work on Dishonored and Prey, but Deathloop also introduces new wrinkles to familiar roguelite and first-person shooter elements that might initially be challenging to wrap your head around. Here are the 9 tips we wish we knew before diving into the Groundhog Days of Blackreef.\n\nAt a glance, Deathloop, the newest game from Dishonored and Prey developer Arkane, might seem like its past work on Dishonored and Prey. You get an array of varied weapons, a handful of creative powers, and the ability to use them in experimentative and inventive ways to progress. And that's true, but Deathloop also introduces new wrinkles to familiar roguelite and first-person shooter elements that might initially be challenging to wrap your head around. Fret not, though, as we've collected some of the lessons we wish we knew before diving into the Groundhog Days of Blackreef.\n\n#deathloop", "link": "https://www.youtube.com/watch?v=mHmgqj_QFXw", "date_published": "2021-09-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "God of War: Ragnarok - Everything We Know", "description": "Several God of War: Ragnarok details were revealed at Sony's PlayStation showcase. Check out our breakdown of everything we know so far for the highly anticipated sequel. This includes info on characters, new worlds, combat, and where the story picks up following the events of the prequel.\n\nLink to Audio Logs Episode with Cory Barlog: https://www.youtube.com/watch?v=e4XRmMkQcuQ \n\nSony's PlayStation showcase got us up to speed on God of War: Ragnarok. Viewers were treated to gameplay and more following the original 30-second teaser from nearly a year ago. The showcase brought us details with the story, introduced new characters, and showed us new worlds along the way.\n\nTaking place shortly after the events of the first, the trailer reveals that Ragnarok (the Norse mythological end of the world) is indeed coming. On their quest to prevent it, Kratos and Atreyus return to find Odin. While the trailer didn't feature the all-father this time, we did get a quick look at Thor. (played by Sons of Anarchy's Ryan Hurst) \n\nThe presentation ended with a developer interview where new director Eric Williams discussed how Santa Monica Studio likes to change directors when they can for a fresh take on the creative process. With the exception of previous director Cory Barlog-who directed God of War from 2018 as well as God of War 2 from 2007. God of War Ragnarok is slated to release in 2022.  \n\nTimestamps:\n00:00 - Intro\n00:20 - The Story So Far\n03:27 - Combat\n04:17 - The World\n04:52 - Voice Cast\n05:09 - Music\n05:27 - New Director\n06:12 - Platforms\n\n#godofwar #ragnarok", "link": "https://www.youtube.com/watch?v=7swc1R0aIrY", "date_published": "2021-09-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]