[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Hacking Expert Reacts To Hacking Clips In Games", "description": "Sean Melia, an ethical hacker, breaks down the hacking mechanics of some of our favorite games to tell us how realistic - or unrealistic - they really are.\n\nFrom Cyberpunk 2077 to Watch Dogs: Legion, many games feature hacking mechanics to let the player conduct covert espionage, steal important data or turn technology against their enemies. But how close do these games get to the way hacking works in real life?\n\nIn the above video Sean Melia, an ethical hacker, breaks down the hacking mechanics in some of our favorite games to tell us how realistic - or unrealistic - they really are.\n\nCheck out more of our Expert Reacts series right here - https://www.youtube.com/watch?v=-BeJdQfEp40&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R", "link": "https://www.youtube.com/watch?v=BZU_KrlaGJk", "date_published": "2021-01-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Hitman 3’s Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of Hitman 3, including Agent 47’s iconic Silverballer pistol, the legendary Sieger 300 sniper rifle, and the Krugermeier pistol.\n\nHitman 3--the third entry in IO Interactive’s World of Assassination trilogy--features a range of iconic weaponry including the Walther WA 2000 sniper rifle, the AMT Hardballer pistol, and the Uzi submachine gun..\n\nIn the above video, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of Hitman 3 and compares them to their real-world counterparts.\n\nIf you're interested in seeing more of Jonathan, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/ \n\nAnd if you would like to become a member of the Royal Armouries, you can get membership here. - https://royalarmouries.org/support-us/membership/", "link": "https://www.youtube.com/watch?v=E9EEFEm-oeo", "date_published": "2021-01-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Hitman 3 Loading Times Comparison: Xbox One S, Xbox Series X|S, PS4 & PS5", "description": "In this video we compare Hitman 3 loading times on five different consoles, including the PlayStation 5, PlayStation 4, Xbox Series X|S, and the Xbox One S.\n\nHitman III is here, having launched for Xbox Series X|S, PS5, Xbox One, PS4, Switch, Stadia, and PC. That's a lot of options and you may be wondering which version is right for you. Well, if loading times are a big part of your decision-making process, then you've come to the right place.\n\nIn the video above, we test the loading times for Hitman III on five different consoles. Apologies if you were considering buying the game for Switch, Stadia, or PC--this is a PlayStation vs. Xbox video.\n\nFor PlayStation owners, we compare the loading speeds between the standard PS4 and PS5. Xbox owners can skip ahead to when we put the Xbox One S up against both the Xbox Series S and Xbox Series X. And if you happen to own both of the current gen consoles, we have a PS5 vs. Xbox Series X comparison to round things out. \n\nThe exact time stamps are listed below if you're looking for a specific comparison.\n\nIn GameSpot's Hitman III review, Phil Hornshaw writes, \"What's good about Hitman--its level design and the creativity, experimentation, and exploration that affords--is great in Hitman 3. It closes out the trilogy by brilliantly playing off everything that came before it, making use of and then subverting expectations, and rewarding players for their willingness to master the complexity of both its individual levels and the series as a whole.\"\n\n00:00 - Base PlayStation 4 vs. PlayStation 5\n01:53 - Xbox One S vs. Xbox Series S vs. Xbox Series X\n03:42 - PlayStation 5 vs. Xbox Series X\n04:42 - Outro", "link": "https://www.youtube.com/watch?v=jyQY1AM6ZO8", "date_published": "2021-01-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Worst Way to Play Cyberpunk 2077", "description": "Jake and Rob boot up an Xbox One disc with the 1.0 version of Cyberpunk 2077, and attempt to power through the bugs and jankiness— Can you finish Cyberpunk in it's worst possible condition?\n\nAs a role-playing game, there are many ways you can play Cyberpunk 2077. We’re taking that spirit with us for a new video where we try to play Cyberpunk 2077 in the worst way.\n\nTo do so, GameSpot’s Jake and Rob  booted up Version 1.0 of the game running on a regular Xbox One. As you are likely aware by now, this is not the ideal way to play Cyberpunk 2077, and this will become painfully obvious once you watch the video with all the bugs and other issues. \n\nWe used an Xbox that hasn’t been connected to the internet and running on a disc to avoid the updates that have since been released.  \n\nIn addition to playing on a poor platform for Cyberpunk 2077, Jake and Rob try to make the worst possible character both in terms of looks and behavior. \n\nThere is a lot to enjoy in the video. Sit back and watch Jake and Rob suffer through the experience so you don’t have to!", "link": "https://www.youtube.com/watch?v=aWrzMkVRNKE", "date_published": "2021-01-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]