[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "Running MS OFFICE on Linux - Is it enough to justify paying for Wine?", "description": "Try Kernelcare Enterprise for free: https://lp.kernelcare.com/kernelcare-enterprise-experiment\n\nBecome a channel member to get access to a weekly patroncast and vote on the next topics I'll cover:\nhttps://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nSupport the channel on Patreon: \nhttps://www.patreon.com/thelinuxexperiment\n\nFollow me on Twitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\nFollow me on LBRY: https://lbry.tv/@TheLinuxExperiment:e\n\nJoin us on Discord: https://discord.gg/nN8wwZPpwr\n\nThe Linux Experiment merch: get your goodies there! https://teespring.com/en-GB/stores/the-linux-experiment\n\nCrossover is developed by Codeweavers. This company is one of the biggest contributors to Wine, they make up 2/3 of the commits on the project, and most of the code they use on Crossover is given back to Wine, in open source form.\n\nCrossover in itself, is a software installation platform: it combines a graphical user interface that lets you install and manage windows software, and a database of installation \"recipes\" that are kept up to date, and contain all the dependencies and configuration  steps to install this windows software.\n\nYou could also compare it to PlayOnLinux, but Crossover has a few advantages over it:\n- First, buying it helps the Wine project, since you're allowing Codeweavers to keep working on Wine, and they give back their code to the Wine project. Buying Crossover allows the Wine project to keep going, or even to move faster.\n- Second, the ratings given on the Crossover GUI are certified, so you can get support for a specific app if it doesn't run on your device even though it's marked as working in Crossover. You can get email or phone support depending on the plan you've picked, to help you make sure you can run what you need.\n- Finally,  Crossover has great management tools: you can create Wine bottles, which are basically folders that contain all the necessary files for Wine, and select in which bottle you want to install your app: if a bottle you already have is compatible with your app, Crossover will tell you, and you can save some disk space instead of duplicating everything. Bottles are also supported by PlayOnLinux, but it won't tell you if a bottle is compatible with a specific app or not, so you're better off installing each app in a specific bottle, which will use a lot of space.\n\n## Installing and using Crossover\n\nCrossover is a paid-for application, but you can also try it for free for 2 weeks. This lets you check that the apps you need can run with Crossover, or not, but after this trial period, you'll need to pay for the software.\n\nInstalling Crossover is pretty easy, just head over to the site, select \"free trial\", and download the installer. It's available in various formats: Debs, RPMs, or .bin if you're not using Ubuntu or Red Hat. After that, you just open the package and install Crossover.\n\nInstalling applications is as simple as looking for their name in the Software Installer, or browsing the various categories and selecting it. You then have the option to select the install media, whether it be a file, a mounted ISO, or a folder, and Crossover will take care of installing any tweaks, libraries, or windows components you might need.\n\nYou also get the rating of the app, as in \"will it run, and how\" front and center, so you don't waste your time trying to install things that clearly won't work.\n\nOnce your software is installed, Crossover will automatically add entries to your menu so you can launch your windows apps just like if they were native Linux ones, but you can also handle a lot of the settings for each bottle.\n\nI managed to install Microsoft Office 365, which worked, but was kinda slow at displaying the various tabs in the ribbon, and the interacting with it wasn't super speedy.\n\nWord, Excel, PowerPoint, and Even Outlook worked well, though, I could activate them using my MS Account, and even though the text rendering in some menus is a bit wonky, and there are some slowness issues here and there, it's perfectly usable. Access couldn't get past the part where you're supposed to create a new database or select a template.\n\n\nI also couldn't find Affinity Designer in the list, and Illustrator CC is listed as working, on the website, but also doesn't show up in the list of apps to install. Whether that's a limitation of the trial version, or because the app no longer works and they removed it, I couldn't tell.\nI couldn't find iTunes in the Graphical user interface, the only AutoCad version the app lists is 2013, and is stated as Will Not Install.\n\nAlso, I think it's important to mention, but Crossover also runs on Mac OS, including on M1 Macs, and on Chrome OS, so you can expand the software library for these systems as well!", "link": "https://www.youtube.com/watch?v=ZH5JYshhtYg", "date_published": "2021-01-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]