[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "KDE at Work - Apps I use to get stuff done", "description": "Join the AlmaLinux community at http://www.almalinux.org\n\nGet your Linux desktop or laptop here: https://slimbook.es/en/\n\nI showed you how I use KDE, and Activities to switch between personal stuff an Work, and my preferred layout, now it's time to take a look at the applications I use to get stuff done!\n\n00:00 Intro\n01:30 Email and Calendar\n03:18 Web Browsers\n05:06 Graphics Design\n06:02 Todo List\n07:02 Office Suite\n08:11 Screen Recording\n08:37 File Manager\n09:18 Desktop-Specific apps\n10:29 Laptop-Specific apps\n11:52 Parting Thoughts\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nJoin us on our new Discord server: https://discord.gg/xK7ukavWmQ\nTwitter : http://twitter.com/thelinuxEXP\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\nFollow me on ODYSEE: https://odysee.com/@TheLinuxExperiment:e\nOr join ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\n\n\n## Common apps\n\nLet's start with the apps I use on both my laptop, and my desktop:\n\n### Email / Calendar\n\nFirst are the email and calendar apps. I use Kmail, and KOrganizer for this. These are the default on KDE, and you can tell that they have older roots, they don't really look or feel super modern, so I tweaked their layout a bit to make them fit my workflow better. \n\nI use the versions supplied in the official manjaro repos or by KDE Neon on the laptop.\n\n### Web Browser\n\nOf course, I also use a web browser, and my preferred one is Firefox.\n\nI also use Chromium, because I need to test our website and webapp in the most used rendering engine, and GNOME Web, when I need to check if something breaks on Safari Desktop.\n\n## Graphics\n\nI sometimes need to quickly mockup something, to propose changes or evolutions to our webapp, and for this, I use GIMP. I never used Photoshop in my life, so for me, it's super natural to use, it's relatively fast and simple, and the workflow of starting with a selection and then using it to draw, move, add, or remove stuff is pretty well ingrained in my brain.\n\n### Planner\n\nTo manage my tasks and reminders, I use Planner. Planner is, IMO, THE best todo list app on Linux. It has so many nice features, and it stays super simple and easy to understand.\nYou can sync it with a todoist account as well, but not with Nextcloud for now, which is too bad.\n\n### Office suite\n\nThere is LibreOffice, which I really like, especially with the tabbed bar user interface. it's fast, it works really well, its compatibility has really improved a lot, and it's a native linux application, so it tends to look right on any desktop, including KDE. It's also open source, it does all I need for spreadsheets, presentations, or long form writing, it's a nice program.\n\nBUT. I also use WPS office, because its file format compatibility with MS Office documents is just better.\n\n\n### Screen recording\n\nAs I test our app and website, I tend to create bug reports, and there is no better way to illustrate one than with a simple, quick recording of what is happening. For this, I use OBS, which is definitely overkill.\n\n### File Manager\n\nHere, I use Dolphin. It's a wonderful file manager, with plenty of options to make it either simple, or very powerful. I tend to use it in a simple way, with a few tabs, no split view, preview panels,or terminal. I like the fact that it integrates nicely with Nextcloud, so I can see the sync status of files and folders, and quickly copy sharing links to various files, and it's super snappy and responsive.\n\n## Desktop only apps\n\nOn to the apps that I only use on my desktop.\n\n### Discord\n\nThis one, I only use on my desktop, because we use it to work remotely and keep in touch with my colleagues.\n\n### Droidcam\n\nI don't own a webcam at home, but I still need to do some video conferencing. For this, I use Droidcam.\n\n## Laptop only apps\n\nNow, on the laptop specifically, here's what I use:\n\n### Slimbook Face\n\nThis is an app that makes use of the IR camera on my Slimbook Pro X 14. It lets me replace my password with just my face. Sadly, KDE's login manager doesn't support that, but everythime the DE asks me for a password, including in a terminal, I just let it scan my face, and a second later, it's done, and the command can run.\n\n### Slimbook Battery\n\nOn the laptop, since most Linux desktops don't have power profiles, I also installed Slimbook battery. it's their app to handle, well, power profiles. I use the laptop in performance mode when it's plugged in, and in low power mode when it's not, the balanced plan, I never use.", "link": "https://www.youtube.com/watch?v=syS3EQcSK3E", "date_published": "2021-08-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]