[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Hell Let Loose’s Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the WW2-era weaponry of Hell Let Loose, including the M1 Garand rifle, the PPSh-41 submachine gun, and the StG 44 assault rifle.\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of Hell Let Loose and compares them to their real-life counterparts.\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can purchase Jonathan's book here - https://www.headstamppublishing.com/bullpup-rifle-book\n\nYou can check out Jonathan on the Fighting on Film podcast here - https://www.youtube.com/playlist?list=PLNsrU8HuCAzaizIqbAcNZ5VUQW789z3ZF\n\n#expertreacts #royalarmouries", "link": "https://www.youtube.com/watch?v=K81e5Q6aY3g", "date_published": "2021-08-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Ghost Of Tsushima Director’s Cut - Is it Worth The Upgrade?", "description": "Ghost Of Tsushima Director’s Cut gives us a native PS5 version, with new upgrades to take advantage of the hardware. But is it enough to make the upgrade?\n\nGhost of Tsushima Director’s Cut is now out, bringing a proper next generation version of Sucker Punch’s open world samurai adventure to the PlayStation 5. This is pretty fascinating as the game already received a PS5 patch last year which let it tap into the extra horsepower of the system. So you might be wondering what a proper PS5 version brings to the table? While it’s still largely the same game there’s a number of improvements that make Ghost of Tsushima Director’s cut the definitive version.\n\n#ghostoftsushima", "link": "https://www.youtube.com/watch?v=YOFgcndewwA", "date_published": "2021-08-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "I Played Every COD in 2021 (Modern Warfare 2 to Black Ops Cold War)", "description": "Part 1: https://www.youtube.com/watch?v=QALC_jNI9WM\n\nRichie returns to share his journey playing through every Call of Duty in the series. Part 2 begins with Modern Warfare 2 from 2009 and leads to 2020's Black Ops Cold War.\n\nTimestamps:\n\n00:00 - Intro\n00:22 - Modern Warfare 2\n02:53 - Black Ops\n05:25 - Modern Warfare 3\n08:33 - Black Ops 2\n11:39 - DS Games \n13:57 - BO: Declassified\n16:06 - Ghosts\n19:11 - Advanced Warfare\n21:36 - Black Ops 3 \n25:16 - Infinite Warfare\n27:56 - WWII\n31:16 - Black Ops 4\n31:57 - Modern Warfare/WZ\n34:48 - Black Ops Cold War\n37:19 - Thank You!\n\nThe Call of Duty series has been around for almost 20 years. In its time we’ve seen it go everywhere from World War II to the final frontier of space. This year, GameSpot’s Richie Bracamonte took the plunge and played every single COD game. In part 1, we watched him begin from 2003’s Call of Duty to 2008’s Call of Duty World At War. This time around, we’ll continue with Call of Duty: Modern Warfare 2 all the way to 2020’s Call of Duty: Black Ops Cold War.\n\nOriginally based on WWII, the first few COD titles are packed with historical retellings of several battles carried out across all theatres. As the series progressed, the gaming market flooded with dozens of WWII games made by several other developers. The fad that Activision helped to create quickly took a back seat after the introduction of the Modern Warfare series in 2008. After major successes with the revitalized series, Call of Duty remained a household name to this day.\n\nIf you love Call of Duty as much as Richie, GameSpot is the place for you! We’re always covering the latest news including gameplay, breakdowns and more. GameSpot’s YouTube page also has classic COD playlists full of fun weapons videos, chats and more.\n\n#cod #callofduty", "link": "https://www.youtube.com/watch?v=74_zo2pCAiU", "date_published": "2021-08-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Madden NFL 22 Review", "description": "With meaningful additions on and off the field, Madden NFL 22 marks a recent high point for the series, but technical issues get in the way.\n\nMadden 22 is now available on PlayStation 4 and 5, Xbox Box Series X|S and Xbox One, Stadia, and PC. You can read the full written Madden 22 review by Richard Wakeling on GameSpot: https://www.gamespot.com/reviews/madden-nfl-22-review-momentum-shift/1900-6417715/\n\n#maddennfl22 #nfl22 #madden22", "link": "https://www.youtube.com/watch?v=wOYYTn_Iy7w", "date_published": "2021-08-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "QuakeCon 2021 Day Three | Quake World Championship Grand Finals, DOOM Eternal BattleMode and More", "description": "QuakeCon concludes with the Quake World Championship Grand Finals, a DOOM Eternal BattleMode Community Bonanza, and a Elder Scrolls Online Live Art Creation Panel.\n\nSchedule:\n11:00AM PT - DOOM Eternal - Battlemode Community Bonanza!\n12:30PM PT - Fallout 76 - C.A.M.P. Love It or Nuke It\n1:30PM PT - Quake World Champsionship Grand Finals\n3:30PM PT The Elder Scrolls Online - Live Art Creation\n\n#quakecon #bethesda", "link": "https://www.youtube.com/watch?v=wF-SOmqUwA0", "date_published": "2021-08-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "12 Minutes of Black Myth: WuKong Official Unreal Engine 5 Gameplay Trailer", "description": "Check out 12 minutes of new gameplay for Black Myth: WuKong, the action-adventure game developed by Game Science, reveals its newest gameplay test collection today. The video is recorded real-time in Unreal 5 Engine, and supported by NVIDIA DLSS technology. \n\nBlack Myth: Wukong is an upcoming action role-playing game by Chinese indie developer Game Science, based on the classical 16th-century Chinese novel Journey to the West. Game Science hopes to release the game in 2023.\n\n#blackmythwukong #blackmyth #wukong", "link": "https://www.youtube.com/watch?v=m6T-YPdyttM", "date_published": "2021-08-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Ghost of Tsushima Director's Cut | Japanese Lip Sync Comparison", "description": "The PS5 version of Ghost of Tsushima now features proper Japanese lip sync. But how does it compare to the original PS4 version?\n\nA point of contention for some players during the release of Ghost of Tsushima was the lack of lip sync when playing with Japanese audio. Considering the game’s setting and how playing it in Japanese is featured as a selling point when you start the game, this exclusion did hurt those looking to experience the game this way.\n\nThis is because the original PS4 release of Ghost of Tsushima used pre-rendered cutscenes, which were so big, they could barely fit on the game disc. This didn’t leave the space for alternate cutscenes with different lip sync. In the PS5 version, The Director's Cut, the cutscenes rendered are in real-time. This allows room for Sucker Punch to add in Japanese lip sync.\n\nAs someone who played Ghost of Tsushima in Japanese this is by far my favorite new addition, it’s still not perfect in a few spots but it’s a massive improvement. Playing in Japanese, you don’t find yourself distracted by the lip sync the way you might have been previously. Watch this video for yourself to see the differences between the two versions.\n\n#ghostoftsushima", "link": "https://www.youtube.com/watch?v=jszehvdyGEQ", "date_published": "2021-08-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Infinite Development Update (August)", "description": "Join members of the 343 Industries team for a discussion on key takeaways from the recent Multiplayer Technical Preview, updates on Halo Infinite’s overall development, and what to expect at launch.  \n\nSome key updates included campaign co-op and Forge getting delayed to post-launch, with the former tentatively arriving around three months after launch and the latter coming six months after launch. The game is still scheduled for a holiday release but no date has been confirmed.\n\n#haloinfinite #halo", "link": "https://www.youtube.com/watch?v=W7n1r2ftBKw", "date_published": "2021-08-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Naraka Bladepoint Review", "description": "In this video, we go over the GameSpot Review for Naraka Bladepoint which was done by Justing Clark. \n\nNaraka Bladepoint's sharp new take on the Battle Royale formula gets off to a promising, but slightly awkward start. \n\nIf absolutely nothing else, be grateful to Naraka Bladepoint for being one of a scant few battle royale titles where getting one-shotted by someone hiding in a shrub three football fields away isn't a danger. That by itself makes it welcoming in a way the genre tends to ignore. But lurking beneath that relative ease and approachability is a shrewd game of wuxia-inspired combat that demandsfar more steelfrom its players--and we're not just talking about swords and spears.\n\n#naraka #narakabladepoint", "link": "https://www.youtube.com/watch?v=NI-lVQi-r1I", "date_published": "2021-08-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "QuakeCon 2021 Day Two | Deathloop Dev Panel, ESO Dungeon Speed Runs, And More", "description": "QuakeCon continues with a Deathloop Developer Panel, an Elder Scrolls Online Dungeon Speed Run Competition, more Quake talk, Skyrim 10th Anniversary Panel, And More!\n\nSchedule:\n11:00AM PT - DEATHLOOP Meet its Makers\n12:30PM PT - WeRateDogs and Pete Hines Dog Chat\n1:00PM PT - Code Orange vs Quake\n2:00PM PT - Alienware - Fundraising and Raising Heck\n3:30PM PT - The Elder Scrolls Online Dungeon Speed Run Competition\n5:00PM PT - Exclusive Musical Performance by Trivium\n6:00PM PT - Skyrim 10th Anniversary - Interactive Fun Run with Gus Johnson\n\n#quakecon #bethesda", "link": "https://www.youtube.com/watch?v=X8DnknyOvvo", "date_published": "2021-08-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]