[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Every Game Delayed in 2021 So Far", "description": "With game development grinding to a halt in 2020, anticipated titles like Battlefield 2042, GhostWire: Tokyo, God of War: Ragnarok, and several more have all been delayed. Here's our list even more games that have been delayed in 2021.\n\nGame development for most of 2020 came to a screeching halt with the wake of the global pandemic. Even into 2021, the wave of delayed games grew by the day, with developers transitioning to their work-from-home environments. As companies continue to regain their momentum, some delays were only temporarily, while some have yet to receive updates. \n\nRichie Bracamonte is here to break down the laundry list of titles that have been delayed in 2021. Games from just about every category are present from the Warhammer series to more recent entries like Battlefield 2024. Titles that were announced in 2021 that were set for a 2022 release (Diablo 4, Overwatch 2) will not be mentioned on this list.\n\nAll of these delays are of course subject to change. As the world continues to adjust from new workspaces, only time will tell if these dates will stick. Stay tuned to GameSpot for the latest news regarding these titles and more. \n\nIntroduction - 0:00\nBattlefield 2042 - 0:32\nHorizon Forbidden West - 0:58\nEvil Dead: The Game - 01:25\nGod of War: Ragnarok - 01:46\nRocksmith + - 02:07\nTotal War: Warhammer 3 - 02:27\nLost Ark - 02:45\nNobody Saves the World - 03:10\nAbandoned - 03:32\nLone Echo - 03:57\nLife is Stange: Remastered Collection - 04:20\nDiablo Immortal - 04:45\nSoup Pot - 05:06\nIcarus - 05:25\nHalo Infinite - 05:43\nStray - 06:05\nCrimson Desert - 06:21\nDigimon Survive - 06:40\nRainbow Six Extraction - 07:01\nWarhammer: 40,000 Darktide - 07:24\nResident Evil RE:Verse - 07:44\nGhostwire: Tokyo - 08:04\nKOF 15 - 08:22\nSkull & Bones - 08:49\nFive Nights at Freddy's: Security Breach - 09:25\nLego Star Wars: The Skywalker Saga - 09:50\nGran Turismo 7 - 10:09\nRiders Republic - 10:27\nThe Lord of the Rings: Gollum - 10:40\nPrince of Persia: The Sands of Time Remake - 11:09\nHogwarts Legacy - 11:30\nGotham Knights - 11:45\nVampire: The Masquerade - Bloodlines 2 - 12:18\nDying Light 2 - 12:50\nBack 4 Blood - 13:22\nPragmata - 13:43\nNew World - 14:03\nDestiny 2: The Witch Queen Expansion - 14:24", "link": "https://www.youtube.com/watch?v=lgQRw2dhgQ0", "date_published": "2021-09-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Kena  Bridge of Spirits Release Trailer", "description": "Check out the launch trailer for Kena Bridge of Spirits release September 21st on PlayStation 4, PlayStation 5 and the Epic Games Store. \n\nA story-driven action adventure with a stunning visual aesthetic combining exploration with fast-paced combat. Players find and grow a team of charming spirit companions called the Rot, enhancing their abilities and creating new ways to manipulate the environment. Kena: Bridge of Spirits seamlessly blends action and narrative into an unforgettable experience. Travel with Kena, a young Spirit Guide on a quest to uncover the mysterious story surrounding the demise of the village.\n\n#kena #birdgeofspirit", "link": "https://www.youtube.com/watch?v=WOMRGOsSJq0", "date_published": "2021-09-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Metroid Franchise - Which Are Worth Playing/Buying?", "description": "This year marks the 35th anniversary of Metroid, the loveable bounty hunting, genre defining, child that Nintendo loves to forget about. Except to everyone’s surprise Nintendo did remember this year and are celebrating with Metroid 5, aka Metroid Dread, the first brand new 2D Metroid game in quite a long time.\n\nSo long in fact that there is a whole generation of people that have never experienced just how good classic Metroid is, and are looking at all the excitement Dread is causing, and they’re curious. \n\nFor this video, Jean-luc details the best Nintendo approved options available for you. Unfortunately that means buying a Wii U.\n\n#metroid", "link": "https://www.youtube.com/watch?v=04aibjsKiXo", "date_published": "2021-09-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]