[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Professor Hoiby, message to world leaders", "description": "Please pass this video on, Basically, we need to change the vaccine administration guidelines to include precautionary aspiration, prior to pushing in the vaccine. This will prevent cases of inadvertent intravascular administration of vaccine.\n\nHere is some discussion to suggest inadvertent intravascular vaccine administration is a variable in the aetiology of complications after adenoviral vector vaccine administration and after mRNA vaccines.\n\nThese adverse events, although rare have reduced public confidence in covid vaccination, especially amongst the young, where vaccine rates are lowest.\n\nIt has long been known that intravenous injection of adenovirus leads to TTS in mice\n\nhttps://ashpublications.org/blood/article/109/7/2832/125650/Adenovirus-induced-thrombocytopenia-the-role-of\n\nNow, new covid vaccine specific work agrees with this previous work\n\nThrombocytopenia and splenic platelet directed immune responses after intravenous ChAdOx1 nCov-19 administration (29th June 2021)\n\nhttps://www.biorxiv.org/content/10.1101/2021.06.29.450356v1\n\nThe authors conclude, ‘Our work contributes to the understanding of TTS and highlights accidental intravenous injection as potential mechanism for post-vaccination TTS.’ \n\n‘We show that intravenous but not intramuscular injection of ChAdOx1 triggers platelet-adenovirus aggregate formation and platelet activation.’ \n\n‘Hence, safe intramuscular injection, with aspiration prior to injection, could be a potential preventive measure when administering adenovirus-based vaccines.’\n\n\nAlso after giving mRNA vaccines\n\nA new study finds that giving mice intravenous mRNA vaccine also causes heart inflammation in mice. \n\nIntravenous Injection of Coronavirus Disease 2019 (COVID-19) mRNA Vaccine Can Induce Acute Myopericarditis in Mouse Model (August 2021)\n\nhttps://academic.oup.com/cid/advance-article/doi/10.1093/cid/ciab707/6353927\n\n‘Our study indicates that IV injection of vaccines might partially contribute to this clinical phenotype, thus warranting a reconsideration of the practice of IM injection without aspiration, which carries the risk of inadvertent IV injection.’ \n\nAgreement from ‘fact check’ from Leo Nicolai, Cardiology Fellow, Ludwig Maximilian University of Munich:\n\n(German Centre for Cardiovascular Research)\n\nhttps://healthfeedback.org/claimreview/incorrect-vaccine-administration-is-a-potential-cause-of-post-vaccine-adverse-effects-but-more-research-is-still-needed-to-confirm-or-reject-this-hypothesis/?fbclid=IwAR0nBbM6v0V2WPFn4LxIdfR4FNAvIzLGKhzFPdQPG8mu_FR1InB8OzYQgMc\n\n‘Indeed, there is peer-reviewed work showing in mice that possibly intravenous injection of mRNA vaccine leads to myocardial inflammation.’\n\n‘that intravenous injection of adenoviral vector based vaccine (AZ1222, ChAdOx1) leads to thrombocytopenia and platelet-directed immune responses, offering a possible explanation for vaccine-induced thrombosis/thrombocytopenia’\n\n‘these data might indicate a simple measure to lower the incidence of vaccine-induced side effects,’\n\n‘There is a lack of data on frequency and effects of IV injection in humans.’\n\n\nDenmark has changed their national guidelines\n\nhttps://en.ssi.dk/news/epi-news/2021/no-19-21---2021\n\nBased on a precautionary principle, we recommend aspiration before injection.\n\n\nhttps://www.youtube.com/watch?v=H7inaTiDKaU\n\nEvidence from Dr. Peter Gaillard (microparticulate pharmacologist)\n\nhttps://www.linkedin.com/pulse/astrazeneca-vaccine-pull-back-push-through-pieter-j-gaillard/?trk=pulse-article_more-articles_related-content-card \n\nCase study evidence\n\nMetallic taste in the mouth seconds after ‘intramuscular’ mRNA vaccine administration, (in the absence of an allergic reaction)\n\nhttps://www.youtube.com/watch?v=hbjuWs99CrE\n\nOther video-based discussions\n\n26th September 2021\n\nhttps://www.youtube.com/watch?v=nBaIRm4610o\n\n30th September 2021\n\nhttps://www.youtube.com/watch?v=KgVsd6qoyU4", "link": "https://www.youtube.com/watch?v=hkopHLQjtVQ", "date_published": "2021-12-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "US omicron surge now", "description": "Omicron in the US is rip roaring away\n\nSA data\n\nhttps://www.nicd.ac.za/diseases-a-z-index/disease-index-covid-19/surveillance-reports/daily-hospital-surveillance-datcov-report/\n\nOmicron variant, Houston Methodist patients\n\nhttps://www.houstonpublicmedia.org/articles/news/health-science/2021/12/17/415844/omicron-variant-is-now-responsible-for-nearly-half-of-houston-methodists-covid-19-cases/\n\nhttps://www.houstonpublicmedia.org/articles/news/health-science/2021/12/15/415577/houston-hospitals-see-a-covid-19-uptick-as-omicron-and-delta-continue-to-spread/\n\nOmicron variant, doubling every two to three days\n\nAt least 45% of Methodist’s COVID-19 patients were omicron as of Friday\n\nWednesday, 32% COVID-19 tests on symptomatic patients\n\nSaturday, (4 days before) 13%\n\nHalf of the hospital’s omicron patients have been vaccinated with either two or three doses\n\nFour times as many positive COVID-19 test results since last week\n\nFueled by the continued spread of the omicron variant\n\nDr. Marc Boom, Methodist president and CEO\n\nIf this spreads so rapidly that there are massive numbers of infected people, \n\neven if on average they’re very mild, if that hits the vulnerable in our population and they end up hospitalized, that can still be an incredibly challenging time\n\nS. Wesley Long, medical director of diagnostic microbiology\n\nVery likely reach 100% of all COVID-19 cases within the hospital by January\n\nThat would be a faster sweep than even the delta variant, which took about a three-month span to sweep prior variants and achieve 100%,\n\nIt is also possible that delta remains in some equilibrium with omicron over time\n\nUS\n\nCases\n\nhttps://covid.cdc.gov/covid-data-tracker/#trends_dailycases\n\nHospitalizations\n\nhttps://covid.cdc.gov/covid-data-tracker/#hospitalizations\n\nRip roaring away\n\nCould bring the highest level of cases yet\n\nhttps://www.washingtonpost.com/nation/2021/12/20/covid-omicron-variant-live-updates/\n\nNew York City Mayor Bill de Blasio\n\nwe are seeing a very substantial rise in the number of cases in a way we haven’t seen previously\n\nNew York adults had at least one dose, 94%\n\nPeople with 2 doses, 70% (10% above national rate)\n\nDr. Anthony Fauci\n\nhttps://www.nbcnews.com/news/us-news/fauci-warns-omicron-variant-raging-world-rcna9293\n\nraging around the world\n\nOmicron variant is really something to be reckoned with\n\nOur hospitals, if things look like they're looking now, in the next week or two are going to be very stressed\n\nbecause, again, we have so many people in this country who are eligible to be vaccinated who have not yet been vaccinated\n\nThe hospitalization to case ratio appears to be smaller than delta\n\nWe are going to see breakthrough infections, there's no doubt about that\n\nThe difference between a vaccinated and boosted person who has an infection and someone who has an infection who's never been vaccinated, \n\nthere's a major difference with regard to the risk of severity\n\nPresident Biden, winter plan tomorrow\n\nLots of flights\n\nBroadway cancelled\n\nSports events cancelled\n\nEducation going remote\n\nUK surge\n\nOmicron\nCases, + 12,133 + 8,044 = 45,145 \nhttps://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1042543/20211220_OS_Daily_Omicron_Overview.pdf\n\nhttps://covid.joinzoe.com/data#levels-over-time \n\nhttps://coronavirus.data.gov.uk\n\nLondon hospital admissions\n\nProfessor Niels Hoiby\n\nDenmark\n\nTotal vaccinated with mRNA vaccine = 4,304,710\n\nTotal myocarditis + pericarditis = 129 (0.003%)\n\nOne case in 33,369\n\nNorway\n\nTotal vaccinated with mRNA vaccine = 3.765.354\n\nTotal myocarditis + pericarditis = 274 (0.0073%)\n\nOne case in 13,743\n\n2.4 times more cases in Norway", "link": "https://www.youtube.com/watch?v=YdVymGK3OzM", "date_published": "2021-12-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "First Omicron science", "description": "Viral replication is reduced in the lung tissue, but increased in the bronchi. This could indicate increased transmissibility but reduced pathogenicity.\n\nLink for free download of John's two text books, http://159.69.48.3/\n\nCampbell's Pathophysiology Notes, Amazon orders for the UK, https://www.amazon.co.uk/dp/B012HWC8SU/ref=cm_sw_em_r_mt_dp_AYC5Q7G3H2B3T4BCHQY0\nCampbell's Physiology Notes \nhttps://www.amazon.co.uk/dp/0955379725/ref=cm_sw_em_r_mt_dp_K0MXMAP26Y77TY4J90FB\n\nFirst video on my series on the respiratory system, https://www.youtube.com/watch?v=TB2lA9sFCD0\n\nHKUMed finds Omicron SARS-CoV-2\ncan infect faster and better than Delta \nin human bronchus\n\nhttps://researchnews.cc/news/10606/HKUMed-finds-Omicron-SARS-CoV-2-can-infect-faster-and-better-than-Delta-in-human-bronchus#.Yb8Nai-l2QV\n\nFirst information on how Omicron SARS-CoV-2 infect human respiratory tract. \n\nOmicron infects and multiplies 70 times faster than the Delta in human bronchus, \n\nwhich may explain why Omicron may transmit faster\n\nOmicron infection in the lung is significantly lower than the original SARS-CoV-2, \n\nwhich may be an indicator of lower disease severity. \n\nThis research is currently under peer review for publication. \n\nPioneered the use of ex vivo cultures of the respiratory tract,\n\nfor investigating many emerging virus infections since 2007\n\nLung tissue removed for treatment of the lung\n\nDr Chan and his team successfully isolated the Omicron SARS-CoV-2,\n\nand used this experimental to compare infection with the original and Delta variants\n\n24 hours after infection\n\nOmicron variant replicated around 70 times higher than the Delta variant and the original SARS-CoV-2 virus. \n\nIn contrast, the Omicron variant replicated less efficiently (more than 10 times lower) in the human lung tissue than the original SARS-CoV-2 virus, \n\nwhich may suggest lower severity of disease.\n \nDr Chan\n\nIt is important to note that the severity of disease in humans is not determined only by virus replication but also by the host immune response to the infection,\n\nwhich may lead to dysregulation of the innate immune system, i.e. “cytokine storm”\n\nIt is also noted that, by infecting many more people, \n\na very infectious virus may cause more severe disease and death even though the virus itself may be less pathogenic. \n\nTherefore, taken together with our recent studies showing that the Omicron variant can partially escape immunity from vaccines and past infection, \n\nthe overall threat from Omicron variant is likely to be very significant.\n\nKoch's postulates \nThe microorganism must be found in abundance in all organisms suffering from the disease but should not be found in healthy organisms.\n\nThe microorganism must be isolated from a diseased organism and grown in pure culture.\n\nThe cultured microorganism should cause disease when introduced into a healthy organism.\n\nThe microorganism must be reisolated from the inoculated, diseased experimental host and identified as being identical to the original specific causative agent.", "link": "https://www.youtube.com/watch?v=84XMFVcLScw", "date_published": "2021-12-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Omicron hits Europe", "description": "Thanks to Rebecca at DW News. Omicron cases will rise in Europe over the next few weeks. This will mean tens of millions of people will have the infection all at the same time. However, South Africa has had this variant for a month, and hospital admissions remain low.", "link": "https://www.youtube.com/watch?v=xyzN3V1BpbE", "date_published": "2021-12-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Time to prepare for omicron exposure", "description": "Thanks to Eddie and DW news. Omicron is coming so we need to get our immune system into the best possible condition.", "link": "https://www.youtube.com/watch?v=4BbJWx_t7AA", "date_published": "2021-12-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]