[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Jonathan McReynolds and Mali Music: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nMitra I. Arthur | December 20, 2021\nAn unapologetic expression of faith and gratefulness is paired with festive lighting, poinsettias and ornaments in this holiday Tiny Desk (home) concert from Jonathan McReynolds and Mali Music.\n\nBoth musicians are prominent in the latest generation of contemporary gospel and inspirational artists, incorporating secular sounds and outreach as an entry point into the \"good news\" of gospel music. They each follow in the footsteps of Kirk Franklin (and of Edwin and Walter Hawkins before him). Individually, McReynolds and Mali Music's output showcases a marriage of motivating messages and faith, with music that younger audiences are more attuned to. The duo came together last year to release \"Movin' On,\" which yielded \"good news\" of its own in the form of a Grammy award, followed by a nomination this year for their EP Jonny x Mali: Live in LA. Given how effortlessly they trade-off during this Tiny Desk performance, I can see a Christmas album in their future.\n\nA captivating rendition of \"Christmas Time is Here\" starts off their performance as their perfectly paired voices float over an understated accompaniment, which includes McReynolds on guitar. From there, the pair treat us to a medley of Christmas carols more rooted in faith, with McReynolds singing triumphantly, \"In HIM there is no failure!\" during \"O Come, All Ye Faithful\" and Mali Music delivering a stirring and meditative rendition of \"Silent Night.\" Following the medley, McReynolds and Mali Music treat us to \"Movin' On.\" After another year of still contending with the uncertainty of a global pandemic, the lyrics provide a reminder that \"...my rearview can't compare to what God will do with my life.\"\n\nSET LIST\n\"Christmas Time Is Here\"\n\"O Come, All Ye Faithful\"\n\"Silent Night\"\n\"Mary, Did You Know?\"\n\"Joy to the World\"\n\"Movin' On\"\n\"Go Tell It on the Mountain\"\n\nMUSICIANS\nJonathan McReynolds: vocals\nMali Music: vocals\nMegan Parker: vocals\nIzacc Dorn: vocals\nThaddeus Johnson: bass\nRogest \"Roscoe\" Carstarphen: keys\nJermaine Poindexter: drums\n\nCREDITS\nVideo: Lee Cherry\nAudio: Kenny Moran\nCoordinator: DeeDee Deshcanel\nProduction Assistant: Jordyn Nguyen\nDirector of Photography: Charlie Wupperman\nCamera Operator/Gaffer: Oliver Lukacs\n1st AC: Sven Feightner\nProduction Designer: Jevon Dismuke\nAssistant Engineer: Terrence Chism\nAudio Manager, Mobile Sessions: Christine Hufenbecher\nCCO: Eliseo Juarez Jr.\nProduction Manager: Marty Taylor\n\nTINY DESK TEAM\nProducer: Bobby Carter\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Kara Frame, Joshua Bryant, Sofie Hernandez-Simeonidis\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #jonathanmcreynolds #malimusic", "link": "https://www.youtube.com/watch?v=8ta8ftzNvek", "date_published": "2021-12-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]