[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "14 Best Xbox Console Exclusives To Play Right Now", "description": "Xbox Series X|S and Xbox One have had some solid console exclusives, and both indie developers and Microsoft's first-party studios are hard at work on more.\nDescription: \nXbox has had some excellent console exclusives over the past few years, a number that's likely going to grow during the Xbox Series X|S's lifecycle given Microsoft's string of studio acquisitions. But that's the future--we don't know for sure what will and what won't be dope. All we can do is look at what's currently out, and decide which games are our favorites.\n\n00:18 - Microsoft Flight Simulator\n00:55 - Sea of Thieves\n01:44 - Halo: The Master Chief Collection\n02:15 - Forza Horizon 4\n02:37 - Gears 5\n03:19 - Myst\n03:52 - State of Decay \n04:22 - Rare Replay\n04:57 - Adios\n05:35 - The Big Con\n06:15 - Grounded\n06:43 - Ooblets\n07:20 - Sunset Overdrive\n07:53 - The Vale: Shadow of the Crown", "link": "https://www.youtube.com/watch?v=VpTuihFUdaM", "date_published": "2021-11-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Nintendo’s Most Disliked Video Ever... Fans Are Still Mad | GameSpot News", "description": "In this episode of GameSpot News, we talk about Nintendo's Switch Online Expansion Pack trailer becoming it's most disliked video ever, leaked details about 2022's Call of Duty, the reason Roblox suffered a long outage, and why Fortnite may not see an official release in China.\n\nIn this video, DeVante talks about the trailer for the Nintendo Switch Online Expansion Pack becoming the company's most disliked video ever on YouTube. The trailer has over 120,000 dislikes at the time of writing and a mere 17,000 likes, with a total count of 1.15 million views.\n\nDeVante also talks about new leaked details about 2022's Call of Duty game. The game could have a morality system like Red Dead Redemption 2, and the campaign will apparently feature a new level of gore for the series. As reported previously, 2022's game is rumored to be a sequel to 2019's Modern Warfare from Infinity Ward, focusing on Colombian drug cartels.\n\nLater in the video, Roblox Corp. CEO David Baszucki explains the game's weekend long outage. And China will reportedly not be getting an official release of Fortnite following two years of testing.\n\nFor more information on all of our topics, please visit gamespot.com\n\nTimestamps:\nIntro - 00:00\nNintendo - 00:13\nCall of Duty - 01:24\nRoblox - 02:46\nFortnite - 03:48\nOutro - 04:34", "link": "https://www.youtube.com/watch?v=mkdBPKfeSS4", "date_published": "2021-11-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "26 MORE Things You STILL Didn't Know In Zelda Breath Of The Wild", "description": "Still at it with more things you still probably don't know about Breath of the Wild! This time we dive into how enemies can wield the legendary Master Sword against you, go for a lovely swim in some lava, and how to trigger some mechanics to absolutely collapse the game.\n\nIn the video above, we cover 26 tips and tricks that aren’t quite as well known, ranging from secrets to glitches, some that are pretty simple and others that are fairly complex. Breath of the Wild has been out for four years at this point, and players have found some amazing things, intended or not, that keep the game and its sense of discovery feeling fresh.\n\n0:00 Intro\n0:13 Blizzard Rods Disable Flame Pillars\n0:32 Swim In Lava\n0:58 Secret Way To Ignite Cannons\n1:16 Lizalfos Arms Flipout\n1:27 Moblin's Spaz Attack\n1:36 Vah Ruta's Ceiling Fights Back\n1:52 Enemies With The Master Sword\n2:16 Windlaunch Chuchu Jellies\n2:31 Hijack Bokos Off Their Highhorse\n2:47 Typhlo Ruins Blood Moon\n2:55 These Bokoblins Are Dumb\n3:13 Mount Agaat Platform\n3:24 T-Posing Moblin\n3:43 Map Return\n3:55 Lizalfos Momentum\n4:15 Lockup Backroom History\n4:56 Remote Bomb Pin\n5:18 Crab Island\n5:25 Tanagar Canyon Is Shield Surf Friendly\n5:45 Divine Beast Subdesign\n5:56 Disable Pebblits\n6:11 Horse Protection During Ganon Battle\n6:40 Block Shock Attacks\n6:48 Fireblights Sword Is Hot\n7:02 Dodge Waterblight 4 Times\n7:14 Walk On Waterblight's Spear\n\n#BOTW", "link": "https://www.youtube.com/watch?v=HkR-mYvHf3g", "date_published": "2021-10-31 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]