[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "16 Best Zelda Breath Of The Wild Glitches Of 2021", "description": "Zelda BOTW has had another amazing year of discoveries. Max takes Zelda fans through some of the best glitches of 2021, including one that gives you 80,000+ arrows and others that provide a new way to fly, the ability to lift heavy objects, and even a first-person mode!\n\nThe Legend of Zelda: Breath of the Wild 2 is said to release in 2022. But while we wait, Max--aka RinHara5aki--is still going strong with the original Breath of the Wild, covering both Things You STILL Didn't Know In Zelda Breath Of The Wild and amazing exploits and glitches found by the community. In this video, we’re covering the most impactful finds of 2021.\n\nIn January, players continued to build on the Memory Storage glitch, finding a way to allow players to have 80,000 arrows. They also discovered Yiga Blademasters could be made to pull the Master Sword out of its pedestal. In March, players sorted out how to play the game from a first-person perspective and how to lift extremely heavy objects. \n\nJune was a huge month, with discoveries ranging from finally getting to an impossible-to-reach chest, to placing bombs inside objects and finding better ways to duplicate objects using Octoballoons. In September, players had figured out new ways to speedrun the game by moving through the world without using stamina. By the end of the year, glitch hunters had even sorted out how to get rid of the Sheikah Slate entirely, proving Link’s mind powers are enough to use rune abilities.\n\nIf you love the The Legend of Zelda: Breath of the Wild sandbox like we do, head on over to YouTube.com/GameSpot to discover hundreds of tips, tricks, glitches, and exploits, including 33 Amazing Ways To Fly In Zelda: Breath of the Wild. Happy Holidays!\n\n0:00 Intro\n0:23 Inventory Corruption\n1:03 Yiga Sword Steal\n1:30 Super Hold Smuggle\n1:59 Golden Gauntlets\n2:21 Unarmed Link\n2:48 Bomb Hold Displacement\n3:11 The Final Treasure Chest\n3:38 Octo Balloon Duplication\n4:00 Active Arrow Smuggling\n4:22 Master Sword Steal\n4:50 Jelly Bouncing\n5:18 BLSS\n5:48 Material Smuggling\n6:09 New FPS Glitch\n6:40 Monkey Arms\n7:00 Slate-less Link\n7:19 Outro", "link": "https://www.youtube.com/watch?v=dZDneCgJCrU", "date_published": "2021-12-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Best 2021 Live Service Games", "description": "Here are GameSpot's best live-service games of 2021.\n\nWe live in an age where some games just keep on going, with post-launch roadmaps advertising months or years of future content. Hate 'em or love 'em, live-service games are here to stay (that's kind of their whole shtick). In 2021, five live-service games stood out above the rest, implementing substantial improvements to their existing formula or finding new ways to tell ever-expanding stories. Here are GameSpot's best live-service games of 2021.\n\n00:31 - Apex Legends\n01:55 - Destiny 2\n03:13 - Final Fantasy XIV Online\n04:16 - Fortnite\n05:55 - Sea of Thieves", "link": "https://www.youtube.com/watch?v=hfWXkVtDGd8", "date_published": "2021-12-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Breaks Down Different Types Of Shotguns - Loadout Extended Chat", "description": "Gaming shotguns come in many shapes and sizes, from the archetypal Remington 870 seen in the likes of Resident Evil and Battlefield 2042, to the sci-fi styled SPAS-12 that inspired Aliens’ iconic Pulse Rifle. Whether they’re packing double barrels or drum magazines, shotguns have made quite the impact on our pop culture. But how close are the shotguns found in our games to the real-world weapons they represent?\n\nIn this episode of Loadout, Dave Jewitt visits the Royal Armouries to talk to Keeper of Firearms & Artillery Jonathan Ferguson about the breadth and variety of shotguns, from the classic double-barrelled flintlocks through to the ridiculous revolving Striker shotgun.\n\nYou can check out more episodes of Loadout right here. - https://www.youtube.com/watch?v=yzSrmGkpWKk&list=PLpg6WLs8kxGMzIemU1gyyLmg5VlKI2UvC\n\nYou can check out our Firearms Expert Reacts series here. - https://www.youtube.com/watch?v=5FVzcoRjoN4&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/", "link": "https://www.youtube.com/watch?v=HoxBjvoraDI", "date_published": "2021-12-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]