[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCoOjH8D2XAgjzQlneM2W0EQ", "title": "Why the Prison Industrial Complex is so Profitable", "description": "📹 Get unlimited stock video, photos, music, & more at http://storyblocks.com/jaketran \n\n😈 Watch exclusive 40+ minute documentaries that are too controversial to ever be released to the public: https://jake.yt/join\nUpdated refund policy: Email us within your first month of joining and we'll refund you for your first month. There is no refund if you cancel at a later time.\n\n🎥 Business is complicated. Subscribe to curiosity: http://bit.ly/jt-sub\n🎙️ Subscribe to the 2nd channel, Intellectual Dropouts: https://jake.yt/id\n✉ Be the first to watch new videos with email notifications: http://bit.ly/jt-inbox\n📸 Follow me on IG for a chance to win $1,000: @jaketran // http://bit.ly/jt-ig\nPlease watch out for fake accounts. I will never message you asking for money or to invest. As of right now, it's spelled exactly like this: @jaketran\n👨👦👦 Join the Tran Mafia Family here: https://bit.ly/patreon-jt\n💬 Join the community Discord: http://discord.gg/BmK8EnQ\n\nSupport this channel monetarily:\n💻 𝗟𝗮𝗽𝘁𝗼𝗽 𝗟𝗶𝗳𝗲𝘀𝘁𝘆𝗹𝗲 𝗔𝗰𝗮𝗱𝗲𝗺𝘆: Learn exactly how I landed my $40/hr work from home job ($83k/yr) at 19 years old: https://jake.yt/LLAd\n🖥️ Website platform I use: https://jake.yt/kd\n📈 Get up to $250 in free Bitcoin at http://blockfi.com/jake \n💽 Editing software I've used for 7+ years: https://jake.yt/ccd\n📒 Online bookkeeping software I use: https://jake.yt/benchd \n📜 The exact resume I used to get my $40/hr remote web dev job + a lot of bonuses: https://jake.yt/DRBd\n🎥 My video gear, setup, tech, books: https://jake.yt/stored\n\n✉️ Email me: jake@jaketran.io\n\nSubscribe to the backup channel on LBRY, use reward code \"jake-cast\" for free coin: https://bit.ly/LBRY-jt\n\n📰 Sources & visuals: https://bit.ly/2Ot4QZT\n\n-----------------------\nAround the world, there are over 10,000,000 people held in prison. With the leader in the Prison Industrial Complex being none other than the United States. Yes, the land of the free, home of the brave has not only the highest number of prisoners, but also the most prisoners per capita. \n\nBut what’s the point of having all these people held in captivity that you have to feed, manage, and somewhat provide for? Simple - almost all the parties involved make money.\n\nThis is the prison industrial complex.\n\nIf you want to be a prison entrepreneur, the business model of private prisons is very simple. Private companies pitched to the government that if you contract the work to us, we can build the prisons you need faster, make them safer, at a lower cost. So today, the job of the prison entrepreneur is to secure government contracts to build and run prisons.\n\nSo if you want to make more money, all you have to do is either increase the price of each prisoner per day, lower your operating costs or increase the number of customers in your facilities. \n\nLet’s say you’re running a company that needs simple manual labor. On one hand, you could hire a normal free citizen but then you have to pay them market wages, maybe offer benefits, 401k’s, deal with labor unions and it’s just a pain. Enter - prison labor! They’re domestic, you pay them pennies on the dollar, and they can’t complain! \n\nAnd this is what happens when all these different parties come together: Police, prosecutors, public prisons, private prisons, government contractors, companies that hire prison labor.\nBut to be fair, some prisons are a lot better than others in how much they cost and how they treat their customers.\n-----------------------\n\nNo Spirit - Reliving https://chll.to/d61278d4 \n\nAll materials in these videos are used for educational purposes and fall within the guidelines of fair use. No copyright infringement intended. If you are or represent the copyright owner of materials used in this video and have a problem with the use of said material, please send me an email, jake@jaketran.io, and we can sort it out.\n\nCopyright © 2021 Transcend Visuals, LLC. All rights reserved.\n\nDISCLAIMER:\n\nThis video does not provide investment or economic advice and is not professional advice (legal, accounting, tax).  The owner of this content is not an investment advisor.  Discussion of any securities, trading, or markets is incidental and solely for entertainment purposes.  Nothing herein shall constitute a recommendation, investment advice, or an opinion on suitability.  The information in this video is provided as of the date of its initial release.  The owner of this video expressly disclaims all representations or warranties of accuracy.  The owner of this video claims all intellectual property rights, including copyrights, of and related to, this video.\n\nAFFILIATE DISCLOSURE: Some of the links in this video's description are affiliate links, meaning, at no additional cost to you, the owner may earn a commission if you click through, make a purchase, and/or opt-in.", "link": "https://www.youtube.com/watch?v=2R880exfYCU", "date_published": "2021-04-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]