[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Tiny Desk Meets SXSW: DUCKWRTH", "description": "Every year, NPR Music participates in the SXSW music festival, whether it's curating a stage or simply attending hundreds of shows at the annual event in Austin, Texas. Last year, the festival was canceled due to the pandemic, but it returned this March as an online festival. We programmed a 'stage' of Tiny Desk (home) concerts and presented them on the final day of the festival. Now, we present to you Tiny Desk Meets SXSW: four videos filmed in various locations, all of them full of surprises.\n\nBobby Carter | April 7, 2021\nDUCKWRTH decided to do something special for Tiny Desk Meets SXSW: brand new music. \"Welcome to my Tiny Desk,\" he says. \"We are gonna play some new songs for y'all if that's OK. Y'all ain't got no choice!\"\n\nThe dynamic R&B singer proceeded to debut two exclusives: a slow jam titled \"make u go,\" which he dedicates to the \"lovers and freaks,\" and the upbeat \"Birthday Suit,\" which KCRW astutely compared to Estelle's \"American Boy.\"\n\nThe new material wasn't the only thing that made this Tiny Desk such a treat. For this funky and flamboyant performance, DUCKWRTH dressed his backing band entirely in white and switched up the lighting for each song so that the hue matched the mood he was laying down.\n\nDUCKWRTH has long been a creative soul. He spoke with NPR in 2019 about growing up in a Pentecostal household in South Central Los Angeles, and how those two worlds helped shape his journeys between R&B and West Coast G-funk.\n\nSET LIST\n\"Kiss U Right Now\"\n\"make u go\"\n\"Birthday Suit\"\n\"Super Good\"\n\nMUSICIANS\nDUCKWRTH: vocals\nJustin \"Jhawk\" Hawkins: guitar\nDarryl Staves Jr.: drums\nSolomon \"Solo\" Smith: bass\nDevin Smith: keys\nAmber Olivia Kiner: vocals\nOlivia Walker: vocals\n\nCREDITS\nVideo: BT Studios, Jonathan Salmon, Lopes\nAudio: Lucas Palmieri\nMixed by: Josh Rogosin\nCreative Director - Abdi Ibrahim\nDirector of Photography - Adam Linssen\nSpecial Thanks: Beehive Studios\n\nTINY DESK TEAM\nProducer: Bobby Carter\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Bob Boilen, Kara Frame\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #DUCKWRTH", "link": "https://www.youtube.com/watch?v=0-PlG-SU8sc", "date_published": "2021-04-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Tiny Desk Meets SXSW: Yasser Tejeda & Palotré", "description": "Every year, NPR Music participates in the SXSW music festival, whether it's curating a stage or simply attending hundreds of shows at the annual event in Austin, Texas. Last year, the festival was canceled due to the pandemic, but it returned this March as an online festival. We programmed a 'stage' of Tiny Desk (home) concerts and presented them on the final day of the festival. Now, we present to you Tiny Desk Meets SXSW: four videos filmed in various locations, all of them full of surprises.\n\nFelix Contreras | April 6, 2021\nIf only I could have experienced Yasser Tejeda and Palotré at one of the bars along Austin's Sixth Street. Tejeda, a New York-based guitarist from the Dominican Republic, started his musical career on the Dominican cuatro (a folkloric guitar-like instrument) and has incorporated guitar stylings that have made him a \"go-to guy\" for Dominican artists looking for passionate elegance in their sound.\n\nYasser Tejeda and his band Palotré begin their set behind a home desk with \"Amor Arrayano,\" weaving a vaguely Caribbean feel with a killer R&B hook. After a brief introduction of his bandmates Tejeda launches into \"La Culebra,\" the track that caught my attention from their album Kijombo. Palotré is a powerful groove machine behind Tejeda's virtuosic guitar playing and his playful dance moves.\n\nTejeda has stated one of the goals of this project is to explore the crossroads between Afro-Dominican musical traditions with anything else that pops onto their radar. Their final song here,\"Nuestras Raices,\" has become one of my favorites because I hear the essence of Africa mixed with jazz and maybe a hint of heavy metal, as Tejeda steps on his distortion pedal to kick the band into overdrive with guest tenor saxophonist Mario Castro in tow.\nI won't spoil the surprise, but be sure to stay until the end.\n\nSET LIST\n\"Amor Arrayano\"\n\"La Culebra\"\n\"Nuestras Raíces\"\n\nMUSICIANS\nYasser Tejeda: guitar, vocals\nJonathan \"Jblak\" Troncoso: percussion, vocals\nVictor Otoniel Vargas: drums, vocals\nKyle Miles: bass\nMario Castro: tenor sax\n\nCREDITS\nVideo: Andreas Hofweber\nAudio: Quinn McCarthy\nStylist and Set Designer: Jill Peacock\n\nTINY DESK TEAM\nProducer: Felix Contreras\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Bob Boilen, Kara Frame\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #yassertejeda", "link": "https://www.youtube.com/watch?v=C9fMzxICTjU", "date_published": "2021-04-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]