[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Laurie Anderson: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nBob Boilen | May 20, 2021\nLaurie Anderson is a revolutionary artist who has mixed storytelling, music and technology for the past four decades plus. This Tiny Desk (home) concert celebrates the truly breathtaking breakthrough album she put out in 1982, Big Science. On that record, she used a few different voice processors; one of them was a Vocoder. By singing into a microphone attached to a keyboard, you can hear how it effectively adds harmony to her voice on \"Let x=x.\" Laurie Anderson also used that effect, creating what I think of as 'the voice of authority' in her storytelling, on \"O Superman,\" a song unlike anything music I'd heard when it came out in 1981. She made use of a vocal loop, something ever-present these days in sampling, but here she uses an Eventide Harmonizer, looping the single syllable \"ha\" as the rhythm of the song. It's a song about dealing with the technological revolution, about compassion; if it's your first time hearing it, take it in and see what strikes you.\n\nHere, Roma Baran, who played on and produced Big Science with Laurie Anderson in 1982, performs on synthesizer. We also hear some brilliant cello and improv from Rubin Kodheli.\n\nOn a personal note, I was a lover of Laurie's music back in those days; they were also the days I played synthesizer in my band Tiny Desk Unit. We opened for Laurie Anderson in 1981, and Laurie joined us onstage for a song. I bring this up because the Tiny Desk name (created by our guitarist Michael Barron) was familiar to Laurie long before this NPR series existed. At the end of her home concert, Laurie, I assume, mistakingly, thanks Tiny Desk Unit for having her. It made me smile and sparked so many memories. Thank you, Laurie.\n\nSET LIST\n\"Let x=x\"\n\"Violin Cello Improv\"\n\"O Superman\"\n\nMUSICIANS\nLaurie Anderson: vocals, electronics, violin\nRoma Baran: synthesizer\nRubin Kodheli: cello\n\nCREDITS\nVideo: Jason Stern\nAudio: Jason Stern, Roma Baran\nProduction: Jim Cass\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Kara Frame, Gabrielle Pierre\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #laurieanderson", "link": "https://www.youtube.com/watch?v=ABjmQCxA7UU", "date_published": "2021-05-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Kathleen Edwards: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nBob Boilen | May 19, 2021\nFrom a house in East Nashville, Kathleen Edwards sings about how thankful she is for those early aughts when she was praised with awards, television appearances, touring to packed venues — even if the tour bus with the bed in back was \"total crap.\" As she continues to sing \"Glenfern,\" the opening track to her first album in eight years as well as this Tiny Desk (home) concert, she remembers her former husband and collaborator.\n\nBut, as thankful as she is for those years, they overwhelmed her, and she quit. Struggling with depression, Kathleen Edwards opened a coffee shop called Quitters Coffee and lived a very different life.\n\nA handful of years later, in 2017, she was invited to Nashville by Maren Morris to write some songs. That Nashville visit sparked a new beginning and eventually the 2020 album Total Freedom, which birthed the four songs you hear in this Tiny Desk concert.\n\nShe's flanked by her carefully masked musical mates: guitarist Todd Lombardo, who also plays on Kathleen's latest album, and Justin Schipper on dobro. Kathleen Edwards seems happy playing these new songs. They can be songs of sadness, sometimes filled with seething, such as \"Ashes to Ashes,\" but she's also grateful for her everlasting love for a four-legged creature and the little catalpa tree where it's buried. She's found strength after those nonstop years — a lesson for us all, perhaps about life and time and its gift.\n\nSET LIST\n\"Glenfern\"\n\"Ashes to Ashes\"\n\"Who Rescued Who\"\n\"Hard On Everyone\"\n\nMUSICIANS\nKathleen Edwards: vocals, guitar\nTodd Lombardo: guitar\nJustin Schipper: dobro\n\nCREDITS\nAudio and Video: Crackerfarm\nEdited: Charles Davis\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Kara Frame, Gabrielle Pierre\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #kathleenedwards", "link": "https://www.youtube.com/watch?v=ecZNktlc-CE", "date_published": "2021-05-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]