[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "FINALLY an affordable LINUX LAPTOP? - Slimbook Essential 14", "description": "today we FINALLY have an affordable Linux laptop to review! This here is the Slimbook Essential, basically the least expensive laptop you can get from this Spanish Linux hardware manufacturer, coming in at 550 euros, 20% Value added tax included. Let's take a look at what you get at that price point!\n\nBecome a channel member to get access to a weekly patroncast and vote on the next topics I'll cover:\nhttps://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nSupport the channel on Patreon: \nhttps://www.patreon.com/thelinuxexperiment\n\nFollow me on Twitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\nFollow me on ODYSEE: https://odysee.com/@TheLinuxExperiment:e\nOr join ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\nThe Linux Experiment merch: get your goodies there! https://teespring.com/en-GB/stores/the-linux-experiment\n\n## The hardware\n\nIt's an ultrabook, that comes in a 14 inch and 15.6 inch variant. What I have here is the 14 inch model, the 15 inch has a slightly different chassis, keyboard and design, so this review doesn't really apply to the bigger model.\n\nIt uses a 10th gen intel core i3,  and comes with 8Gb of RAM, which is nice, and has a full HD display. The display is matte, and the 1080p resolution is more than enough for that size, although it isn't extremely bright. \n\nThe viewing angles are really good though, and the matte coating acts as a nice anti-glare solution.\nThe colors seem a bit muted to me, not that vivid, but it's far from being bad. it's a sharp, not very reflective and good looking little display.\n\nThe laptop only comes with SSDs, with 256GB as the default, which is already plenty, especially for Linux laptops, where the base OS doesn't use a lot of disk space anyways.\n\nNow in terms of build quality, the laptop chassis is made of aluminium, with a nice dark grey finish. The bottom plate is made out of black plastic, as are the bezels and the hinge assembly.\n\nSpeaking of the hinge, it can open up to 180°  which is probably useless, but hey, it makes for some nice shots. That hinge is pretty rigid and doesn't cause any screen wobble when typing.\n\nIt's a well built laptop, without flex, although you'll see some amount of bend on the keyboard assembly, especially in the middle. I wish these chassis would be reinforced down the middle, it would really give them a more solid feel. Still, the laptop itself is hefty, at 1.34 kg, and you feel that it's a sturdy device. In a few weeks of use, it hasn't been scratched, or flexed, or even took a dent, so that's something.\n\nThe branding is a bit big for my tastes though, with a bif slimbook logo underneath the screen, and another big one on the back of the display.\n\nIn terms of I/O, you get a pop-out Ethernet jack, a micro SD card slot, usb 2, the power button, and the audio jack on the left side, and a usb C port, usb 3, hdmi and the barrel charger on the right side. The back is just pure cooling vents.\n\nThe power button placement is a bit annoying, as when you pick up the device from the left side, you're bound to press it.\n\nThe keyboard is... OK. This here is a Spanish layout but you can ask Slimbook for other layouts if you'd prefer. It has a nice Tux key, with another Slimbook logo\n\nKey travel is pretty short here, but the whole board doesn't feel mushy, and there is good amount of bounceback. The sound is a bit too clacky for my tastes, but it won't annoy your neighbors nearly as much as a mechanical keyboard, or even a Mac keyboard. It's also backlit.\n\nThe trackpad is pretty big for a 14 inch laptop, and feels really smooth, although I couldn't confirm if it was glass or not, it felt like it. it's precise, your fingers really don't get stuck or stutter on it, and it's pretty nice to see a good trackpad on a cheaper device like this one.\n\nAs always with most laptops, the webcam... exists. It's basic 720p, pretty grainy.\n\n## Performance\n\nMy review unit ships with an Intel i3 1005G1, which is a dual core, 4 threads CPU. It has a base clock of 1.2Ghz, with turbo boost up to 3.4Ghz, and this nets it a geekbench score of 1229 in single core, and 2574 in multi core. \n\nIt ships with intel UHD graphics, which are enough to drive a 4K display at 60 hertz, and support DX12 and openGL 4.5, although that's not a chip you'll want to use for AAA gaming.\n\nIn real world use, apps open fast, the laptop feels responsive and smooth, and you don't really notice any lack of horsepower. The 8Gb of RAM really help here as well, letting you work with a bunch of tabs open, even in that RAM gobbling monster that is Google Chrome.\n\nThe battery life is average, between 5 and 7 hours depending on what you're asking of your laptop.\n\nThe RAM and the SSD are both user accessible with a few screws removed, so you can upgrade this thing a bit further down the line.", "link": "https://www.youtube.com/watch?v=66RBQXf4FI0", "date_published": "2021-05-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]