[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Migos: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nLaTesha Harris | August 25, 2021\nBy the time Quavo hits the second half of his opening verse on \"Avalanche,\" all three members of Migos are vibrating with energy, falling out of their seats to ride the beat. Juvenile delight fills the air, and it feels like a competition of who can vibe the hardest. Migos performs the remainder of their Tiny Desk (home) concert — \"Straightenin\" and \"Birthday\" — with Offset leaping around the trendy streetwear spot Gallery Dept., Quavo bouncing on armchairs and Takeoff working the shoulder.\n\nTheir performance showcases why we first fell in love with the Atlanta trap trio: charismatic synchronization, playful braggadocio and, of course, their exhilarating resurrection of the triplet flow. In 2013, Migos released the breakout single \"Versace\" before grinding their way up to 2015's Yung Rich Nation. In 2017, Migos firmly pulled everyone and their mama into their orbit; Culture, especially its inescapable lead single, \"Bad and Boujee,\" laid the foundation for contemporary rap's reckoning. Culture II dropped a year later, and the trilogy concluded with Culture III, released this past June. Legendary producer collective 1500 or Nothin' bring the best part of the new album to life in this long-waited Tiny Desk, as Larrance \"Rance\" Dopson, Lamar \"My Guy Mars\" Edwards, Quintin \"Q\" Gulledge and Chris Payton — as well as Migos mainstay DJ Durel — deliver chest-thudding support.\n\n\"You rockin' with the greatest group of all time,\" Quavo announces toward the end of their performance and, as the surreal party plays out, it's tempting to agree. Simply put: They ate and left no crumbs.\n\nSET LIST\n • \"Avalanche\"\n • \"Straightenin\"\n • \"Birthday\"\n\nMUSICIANS\n • Quavo: vocals\n • Takeoff: vocals\n • Offset: vocals\n • Larrance \"Rance\" Dopson: percussion\n • Lamar \"My Guy Mars\" Edwards: keys\n • Dammo \"The Great\" Farmer: bass, key bass\n • Quintin \"Q\" Gulledge: drums\n • Chris Payton : guitar\n • DJ Durel: DJ\n\nCREDITS\n • Video: Michael D. Ratner, Miranda Sherman, Andy Mininger, Jason Bergh, Scott Ratner, Kia Reghabi, Kfir Goldberg, Kenny Simpson, Lars Lindstrom, Sam Law, Ryan Ramsey, Kyle Summers, Taylor Ross, Brian Hall, Tanner Nichols, Tigran Tsolakyan, Eric Gilbert, Andrew Johnson, Alex Goens\n • Audio: Byron McNeish, Irvin Picott\n • Special thanks to OBB Pictures\n\nTINY DESK TEAM\n • Producer: Abby O'Neill\n • Video Producer: Maia Stern\n • Audio Mastering: Josh Rogosin\n • Tiny Production Team: Bob Boilen, Bobby Carter, Andy Huether, Kara Frame, Gabrielle Pierre\n • Executive Producer: Keith Jenkins\n • Senior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #migos", "link": "https://www.youtube.com/watch?v=DIjOxmU6-ew", "date_published": "2021-08-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]