[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "The Secret History of the Credit Card (full documentary) | FRONTLINE", "description": "FRONTLINE and The New York Times examine how the credit card industry became pervasive, lucrative, and politically powerful. (Aired 2004)\n\nThis journalism is made possible by viewers like you. Support your local PBS station here: http://www.pbs.org/donate​.\n\nMillions of American families use their personal, general-purpose credit cards to make ends meet. With no federal laws on the amount of interest or fees that can be charged, credit cards have become the most profitable sector of the American banking industry.”] In “Secret History of the Credit Card,” correspondent Lowell Bergman uncovers the techniques used by the industry to earn record profits and get consumers to take on more debt. Some experts argue the profitability of credit cards began when the banking industry successfully eliminated a critical restriction: the limit on the interest rate a lender can charge a borrower. Deregulation, coupled with a revolution in technology enabled the almost real-time tracking of personal financial information and the emergence of nationwide banking, facilitated the widening availability of credit cards across the economic spectrum. But for some, the cost of credit is often far greater than it appears.\n\nLove FRONTLINE? Find us on the PBS Video App, where there are more than 300 FRONTLINE documentaries available to watch any time: https://to.pbs.org/FLVideoApp​ \n\n#Documentary #CreditCards\n\nSubscribe on YouTube: http://bit.ly/1BycsJW​\nInstagram: https://www.instagram.com/frontlinepbs​\nTwitter: https://twitter.com/frontlinepbs​\nFacebook: https://www.facebook.com/frontline\n\nFunding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Major funding for FRONTLINE is provided by the Ford Foundation. Additional funding is provided by the Abrams Foundation; the John D. and Catherine T. MacArthur Foundation; Park Foundation; and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation, and additional support from Koo and Patricia Yuen.", "link": "https://www.youtube.com/watch?v=2mHsTKvAuZc", "date_published": "2021-12-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]