[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "11 Minutes Of Sifu Combat Gameplay", "description": "Here is 11 minutes of Sifu combat where we force our way into a night club and raise hell, stringing combos to take everyone down, from grunts, to bouncers, and challenging mini bosses, without dying once!\n\n#SIFU", "link": "https://www.youtube.com/watch?v=FJbsS06q8po", "date_published": "2021-12-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Alan Wake 2 Devs Calm Gameplay Fears | GameSpot News", "description": "In today’s GameSpot News, Persia talks about the Alan Wake II devs calming some gameplay fears, Halo Infinite speedrunners are already breaking the game, and more.\n\nRemedy boss Sam Lake confirmed on Twitter that the sequel will still be a third-person game, amid questions about whether the series might make a change akin to Resident Evil 7 and Village and their first-person perspective. Alan Wake II will, however, skew more towards traditional survival-horror, a twist on the original's more psychological horror focus.\n\nLater in the video, Persia talks about Halo content creator Mint Blitz who shows how a new speedrunning trick is done, in which he credits the discovery of the skip to members of the Haloruns speedrunning community. What's notable about the skip is that it doesn't seem all that difficult to accomplish and lets you jump from the Excavation Site to the second to last mission of the campaign. Link to the full video here: https://www.youtube.com/watch?v=mZ8g9XkutRY \n\nLastly, Persia goes over the new games that come to Xbox Game Pass for December. These games include Mortal Kombat 11, The Gunk, Broken Age, and more starting December 16th. Game Pass users will also be able to play DLC and game updates for Ark: Survival Evolved, Minecraft Dungeons, and The Elder Scrolls Online.\n\nFor more information on all of our topics, please visit gamespot.com.\n\nTimestamps:\nIntro - 00:00\nAlan Wake II - 00:07\nHalo Infinite - 01:07\nXbox Game Pass - 02:47\nOutro - 03:37", "link": "https://www.youtube.com/watch?v=-ZbxQukbrlg", "date_published": "2021-12-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Assassin's Creed Valhalla: Dawn of Ragnarök Everything We Know So Far", "description": "Assassin's Creed Valhalla is getting a whole second year of post-launch content, kicking off with the Crossover Stories DLC that see Odyssey's Kassandra and Valhalla's Eivor meet. But the first major expansion for Year 2 is Dawn of Ragnarok, in which Eivor witnesses Havi's adventures during the earliest days of one of the most well-known moments of Norse myth.\n\nDawn of Ragnarok takes place after the events of the Asgard and Jotunheim Sagas, so if you haven't gotten that far in Assassin's Creed Valhalla and don't want to be spoiled, this is your final warning to pause this video and come back later. Don't worry, we'll still be here.\n\nIn the following video, we go over everything that we learned about Dawn of Ragnarok during a preview event.\n\nDawn of Ragnarok is scheduled to release as paid DLC on March 10.", "link": "https://www.youtube.com/watch?v=T1sicCrp1_g", "date_published": "2021-12-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Legends Arceus – December Update Trailer", "description": "Introducing the Diamond and Pearl clans in Pokémon Legends: Arceus – two rivalling groups with conflicting beliefs surrounding a deity known as the almighty Sinnoh! Pokémon Legends: Arceus, launching January 28th on Nintendo Switch.\n\n#PokemonLegendsArceus", "link": "https://www.youtube.com/watch?v=XvXnV2HMQ9s", "date_published": "2021-12-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Sifu Preview - Growing Stronger With Death", "description": "Sifu blends together all the best parts of martial arts, frenetic action, and a challenging set of opponents. In this video, we break down our time spent with Sloclap's press preview build.\n\nThe hands-on preview build we were given only features a small slice of what's to come when the full game releases in February, yet this is still more than enough to showcase the depth and potential brilliance of Sifu's hand-to-hand action. A back alley nightclub provides the setting for this single-level preview, its ambience shifting as you move between neon-lit social areas and dim backstage corridors. \n\nMuch like the martial arts movies that inspired it, Sifu often positions you as a lone fighter facing off against an overwhelming number of foes. This is the case in most games, of course, and at first glance, the setup for Sifu's brawls looks reminiscent of the Batman: Arkham games. The similarities basically end there, though. Sifu's combat is grounded in reality by comparison. You'll barely scrape by in most encounters, even when utilizing the full potential of your fighting skills, awareness of the environment, and ingenuity.\n\nSlocap says there will be story connotations related to your rapid aging and the price of vengeance, but this isn't present in the preview build. Instead, this snapshot of the game offers a brief glimpse of the intriguing elements wrapped around its rousing combat. My anticipation for Sifu was already high just based on its trailers, but after getting a taste I can't wait for more. Sifu releases on February 22, 2022 for PS4, PS5, and PC.", "link": "https://www.youtube.com/watch?v=grRWcVNeg4g", "date_published": "2021-12-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Splinter Cell Remake - Stepping Out of the Shadows | Developer Presentation", "description": "Check out the developer presentation revealing the Splinter Cell Remake! Splinter Cell is a long beloved fan favorite among gaming fans and now a remake is on the way. This presentation is a walkthrough by the devs and starts to go through how they are approaching the game.\n\n#SplinterCell", "link": "https://www.youtube.com/watch?v=I92Mz3xYw18", "date_published": "2021-12-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Why The New War is the Perfect Time to Get Into Warframe", "description": "(Presented by Warframe) Whether you’re a veteran Tenno or first time player, The New War is the perfect time to get into Warframe! Play now for free: https://t.warframe.com/c/3nu5ms \n\nWarframe is an expansive free-to-play game that has been constantly updated since its launch back in 2013. The New War is the culmination of years of epic storytelling and innovative gameplay evolutions, and delivers the most ambitious, important cinematic update in Warframe history. Now is the time to jump in and start your Tenno journey.", "link": "https://www.youtube.com/watch?v=FiPRQ7h7FQU", "date_published": "2021-12-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "NFTs In Gaming... Are We Doomed?", "description": "In this video, DeVante breaks down NFTs and what they could mean for the gaming industry going forward following the release of Ubisoft Quartz. \n\nOn December 7th, 2021, Ubisoft announced its first project in the NFT space titled Ubisoft Quartz. And while this isn’t the first time NFTs and games have crossed paths, it is the first time a AAA studio has entered the fray--and it most likely won't be the last.\n\nIn this video, DeVante gives a brief explanation about what NFTs are, where they’ve shown up in gaming and what it could mean for gaming once more publishers follow Ubisoft’s lead.", "link": "https://www.youtube.com/watch?v=TJ77Nvvth_w", "date_published": "2021-12-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "You Can Now Officially Customize Your PS5 | GameSpot News", "description": "Official PlayStation 5 console covers have been announced, Halo Infinite is getting some new playlists, and more.\n\nSony has officially announced a new series of PS5 console covers priced at $55, which will come in Nova Pink, Starlight Blue, and Galactic Purple color schemes. In addition to that, new color variants of the DualSense controller are also on the way, joining the previously released Midnight Black and Cosmic Red versions and including the same new colors as the PS5 covers. You can pre-order today on the Sony website for the January 2022 release.\n\nLater in the video, Persia also talks about the addition of Slayer, free-for-all, Fiesta Slayer, and Tactical Slayer playlists coming to Halo Infinite on December 14th. 343 Industries adjusted its update plans in response to players' feedback.\n\nLastly, Power On, a new documentary series detailing the storied history of the Xbox, is now out on YouTube to stream for free. Of particular interest is the appearance of Don Mattrick, the infamous leader of Xbox during the launch of the Xbox One, in the final episode. The series also dives into the many highs of the brand, from the incredible launch of the Xbox 360 and its years of dominance over Sony's PlayStation 3.\n\nFor more information on all of our topics, please visit gamespot.com.\n\nTimestamps:\nIntro - 00:00\nPS5 - 00:06\nHalo Infinite - 01:41\nXbox Documentary - 02:55\nOutro - 04:24", "link": "https://www.youtube.com/watch?v=bbjPz99Vgas", "date_published": "2021-12-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]