[{"source": "https://www.theguardian.com/rss", "title": "‘We’re so grateful for people’s kindness’: one day in the life of a food bank manager", "description": "<p>Worsening circumstances for those already in poverty and the effects of the pandemic have seen the need for food banks explode. Here, we speak to a food bank manager to see the crisis through their eyes</p><p>Sam Hanson has been managing Portsmouth Food bank for two-and-a-half years. The food bank, which runs in <a href=\"https://www.trusselltrust.org/get-help/find-a-foodbank/portsmouth/\" rel=\"nofollow\">three sites</a> across the city, is part of the Trussell Trust’s network of more than 1,300 food bank centres across the UK.</p><p><strong>How many volunteers do you have?<br /></strong>We have around 30 in total, which works out at approximately 10 a session – they generally do different days. We have volunteers who help support people using the food bank, volunteers in our warehouse who help to sort the food, and people who collect food for us from schools and supermarkets.</p> <a href=\"https://www.theguardian.com/the-last-10-years-of-food-banks/2021/dec/14/were-so-grateful-for-peoples-kindness-one-day-in-the-life-of-a-food-bank-manager\">Continue reading...</a>", "link": "https://www.theguardian.com/the-last-10-years-of-food-banks/2021/dec/14/were-so-grateful-for-peoples-kindness-one-day-in-the-life-of-a-food-bank-manager", "date_published": "2021-12-14 16:05:02+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Cuts, covid and community in Blackpool: 'There's no such thing as a hopeless case' – video", "description": "<p>Mark and Abbie Butcher run <a href=\"https://www.paypal.com/paypalme/amazinggraze\">Amazing Graze</a>, a pizzeria that hands out free food and advice to people in Blackpool who need it. The town, one of the poorest in the UK, with jobs seasonal and dependent largely on tourist income, has been left reeling from the pandemic, and the restaurant is struggling to cope with heightened demand. As the government pursues its&nbsp; 'levelling up' policy, Mark and Abbie question what the slogan actually means as they deal with the effects of the £20 cut in universal credit on some of Blackpool's most vulnerable people, and prepare for the challenging winter ahead</p> <a href=\"https://www.theguardian.com/uk-news/video/2021/dec/14/what-difference-will-levelling-up-make-the-blackpool-couple-fighting-a-winter-crisis-video\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/video/2021/dec/14/what-difference-will-levelling-up-make-the-blackpool-couple-fighting-a-winter-crisis-video", "date_published": "2021-12-14 12:50:54+00:00", "persistent": false, "user": null, "language": "en-UK"}]