[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCsXVk37bltHxD1rDPwtNM8Q", "title": "Why We Should NOT Look For Aliens - The Dark Forest", "description": "Getting something from the kurzgesagt shop is the best way to support us and to keep our videos free for everyone. Thank You!\n►► https://kgs.link/shop-156 (Worldwide Shipping Available)\n\nSources & further reading:\nhttps://sites.google.com/view/sources-darkforest/\n\nThe Universe is incredibly big and seems full of potential for life, with billions of habitable planets. If an advanced civilization had the technology to travel between the stars, at just 0.1% of the speed of light, It could colonize our galaxy in roughly 100 million years. Which is not that long given the billions of years the milky way has existed – so in principle any spacefaring civilization should be able to spread rapidly over huge sectors of the galaxy. And yet we see nothing, hear nothing, the universe seems empty. Devoid of others. This is the Fermi Paradox, which we have discussed in more detail in other videos.\n\nConfronted with the seemingly empty universe, humanity faces a dilemma. We desperately want to know if we are alone in the Milky Way. We want to call out and reveal ourselves to anyone watching but that could be the last thing we ever do. Because maybe the universe is not empty. Maybe it’s full of civilizations but they are hiding from each other. Maybe the civilizations that attracted attention in the past were wiped away by invisible arrows. This is the Dark Forest solution to the Fermi paradox.\n\nOUR CHANNELS\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nGerman Channel: https://kgs.link/youtubeDE \nSpanish Channel: https://kgs.link/youtubeES \n\n\nHOW CAN YOU SUPPORT US?\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nThis is how we make our living and it would be a pleasure if you support us!\n\nGet Merch designed with ❤ https://kgs.link/shop-156  \nJoin the Patreon Bird Army 🐧  https://kgs.link/patreon  \n\n\nDISCUSSIONS & SOCIAL MEDIA\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nReddit:            https://kgs.link/reddit\nInstagram:     https://kgs.link/instagram\nTwitter:           https://kgs.link/twitter\nFacebook:      https://kgs.link/facebook\nDiscord:          https://kgs.link/discord\nNewsletter:    https://kgs.link/newsletter\n\n\nOUR VOICE\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nThe Kurzgesagt voice is from \nSteve Taylor:  https://kgs.link/youtube-voice\n\n\nOUR MUSIC ♬♪\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\n700+ minutes of Kurzgesagt Soundtracks by Epic Mountain:\n\nSpotify:            https://kgs.link/music-spotify\nSoundcloud:   https://kgs.link/music-soundcloud\nBandcamp:     https://kgs.link/music-bandcamp\nYoutube:          https://kgs.link/music-youtube\nFacebook:       https://kgs.link/music-facebook\n\nThe Soundtrack of this video:\nSoundcloud: https://bit.ly/3pQJ4Oo\nBandcamp: https://bit.ly/3m0fDsc\n\nIf you want to help us caption this video, please send subtitles to subtitle@kurzgesagt.org\nYou can find info on what subtitle files work on YouTube here:\nhttps://support.google.com/youtube/answer/2734698?hl=en-GB&ref_topic=7296214\nThank you!\n\n🐦🐧🐤 PATREON BIRD ARMY 🐤🐧🐦\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nMany Thanks to our wonderful Patreons (from http://kgs.link/patreon) who support us every month and made this video possible:\nIbrahim Khan, gibraltar, Farago Adam, Rico Meinl, Krego Kim, dove, Quentin Le Guennec, CompileNix, Kitty Kuran, Harry Smith, Marc, Nick Vest, Adrian Plummer, Daniel P, William Refsland, Ugur Doga Sezgin, Alexander Dinkelacker, Tk Price, Digital Curio, Splintercat, Mario Müller, Stanley Thompson-Thorn, Nicholas Thaera, Dan Pritts, Josh Lewis!, OffBeatBunny, Christopher Yanac, Leo Espinoza, Amocin, Emily, John Vo, N. A., Pascal Rappolt, Logan Baker, Naiche, Josh, Frederik Ebert, steve young, Ganael D, Kai, Thomas Torrissen, Andrew Weir, Victoria Dewey, Niza Mar, Rajeev Lachmipersad, John Sheffield, French Today (Camille), Kirill Vlasov, Kamito Kazaha, Adam Kurzrok, Kity Bird, Jordan Casley, Jan Pavelka, ADRIAN, Garrett Agard, Martin Etnestad Johansen, Fernanda Scovino, Sébastien Lescos, Krishen Seegobin, maylia 313, Steve Robinson, Xsitsu, jesse jones, Andrija Nenin, Pascal Newman, luixo, Zachary Stiggelbout, Brandon Wolf", "link": "https://www.youtube.com/watch?v=xAUJYP8tnRE", "date_published": "2021-12-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]