[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Robert Plant and Alison Krauss: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nBob Boilen | December 13, 2021\nWhat a remarkable sight to see the reunion of Robert Plant and Alison Krauss gathered around a couple of microphones in Nashville. It's been 14 years since their surprising and remarkable album Raising Sand and now they're back at Sound Emporium, the studio where they recorded some of that first record and the entirety of their new album Raise The Roof.\n\nHuddled in the control room are an all-star cast of musicians, with Jay Bellerose on drums, JD McPherson on guitar, Dennis Crouch on upright bass, Stuart Duncan on guitars and ukulele, and Viktor Krauss on electric bass and guitar. All of these folks minus JD McPherson played on the original recordings of the songs you'll hear in this Tiny Desk (home) concert.\n\nThey kick it off with the rockabilly sounds of \"Can't Let Go,\" a song originally recorded by Lucinda Williams and written by Randy Weeks. For their second number, Robert Plant recalls a song he first heard as a 15-year-old listening to some great R&B by Bobby Moore & the Rhythm Aces. He and Alison Krauss put their hearts and harmonies into a cover of that song, \"Searching For My Love.\" Alison takes the lead on the final tune \"Trouble With My Lover,\" written by Allen Toussaint and recorded in the '60s by the \"Lost Queen of New Orleans Soul,\" Betty Harris. These interpretations are delicate, gripping and so damn special.\n\nSET LIST\n\"Can't Let Go\"\n\"Searching For My Love\"\n\"Trouble With My Lover\"\n\nMUSICIANS\nRobert Plant: vocals\nAlison Krauss: vocals\nJay Bellerose: percussion\nJD McPherson: guitar, backing vocals\nDennis Crouch: upright bass\nStuart Duncan: acoustic guitar, electric 12-string guitar, ukulele, backing vocals\nViktor Krauss: electric bass, electric guitar\n\nCREDITS\nVideo Director/Editor: Vern Moen\nAudio Engineer: Rachael Moore\nExecutive Producer: Dilly Gent\nProducer: Josiah Bultema\nColor: Graham Lovelis\nP.M. (LA): Ian Menzies\nP.M. (Nashville): Matthew Pessoni\nDirector of Photography: Trevor Wineman\nCamera Operator: Scott Pessoni, Matthew Pessoni\n1st Assistant Camera: Dylan Mire, David Piersaul\nGaffer: Shelby Wertsbaugh\nKey Grip: BJ Hyman\nAssistant Engineer: Louis Remenapp\n2nd Engineer: Joe Trentacosti\nMixed by: Michael Piersante\nAdditional Engineering: Neal Cappellino\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bobby Carter, Kara Frame, Joshua Bryant, Sofie Hernandez-Simeonidis\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #robertplant #alisonkrauss", "link": "https://www.youtube.com/watch?v=srn5Cd9yR3Y", "date_published": "2021-12-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]