[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "NFTs In Gaming... Are We Doomed?", "description": "In this video, DeVante breaks down NFTs and what they could mean for the gaming industry going forward following the release of Ubisoft Quartz. \n\nOn December 7th, 2021, Ubisoft announced its first project in the NFT space titled Ubisoft Quartz. And while this isn’t the first time NFTs and games have crossed paths, it is the first time a AAA studio has entered the fray--and it most likely won't be the last.\n\nIn this video, DeVante gives a brief explanation about what NFTs are, where they’ve shown up in gaming and what it could mean for gaming once more publishers follow Ubisoft’s lead.", "link": "https://www.youtube.com/watch?v=TJ77Nvvth_w", "date_published": "2021-12-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "You Can Now Officially Customize Your PS5 | GameSpot News", "description": "Official PlayStation 5 console covers have been announced, Halo Infinite is getting some new playlists, and more.\n\nSony has officially announced a new series of PS5 console covers priced at $55, which will come in Nova Pink, Starlight Blue, and Galactic Purple color schemes. In addition to that, new color variants of the DualSense controller are also on the way, joining the previously released Midnight Black and Cosmic Red versions and including the same new colors as the PS5 covers. You can pre-order today on the Sony website for the January 2022 release.\n\nLater in the video, Persia also talks about the addition of Slayer, free-for-all, Fiesta Slayer, and Tactical Slayer playlists coming to Halo Infinite on December 14th. 343 Industries adjusted its update plans in response to players' feedback.\n\nLastly, Power On, a new documentary series detailing the storied history of the Xbox, is now out on YouTube to stream for free. Of particular interest is the appearance of Don Mattrick, the infamous leader of Xbox during the launch of the Xbox One, in the final episode. The series also dives into the many highs of the brand, from the incredible launch of the Xbox 360 and its years of dominance over Sony's PlayStation 3.\n\nFor more information on all of our topics, please visit gamespot.com.\n\nTimestamps:\nIntro - 00:00\nPS5 - 00:06\nHalo Infinite - 01:41\nXbox Documentary - 02:55\nOutro - 04:24", "link": "https://www.youtube.com/watch?v=bbjPz99Vgas", "date_published": "2021-12-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Assassin's Creed Valhalla: Dawn of Ragnarök - Cinematic Trailer", "description": "Check out a world premiere trailer for Assassin's Creed Valhalla showcasing the Dawn of Ragnarok!", "link": "https://www.youtube.com/watch?v=hXYcbfXz_k8", "date_published": "2021-12-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Forspoken - Beautiful World, Seemingly Nowhere To Go", "description": "Jordan talks about his hands-off preview of Forspoken, giving early impressions on the game's world, main character and story based off what he saw. Forspoken will release for PS5 and PC on May 24, 2022.\n\nIn Forspoken, you play as Frey Holland, a young New Yorker who has hit rock bottom in her life and desperately yearns to get out of the city and find a place where she can belong. She sort of gets her wish when a strange portal suddenly transports her to the fantastical world of Athia, where she meets a sentient bracelet named Cuff.\n\nIn this video, Jordan walks through his intial thoughts after taking part in a hands-off preview of Forspoken. He talks about the game's story and poses interesting questions about it's world and characters.\n\nForspoken is planned to launch for PS5 and PC on May 24, 2022.", "link": "https://www.youtube.com/watch?v=4c_gkI0XwMw", "date_published": "2021-12-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]