[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Omicron science, good news", "description": "New science explains South Africa's low rates of omicron severe disease\n\nSARS-CoV-2 spike T cell responses induced upon vaccination or infection remain robust against Omicron\n\nhttps://www.medrxiv.org/content/10.1101/2021.12.26.21268380v1\n\nhttps://www.medrxiv.org/content/10.1101/2021.12.27.21268278v1\n\nInstitute of Infectious Disease and Molecular Medicine, University of Cape Town \n\nSARS-CoV-2 Omicron variant has multiple Spike (S) protein mutations\n\nThese contribute to escape from the neutralizing antibody responses, \nreducing vaccine protection from infection\n\nWe assessed the ability of T cells to react with Omicron spike\nIn participants who were vaccinated with Ad26.CoV2.S (J and J) (n = 20)\n\nor BNT162b2 (Pfizer) (n = 15\n\nor in unvaccinated convalescent COVID-19 patients (n = 15)\n\nSARS-CoV-2-specific T cells play a key role in modulating COVID-19 severity and provide protective immunity\n\nResults\n\n70-80% of the CD4 and CD8 T cell response to spike was maintained across study groups\n\nThe magnitude of Omicron cross-reactive T cells was similar to that of the Beta and Delta variants\n\nThese results demonstrate that,\ndespite Omicron’s extensive mutations\n\nand reduced susceptibility to neutralizing antibodies, \n\nthe majority of T cell response, \n\ninduced by vaccination or natural infection, cross- recognises the variant.\n \nWell-preserved T cell immunity to Omicron,\n\nis likely to contribute to protection from severe COVID-19, \n\nsupporting early clinical observations from South Africa. \n\nFurther explanation\n\nThe limited effect of Omicron’s mutations on the T cell response suggests that vaccination or prior infection may still provide substantial protection from severe disease. \n\nIndeed, South Africa has reported a lower risk of hospitalisation and severe disease compared to the previous Delta wave\n \nCross-reactive T cell responses acquired through vaccination or infection may contribute to these apparent milder outcomes for Omicron.\n \nThe resilience of the T cell response demonstrated here also bodes well in the event that more highly mutated variants emerge in the future.", "link": "https://www.youtube.com/watch?v=8EDBJBmlvXY", "date_published": "2021-12-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Most omicron hospitalisations incidental", "description": "Around 80% of English hospital admissions with coronavirus are admitted for other reasons\n\nUK, 24th December\n\nOmicron hospital patients, 366\n\nTotal omicron deaths, 29\n\nUK, 27th December\n\nOmicron hospital patients, 407\n\nTotal omicron deaths, 39\n\nOmicron cases + 45,307 \n= 159,932\n\nUK, 29th December\n\nOmicron hospital patients, \n+ 261 + 98 = 766\n\nTotal omicron deaths, \n+ 10 + 4 = 53\n\nUK data\nhttps://www.gov.uk/government/publications/covid-19-omicron-daily-overview\n\nhttps://covid.joinzoe.com/data#levels-over-time\n\nhttps://coronavirus.data.gov.uk\n\nSA data\n\nSA hospital data\n\nhttps://www.nicd.ac.za/diseases-a-z-index/disease-index-covid-19/surveillance-reports/daily-hospital-surveillance-datcov-report/\n\nhttps://www.worldometers.info/coronavirus/country/south-africa/\n\nUS cases and deaths data\n\nhttps://covid.cdc.gov/covid-data-tracker/#trends_dailycases\n\nIsolation down to 5 days is asymptomatic\n\n20% of covid admissions caused by viral complications\n\nhttps://www.telegraph.co.uk/news/2021/12/28/covid-hospital-data-should-treated-caution-many-patients-admitted/\n\nDecember 21, England\n\nCovid patients in hospital \n= 6,245\n\nUp 259 from previous week\n\nOf the 259, just 45 admitted because of the virus\n\nOf the 259, admitted, 214 for other conditions but having also tested positive\n\n“incidental Covid” admissions\n \n\nPrevious week, December 7 to December 14\n\nMajority of hospitalisations were still delta\n\nPrimary covid cases were 59% of the 289 weekly rise\n\n\nPeople currently in hospital with Covid\n\n“incidental” cases, 1,813 out of 6,245\n\nHighest so far\n\n\nSir John Bell, regius professor of medicine, Oxford University\n\nThis is not the same disease we were seeing a year ago\n\nThe horrific scenes that we saw a year ago – \n\nintensive care units being full, \n\nlots of people dying prematurely – \n\nthat is now history in my view and I think…that’s likely to continue\n\nChris Hopson, the chief executive of NHS Providers\n\nWhat our guys are saying is that incidental cases are making around 25 to 30 per cent of cases that are arriving, \nbut that will vary from place to place\n\nIn London you would expect to see higher levels\n\nlower in somewhere like the South West, where community infections are lower\n\nThey are seeing an increase in the number of hospital admissions\n\nbut it's not precipitous. \n\nIt's not going up in an exponential way \n\nAs the number of cases in the community rises, there are significant levels of incidental cases\n\nBut we mustn't forget that having those people in hospital causes complications because of infection control measures\n\nunder significant amounts of pressure and are struggling with high numbers of staff absences\n\n \n\nMore cases of incidental Covid compared to previous waves\n\nDr Raghib Ali, consultant in acute medicine at Oxford University Hospitals, \n\nThere is certainly a smaller proportion of people ending up with Covid pneumonia in intensive care \nProbably half the cases I’ve seen are incidentals\n \nYou’ve got completely incidental cases, \n\nsomeone coming in with a broken leg, who also tests positive for Covid, \n\nthen a third category of older people who have comorbidities. \n\nMaybe they’ve had a fall or chest pain and also test positive and it's unclear if the virus is having some sort of impact.\n\nAnd when the prevalence of a virus with relatively mild symptoms is high in the community then you will see higher incidentals\n\nSimilar to Gauteng, with 52% incidentals\n\n\n\nReport from Intensive Care National Audit and Research Centre (May 1 to Dec 24)\n\n \n\nhttps://www.dailymail.co.uk/news/article-10348763/Most-pregnant-women-ventilators-Covid-havent-jab.html\n\nhttps://www.icnarc.org/our-audit/audits/cmp/reports", "link": "https://www.youtube.com/watch?v=OM2VgBm9pTI", "date_published": "2021-12-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]