[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Biomutant - The Final Preview", "description": "Before its full release on May 25, we had the chance to check out a final preview of Biomutant. The game balances various mechanics and approaches to storytelling, which certainly make for an enticing take on a post-apocalyptic adventure game. \n\nDescribed as a \"post-apocalyptic kung-fu fable,\" the action and storytelling on display in Biomutant present an adventure that's an intriguing mix of the classic animated film Secret of Nimh, along with the platforming and action of games like Enslaved: Odyssey To The West and Devil May Cry. And therein lies the hook for Biomutant; it wears its weirdness on its sleeve, presenting an alluring take on what the post-apocalyptic Earth would look like once the animals inherit the world.\n\nIn our preview, we got a clearer sense of the game's focus on action and storytelling, and how the hero's journey will evolve in a world full of talking animals and decaying automatons. First revealed back in 2017, Biomutant is the debut game from Experiment 101, made up of former developers from the Just Cause series. Biomutant is a departure from that particular series, which instead focuses more on exploring a Zelda-like map with action-RPG mechanics that blend third-person combat and RPG-like progression. \n\nBiomutant releases for PS4, Xbox One, and PC on May 25th.", "link": "https://www.youtube.com/watch?v=HjXqDTETjqM", "date_published": "2021-05-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil Village Video Review", "description": "The sequel to Resident Evil 7 leans heavily on Resident Evil 4's brand of action, but adds its own sensibilities to the mix.\n\nPhil Hornshaw scoured the ramshackle houses and strange environs of Resident Evil Village for about 12 hours on PlayStation 5, which included blasting off quite a few lycan heads in The Mercenaries. Review code was provided by the publisher.", "link": "https://www.youtube.com/watch?v=Kmkm-LQbcDo", "date_published": "2021-05-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Apex Legends Legacy: Valkyrie & New Arena Mode | Livestream", "description": "Check out Apex Legends Season 9 live gameplay, which includes new legend Valkyrie and the new 3v3 Arena mode.", "link": "https://www.youtube.com/watch?v=wxF197rNa04", "date_published": "2021-05-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil Village Demo: PS4 Pro VS PS5 Side-by-Side Comparison", "description": "Resident Evil Village is the first in the series to be fully cross-gen, so let's compare load times and gameplay between a PS4 Pro and PS5 to see how each holds up.\n\nIn the above video, we take a look at how the PS4 Pro and PS5 versions look in this back-to-back comparison, with the most notable difference being its load times, which is leaps-and-bounds faster on the PS5 thanks to the consoles SSD. Another advantage of the PS5 version is ray tracing, which is absent from the PS4 version. \n\nDespite ray tracing and load times, however, Resident Evil Village is an impressive visual feat that manages to look and run very well on previous gen hardware. So fear not, PS4 owners, Lady Dimitrescu will still stalk and prey on you in all of her tall and menacing glory all the same from the looks of this comparison. \n\nIt won’t be long until we step into the shoes of Resident Evil 7’s protagonist, Ethan Winters, once again in the search for his daughter Rose. The demo, which featured a segment of the village and Lady Dimitrescu’s castle, still leaves many questions to be answered, like Chris Redfield’s involvement and why he murdered Ethan’s wife Mia. It also remains unclear whether or not Lady Dimitrescu is the main villain, and who exactly Mother Miranda is.\n\nResident Evil Village is taking clear inspiration from one of the franchises most beloved installments Resident Evil 4, which also prominently featured a village and gothic-like horror. There are several other notable similarities like the return of a tetris-like inventory system, a merchant, and weapon upgrade systems.\n\nResident Evil Village is a direct sequel to Resident Evil 7. If you need to be caught up on the events that happened at the Baker house in the previous game, you can watch our story recap here: https://youtu.be/c_M_KFIzqa0\n\nResident Evil Village comes out on May 7 for the PS5, PS4, Xbox Series X|S, Xbox One, and PC.", "link": "https://www.youtube.com/watch?v=_UAV9XKHtVM", "date_published": "2021-05-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Evolution Of Star Wars Games", "description": "Star Wars and video games have gone hand-in-hand for almost four decades now. Check out just how much they've changed, from the early days of the Atari, all the way to Star Wars: Squadrons. May the Fourth be with you!", "link": "https://www.youtube.com/watch?v=jAHtHGo6tPg", "date_published": "2021-05-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]