[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Cande y Paulo: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nFelix Contreras | May 5, 2021\nI'm a little envious of those of you about to press play on this Tiny Desk (home) concert. The first time I heard this Argentine duo was love at first sight.\n\nVocalist and upright bassist Cande Buasso and keyboardist Paulo Carrizo are from San Juan, Argentina, a very small town nestled by the Andes close to Chile. I like to imagine that the secluded location contributes to the magic and nuance of the very personal musical language the two have developed since forming the duo in 2017.\n\nThings kick off with the magic turned up to 11 with Leonard Cohen's \"Treaty,\" from 2016's You Want It Darker. The duo's introduction to the world was a heartbreaking YouTube performance of \"Barro Tal Vez\" by the Argentine rocker and songwriter Luis Alberto Spinetta, and their performance of it here is no less haunting and captivating.\n\n\"Limite En Tu Amor,\" a cover of Feist's \"Limit To Your Love,\" is a preview of one of the tracks that will be included on their upcoming album of covers, produced by Grammy-winning producer Larry Klein. And they seal the deal with \"Tuyo,\" a nod to one of the most unheralded singer-songwriters in Latin America, Rodrigo Amarante of Brazil. Tuyo translates to \"yours\" and it's a fitting close to the briefest of introductions, but one strong enough to make Cande y Paulo one of our favorite discoveries of 2021.\n\nSET LIST\n • \"Treaty\"\n • \"Barro Tal Vez\"\n • \"Limite En Tu Amor\"\n • \"Tuyo\"\n\nMUSICIANS\n • Cande Buasso: vocals, double bass\n • Paulo Carrizo: keys, piano & production\n • Santiago Molina: drums\n\nCREDITS\n • Video: Guillermo Cabrera, Adrián Arroyo, Agustín Arroyo and Oscar Díaz\n • Audio: Guillermo Barros\n • Filmed at Teatro Del Bicentenario, San Juan, Argentina\n\nTINY DESK TEAM\n • Producer: Felix Contreras\n • Video Producer: Maia Stern\n • Audio Mastering: Josh Rogosin\n • Associate Producer: Bobby Carter\n • Tiny Production Team: Bob Boilen, Kara Frame\n • Executive Producer: Keith Jenkins\n • Senior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #candeypaulo", "link": "https://www.youtube.com/watch?v=ZoxKkGpRbtk", "date_published": "2021-05-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]