[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "Steam Deck - The future of Linux gaming has never looked brighter", "description": "Download Safing's Portmaster for FREE and take control of your network traffic: https://safing.io/portmaster\n\nGet your Linux desktop or laptop here: https://slimbook.es/en/\n\nBecome a channel member to get access to a weekly patroncast and vote on the next topics I'll cover:\nhttps://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nSupport the channel on Patreon: \nhttps://www.patreon.com/thelinuxexperiment\n\nFollow me on Twitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\nFollow me on ODYSEE: https://odysee.com/@TheLinuxExperiment:e\nOr join ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\nThe Linux Experiment merch: get your goodies there! https://teespring.com/en-GB/stores/the-linux-experiment\n\n\n00:00 Intro\n01:29 The Device\n04:12 The Software\n05:11 Gaming\n06:27 Problems\n07:54 A Huge Opportunity\n\n## The device\n\nLet's move quickly on the device itself, as you probably all already have read the dedicated website for that thing: it's based on a custom AMD APU: It's a 4 core CPU, with 8 threads, that runs between 2.4 and 3.5Ghz, so it's a pretty powerful system. The graphics part is based on the RDNA 2 architecture. I'd expect this thing to perform in line with a ryzen 3 5300U, which is definitely not bad at all for this form factor.\n\nIt has 16GB of RAM, and will start with 64Gb of eMMC memory, which is neither fast, nor a lot of storage.\n\nSpeaking of the screen, it's a small, 7 inch panel, with touch, running at 1280x800: the resolution is pretty low, but for a 7inch display, you still have a lot of pixels per inch, and it's running at 60hz.\n\nIt also has, of course, complete input, like a controller, with 2 sticks, all the triggers you need, and even 4 more triggers on the back, which you'll be able to map to do whatever you want. \n\nIt charges through USB C, and can output up to 8K at 60hz, although the specs definitely won't let you play at that resolution, and it has a micro SD card slot for more storage.\n\n## The Operating System\n\nYeah, this thing runs Steam OS, but version 3.0, based on Arch, and KDE Plasma.\n\nThe interface you'll use to navigate works with touch or the builtin controls, but you can also access the desktop itself, and run whatever Linux app you'd like, especially since you'll get access to the AUR.\n\nThis means that the Steam Deck can also be your main PC if you want: just buy a dock and slap it in there when you need to use a regular desktop, and unplug it when you want to game on the go.\n\n## Gaming\n\nSince this thing's primary purpose is gaming, and it runs Linux, we're faced with an issue: while Proton is a game changer, it still falls short when you need to run multiplayer focused games that make use of an anti cheat solution, like EPic's Easy Anti Cheat, or BattleEye.\n\nWell, it looks like Valve knows about this, since they're working with the editors of these 2 fine pieces of software to make them work on Linux.\n\nSince Proton and the Linux kernel are open source, we'll definietly see these improvements and support working on all Linux distributions as well.\n\n## The bad\n\nNow, there are some drawbacks to the device itself, and to its Proton first strategy.\n\nFirst, the device, is heavy. At almost 700 grams, it's a heavy device, twice as heavy as a Nintendo Switch. Depending on the ergonomics, it might be problematic to hold it for extended periods of time.\n\nSecond, the battery: 40Wh isn't huge, and demanding games, even running at 720p will definitely drain it in 2 hours and a half, up to 3 hours maybe. Would you play for longer sessions than this on a handheld? I know I wouldn't but I might be in the minority here.\n\nThird, the Proton First approach. It's the only one that makes sense, rather than hope that developers will port to an unproven device running Linux, but it also means that Valve is basically giving up on native Linux development, saying \"you know what, we've got this translation layer, it works fine, you get a really small performance loss, just leave it be and it will work fine, as long as you're distributing on Steam\".\n\n## The very good\n\nNow, maybe I'm super optimistic, but I think the Steam Deck has the potential to really make Linux shine as a general computing desktop. If that device sells well, and people realize they can game on a Linux based OS with no trouble, then Linux is wide open for anyone to try and stick to.\n\nThis means more market share in general, and more developer interest for general purpose applications, not just games. I see it as a nice foot in the door to open up Linux to the general public. If the Steam Deck sells well, at least.\n\nSteam OS might also be opened to other manufacturers, that could release their competitors to the Deck, and make Linux the default, go to OS for handheld PCs. This would definitely help make Linux even more interesting.", "link": "https://www.youtube.com/watch?v=lLymU21FYTY", "date_published": "2021-07-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]