[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "12 Biggest Changes In Zelda: Skyward Sword HD", "description": "With the recent release of The Legend of Zelda: Skyward Sword HD on the Nintendo Switch, we’ve rounded up all the biggest and smallest changes we could find between the new HD remaster and the Wii original.\n\nAfter Wind Waker HD and Twilight Princess HD changed a few things from their original releases, it was safe to assume Nintendo would do the same with the announcement of Skyward Sword HD in the February 2021 Nintendo Direct. But what exactly was changed? Well, we played both games to 100% completion and put them side by side to try and spot as many differences as we could, big and small.\n\nSome of these changes include button controls for the entire game, brand-new camera controls, a new autosave system, character names added to text boxes, amiibo functionality, and a bunch of others, but you’ll have to watch the video to see everything. So stop reading this description and go do that if you haven’t already.\n\nThe Legend of Zelda: Skyward Sword HD is now available for the Nintendo Switch. Alongside the game, Nintendo released a pair of Joy-Con controllers themed after the Master Sword and Hylian Shield, and a Zelda & Loftwing amiibo figure. If you’re looking for more Skyward Sword HD videos, we’ve got you covered here on GameSpot:\n\nWii vs. Switch Graphics Comparison: https://youtu.be/G8wbQMKIQzA\nVideo Review: https://youtu.be/oEEjbLxaCes\n10 Minutes of Gameplay: https://youtu.be/yacvlG1HBco\nLivestream: https://youtu.be/DgL3jDZdPzk\n\n#zelda #LegendofZelda:SkywardSword", "link": "https://www.youtube.com/watch?v=P3E8zT0eAwI", "date_published": "2021-07-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 - Even More Things To Know", "description": "Battlefield 2042 details cross-play and progression, robot dog jeep stuff, call-in tablets, AI Soldiers, unique specialist gadgets, a watered-down class system, so many rocket launchers, the lack of some playable interior spaces, and teases for EA Play Live happening soon.\n\nBattlefield 2042 is about to release a ton of information at EA Play Live, but don’t tell that to DICE community managers who tracked down Daniel Berlin, Senior Design Director to answered a lot of questions ahead of time in a massive blog post. \n\nWe now have confirmed details about many different aspects of the game. There will be cross-play and progression, both of which are being tested later this summer. We learned about the robot dog, whose name is Ranger, and how it will follow you and protect you with its life. We learned that players use call-in tablets to bring vehicles down mid-battle and also that the system is limited by team points that vary based on map and mode. There were details around how AI soldiers will fill or balance matches. AI soldiers will also do many of the same tasks as players but can’t be specialists. It was confirmed that Sundance’s wingsuit is a unique piece of gear and nobody else gets one. We learned about the new loadout system where anyone can make a choice between carrying a rocket launcher or bringing items such as ammo or health packs. Finally, we got more details on maps such as out of bounds being expanded, skyscrapers not having much in the way of interior spaces, and penguins being confirmed on the Breakaway Map. \n\nBattlefield 2042 releases October 15 or 22, depending on which version you get, and makes a lot of changes to the formula, such as a new specialist system, larger maps, a freeform weapons system, a revamped Conquest mode with sectors, storms such as tornadoes, map-altering events like rocket launches, and a massive 128 player count. Up next, we are expecting to learn about the not-battle-royale Hazard Zone mode, remastered classic maps, and what the newly branded Ripple Effect studio, formerly DICE LA, is making.\n\n#battlefield #battlefield2042", "link": "https://www.youtube.com/watch?v=FUdPuU7V6MY", "date_published": "2021-07-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Valve's Steam Deck - Who's It For?", "description": "If you enjoyed this discussion why not check out the GameSpot After Dark podcast!\nSpotify: https://open.spotify.com/show/5qmuPYfpj7R7yHXEtKBocG?si=l4eHPhXETPKJjZjWKilMPg&dl_branch=1\nApple: https://podcasts.apple.com/us/podcast/gamespot-after-dark/id1476085691\n\nValve has revealed a portable gaming device the Steam Deck that brings PC-quality gaming to a handheld device. But does it have a place in our gaming lives? The After Dark crew discuss who they think Valve's new handheld PC is for and if it is a Nintendo Switch competitor.\n\n#valvesteamdeck", "link": "https://www.youtube.com/watch?v=R_gHUktD0Ws", "date_published": "2021-07-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "COD Zombies New Map: Mauer Der Toten Livestream", "description": "Call of Duty: Black Ops Cold War is launching a new round-based Zombies map, Mauer Der Toten. To celebrate the launch, Richie will explore the new location set in Berlin and hopefully uncover some secrets along the way.\n\n#cod #codzombies", "link": "https://www.youtube.com/watch?v=Vg2mYqIclAY", "date_published": "2021-07-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Path of Exile 3.15 Expansion Announcement Livestream", "description": "Learn more about the latest expansion coming to Path of Exile 3.15. Watch live on July 15th at 1pm (PDT) at to get the full details on what to expect. Play for free on July 23rd (PDT).\n\n#partifexile3.15", "link": "https://www.youtube.com/watch?v=_TTOvINxLCg", "date_published": "2021-07-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Path of Exile Expedition Announcement Presentation", "description": "In Path of Exile: Expedition, players encounter the Kalguur, who have traveled to Wraeclast to follow in the footsteps of their ancient settlers and to retrieve their lost artifacts. Players are asked to help retrieve these artifacts from marked Expedition sites where the Kalguur believe their ancestors have fallen. Players must strategically place a chain of explosives across the site and detonate them in order to unearth the remains of the fallen Kalguur, who rise as an undead army that must be defeated. Careful choices of where to place explosives will yield chests that might contain ancient runed artifacts.\n\n#pathofexile #exilexpedition", "link": "https://www.youtube.com/watch?v=IZlNFWY-8jA", "date_published": "2021-07-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]