[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Good vaccine news in US", "description": "AZD1222 US Phase III trial met primary efficacy endpoint in preventing COVID-19 at interim analysis\n\nhttps://www.astrazeneca.com/content/astraz/media-centre/press-releases/2021/astrazeneca-us-vaccine-trial-met-primary-endpoint.html\n\nhttps://clinicaltrials.gov/ct2/show/NCT04516746?term=NCT04516746&draw=2&rank=1\n\nInterim safety and efficacy analysis\n\nN =  32,449\n\n2:1 randomisation of vaccine to placebo\n\nAccruing 141 symptomatic cases of COVID-19\n\nStatistically significant vaccine efficacy of 79% at preventing symptomatic COVID-19\n\n100% efficacy at preventing severe disease and hospitalisation\n\nVaccine efficacy was consistent across ethnicity and age\n\nAged 65 years and over, vaccine efficacy was 80%\n\nThe vaccine was well tolerated\n\nFavourable reactogenicity and overall safety\n\nIndependent data safety monitoring board (DSMB) identified no safety concerns\n\nDSMB conducted a specific review of thrombotic events, as well as cerebral venous sinus thrombosis \n\n(CVST) with the assistance of an independent neurologist\n\nDSMB found no increased risk of thrombosis or events characterised by thrombosis, n = 21,583, receiving at least one dose of the vaccine\n\nThe specific search for CVST found no events in this trial\n\n79% white/Caucasian\n\n8% black/African American\n\n4% native American \n\n4% Asian\n\n22% of participants were Hispanic.\n\nTwo doses administered, four week interval\n\nExtended interval of up to 12 weeks demonstrated greater efficacy\n\nSupported by immunogenicity data\n\nThis evidence suggests administration of the second dose with an interval \n\nLonger interval could further increase efficacy\n\nand accelerates the number of people who can receive their first dose\n\nStored, transported and handled at normal refrigerated conditions \n\n2-8 degrees Celsius or 36-46 degrees Fahrenheit, for at least six months\n\nCounter argument\n\nhttps://www.nih.gov/news-events/news-releases/niaid-statement-astrazeneca-vaccine\n\nConcerned by information released by AstraZeneca on initial data from its COVID-19 vaccine clinical trial. \n\nAstraZeneca may have included outdated information from that trial, which may have provided an incomplete view of the efficacy data. \n\nFood and Drug Administration and Centers for Disease Control and Prevention to decide.\n\nAfter thorough review of the data by independent advisory committees", "link": "https://www.youtube.com/watch?v=OBA9xTTAC8g", "date_published": "2021-03-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]