[{"source": "https://www.theguardian.com/rss", "title": "Cuts and budget delays are undermining UK science sector, warns Labour", "description": "<p>No funding earmarked for research agency and Europe’s Horizon scheme despite imminent start to financial year</p><p>The government risks creating a serious funding gap for science, Labour has warned, saying that delays over budgets and cuts to research are undermining the sector and giving the lie to ministers’ boasts about Britain’s status as a science superpower.</p><p>The party has highlighted a continued <a href=\"https://www.theguardian.com/science/2020/oct/22/science-brexit-deal-faces-3bn-hurdle-in-eu-funding-programme-uk-horizon-europe\">standoff over post-Brexit funding</a> for collaboration with European scientists via the Horizon research programme, as well as the lack of an agreed budget for the main government science funding scheme, saying the government risked “badly letting down” the sector.</p> <a href=\"https://www.theguardian.com/science/2021/mar/22/cuts-and-budget-delays-are-undermining-uk-science-sector-warns-labour\">Continue reading...</a>", "link": "https://www.theguardian.com/science/2021/mar/22/cuts-and-budget-delays-are-undermining-uk-science-sector-warns-labour", "date_published": "2021-03-22 22:30:43+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "MPs defeat bid to save leaseholders from huge fire safety bills", "description": "<p>Amendments to stop building owners passing on the costs of fixing defects were defeated in a Common vote</p><p>Hundreds of thousands of leaseholders living in unsellable and potentially dangerous high-rise homes could be left with fire safety bills of up to £100,000 each after MPs voted against a proposal to protect them from the crippling costs.</p><p>Amendments intended to stop building owners passing on the costs of fixing defects were defeated in a Commons vote on Monday evening, after being submitted by the House of Lords. It was backed by Labour, but failed to attract sufficient Tory rebels to pass, and was defeated 322 to 253.</p> <a href=\"https://www.theguardian.com/society/2021/mar/22/mps-defeat-bid-to-save-leaseholders-from-huge-fire-safety-bills\">Continue reading...</a>", "link": "https://www.theguardian.com/society/2021/mar/22/mps-defeat-bid-to-save-leaseholders-from-huge-fire-safety-bills", "date_published": "2021-03-22 22:24:42+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "The Guardian view on pandemic politics: we need cooperation, not confrontation | Editorial", "description": "<p>Vaccinating the world is the only way out of Covid, but a mixture of nationalism and protectionism is blocking the exit</p><p>Covid-19 has proved to be the greatest humanitarian and economic disaster of the century. A reported 2.7 million people have already died from the pathogen. Its recession is estimated to be <a href=\"https://blogs.worldbank.org/opendata/understanding-depth-2020-global-recession-5-charts\" title=\"\">twice as deep</a> as that associated with the 2008 crash. Ultimately, the only way out of the pandemic is to vaccinate the world. Yet there has been an alarming outbreak of a “my country first” approach to vaccine allocation. In February, the US <a href=\"https://www.ft.com/content/e00fe88e-263c-41da-9ac5-fdbbd71c928a\" title=\"\">announced</a> that it would not donate any doses to poor countries until it had a plentiful supply. Fewer than 10 days later, India <a href=\"https://www.nytimes.com/2021/02/21/world/serum-institute-india-covid-vaccine.html\" title=\"\">cracked</a> down on vaccine exports. These are political decisions, as no one doubts either country’s ability to vaccinate their own populations.</p><p>That is why the EU’s <a href=\"https://www.theguardian.com/world/2021/mar/22/britain-urges-eu-meet-commitments-covid-vaccine-supplies\" title=\"\">threat</a> to limit the export of locally produced vaccines is so concerning. Brussels has enough vaccines. Having stumbled, the bloc’s leaders know it looks bad to see doses leaving the EU for Britain, which has already vaccinated half its population. European leaders should realise that only <a href=\"https://www.theguardian.com/society/2021/mar/22/potential-for-eu-uk-vaccine-collaboration-despite-astrazeneca-row\" title=\"\">cooperation</a> can end the pandemic. Without worldwide coordination, there will be no way to get jabs to the 8 billion people on the planet. Vaccinating the globe at once has never been done. “But if we can put a rover on Mars,” the director general of the World Health Organization, Tedros Adhanom Ghebreyesus, <a href=\"https://www.theguardian.com/commentisfree/2021/mar/05/vaccination-covid-vaccines-rich-nations\" title=\"\">wrote in the Guardian</a> this month, “we can surely produce billions of vaccines and save lives on earth.”</p> <a href=\"https://www.theguardian.com/commentisfree/2021/mar/22/the-guardian-view-on-pandemic-politics-we-need-cooperation-not-confrontation\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2021/mar/22/the-guardian-view-on-pandemic-politics-we-need-cooperation-not-confrontation", "date_published": "2021-03-22 19:44:40+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "The Guardian view on public sector jobs: keep gig economics out | Editorial", "description": "<p>Outsourcing catch-up tutoring to teenagers in Sri Lanka is part of a bigger project to weaken, and cheapen, public services </p><p>The erosion of job security and the prospects of millions of UK workers due to casualisation and outsourcing is widely recognised to have transformed the experience of work. Between 2000 and 2016, the number of zero-hours contracts <a href=\"https://www.theguardian.com/business/2017/mar/03/zero-hours-contracts-uk-record-high\" title=\"\">increased fourfold</a>. Such trends are meeting with increased resistance. Last week, <a href=\"https://www.theguardian.com/technology/2021/mar/18/a-lot-are-sceptical-uber-drivers-cautious-welcome-over-worker-status\" title=\"\">Uber drivers won</a> the right to a minimum hourly wage and holiday pay.</p><p>Through the replacement of permanent staff with service contracts, public sector employers such as the NHS have been part of the shift towards more precarious employment. The exposure of a company that was paying Sri Lankan teenagers <a href=\"https://www.theguardian.com/education/2021/mar/19/uk-tutoring-scheme-uses-sri-lankan-under-18s-paid-as-little-as-157-an-hour\" title=\"\">£1.57 an hour</a> to tutor primary school pupils shows that schools in England are now being pushed down a similar path. Parents and teachers want to make the most of the £1.7bn catch-up fund provided by the government. But as <a href=\"https://www.theguardian.com/education/2021/mar/07/englands-school-catch-up-scheme-chaotic-and-confusing-say-headteachers\" title=\"\">difficulties with the scheme</a> emerge, it seems far from clear that it will boost schools and teachers. On the contrary, the use of public funds to build a system that supplements lessons by qualified teachers with far cheaper ones delivered via the internet, by unqualified people thousands of miles away, could undermine them.</p> <a href=\"https://www.theguardian.com/commentisfree/2021/mar/22/the-guardian-view-on-public-sector-jobs-keep-gig-economics-out\">Continue reading...</a>", "link": "https://www.theguardian.com/commentisfree/2021/mar/22/the-guardian-view-on-public-sector-jobs-keep-gig-economics-out", "date_published": "2021-03-22 19:41:53+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Man arrested after pregnant woman repeatedly punched in stomach in London", "description": "<p>Video appears to show man throwing pillowcase over woman’s head before beating her in Orthodox Jewish area of Stamford Hill<br /></p><p>A man in his late 50s has been arrested after a pregnant woman was left “traumatised” by having a pillowcase put over her head and being repeatedly punched.</p><p>The suspect was arrested on suspicion of grievous bodily harm (GBH) at an address in Haringey and is now in custody at an east London police station, Scotland Yard said.</p> <a href=\"https://www.theguardian.com/uk-news/2021/mar/22/attacker-punches-pregnant-woman-stamford-hill-north-london\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/2021/mar/22/attacker-punches-pregnant-woman-stamford-hill-north-london", "date_published": "2021-03-22 18:38:19+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "A tribute to key workers and those lost to Covid | Letters", "description": "<p>Readers on how to memorialise the thousands who have died in the pandemic and healthcare workers who risk their lives</p><p>On Tuesday, to <a href=\"https://www.theguardian.com/world/2021/mar/13/covid-day-of-reflection-year-after-uk-lockdown-began\" title=\"\">mark the anniversary of the first Covid-19 lockdown</a>, we will all stop for a moment to reflect on those we have lost to this dreadful pandemic. Personally, I think of the thousands of people who have died in care settings. Every death is a tragedy, the loss of a loved one – a father, mother, husband, wife, son, daughter, aunt, uncle or friend. Tuesday is also a time to think of and thank all those carers, NHS staff and other key workers who put their lives at risk to care for others. To acknowledge that work, it would be nice if the government could give all health and social care staff in England a <a href=\"https://www.gov.scot/publications/coronavirus-covid-19-gbp500-payment-for-health-and-social-care-staff---questions-and-answers/\" title=\"\">bonus</a>, like the £500 payment awarded in Scotland, Wales and Northern Ireland.<br /><strong>Mike Padgham</strong><br /><em>Scarborough, North Yorkshire</em></p><p>• The doctors, nurses and support staff who have been looking after Covid patients in hospitals and care homes for over a year now have a job that is quite different from any other that I can think of, apart from active military service. They go to work daily, knowing that they will be placing themselves in an environment that could kill them.</p> <a href=\"https://www.theguardian.com/world/2021/mar/22/a-tribute-to-key-workers-and-those-lost-to-covid\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2021/mar/22/a-tribute-to-key-workers-and-those-lost-to-covid", "date_published": "2021-03-22 17:20:28+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Tell us about the bleak spots in your local area you have come to value", "description": "<p>We would like to hear about the superficially unattractive corners of your neighbourhood you have learned to love</p><p>Desperate to escape our homes, yet unable to stray too far, many of us have learned to love bleak or superficially unattractive corners of our neighbourhoods over the last year. Fly-tipped building sites, muddy towpaths, bramble-lined tracks past scrap heaps and industrial sheds – they have all offered us an escape from the crowds and a place to hear ourselves think. And as the weeks and months have passed, we have seen how life goes in in even the most unpromising of locations, from birds hunting for food and building their nests to flowers pushing through the pavement.</p><p>We’d love to hear about the unlovely areas you’ve come to value – both what you cherish and what might deter a casual visitor. How did you discover it? What humans, animals and plants do you share it with? And what do you take home from it every time you visit?</p> <a href=\"https://www.theguardian.com/lifeandstyle/2021/mar/22/tell-us-about-the-bleak-spots-in-your-local-area-you-have-come-to-value\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2021/mar/22/tell-us-about-the-bleak-spots-in-your-local-area-you-have-come-to-value", "date_published": "2021-03-22 17:05:51+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Did you solve it? The crazy maths of crypto", "description": "<p>The solution to today’s puzzle about trust, secrets and the world’s weirdest proof</p><p>Earlier today I set the following puzzle, based on the remarkable mathematical concept of a ‘zero-knowledge proof,’ which has applications in cyber security. (To find out why this concept is so revolutionary, and how it relates to the puzzle, you can read the<a href=\"https://www.theguardian.com/science/2021/mar/22/can-you-solve-it-the-crazy-maths-of-crypto\"> original article here</a>.)</p><p><strong>The stolen paper clip</strong></p> <a href=\"https://www.theguardian.com/science/2021/mar/22/did-you-solve-it-the-crazy-maths-of-crypto\">Continue reading...</a>", "link": "https://www.theguardian.com/science/2021/mar/22/did-you-solve-it-the-crazy-maths-of-crypto", "date_published": "2021-03-22 17:00:17+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "‘Today’s the day’: the miracle wedding NSW flood waters couldn’t stop", "description": "<p>Kate Fotheringham’s wedding plans didn’t include a natural disaster, but even that wasn’t going to stop the ceremony <br />• <a href=\"https://www.theguardian.com/australia-news/live/2021/mar/23/nsw-floods-live-new-floods-warnings-for-nsw-and-life-threatening-rain-in-queensland\">Follow the NSW floods liveblog</a></p><p>When Kate Fotheringham promised her husband-to-be she wouldn’t be late to their wedding ceremony she could not have guessed a once-in-a-century flood might keep them apart.</p><p>On Saturday morning, Kate woke up to a nightmare when rising flood waters on the New South Wales mid-north coast left her trapped at her parents’ home just outside the regional town of Wingham.</p> <a href=\"https://www.theguardian.com/environment/2021/mar/23/todays-the-day-the-miracle-wedding-flood-waters-couldnt-stop\">Continue reading...</a>", "link": "https://www.theguardian.com/environment/2021/mar/23/todays-the-day-the-miracle-wedding-flood-waters-couldnt-stop", "date_published": "2021-03-22 16:30:36+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "UK startup raises €8m of funding to convert CO2 into animal feed", "description": "<p>Deep Branch aims to create protein that will replace the use of soy, which has been linked to deforestation</p><p>A UK company that turns carbon dioxide into protein to be used for animal feed has raised €8m (£6.8m) in funding as it seeks to displace the use of deforestation-linked soy by farmers.</p><p>Carbon and hydrogen are fed to a microorganism in a fermentation process similar to what you would see in a brewery. But rather than alcohol, the output is a high-value protein that can be dried and converted into pellets to feed animals.</p> <a href=\"https://www.theguardian.com/environment/2021/mar/22/uk-startup-raises-8m-funding-convert-co2-animal-feed\">Continue reading...</a>", "link": "https://www.theguardian.com/environment/2021/mar/22/uk-startup-raises-8m-funding-convert-co2-animal-feed", "date_published": "2021-03-22 16:11:44+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Britons: who has been your voice of reason through the coronavirus pandemic?", "description": "<p>As Chris Whitty wins praise for being “a class act”, we’d like to hear about the person who has kept you grounded, calm or supported during the pandemic </p><p>England’s Chief Medical Officer Chris Whitty has emerged as a<a href=\"https://www.theguardian.com/world/2021/mar/22/a-class-act-sir-chris-whitty-the-calm-authority-amid-covid-crisis-chief-medical-officer\"> voice of sense and reason</a> for during the coronavirus pandemic, cutting through the turbulence of lockdown with a calmly-delivered dose of fact.</p><p>The Chris Whitty Appreciation Society Facebook group has garnered thousands of followers and fans have even created mugs bearing his face and the catchphrase “Next Slide Please”.</p> <a href=\"https://www.theguardian.com/world/2021/mar/22/britons-who-has-been-your-voice-of-reason-through-the-coronavirus-pandemic\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2021/mar/22/britons-who-has-been-your-voice-of-reason-through-the-coronavirus-pandemic", "date_published": "2021-03-22 12:48:31+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "How have you been affected by the 'kill the bill' protest in Bristol?", "description": "<p>We would like to hear from people who have been affected by the protest in Bristol</p><p>A <a href=\"https://www.theguardian.com/uk-news/2021/mar/21/demonstrators-against-policing-bill-clash-with-officers-in-bristol\">protest against plans to give police increased powers</a> in Bristol turned violent on Sunday night with vehicles being torched and officers injured.</p><p>Hundreds had gathered at Bristol’s College Green to demonstrate before marching to a police station on nearby Nelson Street. What began as a sit-down protest outside the station escalated as the evening progressed, <a href=\"https://www.bristolpost.co.uk/news/bristol-news/kill-bill-protest-bristol-bridewell-5211280\">Bristol Live reported</a>, as riot police, dogs and police horses were deployed and police station windows were smashed.</p> <a href=\"https://www.theguardian.com/uk-news/2021/mar/22/how-have-you-been-affected-by-the-kill-the-bill-protest-in-bristol\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/2021/mar/22/how-have-you-been-affected-by-the-kill-the-bill-protest-in-bristol", "date_published": "2021-03-22 09:07:37+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Surprise! Magnum celebrates the unexpected – in pictures", "description": "<p>From a squadron of flying foxes to two men casually sitting on a train roof, photographers reveal the stories behind the images chosen for Magnum’s latest print sale, which takes chance as its theme</p> <a href=\"https://www.theguardian.com/artanddesign/gallery/2021/mar/22/surprise-magnum-celebrates-the-unexpected-in-pictures-print-sale\">Continue reading...</a>", "link": "https://www.theguardian.com/artanddesign/gallery/2021/mar/22/surprise-magnum-celebrates-the-unexpected-in-pictures-print-sale", "date_published": "2021-03-22 07:00:17+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Finding calm: the Thames at low tide during lockdown – in pictures", "description": "<p>Photographer <a href=\"https://www.theguardian.com/profile/davidlevene\">David Levene</a> found himself drawn to water, and the River Thames at low tide, for his second lockdown photo diary.</p><p><em>‘I seem to be returning to water again and again as a theme. This surely has something to do with my love of swimming, as exemplified by my previous <a href=\"https://www.theguardian.com/uk-news/gallery/2020/dec/01/deep-dive-empty-swimming-venues-during-lockdown-in-pictures\">lockdown diary</a>, but perhaps bodies of water, beaches, rivers that flow to the sea, present to us the very nature of our confinement to an island, putting into sharp focus the essence of being held captive within a place and time’</em></p> <a href=\"https://www.theguardian.com/uk-news/gallery/2021/mar/22/finding-calm-thames-low-tide-lockdown-in-pictures\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/gallery/2021/mar/22/finding-calm-thames-low-tide-lockdown-in-pictures", "date_published": "2021-03-22 06:00:17+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Professor Neil Ferguson on the Covid year that shattered our way of life – podcast", "description": "<p>Prof Neil Ferguson was one of the first scientists to raise the alarm in Britain that unless the government radically changed policy, it was heading for a disaster that the NHS could not cope with</p><p>When the UK government announced a full national lockdown a year ago, it pointed to a devastating report based on the modelling data of one of Britain’s most influential epidemiologists: Prof Neil Ferguson. It showed that unless the government changed course it was heading for a disaster that could result in the deaths of 250,000 people and the NHS being overwhelmed within weeks. </p><p>Weeks turned into months but, eventually, Britain was able to reopen last summer. Yet cases of Covid-19 surged again. Ferguson tells <strong>Anushka Asthana</strong> that once again there were calls from the scientists for a short “circuit breaker” lockdown that could stem the flow of new cases. In this instance, the government decided not to take the advice, but was forced to implement a second lockdown lasting throughout November. Then when new variants began running rampant, officials moved in January to institute a full third national lockdown that is only now starting to be relaxed. </p> <a href=\"https://www.theguardian.com/news/audio/2021/mar/22/neil-ferguson-covid-year-shattered-way-of-life-podcast\">Continue reading...</a>", "link": "https://www.theguardian.com/news/audio/2021/mar/22/neil-ferguson-covid-year-shattered-way-of-life-podcast", "date_published": "2021-03-22 03:00:12+00:00", "persistent": false, "user": null, "language": "en-UK"}]