[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Royce 5'9\": Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nAbby O'Neill | Sept. 10, 2021\nFlanked by an ensemble picked by music director, producer and longtime friend Denaun Porter, formidable lyricist Royce 5'9\" welcomes us to Heaven, his private studio near Detroit, for an impassioned Tiny Desk (home) concert. Donned in a white jumpsuit, an amped-up Royce points with enthusiasm toward vocalist Ashley Sorrell (his mentee and an emerging talent out of The D), who launches the set with \"God Speed” from Royce’s 2018 album, Book Of Ryan. \n\nSince his early years entrenched in emcee bootcamp alongside Detroit comrade Eminem, Royce -- a one-man army strapped with a battalion of bars -- has battled emcees ferociously (and playfully). Lately, Royce's personal growth -- as a man, a father and a husband -- has been palpable in his music, all while sharpening that proverbial verbal steel. The Grammy-nominated rapper aligned this Tiny Desk with National Recovery Month to celebrate his eighth year of sobriety. And in one touching moment between live renditions of \"Dead President Heads\" and the DJ Premier-produced classic \"Boom,\" Royce expresses his support for comedian Tony Baker, whose son was killed in August near Los Angeles. Royce’s lyrics and his band’s live instrumentation during this Tiny Desk combine for a reinvigorating adrenaline rush that pushes the artform forward.\n\nSET LIST\n* \"God Speed\"\n* \"Anything/Everything\"\n* \"Dead President Heads\"\n* \"Boom\"\n\nMUSICIANS\n* Royce 5'9\": vocals\n* Ashley Sorrell: vocals\n* Jeremy \"Jermz on Drumz\" Turrentine: drums\n* Edward \"EJ\" Croft Jr.: bass\n* Darell \"Red\" Campbell Jr.: keys\n* Emanuel \"Uncle EJ\" Johnson: keys\n* Gwen \"Gwenation\" Barnes: vocals\n* Jamiliah Minter: vocals\n\nCREDITS\n* Video: Brendan McCafferty, Franklyn Grant, Philip Lenok\n* Audio: I.V. Duncan\n* Music Director: Denaun Porter\n\nTINY DESK TEAM\n* Producer: Abby O'Neill\n* Video Producer: Kara Frame\n* Audio Mastering: Josh Rogosin\n* Tiny Production Team: Bob Boilen, Bobby Carter, Maia Stern, Sofie Hernandez-Simeonidis\n* Executive Producer: Keith Jenkins\n* Senior VP, Programming: Anya Grundmann\n\n#tinydesk #nprmusic #royce59", "link": "https://www.youtube.com/watch?v=ywicdvAo5AQ", "date_published": "2021-09-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Pastor T.L. Barrett & the Royal Voices Of Life: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nMitra Arthur | September 9, 2021\nPastor T.L. Barrett comes to this Tiny Desk (home) concert from his spiritual home, the Chicago church he has pastored for over 40 years. His choir, the Royal Voices of Life, and the band are positioned in front of a dazzlingly lit stained glass window. A tambourine is at the ready. The sight is familiar to anyone familiar with churches that anchor their neighborhood.\n\nStarting in 1971, Pastor Barrett released a series of albums that integrated soul and funk elements, all backed by a 45-member ensemble. Some of those former youths still perform with him today. At one point, his congregation included Donny Hathaway and members of Earth, Wind & Fire. Barrett's music has had a resurgence of late — his records have been sampled by Kanye West and DJ Khaled, songs have been featured in movies and commercials, and the label Numero Group will soon release a career-spanning box set.\n\nPastor Barrett opens this Tiny Desk (home) concert with \"I Shall Wear a Crown,\" reminding the choir, \"Let the people know you like it!\" His most well-known song, \"Like a Ship,\" retains the groove of the 1971 original; the song encourages that, despite the pain, you can shake it. In the rolling, soul-drenched take on \"Nobody Knows,\" Barrett cautions: \"This is a mean world to try to live in / But you've got to stay ahead until you die.\" A church member sitting in the front pew, decked out in a wide brim hat, raises her hands in praise. This is not a concert; this is worship.\n\nSET LIST\n\"I Shall Wear A Crown\"\n\"Like A Ship\"\n\"Nobody Knows\"\n\nMUSICIANS\nPastor T.L. Barrett: vocals & piano\nWayne Barrett: lead guitar\nCarlos Patterson: organ\nTimothy Fullerton: bass guitar\nQuinn Anderson: drums\nMinister Ykheera, Minister Jahaira, Vera Sharp: choir (sopranos)\nDeborah Thomas, Barbara Blake, Doresse Scott, Rosalind Thomas, Steve Lucas, T.L. Barrett, III: choir (tenors)\nChristine Robinson, Ceceria Robinson, Jeanette Reynolds, Michele Marshal, Zelma Evans: choir (altos)\n\nCREDITS\nVideo and Editing: Adam Luksetich\nCameras: Alex Pennacchia, Chris Vanderwall, Ed Bornstein\nProducers: Stephen Arndt, Rob Sevier, Ken Shipley, Ed Bornstein\nAudio: Kenneth Klemaier\nMusic Director: Dwayne Barrett\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bobby Carter, Kara Frame, Gabrielle Pierre\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #pastortlbarrett", "link": "https://www.youtube.com/watch?v=2nFGD1-cmns", "date_published": "2021-09-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]