[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Vaccination in immune compromise", "description": "Are COVID-19 vaccines safe for people with weakened immune systems?\n\nhttps://covid.joinzoe.com/post/covid-vaccines-immunocompromised\n\nProfessor Ellie Barnes, Oxford University\n\nCauses of immunosuppression\n\nAuto-immune conditions (e.g. lupus, rheumatoid arthritis, multiple sclerosis, inflammatory bowel disease, \nCrohn’s disease)\n\nGenetic conditions\n\nChronic diseases, liver, kidney disease, cancer \n\nPost organ or bone marrow transplant\n\nComplications of vaccination in immunocompromise\n\nProblems with live vaccines\n\nMeasles, mumps, rubella\nSmallpox\nYellow fever\n\nReduced immune response may lower vaccine efficacy\n\n\nAre the COVID vaccines safe for people who are immunocompromised?\n\nCurrently in UK, Oxford/AstraZeneca vaccine and the Pfizer vaccine\n\nNeither of these are live vaccines. \n\nAnd because of that, there's no theoretical reason why these vaccines would not be completely safe, even \nfor people who are severely immunocompromised\n\nPfizer mRNA vaccine\n\nNo virus involved with that at all\n\nOxford/AstraZeneca vaccine\n\nViral vector carries RNA to cells\n\nCannot replicate in cells or cause disease\n\nThese vaccines have been shown to be very safe\n\nThere's no reason why an immunocompromised person would have a different adverse effect profile, compared to a healthy person after receiving a COVID-19 vaccine\n\nAllergies\n\nExtremely rare\n\nNot expected to be more likely in immunocompromised people\n\nVaccine efficacy in immunocompromise\n\nThe phase three vaccines studies generally recruited healthy people and excluded people with severe disease and immunosuppressive therapy\n\nAlthough it’s likely that vaccines can provide some level of protection for people who are immunocompromised, \n\nright now we don’t have any solid data on how well COVID-19 vaccines will work in people with weakened immune systems\n\nOCTAVE study\n\nBritish Society for Immunology\n\nWhile COVID-19 vaccination might provide a lower level of protection in people who are immunosuppressed or immunocompromised compared with the rest of the population,\n\nit is still very important that you get vaccinated as it will offer you a certain amount of protection against catching COVID-19.\n\nIt is important that you receive two doses of the vaccine to maximise the protection that vaccination offers you.\n\nCOVID-19 vaccination will work best if you have a functioning immune system. \n\nIt’s important to remember that the COVID-19 vaccines can protect you from getting seriously ill with COVID-19, \n\nalthough if your immune system isn’t functioning optimally this protection will not be complete.”\n\nProfessor Ellie Barnes\n\nThe vaccines will not harm you, and they may give you some protection\n\nSo my advice to patients currently is: if you're offered a vaccine, take it\n\nWhen You’ve Been Fully Vaccinated\n\nTwo weeks after second dose in a 2-dose series, like the Pfizer or Moderna vaccines\n\nTwo weeks after a single-dose vaccine, like Johnson & Johnson’s Janssen vaccine\n\nhttps://www.cdc.gov/coronavirus/2019-ncov/vaccines/fully-vaccinated.html\n\nWhat Hasn’t Changed\n\nKeep taking precautions in public places, wearing a mask, 6 feet, avoiding crowds, poorly ventilated spaces until we know more\n\nIn public\n\nGathering with unvaccinated people\n\nVisiting an unvaccinated person\n\nStill avoid medium or large-sized gatherings\n\nStill delay domestic and international travel\n\nStill watch out for symptoms\n\nStill get tested if symptomatic\n\nStill self isolate\n\nStill need to follow guidance at your workplace.\n\nWhat’s Changed\n\nGather indoors with fully vaccinated people without wearing a mask\n\nGather indoors with unvaccinated people from one other household, unless any of those has an increased risk of severe illness\n\nIf you’ve been around someone who has COVID-19, you do not need to stay away from others or get tested unless you have symptoms.\n\nHowever, if you live in a group setting, and are around someone who has COVID-19, you should still stay away from others for 14 days and get tested, even if you don’t have symptoms\n\nWhat We Know and What We’re Still Learning\n\nWe know COVID-19 vaccines are effective at preventing COVID-19 disease, especially severe illness and death.\n\nWe’re still learning how effective the vaccines are against variants \n\nWe know that prevention measures help stop the spread of COVID-19, and that these steps are still important\n\nWe’re still learning how well vaccines prevent spread\n\nWe’re still learning how long vaccines can protect people.\n\nEstonia\n\nhttps://www.bbc.co.uk/news/live/uk-56330945\n\nNew lockdown from Thursday, education and shops\n\nUK variant\n\nDetection dogs in Germany\n\nhttps://www.dw.com/en/coronavirus-trained-dogs-detect-covid-94-of-the-time-german-study-finds/a-56447514\n\nEsther Schalke, Armed forces school for service dogs\n\n94% accuracy, even if asymptomatic\n\nFrom 1,000 + samples\n\ncoronavirus odor, emitted from cells in infected people\n\nHolger Volk, Hanover's University of Veterinary Medicine", "link": "https://www.youtube.com/watch?v=SV7ML38WfXk", "date_published": "2021-03-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Czech republic authorises ivermectin", "description": "UK, CoViD symptom tracker\n\nhttps://covid.joinzoe.com/data\n\nDrop in news COVID cases resumes \n\nhttps://covid.joinzoe.com/post/drop-in-news-covid-cases-resumes\n\nSymptomatic cases, + 8,111\n\nBased on 9,642 swab tests data from last week\n\nWeek before, + 9,545\n\nDecrease of 15%\n\nDown 88% from a peak of 69,000 at the beginning of the year\n\nPrevalence, 1 in 483 people in the UK currently have symptomatic COVID\n\nhttps://coronavirus.data.gov.uk\n\nCases, + 5,177\nDown 31.3%\n\nDeaths, + 82\nDown 34.8%\n\nHospitalised, + 707\nDown 29.6%\n\nIn patients, 12,876\n\nVaccinations\nFirst dose, 22,213,112\n\nSecond dose, 1,122,402\n\nNicola Sturgeon\n\nEveryone has made so many sacrifices in the past year & seeing a minority risk our progress is infuriating & disgraceful\n\nUK\n\nMinimum of 5 weeks apart\n\nStep One\n\nEngland, From 8 March\n\nAll schools and colleges  open\n\nOutside, with 2 people, tea, picnic\n\nEngland, From 29 March\n\nOutdoor gatherings, six people or two households\n\nIncluding private gardens\n\nOutdoor sports allowed\n\nStep Two\n\nFrom 12 April\n\nPubs and restaurants open for outdoor drinking and eating\n\nNon-essential retail opens, hairdressers and some public buildings like libraries \n\nOutdoor settings like alcohol takeaways, beer gardens, zoos and theme parks\n\nIndoor leisure like swimming pools and gyms\n\nSelf-contained holiday accommodation, and camp sites\n\nStill no indoor mixing between different households\n\nReview of international leisure travel, announced by 12 April at the earliest\n\nFunerals, up to 30 people, weddings up to 15 guests\n\nStep Three\n\nFrom 17 May, at the earliest\n\nIf the data allows\n\nOutdoor, up to 30 people\n\nTwo households can mix indoors\n\nPubs and restaurants, eating inside, rule of six\n\nCinemas, museums, hotels, open\n\nUp to 10,000 spectators outdoor\n\nconsider the potential role of Covid status certification\n\nStep Four\n\nFrom 21 June\n\nPotentially see all legal limits on social contact removed\n\nNightclubs\n\nRestrictions on weddings and funerals will also be abolished\n\nUnited States\n\nCases, 28,771,749\n\nDeaths, 522,973\n\nTrends\n\nhttps://covid.cdc.gov/covid-data-tracker/#trends_dailytrendscases\n\nHospitalizations\n\nhttps://covid.cdc.gov/covid-data-tracker/#hospitalizations\n\nVOCs\n\nhttps://www.cdc.gov/coronavirus/2019-ncov/transmission/variant-cases.html\n\nUS Vaccinations\n\nAdministered, 90,351,750\n\nFirst dose, 58,873,710 (17.7%)\n\nSecond dose, 30,686,881 (9.2%)\n\nDr. Fauci\n\nThose guidelines are coming out from the C.D.C. really imminently\n\nDr. Rochelle Walensky, C.D.C. director\n\nthese are complex issues, and the science is rapidly evolving\n\nWe are making sure and taking the time to get this right\n\nCzech republic\n\nIn order to protect public health\n\nTo ensure the availability of medicinal products important for the provision of health care\n\nhttps://www.mzcr.cz/rozhodnuti-o-docasnem-povoleni-distribuce-vydeje-a-pouzivani-neregistrovaneho-humanniho-leciveho-pripravku-humevec-s-obsahem-lecive-latky-ivermektin/\n\nhttps://www.sukl.eu/medicines/general-guidelines-2\n \nHUVEMEC 3 mg, tablets, manufactured by Huvepharma, Bulgaria, containing the active substance Ivermectin\n\nSubject to a medical prescription\n\nOnly for use in hospitalized patients over 18 years of age\n\nRisk of teratogenicity\n\n0.2 mg / kg / day administered on days 1, 3 and 5\n\nMaximum daily dose of 24 mg was evaluated as safe and most appropriate.\n\nCan be given to inpatient health care providers\n\nDue to the favorable safety profile and lack of other treatment alternatives\n\nIt is more appropriate to allow the use of an unregistered medicinal product under controlled conditions\n\nThus prevent reckless use of Ivermectin obtained on the black market or by using inappropriate veterinary products or dosage forms (cream, paste).\n\nThe patient must be informed that he is being treated with an unregistered medicinal product\n\nthat is not used in accordance with the marketing authorization and will be aware of its benefits and risks.\n\nSlovakia\n\nhttps://www.visegradgroup.eu/news/health-ministry-okays\n\nAuthorises Ivermectin for use against CoViD\n\nIn hospitals and on prescription\n\nFor the next 6 months\n\nAfghanistan\n\nPopulation, 38 million\n\nCases, 55,847\n\nDeaths, 2,449\n\nhttps://www.nytimes.com/live/2021/03/08/world/covid-19-coronavirus#syrias-leader-bashar-al-assad-and-his-wife-have-tested-positive-for-the-virus\n\nCovax initiative, 468,000 AstraZeneca vaccines arrived today\n\nIn addition to 500,000 from India\n\nNew Zealand\n\nBought 10 million Pfizer vaccine doses\n\nOnly vaccine approved so far\n\nMiddle of the year\n\nVietnam\n\nPopulation, 96 million\n\nCases – 2,500\n\nDeaths, 35\n\nBegan immunization program today\n\nOxford-AstraZeneca vaccine\n\nSouth Korea\n\nApprove AstraZeneca today for people 65 +\n\nSyria\n\nPopulation\n\nCases = 17 15,981\n\nDeaths = 1,063\n\nPresident Bashar al-Assad and Asma\n\nTested positive, mild symptoms\n\nQuarantining at home for at least two weeks", "link": "https://www.youtube.com/watch?v=e40EYxdIflk", "date_published": "2021-03-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]