[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC1gVCrX5uEFc0s_8TIYGqmw", "title": "Wild Charleston Dance - So This Is Paris 1926 - [60FPS - Color - 4K] - Footage restoration with AI", "description": "The Charleston is a dance named after the harbor city of Charleston, South Carolina. The rhythm was popularized in mainstream dance music in the United States by a 1923 tune called \"The Charleston\" by composer/pianist James P. Johnson, which originated in the Broadway show Runnin' Wild and became one of the most popular hits of the decade.\n\nSo This is Paris is a 1926 American silent comedy film produced and distributed by Warner Bros. and directed by Ernst Lubitsch. It is based on the 1872 stage play Le Reveillon by Henri Meilhac and Ludovic Halevy. It stars Monte Blue and Patsy Ruth Miller. The film is preserved in many archival holdings including the Library of Congress and the Turner Entertainment Company.\n\nWikipedia:\n🔗 https://en.wikipedia.org/wiki/So_This_Is_Paris_(1926_film%29\n🔗 https://en.wikipedia.org/wiki/Charleston_(dance%29\n\nIMDB:\n🔗 https://www.imdb.com/title/tt0017409/\n\nOriginal video was processed with Deep Learning algorithms to achieve modern look and quality. Here is the process:\n\n1. Footage stabilization and noise/dust/scratches removal with After Effects and Neat Video ✔️\n🔗 https://www.neatvideo.com/?linkID=p7845\n2. Restoration with DeepRemaster, removing scratches and film damage ✔️\n🔗 https://github.com/satoshiiizuka/siggraphasia2019_remastering\n3. Frame interpolation to get smooth look using DAIN method. Result is 60 FPS video ✔️\n🔗 https://github.com/baowenbo/DAIN\n4. Colorization using DeOldify with NoGAN. Colors are not accurate, only for ambient mood ✔️\n🔗 https://github.com/jantic/DeOldify\n5. Upscaling using Topaz Video Enhance AI, upscale preserving detail and reducing noise ✔️\n🔗 https://topazlabs.com/video-enhance-ai/ref/755/\n⭐⭐⭐ 15% DISCOUNT CODE: oldendays15\n6. Automation with Python scripts and AWS Thinkbox Deadline as queue manager ✔️\n🔗 https://www.awsthinkbox.com/deadline\n7. RTX 2070 Super 8GB, 32GB RAM, Ryzen 9 3900X 12-core. Approx 48hrs/10min video processing.\n\n🎵 Music:\nI'm Gonna Meet My Sweetie Now - Jean Goldkette & His Orchestra\n\nSocial Media:\nhttps://www.facebook.com/oldendayschannel\nhttps://www.twitter.com/OldenDaysYT\nhttps://www.instagram.com/oldendayschannel\nhttps://www.pinterest.ca/OldenDaysYT/old-footage-restoration\nhttps://www.patreon.com/oldendays\n\n#deoldify #colorize #upscale #topazlabs #veai #dain #60fps #4k", "link": "https://www.youtube.com/watch?v=TXiXec8Xups", "date_published": "2021-03-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]