[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCsXVk37bltHxD1rDPwtNM8Q", "title": "What if the World turned to Gold? - The Gold Apocalypse", "description": "The Map of Evolution and other sciency posters, researched and designed with love, are now available on the kurzgesagt shop. ►► https://kgs.link/shop-139\n(Worldwide Shipping Available)\nYour purchase will support us directly and keep our videos free for everyone. \n\nSources & further reading:\nhttps://sites.google.com/view/sourcesgoldapocalypse/\n\nLet us explore the scientific mystery of what would happen to you, if Earth suddenly turned into gold! The “Midaspocalypse”, based on the ancient tale of King Midas who was cursed so everything he touched turned into gold. \n\nOUR CHANNELS\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nGerman Channel: https://kgs.link/youtubeDE \nSpanish Channel: https://kgs.link/youtubeES \n\n\nHOW CAN YOU SUPPORT US?\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nThis is how we make our living and it would be a pleasure if you support us!\n\nGet Merch designed with ❤ from https://kgs.link/shop-139  \nJoin the Patreon Bird Army 🐧 https://kgs.link/patreon  \n\n\nDISCUSSIONS & SOCIAL MEDIA\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nReddit:            https://kgs.link/reddit\nInstagram:     https://kgs.link/instagram\nTwitter:           https://kgs.link/twitter\nFacebook:      https://kgs.link/facebook\nDiscord:          https://kgs.link/discord\nNewsletter:    https://kgs.link/newsletter\n\n\nOUR VOICE\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nThe Kurzgesagt voice is from \nSteve Taylor:  https://kgs.link/youtube-voice\n\n\nOUR MUSIC ♬♪\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\n700+ minutes of Kurzgesagt Soundtracks by Epic Mountain:\n\nSpotify:            https://kgs.link/music-spotify\nSoundcloud:   https://kgs.link/music-soundcloud\nBandcamp:     https://kgs.link/music-bandcamp\nYoutube:          https://kgs.link/music-youtube\nFacebook:       https://kgs.link/music-facebook\n\nThe Soundtrack of this video:\n\nSoundcloud:   https://bit.ly/3uC1UdP\nBandcamp:     https://bit.ly/3rafoeA\n\n\n🐦🐧🐤 PATREON BIRD ARMY 🐤🐧🐦\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nMany Thanks to our wonderful Patreons who support us every month and made this video possible:\n\nKarthik Ramasamy, Vladan Lausevic, Glenn Green, Austin Millan, Wyton Chu, Gintare Petraityte, Cédric Marchal, Stacey Shpaner, Marko Cukovic, Misha Suksnguan, Christina Mansson, yem, Patrick Lathrop, Ben Saward, Igor Shevchenko, Eugen Schiller, Kamran Hassan, SrirachaSeahawk, Andrew Morse, Nick Wharff, Aleksander Lis, Andrew Conner, Linda Massie, R Armstrong, Garrett Krest, Vector-Dopamine math, James McMeeking, tuxlu, Matthew Gunn, Benjamin Lois, Xiaohan Ma, Yu Li, Fernadno, Memo Akten, Wrong_Dongle, วงศกร นันทวิชิต, Jose Mejia, Jacob B., gingerninja, Ondrej Priečinský, Leo MacMitchell, Mehran Ziadloo, Milan Mladoniczky, Jonathan Beranger, Jessie Childers, Joan Zak, Danil, Plinzler, landon, Patrick Jones, Ahmed Sultan, Ethan Holland, Ralitsa Tsoneva, David Lindvall, Bryan Roscoe, Jason aka Kypzethdurron, Christopher R. Collins, Jason Meyer, Patrick Frank, Anne Commons, James Moffatt, Emma Phillips, KoblerMan, Michael Wolfe, Kristian Küng, Morten Berg, Cristian Klein, Athletic Interest, Nomvitch, Team HAM, planloskreativ, Martin Lange", "link": "https://www.youtube.com/watch?v=VB_GWz25B3Q", "date_published": "2021-03-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]