[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCZYTClx2T1of7BRZ86-8fow", "title": "The Incredible World of Snakes | SciShow Snake Compilation", "description": "Welcome to the slithery world of snakes! Maybe you fear them, love them, or respect them from afar, but we can't help but wonder what is it about snakes that makes them so fascinating? Join us for a fun SciShow compilation of everything you'd ever want to know about these scaly serpents. \n\nSciShow has a spinoff podcast! It's called SciShow Tangents. Check it out at http://www.scishowtangents.org\n----------\nSupport SciShow by becoming a patron on Patreon: https://www.patreon.com/scishow\n----------\nHuge thanks go to the following Patreon supporters for helping us keep SciShow free for everyone forever:\n\nChris Peters, Matt Curls, Kevin Bealer, Jeffrey Mckishen, Jacob, Christopher R Boucher, Nazara, charles george, Christoph Schwanke, Ash, Silas Emrys, KatieMarie Magnone, Eric Jensen, Adam Brainard, Piya Shedden, Alex Hackman, James Knight, GrowingViolet, Sam Lutfi, Alisa Sherbow, Jason A Saslow, Dr. Melvin Sanicas\n\n----------\nLooking for SciShow elsewhere on the internet?\nFacebook: http://www.facebook.com/scishow\nTwitter: http://www.twitter.com/scishow\nTumblr: http://scishow.tumblr.com\nInstagram: http://instagram.com/thescishow\n----------\nOriginal Episodes:\nWhy Are There No Sea Snakes in the Atlantic? - https://www.youtube.com/watch?v=SOqORIOudLw\nSnakes Use Their Spongy Mouths to Drink - https://www.youtube.com/watch?v=_r3gG6NjNKQ\nHow to Make Antivenom - https://youtu.be/0yqVow4J4oA\nBehold—Poisonous Snakes! (Yes, You Read That Right) - https://www.youtube.com/watch?v=7xGWzikzKUA\nWhat Happens When a Venomous Snake Bites Itself? - https://youtu.be/fp1r40w_PtA\nIs It Safe To Drink Snake Venom? - https://youtu.be/AxS0m00jFOA", "link": "https://www.youtube.com/watch?v=sVC7bpi54fQ", "date_published": "2021-08-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]