[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 Hazard Zone - 18 Things I Wish I Knew", "description": "Hazard Zone is Battlefield 2042’s competitive extraction style game mode and it can be very challenging. Here’s the best way to use guns, specialists, and tactics to get those data drives and get out alive.\n\nBattlefield 2042 has three main modes: All-Out Warfare, Portal, and Hazard Zone. Hazard Zone is an extraction mode that draws influence from hero shooters, popular battle royale titles, and games like Hunt: Showdown and Escape from Tarkov. In our 12-hour review event, we spent around four hours with the mode and learned a lot. Here’s what you should know. \n\nIn this video, we’re giving you 18 things we wish we knew before playing. These tips will help you earn more Dark Market credits, help you develop tactics, cover what kind of guns to purchase at the start of each round, help you survive the extraction process, and more. We’ll also cover how mechanics like the Call-In tablet, plus system, and some specialist abilities work in slightly different ways in this mode, as well as some tactical dos and don’ts. \n\nBattlefield 2042 is out now in early access with a general release on November 19. The game has cross-progression, cross-play, and cross-buy on PC, PlayStation 5, PS4, Xbox Series X/S, and Xbox One. It's worth noting, though, that matches sport aa lower player count on last-gen consoles. Head on over to YouTube.com/GameSpot for our review-in-progress, and more gameplay, like a video of a No Specialist Mode from Portal.", "link": "https://www.youtube.com/watch?v=8n5FFd4iMX8", "date_published": "2021-11-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Call Of Duty: Vanguard’s Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of Call Of Duty: Vanguard, including cursed versions of the M1 Garand, a ridiculously cutdown Thompson, and an MG42 without a stock.\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of Call Of Duty: Vanguard and compares them to their real-life counterparts.\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\nYou can subscribe to the Armax Journal that Jonathan Associate Edits here: https://www.armaxjournal.org/", "link": "https://www.youtube.com/watch?v=nVCQ4_mnyts", "date_published": "2021-11-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 Early Access Launch Day Livestream", "description": "We dive into Battlefield 2042 and play a bunch of classic Battlefield games like Bad Company 2 in the all new Portal mode, as well as All Out Warfare!", "link": "https://www.youtube.com/watch?v=0uDsimO32QE", "date_published": "2021-11-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 Is Missing Features According To Fans | GameSpot News", "description": "In this episode of GameSpot News, we talk about Battlefield 2042 launching with no scoreboard or in-game chat, Battlefield 2042 Portal servers being reset to \"combat bad behavior\", GTA Trilogy getting Pulled For PC and Sony revealing the most popular PS5 games. \n\nIn this video, DeVante talks about Battlefield 2042 launching with missing features like no scoreboard or in-game chat. ICE plans to add voice chat to Battlefield 2042 in an official capacity after launch, and potentially as soon as \"day 25\" after release, which would be sometime in December. Also the \"effectiveness\" of XP farming servers in Portal mode has been reduced thanks to a new update. The development team also performed a hard reset of all Portal mode servers in order to free up more servers in the mode as well.\n\nDeVante also talks about the GTA Trilogy getting pulled from PC and the Rockstar Games Launcher going down. Because GTA III, Vice City, and San Andreas were de-listed on digital stores ahead of the Definitive Edition's release, there is currently no way to buy the games in any fashion on PC right now.\n\nLater in the video, Sony reveals most popular PS5 games on console's first birthday.\n\nTIME STAMPS\n00:00 - Intro\n00:13 - Battlefield 2042 Launches With No Scoreboard Or In-Game Chat\n01:13 - Battlefield 2042 Portal Servers Reset To \"Combat Bad Behavior\"\n02:08 - GTA Trilogy Pulled For PC, Rockstar Launcher Broken\n02:56 - Sony Reveals Most Popular PS5\n03:55 - Outro", "link": "https://www.youtube.com/watch?v=1mn-Kb8g9CA", "date_published": "2021-11-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Elden Ring 84 Minutes of PlayStation 5 Gameplay (4K)", "description": "The Elden Ring Network Test is underway, and Gamespot's very own Tamoor Hussain was lucky enough to get his hands on it. So, we present to you, 84 minutes of Elden Ring gameplay, with some slight narration by Dave Klein of DaveControl. Elden Ring releases February 25, 2022.\n\nElden Ring is the latest FromSoftware game from now-legendary Game Director, Hidetaka Miyazaki, creator of Demon's Souls, Dark Souls, Bloodborne, and Sekiro. Elden Ring is Hidetaka Miyazaki's take on an open world, and many have called it Open World Dark Souls, thanks to how similar it is to Dark Souls' roots.\n\n0:00 - Character Classes\n0:36 - Fringefolk Hero's Grave (Tutorial)\n8:08 - Soldier of Godrick\n10:55 - Limgrave\n26:11 - Map Fragment\n27:30 - Melina\n29:53 - Leveling Up\n32:56 - Church of Elleh\n34:00 - Merchant Kale\n39:27 - Demi-Human Chief\n54:45 - Tree Sentinel\n57:17 - Post Town Remains\n1:12:15 - Stormhill\n1:12:50 - Forlorn Hound Evergaol\n1:14:26 - Bloodhound Knight Darriwil\n1:17:50 - Margit the Fell Omen\n1:20:37 - Stormveil Castle", "link": "https://www.youtube.com/watch?v=YPKo57SqiiU", "date_published": "2021-11-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Grand Theft Auto: The Trilogy - Definitive (Xbox Series X) vs Original (Xbox) Graphics Comparison", "description": "We compare the original Xbox versions of Grand Theft Auto 3, Vice City, and San Andreas to their new definitive editions running on the Xbox Series X.\n\n#GTA\n\nTimestamps\nGTA 3 - 0:01\nGTA Vice City - 7:14\nGTA San Andreas - 13:38", "link": "https://www.youtube.com/watch?v=EB2SgSA5Fx4", "date_published": "2021-11-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "PlayStation 5: One Year Later", "description": "Happy birthday to the PlayStation 5! In this special episode of Console Crew/Generation Next, Lucy, Tamoor, and Jordan discuss the PS5's first year, including its exclusive titles like Demon's Souls and Spider-Man: Miles Morales.\n\nThe gang are back again for another special episode of Console Crew/Generation Next. This time, Lucy, Tamoor, and Jordan are discussing the PlayStation 5's birthday. \n\nOn its first anniversary, the gang discuss the highs and lows of the console's first year, including its lineup of exclusive games such as Deathloop, Returnal, and Demon's Souls. They also spend time discussing the console's tech, and how the PS5 fits into their daily lives: from gaming, multimedia, to how they use it to socialise. They also discuss the PS5's storage issues and the gamechanger that is 3D Audio. \n\nNovember 10 marked the one-year anniversary of the Xbox Series X/S, so make sure to check out the other episode of the show about that console's first year too. To make sure you're up to date with everything PlayStation, make sure to subscribe at youtube.com/gamespot.", "link": "https://www.youtube.com/watch?v=ufGXCsDRjEs", "date_published": "2021-11-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Bee That Broke Skyrim", "description": "Skyrim's intro is iconic, but the classic opening-turned-meme almost didn't happen due to a bug in the game--to be more specific, a bee.\n\nSkyrim's opening cart scene has become iconic since the game's release ten years ago, but it nearly didn't happen due to a bug that derailed the whole thing… quite literally. \n\nIn this video, Kurt Indovina chats with The Elder Scrolls V: Skyrim senior world artist Nate Purkeypile about the bee that broke the game's classic intro. In the decade since its release, Skyrim's opening has become synonymous with the meme which spawned \"Hey you, you're finally awake.'' For a lot of players, seeing the intro means a new journey through Northern Tamriel awaits, but for Purkeypile, seeing the intro again is a bit of a touchy subject. \n\nPurkeypile breaks down the story of the mysterious bug that plagued the game's opening cart scene, and the many layers it took to unravel to find the bug and fix it. With Purkeypile, Kurt helps carry the story along, while regaling his own passion for Bethesda's epic fantasy RPG.\n\nThe Elder Scrolls V: Skyrim Anniversary Edition comes out on November 11 for the PlayStation 4 and Xbox One, with next-gen upgrades for the PlayStation 5 and Xbox Series X|S. \n\nFollow Nate Purkeypile on Twitter: https://twitter.com/NPurkeypile\n\n#Skyrim", "link": "https://www.youtube.com/watch?v=Ll6M5QiIa6k", "date_published": "2021-11-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]