[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Autumn predictions and BBC checked", "description": "Free download link for John's two text books in PDF, http://159.69.48.3/\nThese books are now available for free download so students and interested members of the public in poorer areas can read on computers or optional mobile phone friendly format. PDF files may also freely printed out for further free distribution.\n\nUS cases and deaths\n\nhttps://covid.cdc.gov/covid-data-tracker/#trends_dailycases\n\nUS hospital patients\n\nhttps://covid.cdc.gov/covid-data-tracker/#hospitalizations\n\nCovid vaccine booster doses available for all adults \n\nCalifornia, Colorado, New Mexico\n\nOver 18s, six months after second dose\n\nhttps://www.latimes.com/science/story/2021-11-12/cdc-shifts-pandemic-goals-away-from-reaching-herd-immunity\n\nhttps://www.cdc.gov/vaccines/acip/meetings/downloads/slides-2021-11-2-3/03-COVID-Jefferson-508.pdf\n\nUK, Zoe graphics link\n\nhttps://covid.joinzoe.com/post/covid-cases-probably-peaked\n\nLive Zoe data\n\nhttps://covid.joinzoe.com/data#levels-over-time\n\nUK Official data\n\nhttps://coronavirus.data.gov.uk\n\nUK, next?\n\nProf Neil Ferguson, Imperial College London\n\nhttps://www.theguardian.com/world/live/2021/nov/13/covid-live-news-melbourne-vaccine-mandate-sparks-protest-boris-johnson-warns-of-storm-clouds-in-europe\n\nCatastrophic winter wave unlikely in UK\n\nUK, quite a different situation from other European nations (Germany, Netherlands, France)\n\nHigh Covid numbers in summer, population immune boost\n\n30,000 to 50,000 a day, for the last four months\n\nI think it is unlikely we will get anything close to what we had last year, that catastrophic winter wave\n\nSeveral weeks of declining cases, a hint of an uptick in the last few days\n\nRussia \n\nCases, + 39,256\n\nDeaths, + 1,241\n\nOne week after 80 region, 1 week workplace shutdown\n\nFact checking the BBC\n\nhttps://www.bbc.co.uk/news/health-59178291\n\nCovid: Pfizer says antiviral pill 89% effective in high-risk cases\n\nIt comes a day after the UK medicines regulator approved a similar treatment from Merck Sharp and Dohme (MSD).\n\nPfizer says it stopped trials early as the initial results were so positive.\n\nThe combination treatment, which is still experimental because trials haven't finished\n\nUK, 250,000 courses of Paxlovid (combo with ritonavir)\n\n480,000 courses of molnupiravir pill\n\nPaxlovid works slightly differently to the Merck pill\n\nwhich introduces errors into the genetic code of the virus\n\nFull trial data has not yet been published by either company\n\nPfizer, chairman and chief executive Albert Bourla\n\nthe potential to save patients' lives, reduce the severity of Covid-19 infections, and eliminate up to nine out of 10 hospitalisations\n\nThere have been successes, notably in HIV, but reports concluded one antiviral for flu ended up being about as effective as paracetamol.", "link": "https://www.youtube.com/watch?v=PdgnLxRsxBY", "date_published": "2021-11-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]