[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCFQMnBA3CS502aghlcr0_aw", "title": "Great Investing Isn't Sexy - The Plain Bagel Interview", "description": "The plainest man on wall-street, mr half donut - one finance\nSubscribe to Richard's Channel! https://www.youtube.com/channel/UCFCEuCsyWP0YkP3CZ3Mr01Q\nRichard's books list\nFor history: The Big Short (2008 financial crisis) by Michael Lewis or Liar's Poker\nFor general investment/financial knowledge:\nThe Wealthy Barber Returns: A Canadian one but it covers the basics and provides pretty tangible steps for getting your finances in order. Most of the lessons apply to anyone.\nThe Intelligent Investor: This is a cult favourite of value investors. A little dated (and a little sexist!) but it lays out the value investment philosophy.\nThe Education of a Value Investor: This is a lighter read and less technical, but it's a book from a famous hedge fund manager Guy Spier where he talks about methods he's used over time to avoid becoming emotional as an investor and getting caught up in the madness of Wall Street. It talks ethics and good emotional management; I took a lot away from it.\nOne Up on Wall Street: I'm actually still reading this one, but for the active investor it provides a good overview of what to look for when researching companies. Also a little dated, but good fundamental teachings.\n\ntwitter: https://twitter.com/coffeebreak_YT\ninstagram: https://www.instagram.com/coffeebreak_yt/\nthis video is an opinion and in no way should be construed as statements of fact. scams, bad business opportunities, and fake gurus are subjective terms that mean different things to different people. I think someone who promises $100K/month for an upfront fee of $2K is a scam. Others would call it a Napolean Hill pitch.\n\nNote: this video was filmed around august - september, only just released now because I've been lazy.", "link": "https://www.youtube.com/watch?v=9v28g85LHHQ", "date_published": "2021-01-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCFQMnBA3CS502aghlcr0_aw", "title": "18 YR OLD LIFECOACH CHANGED MY MIND", "description": "Truly the greatest meme opportunity of our era: https://www.reddit.com/r/Coffeezilla_gg/\n\ntwitter: https://twitter.com/coffeebreak_YT\ninstagram: https://www.instagram.com/coffeebreak_yt/\nthis video is an opinion and in no way should be construed as statements of fact. scams, bad business opportunities, and fake gurus are subjective terms that mean different things to different people. I think someone who promises $100K/month for an upfront fee of $2K is a scam. Others would call it a Napolean Hill pitch.", "link": "https://www.youtube.com/watch?v=gD_Ol8L2y9c", "date_published": "2021-01-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]