[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "DualSense on Linux, GNOME 40 changes things, and 2 projects to replace CentOS!", "description": "Try KernelCare+ for free for 30 days by signing up here: https://lp.kernelcare.com/kernelcare-plus-experiment\n\nThis time, we have changes in how GNOME Shell will look in the next release, the PS5 controller being officially supported on Linux, and a nifty little handheld for retro gaming that runs Ubuntu\n\nJoin this channel to get access to a monthly patroncast and vote on the next topics I'll cover:\nhttps://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nSupport the channel on Patreon: \nhttps://www.patreon.com/thelinuxexperiment\n\nFollow me on Twitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\nFollow me on LBRY: https://lbry.tv/@TheLinuxExperiment:e\n\nThe Linux Experiment merch: get your goodies there! https://teespring.com/en-GB/stores/the-linux-experiment\n\n00:00 Intro\n01:24 Linux News\n04:52 Open Source News\n07:04 Apps News\n08:24 Privacy News\n10:01 Gaming News\n\nThere was an interesting article about GNOME and its health in terms of contributors.\nhttps://hpjansson.org/blag/2020/12/16/on-the-graying-of-gnome/\n\nFor those who have been more than troubled by the announcement that CentOS will become sort of a rolling release, there is a new project that aims to bring the same experience that CentOS used to, and it's called Rocky Linux.\nhttps://rockylinux.org/\nhttps://www.projectlenix.org/\n\nAn official blog post talked about the future of GNOME SHell, and there are some interesting designs here. It lays out plans for the next GNOME 40 release, and showcases a reimagined Activites Overview.\nhttps://blogs.gnome.org/shell-dev/2020/12/18/gnome-shell-ux-plans-for-gnome-40/\n\nXFCE 4.16 was released, and it brings a big number of changes, starting with the icons.\nhttps://xfce.org/about/news\n\n/e/ is now available on more phones, including the Gigaset G290, which is a recent device that goes for 260€.\nhttps://esolutions.shop/shop/e-os-gs290/\n\nAWS, the Cloud services part of Amazon, will join the Blender Development Fund and support the fantastic open source 3D tool. AWS will fund Blender for the next 3 years.\nhttps://www.blender.org/press/aws-joins-the-blender-development-fund/\n\nSony has sent a new official driver for the PS5's controller, the DualSense, to be included in the Linux kernel. This means that this new controller, that has been praised by most reviewers as the best iteration on a playstation controller to date, will have its bluetooth and USB modes supported on Linux, but also the LED's, the touchpad, the motion sensors, and the rumble features.\nhttps://www.gamingonlinux.com/2020/12/sony-to-officially-support-the-ps5-dualsense-on-linux-with-a-new-driver\n\nKdenlive 20.12 was released, and it's a big update to the open source video editing software. The update features the ability to implement same track transitions, always nice to keep your timeline tidy, an integrated subtitling tool which seems super easy to work with by editing subtitles directly on the timeline, the effects have been re-categorized to be more legible, and Kdenlive should now also perform better.\nhttps://kdenlive.org/en/2020/12/kdenlive-20-12-is-out/\n\nDarktable 3.4 was also released. For those who don't know about it, it's an open source photography workflow application, and a RAW developer. This new release brings a more stable tethering view with histogram support, and modules can now be grouped and have presets to make it easier to get started.\nhttps://www.darktable.org/2020/12/darktable-340-released/\n\nThe EU is moving forward with new legislation aiming to curb the power of big tech companies.\nhttps://www.cityam.com/europe-lays-out-new-rules-that-could-force-the-breakup-of-big-tech/\n\nWe already knew this, but now the proof is pretty visible: Facebook does collect a ton of data. Apple rolled out privacy labels in its App Store on iOS. This feature shows users what data an application can collect to track you, and what is linked to your identity, and the list, for the Facebook app, is very, very long, including health and fitness data, your purchases history, financial info, location, search and browsing history, usage data, diagnostics, and more.\nhttps://apps.apple.com/us/app/facebook/id284882215\n\n\nCollabora announced their wayland driver for wine.\nhttps://www.gamingonlinux.com/2020/12/collabora-announce-their-wayland-driver-for-wine\n\nValve tweaked Proton Experimental to make Red Dead Online Work on Linux. Valve seems to be using Proton Experimental to add \"day one\", or at least very quick support for newer games, even though it's not fully stable yet.\nhttps://www.gamingonlinux.com/2020/12/valve-tweaks-proton-experimental-further-to-get-red-dead-online-running-on-linux\n\nAn Ubuntu powered, Nintendo Switch device has appeared: the Odroid Go Super is a 5 inch handheld PC running Ubuntu 20.04 LTS and the Emulation Station graphical interface, so the device supports a large range of older games.\nhttps://www.omgubuntu.co.uk/2020/12/odroid-go-super-ubuntu-handheld", "link": "https://www.youtube.com/watch?v=vDljnwYPg68", "date_published": "2021-01-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]