[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Neffy, 2021 Tiny Desk Contest Winner: Tiny Desk Concert", "description": "Bob Boilen | October 27, 2021\nIt felt good to be home, if only for one night: home, in this case, being my Tiny Desk at NPR. We were about to film Neffy, our 2021 Tiny Desk Contest winner, at my desk at NPR headquarters. My corner of the NPR Music department looked just as I had left it almost 600 days ago; it's eerie inside and nearly nightfall outside. There's no audience for this Sunday evening concert, just our five-person Tiny Desk crew.\n\nWe had filmed almost 1,000 Tiny Desk concerts before we abandoned the office in mid-March of 2020. What was then exciting yet routine now felt somewhat like a hallucination.\n\nFor Neffy, it too was a dream: — a dream come true. Her joy during the recording was contagious. Neffy is Mecca Russell, a young singer who grew up around Arlington, Va., just across the river from NPR. Her Contest-winning song \"Wait Up\" is about living in New York, most recently during the COVID-19 outbreak, but yearning for home. In fact, Neffy did return to her childhood home, where she recorded her winning song with just her heartfelt voice and her guitar.\n\n\"I wrote 'Wait Up' like many other songs I've written: sitting on the edge of my bed. But I didn't know it would be the song that would change my life,\" Neffy told us. \"I got to sing lyrics I wrote in the privacy of my room late at night to a vast and loving audience is beyond my wildest dreams. For that, I am incredibly grateful, and quite frankly, still in disbelief.\"\n\nWe hear three more songs from Neffy during her Tiny Desk concert. It's a small window into an outstanding talent, and we're so proud to share this extraordinary moment.\n\nSET LIST\n\"Like You Did\"\n\"Wait Up\"\n\"What If\"\n\"Hangin' On Too Long\"\n\nMUSICIANS\nNeffy: vocals, guitar\n\nTINY DESK TEAM\nProducers: Bob Boilen, Kara Frame, Elle Mannion\nAudio Engineer: Josh Rogosin\nVideographers: Kara Frame, Maia Stern\nEditor: Maia Stern\nTiny Contest Team: Jessica Goldstein, Marissa Lorusso\nTiny Production Team: Bobby Carter, Sofie Hernandez-Simeonidis\nCreative Director: Bob Boilen\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #neffy", "link": "https://www.youtube.com/watch?v=l-JEdcOGuzQ", "date_published": "2021-10-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Ed Sheeran: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nBobby Carter | October 26, 2021\nDecked in a hoodie, cargo pants and coveted sneakers, a slimmed-down and clean-shaven Ed Sheeran stands surrounded by bookshelves and a host of world-class musicians. He’s flanked by music director to the stars, Adam Blackstone, who assembled the band and handled bass guitar duties. After opening this Tiny Desk (home) concert with his latest single, “Shivers,” Sheeran introduces himself and proceeds with more hits, new tunes, and a surprise throwback. \n\nThe English singer-songwriter may appear acclimated to a live band, but it’s a pretty rare occasion. For more than a decade, Sheeran’s become revered for ripping down stadiums, but usually (and remarkably) it’s just him, a guitar and loop pedals.\n\nThe material released so far from his upcoming album, = (out Oct. 29), leans heavily into the ’80s pop sphere and provides glimpses into Sheeran’s personal life during his time away. Here, he debuts “Overpass Graffiti,” an uptempo ode to the endurance of long love. “Visiting Hours” is a heartfelt dedication to his close friend and mentor, Australian record executive Michael Gudinski, who passed away in March. \n\nAlthough most of the setlist honors =, Sheeran veers momentarily to take us to church with 2014’s “Make It Rain” from the TV show Sons of Anarchy. The choir only takes up a smidgen of physical real estate, but their voices manage to engulf the entire space, propelling the song to another stratosphere. He closes the performance with a quiet storm version of his summer single “Bad Habits.”\n\nSET LIST\n* “Shivers”\n* “Make It Rain”\n* “Overpass Graffiti”\n* “Visiting Hours”\n* “Bad Habits”\n\nMUSICIANS\n* Adam Blackstone: musical director/bass\n* Terence Vaughn: keys\n* Tim Stewart: guitar\n* Clay Sears: guitar\n* Brian Frasier-Moore: drums\n* Rayfield Holloman: pedal steel guitar\n* Whitney Smith: vocals\n* Raphael Smith: vocals\n* Melissa Best: vocals\n* Antia Coach: vocals\n* Melany Watson: vocals\n* Kyron Elcock: vocals\n* Raymond Mason: trombone\n* Michael Leonhart: trumpet\n* Sam Greenfield: saxophone\n\nCREDITS\n* Video: Chadrick Fellers, Jeremy Ivory-Chambers, Porous Porousfreak\n* Audio: Tyrell Ace Clark, James Hardy-Martin, Douglas Touré Harris\n\nTINY DESK TEAM\n* Producer: Bobby Carter\n* Video Producer: Kara Frame\n* Audio Mastering: Josh Rogosin\n* Tiny Production Team: Bob Boilen, Bobby Carter, Maia Stern, Sofie Hernandez-Simeonidis\n* Executive Producer: Keith Jenkins\n* Senior VP, Programming: Anya Grundmann\n\n#tinydesk #nprmusic #edsheeran", "link": "https://www.youtube.com/watch?v=4MsoqUv5gv4", "date_published": "2021-10-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]