[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "28 Minutes of Days Gone PC Gameplay (4K)", "description": "Get a glimpse of the first 28 minutes of gameplay from Days Gone on the PC in 4K. We're playing a PC with a 2080 TI, I9-9900K CPU, and 32 GBs of Ram. Days Gone is set to launch on PC on May 18th, 2021.", "link": "https://www.youtube.com/watch?v=aGwz7MbHcwo", "date_published": "2021-05-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Hood: Outlaws & Legends Review", "description": "Hood gives you glimpses of a new and exciting multiplayer concept, but its many, many design flaws keep the game from delivering.\n\nHood: Outlaws & Legends is now available on PS5, PS4, Xbox Series X/S, Xbox One, and PC. You can read the full written Hood: Outlaws & Legends review by Mike Epstein on GameSpot.com: https://www.gamespot.com/reviews/hood-outlaws-legends-review-petty-theft/1900-6417675/", "link": "https://www.youtube.com/watch?v=TUjfORZ9WKI", "date_published": "2021-05-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Mass Effect - Legendary vs Original Graphics Comparison | Characters, Eden Prime, Citadel", "description": "Enjoy this comparison of the Mass Effect remaster to the 2007 original game.\n\nMass Effect Legendary Edition brings a whole lot of improvements to the original Mass Effect, especially in the graphics department. Nearly 14 years have passed since the game's release on the Xbox 360, and that means a whole lot of technical advancement has been applied to the game. With that in mind, we're taking a look at Mass Effect Legendary Edition and the original Mass Effect's PC release to see just how much the new remaster has improved on the original.\n\nThe video above lets you check out both versions of Mass Effect, sticking to the early portions of the game. We've got some direct comparisons of Mass Effect characters to show how lighting and textures have been improved. The comparison also extends to Eden Prime, the game's first combat mission, and the Citadel, where you'll spend some time talking with humans and aliens and advancing the story.\n\nWhile Mass Effect has seen a lot of technological improvements in the Legendary Edition, it's important to note that the story remains the same. You'll be playing through a smoother, better-looking version of the 2007 sci-fi RPG classic, but for all intents and purposes, this is the same game. As Jordan Ramée noted in his review in progress, the Legendary Edition brings an enhanced version of the original game that's a lot easier to play and looks a lot better, but it's not without its visual and gameplay quirks.\n\n00:00 - Intro\n00:47 - Tile Screen & Opening\n02:17 - Characters\n07:26 - Eden Prime\n10:53 - The Citadel", "link": "https://www.youtube.com/watch?v=04f9T0_xSX4", "date_published": "2021-05-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Mass Effect Legendary Edition Livestream", "description": "Join Lucy James and Tamoor Hussain as they play through the opening of the remaster of Mass Effect from the Legendary Edition.", "link": "https://www.youtube.com/watch?v=Anm5uKxI0I8", "date_published": "2021-05-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Total War: Warhammer 3 Hands On Battle Preview", "description": "Total War: Warhammer 3 is introducing new factions in Kislev, Cathay, Khorne, Nurgle, Slaanesh and Tzeench, but also bringing a new battle type to the franchise. So called \"Survival Battles\" are huge narrative beats in the campaign for Total War: Warhammer 3, as the player invades the realms of chaos in a battle type that is part skirmish, part tower defense. \n\nDo you like the idea of being able to build new units, walls and towers all while in a battle? What are your thoughts on Total War: Warhammer 3 so far? Let us know down below!", "link": "https://www.youtube.com/watch?v=7j3PXWUmv4g", "date_published": "2021-05-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "11 Minutes of Scarlet Nexus Preview Gameplay", "description": "Scarlet Nexus is the upcoming anime-style action RPG from Bandai Namco, and here are 11 minutes of brand new gameplay for you to check out!\n\nIn a futuristic world threatened by otherworldly monsters called 'Others', Scarlet Nexus sees you play as either Kasani or Yuito with the task of putting a stop to them. Each protagonist have different paths through the same story, and you can see both of them in action in the above gameplay.\n\nYou'll not be fighting along, as you'll be fighting alongside a merry band of anime boys and girls who are part of a special forces unit who can support you in combat encounters. But of course, there seems to be a deeper mystery to unravel in the main story.\n\nWe got out hands on with the game for about 3 hours, but the gameplay in the above video was provided by Bandai Namco. Scarlet Nexus is set to launch on June 25th for PC, Xbox Series X and S, Xbox One, PS5, and PS4.\n\nYou can check out our full preview right here - https://www.gamespot.com/articles/scarlet-nexus-anime-style-action-has-potential-but-hasnt-fully-impressed-yet/1100-6491378/", "link": "https://www.youtube.com/watch?v=Fb22V8tXwFw", "date_published": "2021-05-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Hilarious Battlefield Bugs & Glitches Compilation", "description": "With Battlefield 6 on the horizon we take a moment to reflect on some of the hilarious bugs and glitches that went on a rampage throughout the Battlefield games.", "link": "https://www.youtube.com/watch?v=gptfbke3lGk", "date_published": "2021-05-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Rarest Mass Effect Moments You Might Not Know About", "description": "Jean-Luc lists some of the rarest moments in the Mass Effect Trilogy that you might not have experienced in your playthrough.\n\nIntro:\nThere’s this side quest in the original Mass Effect where you must collect 16 ancient asari writings, which you do by scanning planets as well as landing on uncharted worlds and searching for them. It's an awful collection task quest, deathly boring to do even with a guide. The reward isn’t even all that great, being nothing but some measly experience points.  The saving grace being that because the whole thing is so meaningless, you can skip it without fear of missing out.\n\nHowever, in Mass Effect 3, there is a small side quest on the Citadel for Shepard stan Conrad Verner. Turns out that before Conrad devoted his life to worshiping the Commander, he wrote a doctoral dissertation on xenotechnology and dark energy integration and can help Shepard obtain some ancient tech, tech that happens to be written in ancient asari dialect. If you collected 10 of the 16 asari writings all the way back in Mass Effect 1, you get some special dialogue as well as a plus five bonus to your war assets.\n\nThis is one of those rare moments most players didn’t fully experience in their Mass Effect trilogy playthrough: Strange or unique outcomes that required you to do something either really obscure to get or because you made choices in the past that fall in-between the cracks of the series’ mortality system. Most players tend to play a pure pure paragon or renegade playthrough, but if you mix and match you get some pretty interesting consequences. In this video, I’m going to go through a few of my favourite rare Mass Effect outcomes.\n\nOriginally this video was really long, so if you have other moments you’d love to see, or have your own favourites, drop them in the comments below or like this video and subscribe so we know you want to see more. It goes without saying this video contains spoilers for the whole series, except Andromeda cause I don’t talk about that game.", "link": "https://www.youtube.com/watch?v=ru8LbcqbBFc", "date_published": "2021-05-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Ratchet & Clank: Rift Apart - The Final Preview (4K)", "description": "Ratchet & Clank: Rift Apart is shaping up to be a PS5 showpiece. Our in-depth preview delves into environments, weapons, and how Spider-Man shaped it.\n\nInsomniac showed some of the opening tutorial along with a big action set piece starring the new co-protagonist Rivet. The studio also shared loads of details on weapon and environment design, the influence of its other recent hit Spider-Man, and how it's using the DualSense to make the weapons feel better than ever. Check out the video to hear our impressions on all the new additions coming to Ratchet & Clank's (and Rivet's) next planet-hopping adventure.\n\nRatchet & Clank: Rift Apart will release exclusively for PlayStation 5 on June 11, 2021. For more coverage on Ratchet & Clank: Rift Apart, including our review, consider subscribing to GameSpot. You can also read the written preview by Steve Watts on GameSpot.com: https://www.gamespot.com/articles/ratchet-clank-rift-apart-is-ps5s-gorgeous-new-comfort-food/1100-6491353/", "link": "https://www.youtube.com/watch?v=AJmt7S6x298", "date_published": "2021-05-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]