[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Tiny Desk Meets globalFEST: Vox Sambou, Aditya Prakash Ensemble, Rachele Andrioli, Martha Redbone", "description": "January 13, 2021 | Bob Boilen\nThe Tiny Desk is teaming up with globalFEST this year for a thrilling virtual music festival: Tiny Desk Meets globalFEST. The online fest includes four nights of concerts featuring 16 bands from all over the world. From Monday, Jan. 11, through Thursday, Jan. 14, we’ll be streaming new performances at 8 p.m. ET on NPR Music’s YouTube channel and NPR.org. \n\nEvery January, I attend globalFEST at a New York City nightclub and see some of the most fantastic music I'll experience all year. Now, given the pandemic's challenges and the hardening of international borders, NPR Music and globalFEST is moving from the nightclub to your screen of choice and sharing this festival with the world. Each night, we’ll present four artists in intimate settings (often behind desks donning globes), and it's all hosted by African superstar Angélique Kidjo, who performed at the inaugural edition of globalFEST in 2004. \n\nFor the third night of the festival, we have Vox Sambou’s energetic Hatian funk from Montreal, Carnatic Indian music from Aditya Prakash Ensemble, a blend of old and new with Italian singer-songwriter Rachele Andrioli, and an expansion and exploration of American Roots music from globalFEST alum Martha Redbone.\n\n0:00 INTRO\n1:07 VOX SAMBOU\n17:01 ADITYA PRAKASH ENSEMBLE\n32:51 RACHELE ANDRIOLI\n48:45 MARTHA REDBONE\n\nBelow you’ll find short descriptions about each act, written by the globalFEST team.\n\nVOX SAMBOU\nThere are few performers as “alive” as Vox Sambou, whose energy and soul transcends the virtual space. He starts his performance at Tiny Desk Meets globalFEST with a short moment between himself and his son, overseen by a painting of his mother, highlighting the ways we pass down traditions from generation to generation. Based in Montreal, Quebec, Vox Sambou writes and performs in Hatian-Creole, French, English, Spanish and Portuguese. His music is a joyous fusion of Haitian funk, reggae and hip-hop. \n\nSET LIST\n\"African Diaspora\"\n\"My Rhythm\" \n\"Everyone\"\n\nADITYA PRAKASH ENSEMBLE\nPerforming from their home base in Los Angeles, Aditya Prakash Ensemble highlights songs borne from South India's Carnatic tradition. Aditya uses his voice as an instrument to tell powerful, emotive stories -- which he reimagines in a fresh, dynamic way.  Aditya Prakash Ensemble’s modern take on traditional music mixes in jazz and hip-hop and features a diverse L.A. ensemble.\n\nSET LIST\n\"Greenwood\"\n\"Vasheebava\" \n\"Payoji\"\n\nRACHELE ANDRIOLI\nRecording from southern Italy, Rachele Andrioli’s performance highlights her mix of old and new, of traditional music and modern technology. Her trance vocals and loop pedals create a sound all her own, mixing music from Italian, Indian, Lebanese, Albanian and Romani cultures and traditions.\n\nSET LIST\n\"Te Spettu\"\n\"Pranvera Filloi Me Ardh\"\n\"Ederlezi\"\n\nMARTHA REDBONE\nhttps://www.martharedbone.com/\nMartha Redbone performs her Tiny Desk Meets globalFEST performance from her home studio in Brooklyn’s Navy Yards. Native and African-American singer-songwriter Martha Redbone is known for her mix of folk, blues and gospel from her childhood in Harlan County, Ky., which she  infuses with the eclectic grit of pre-gentrified Brooklyn. Inheriting the powerful vocal range of her gospel-singing African-American father and the resilient spirit of her mother’s Cherokee, Shawnee and Choctaw culture, Redbone broadens the boundaries of American Roots music. \n\nSET LIST\n\"The Garden of Love\"\n\"Talk About It\"\n\"Underdog\" \n\n---\n\nTINY DESK TEAM \nProducer: Bob Boilen \nVideo Producer: Morgan Noelle Smith\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Kara Frame, Maia Stern\nExecutive Producer: Lauren Onkey \nSenior VP, Programming: Anya Grundmann \n\nGLOBALFEST TEAM \nCo-Directors: Shanta Thake, Isabel Soffer, and Bill Bragin\n2021 Curators: Shanta Thake, Isabel Soffer, Bill Bragin, and Viviana Benitez\nEvent Producer: Ian Thake \nHost: Angélique Kidjo\nSocial Media Manager: Valerie French\nPublicity: Brendan Gilmartin, Chart Room Media \nLegal Services: Tamizdat\nLegal Services: Duane Morris\nProducer: THE OFFICE performing arts + film \nVideo Production: MODEMA Studios \n\nTHE OFFICE performing arts + film consists of Diane Eber, Rachel Chanoff, Laurie Cearley, Olli Chanoff, Erica Zielinski, Gabrielle Davenport, Catherine DeGennaro, Noah Bashevkin, Lynn Koek, Bruna D'Avila, Chloe Golding, Kyla Gardner, Zion Jackson, Tess Peppis, Scout Eisenberg \n\nMODEMA Studios consists of Jammal Lemy (director and editor), Matt Deitsch (producer), Theo Braun (audio), and Gary Blake (editor) \n\nSpecial Thanks: Joshua Feigenbaum, Mona Golub, Steven Kirkpatrick, Daniel C. Smith, Ken Umezaki \n\nglobalFEST 2021 funders include The Andrew W. Mellon Foundation, National Endowment for the Arts, NYC Department of Cultural Affairs, The Québec Government Office in New York", "link": "https://www.youtube.com/watch?v=1sdOIpRJuvE", "date_published": "2021-01-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Tiny Desk Meets globalFEST: Minyo Crusaders, Hit La Rosa, Natu Camara, Emel", "description": "January 12, 2021 | Bob Boilen\nThe Tiny Desk is teaming up with globalFEST this year for a thrilling virtual music festival: Tiny Desk Meets globalFEST. The online fest includes four nights of concerts featuring 16 bands from all over the world. From Monday, Jan. 11, through Thursday, Jan. 14, we'll be streaming new performances at 8 p.m. ET on NPR Music's YouTube channel and NPR.org.\n\nEvery January, I attend globalFEST at a New York City nightclub and see some of the most fantastic music I'll experience all year. Now, given the pandemic's challenges and the hardening of international borders, NPR Music and globalFEST is moving from the nightclub to your screen of choice and sharing this festival with the world. Each night, we'll present four artists in intimate settings (often behind desks donning globes), and it's all hosted by African superstar Angélique Kidjo, who performed at the inaugural edition of globalFEST in 2004.\n\nOn Tuesday night, we have Minyo Crusaders' new spin on Japanese folk music, Peruvian cumbia music from Hit La Rosa, Natu Camara's combination of West African soul, rock and pop music, and Tunisian singer and activist (and globalFEST Alum) Emel.\n\n0:00 INTRO\n2:24 MINYO CRUSADERS\n24:05 HIT LA ROSA\n41:01 NATU CAMARA\n58:55 EMEL\n\nBelow you'll find short descriptions about each act, written by the globalFEST team.\n\nMINYO CRUSADERS\nMin'yō folk music was originally sung by Japanese fishermen, coal miners and sumo wrestlers hundreds of years ago, and the Minyo Crusaders are on a mission to make these songs relevant to an international audience. For their performance, the Crusaders found a unique take for their desk: a \"kotatsu,\" which is a heated Japanese table traditionally used for gathering in the winter months.\n\nSET LIST\n\"Hohai Bushi\"\n\"Yasugi Bushi\"\n\"Aizu Bandaisan\"\n\n-\n\nHIT LA ROSA\nFrom the candle-lit home of their lead singer, Hit La Rosa comes in hot and doesn't stop until the final measure. The band explores the many facets of Peruvian cumbia music, infusing it with pop music, folklore, jazz and dancehall to produce its distinctive grooves and hooks. The band's precise-yet-dreamlike music and punk sensibility all come together to make music that explores life's shadowy sides. Despite living through a political crisis in Peru, the band brings a message of hope and joy in the midst of struggle and upheaval.\n\nSET LIST\n\"La Montañita\"\n\"La Marea\"\n\"Salvia\"\n\n-\n\nNATU CAMARA\nFrom a studio space in Brooklyn, Guinean native Natu Camara mixes West African soul, rock and pop music. As a builder of inter-cultural bridges, Camara uses her songs to bring people together, weaving a tapestry of musical stories and visions of her beloved home.\n\nSET LIST\n\"Ka Hirdé\" - Intro\n\"Waa\"\n\"Dimedi\"\n\"Arabama di\"\n\n-\n\nEMEL\nTunisia-born singer Emel first performed at globalFEST in 2015, the same year she performed her song of Tunisian Revolution, \"Kelmti Horra,\" at the Nobel Peace Prize Concert. Emel was hailed by NPR as a \"21st century catalyst for change.\" She created her latest album, The Tunis Diaries, equipped with only a laptop, tape recorder and a crowdsourced guitar after she was unexpectedly quarantined in her childhood home in Tunis last spring.\n\nSET LIST\n\"Holm\"\n\"Everywhere We Looked Was Burning\"\n\n\n-\n\nTiny Desk Meets globalFEST\n\nTINY DESK TEAM\n\nProducer: Bob Boilen\nVideo Producer: Morgan Noelle Smith\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Kara Frame, Maia Stern\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann\n\nGLOBALFEST TEAM\n\nCo-Directors: Shanta Thake, Isabel Soffer, and Bill Bragin\n2021 Curators: Shanta Thake, Isabel Soffer, Bill Bragin, and Viviana Benitez\nEvent Producer: Ian Thake\nHost: Angélique Kidjo\nSocial Media Manager: Valerie French\nPublicity: Brendan Gilmartin, Chart Room Media\nLegal Services: Tamizdat\nLegal Services: Duane Morris\nProducer: THE OFFICE performing arts + film\nVideo Production: MODEMA Studios\n\nTHE OFFICE performing arts + film consists of Diane Eber, Rachel Chanoff, Laurie Cearley, Olli Chanoff, Erica Zielinski, Gabrielle Davenport, Catherine DeGennaro, Noah Bashevkin, Lynn Koek, Bruna D'Avila, Chloe Golding, Kyla Gardner, Zion Jackson, Tess Peppis, Scout Eisenberg\n\nMODEMA Studios consists of Jammal Lemy (director and editor), Matt Deitsch (producer), Theo Braun (audio), and Gary Blake (editor)\n\nSpecial Thanks: Joshua Feigenbaum, Mona Golub, Steven Kirkpatrick, Daniel C. Smith, Ken Umezaki\n\nglobalFEST 2021 funders include The Andrew W. Mellon Foundation, The National Endowment for the Arts, NYC Department of Cultural Affairs, The Québec Government Office in New York", "link": "https://www.youtube.com/watch?v=RyBMNprEeQM", "date_published": "2021-01-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]