[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Cyberpunk 2077: Updates, Free DLC, Next-Gen Versions", "description": "Projekt Red's co-founder Marcin Iwinski has issued an apology for Cyberpunk 2077’s buggy launch, in particular on PS4 and Xbox One. Lucy, Jake, and Jean-Luc break down their new roadmap, including upcoming patches, free DLC, refunds, and PS5 and Xbox Series X versions. \n\nIt’s pretty common knowledge that Cyberpunk 2077 had a less than perfect launch, with many players encountering a number of bugs during their playthroughs, whether they played on PC on console. However, no group suffered more than those on PS4 and Xbox One, who encountered everything from huge frame rate drops and low textures to unsightly glitches and abrupt crashes. CD Projekt Red co-founder Marcin Iwinski has issued an apology, an explanation, and a roadmap for the future. \n\nIn the video above, Lucy James, Jean-Luc Seipke, and Jake Dekker dissect CD Projekt Red’s apology and help unpack what went wrong with Cyberpunk 2077’s launch. Much of the issues with the PS4 and Xbox One versions of the game were due to the streaming technology used, according to Iwinski, and the ambitious nature of the game led to difficulties adjusting this aspect of the game for last-gen consoles. \n\nIwinski also gave updates about upcoming free DLC and future patches to fix bugs in the game, as well as the free PlayStation 5 and Xbox Series X/S upgrades coming in the second half of the year. For a deep dive into the apology, check out the video above, and make sure to subscribe to youtube.com/GameSpot for all the latest updates. \n\n00:00 - Intro\n01:11 - Why is there such a gap between the PC and console versions of Cyberpunk 2077?\n03:55 - Testing didn't show any of the console version issues?\n06:27 - Updates Roadmap (Patches, Next-Gen Console Update, etc.)\n07:20 - CD Projekt Red has a newfound commitment to avoiding crunch\n08:55 - Free DLC coming to Cyberpunk 2077\n09:45 - Cyberpunk 2077 refunds\n11:02 - Outro", "link": "https://www.youtube.com/watch?v=jXzFG5gHB9M", "date_published": "2021-01-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New Pokémon Snap Trailer", "description": "New Pokémon Snap arrives on April 30!", "link": "https://www.youtube.com/watch?v=r8iU8zEr7r8", "date_published": "2021-01-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Worst Game Launches Of All Time", "description": "Bugs and glitches and crashes, oh my! In lieu of Cyberpunk 2077 releasing in a messy state, we look back, and round up other notoriously rough video game launches.\n\nEvery once in a while a game comes out that happens to launch in pretty rough shape. Quite often, the game is updated over time and eventually reaches a much more playable state. But those who first picked up the game at launch can be left feeling like they paid full price for a game still in early access.\n\nKurt Indoniva details 11 such games. A few were so bad, their legacy continues to live on--we're talking games like Assassin's Creed Unity and Fallout 76, titles that are often used as a comparison point for when new games have rough launches. \n\nOthers, such as No Man's Sky and Star Wars: Battlefront II, have managed to somewhat overcome the memory of what they once were, with their respective studios patching them in experiences that are largely viewed with a positive lens now. And then there are very recent releases, like Anthem and Cyberpunk 2077, which haven't had the chance to showcase whether they'll be successful after their disastrous launches.\n\nAs you may have noticed, most of the games in this list are fairly recent. 2012's Diablo III is the oldest of the bunch. This isn't our way of saying that games only have bad launches now and they all released in perfect condition back in the day--far from that. But the most prominent launch disasters have all occurred within the last decade.", "link": "https://www.youtube.com/watch?v=l2pxxiqALW8", "date_published": "2021-01-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Cyberpunk 2077 Our Commitment to Quality", "description": "CD Projekt co-founder Marcin Iwiński gives a personal explanation of what the days leading up to the launch of Cyberpunk 2077 looked like. In addition, he shares the studio's perspective on what happened with the game on previous generation consoles and speaks on what Cyberpunk 2077's roadmap looks like for 2021.", "link": "https://www.youtube.com/watch?v=x85OX9yVkOg", "date_published": "2021-01-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Star Wars Jedi: Fallen Order Optimized Xbox Series X Gameplay", "description": "Star Wars Jedi: Fallen Order has recently dropped an optimization update to create postprocessed 4k 30fps, and 1080p 60fps gameplay for the Xbox Series X|S, and the PlayStation 5.\n\nWhile we're waiting for new PlayStation 5 and Xbox Series X|S games to launch, there's plenty of time to revisit some favorites on the PlayStation 4 and Xbox One. Luckily for us, developers are optimizing those games for the brand-new consoles.\n\nStar Wars Jedi: Fallen Order is one of those titles, and has received a next-gen optimization update. The new update improves framerate and dynamic resolution ranges on the Xbox Series X|S as well as the PlayStation 5. The update also improves post-processing resolution on the Series X and PS5 but not the Series S. \n\nIn the video above, we play Star Wars Jedi: Fallen Order on an Xbox Series X first running in 4k Postprocessing Mode and then in 1080p 60fps Performance Mode.\n\nStar Wars Jedi: Fallen Order, developed by Respawn Entertainment, is out now for PC, PS4, PS5, Xbox One, Xbox Series X|S, and Stadia.\n\n0:00 4k Postprocessing Mode\n4:47 1080p 60fps Performance Mode", "link": "https://www.youtube.com/watch?v=RnIY5OORgUQ", "date_published": "2021-01-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]