[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "I've used KDE exclusively for a month, here's my opinion - KDE Plasma Review", "description": "The first 1000 people to use the link will get a free trial of Skillshare Premium Membership: https://skl.sh/thelinuxexperiment04211\n\nI've been using Manjaro KDE on my new Slimbook desktop for a month now, so here are my conclusions.\n\nBecome a channel member to get access to a weekly patroncast and vote on the next topics I'll cover:\nhttps://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nSupport the channel on Patreon: \nhttps://www.patreon.com/thelinuxexperiment\n\nFollow me on Twitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\nFollow me on ODYSEE: https://odysee.com/@TheLinuxExperiment:e\nOr join ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\nThe Linux Experiment merch: get your goodies there! https://teespring.com/en-GB/stores/the-linux-experiment\n\n\nI used Manjaro KDE for the past month. I applied a bunch of tweaks to it, from using Latte Dock to achieve a look and feel I liked, to changing the widget theme, the position of window controls, making windows appear centered, and other small tweaks here and there.\nIf you want to achieve a similar look, you can follow a video from linux Scoop, I left a link in the description below. I didn't apply everything he did there, I mainly took the Latte Dock and plasma themes.\n\nNow that this is out of the way, let's begin with what I liked about KDE Plasma.\n\nhttps://www.youtube.com/watch?v=qTF9Nmt3iXY\n\n## What I liked\nApart from completely changing the layout, the number of small things you can change is just amazing: from how the task manager looks and behaves, to which notification icons you want to see and when, or the clock style, you can really change everything you want.\n\nI also enjoy the widget system, that you can add to your desktop. I added my Video folder, and a few system monitoring ones,, but that's just the tip of the iceberg here. There are hundreds of widgets you can download from the Plasma, let's call it \"store\" for lack of a better word. \nIt was nice to rediscover notification icons, especially how they've been integrated in plasma. They all feel part of the same interface, which is rare. Usually, you get a disjointed collection of icons of varying shapes, sizes and colors, but here, they're all looking nice and similar, and I must admit I had missed them quite a lot on elementary OS.\n\nHaving a full-featured menu is also very refreshing. It's not just a list of apps, or categories, you also get access to your favorite folders, your recent files history, and, more importantly, it has file search. \n\nAnother thing that I missed, is KDE Connect. I used it on elementary OS, but there is no way to really integrate it, especially since the elementary OS notification system doesn't really support actionable notifications, so there was no way to answer messages, or share files, so it was a glorified remote control.\n\n## What I don't like\n\nOf course, not everything is roses and rainbows. There are things that I don't really like about KDE as a desktop environment.\n\nThe default theme, in light mode, is pretty bland and looks a bit old, especially the buttons. I'm using the daark theme which kinda resolves the issue, but the default applications theme really needs an update, in my opinion.\nMy main issue here is with applications. The default suite of applications in KDE is very inconsistent. On the one hand, you have apps that have really simple defaults, and a lot of power under the hood if you need it, like Dolphin. On the other hand, you have applications that really want you to see every single feature, panel, and option available, right out of the box, like the Calendar.\n\nThere also seem to be a less sizable community developing KDE apps as on GNOME or elementary OS. A lot of the apps are pretty old, and look it, like Korganizer, or Kmail. I couldn't find a todo list application along the lines of Getting Things GNOME or Planner. I couldn't find an equivalent to Audacity for the KDE desktop. \n\nOf course, you can always install non-KDE apps on KDE, and that's what I did, with the GIMP, Planner, or Audacity.\n\nAnd that's where KDE grabs the advantage again: it integrates GTK apps a lot better than GNOME integrates Qt apps. The fact that you can choose any theme you want for GTK apps under KDE is great, because it means these things will look a lot better integrated, and not feel so alien.\nUsing KDE apps on GNOME or Elementary OS is a weird experience, as they really don't look or feel native, but GTK apps on KDE feel just at home.\n\nNow I praised the avalanche of settings before, and I'm not going to apologize for it, but it's also a bit of a hassle sometimes to find a specific thing you're looking for.", "link": "https://www.youtube.com/watch?v=aVTvG1YYEJk", "date_published": "2021-04-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]