[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "COD WW2 Could Give Battlefield 6 the Edge", "description": "Call of Duty's rumored return to WWII is leaving series' fans with mixed emotions. Will Battlefield 6's reportedly futuristic setting help it take the throne in 2021?\n\nTimestamps:\n00:00 - Intro\n00:28 - Verdansk goes 80s? \n04:17 - What's Going on With Zombies? \n06:11 - Back to WWII?\n09:45 - Can BF Do Better?\n11:35 - Good News & Your Comments \n\nAaron Sampson and Richie Bracamonte are here to talk about the COD’s rumored return to World War II. This can be to the detriment of burnt-out Call of Duty fans, but could also lead to more interest in Battlefield 6. Rumored to take place in the 2030s and feature Battlefield 3-style multiplayer, die-hard Modern Warfare 2019 fans may have a place to call home in 2021. In the past few months, strange and seemingly dying support from Infinity Ward has left fans puzzled. New weapons like the RAAL Light machine gun and the CX-9 submachine gun have been halfway added into some game modes, and 3 new maps were quietly added in only to be removed days later. \n\nAnother leak has surfaced revolving a new Warzone experience. An unfinished trailer leaked that shows off an 80s version of Verdansk. Strangely, it appeared to feature some assets from Cold War: Prominently the Duga 2 array from the game’s optional final mission. Aaron discusses his theories on how we’re going to find ourselves in the 1980s. It definitely takes some suspension of disbelief and of course, time traveling zombies. But since nuclear weapons don’t cause time travel, there’s more to unpack than you might think. \n\nSince zombies seem to be the glue holding the MW and Cold War together, Richie reflects on his fond memories of older zombies maps. As much as he cherishes them, he admits how much harder they were to survive. If you’re enjoying these chats about Call of Duty, speak up! Your comments can lead to more discussions about future COD topics and have a chance to be featured in a future episode!", "link": "https://www.youtube.com/watch?v=JCHVgwsWX2I", "date_published": "2021-04-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Age of Empires: Fan Preview Livestream", "description": "Tune for surprises, reveals, new gameplay civilizations and campaigns, and much more Age of Empire first-looks. The stream begins on Saturday, April 10th at 9am PT/ 12pm ET.", "link": "https://www.youtube.com/watch?v=8vALjV1pkqE", "date_published": "2021-04-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Metro Franchise Guns", "description": "If you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can purchase Jonathan's book here - https://www.headstamppublishing.com/bullpup-rifle-book", "link": "https://www.youtube.com/watch?v=XKRTkZOFiuk", "date_published": "2021-04-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "How Awful Can You Be In Disco Elysium?", "description": "In this video, Jake breaks down his experience of playing as the worst detective there is in Disco Elysium.", "link": "https://www.youtube.com/watch?v=5xijCtokEK4", "date_published": "2021-04-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]