[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Alan Wake Remastered vs Original | Graphics Comparison", "description": "See how the original Xbox 360 release of Alan Wake stacks up the 2021 remastered version running on PS5.\n\nRemedy Entertainment's beloved game Alan Wake returns on modern systems with Alan Wake Remastered. Originally an Xbox 360 exclusive back in 2010, the game has since seen a PC port and now a proper remaster.\n\nRemastered is the same game but with a host of visual improvements. A major one of note is the reworking of character models and improved facial expressions. You can see a marked improvement in lip sync, and Alan no longer spends half the game with his mouth agape, the silliness of which I never noticed until comparing him side by side with his updated model. Alan might look drastically different to fans in fact--this is due to a new face model being created for this remastered version. However, Alan is still portrayed by finnish actor, Ilkka Villi just like in the original, and if anything he more closely resembles him with the updated model.\n\nThis updated look for Alan Wake might have the benefit of bridging the gap to a potential Alan Wake sequel. Remedy has been hinting at a return to Alan Wake for several years now, most recently with the final DLC for Control, which confirms both games share the same universe and even has Alan make several small appearances. The remastered version of Alan Wake has its own secrets that hint at the future of the series, so keep an eye on GameSpot for more details.", "link": "https://www.youtube.com/watch?v=uVkUnJ7U-YI", "date_published": "2021-10-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Far Cry 6 - 12 Minutes of Boat Stealth and Shootout Gameplay", "description": "See some early story mission gameplay of Far Cry 6 featuring some stealth infiltration before everything turns into a full blown shootout. Check out the Libertad Rises mission which will unlock the rest of the map once you've finished it. The gameplay was captured on PC in 1440p.\n\nIn Far Cry 6, play as a local Yaran and fight using over the top guerrilla tactics and weaponry to liberate your nation.\n\nFar Cry 6 will be releasing on Amazon Luna, Microsoft Windows, PlayStation 4, PlayStation 5, Xbox One, Xbox Series X/S, and Stadia on October 7, 2021.\n\n#Farcry6", "link": "https://www.youtube.com/watch?v=c-1EeRM8oTk", "date_published": "2021-10-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Far Cry 6 Early Access Livestream With The Giant Bomb Crew", "description": "Lucy joins up with Jan, Rorie, and Jeff Bakalar from Giant Bomb to check out the early part of Far Cry 6. Get a look at some of the early hours of the game and enjoy the company. \n\nIn Far Cry 6, play as a local Yaran and fight using over the top guerrilla tactics and weaponry to liberate your nation.\n\nFar Cry 6 will be releasing on Amazon Luna, Microsoft Windows, PlayStation 4, PlayStation 5, Xbox One, Xbox Series X/S, and Stadia on October 7, 2021.\n\n#farcry6", "link": "https://www.youtube.com/watch?v=e1NSmb3mf9k", "date_published": "2021-10-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Nintendo Switch's Lack of Wii Sports is a Crime", "description": "Wii Sports is as vital to Nintendo's history as Mario, Zelda, and Pokemon, and yet it is criminally absent from the Switch.\n\nWii Sports is the best-selling console exclusive, and fourth highest selling game of all time just behind Tetris, Grand Theft Auto 5, and Minecraft. It's responsible for putting Nintendo front-and-center in mainstream media, and helping catapult the Wii's sales ahead of the Xbox 360 and PlayStation 3. There is no denying Wii Sports' importance to Nintendo's success, and yet it's been missing for nearly a decade.\n\nWith the exception of the haphazard release of Wii Sports Club for the Wii U, Wii Sports' legacy is slipping to the sands of time, which all more offensive when considering all the pieces to give it life are on the Nintendo Switch. \n\nJoin Kurt Indovina, as he traces back Wii Sports' impact on culture, its importance to Nintendo's success, and how the game holds up 15 years later.", "link": "https://www.youtube.com/watch?v=w5c9PSSPtFE", "date_published": "2021-10-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "25 MORE Things You STILL Didn't Know In Zelda Breath Of The Wild", "description": "Returning with more secrets that you probably don't know about in Breath of the Wild! This time we dive into what heart containers are made of, the highest damage amount you can do in the game, lifting ingredients in your hands, and much more!\n\nIn the video above, we cover 25 tips and tricks that aren’t quite as well known, ranging from secrets to glitches, some that are pretty simple and others that are fairly complex. Breath of the Wild has been out for four years at this point, and players have found some amazing things, intended or not, that keep the game and its sense of discovery feeling fresh.\n\n0:00 Intro\n0:15 Satoru Iwata's Moon Phase\n0:31 Protect This Precious Pup\n0:46 Stal Horses Somehow Eat\n0:59 Master Sword Beam Durability\n1:17 Master Sword Beam Cutting\n1:28 Octoroks Can Throw Boomerang\n1:36 Spear Attack Special Animation\n1:47 Master Cycle Inspirations\n2:09 Is The Master Cycle Accurate?\n2:40 Pokeball Master Cycle Scrapped\n2:56 Sneak Into Gerudo Town\n3:15 Ricochet Thrown Objects\n3:31 Shock Balls Cancel Windcleavers\n3:36 Hold And Float Items\n3:54 Super Updrafts\n4:15 Korok Holes\n4:25 What Heart Containers Are Made Of\n4:34 Parry Backwards\n4:52 How To Do 1,180,000 Damage\n5:35 Luminous Talus' Are Bugged\n5:56 Nintendo's Arrow Crafting Recipes\n6:11 Kass' Instrument\n6:30 Rito Village Floors\n6:46 Chest Opening Animations\n7:05 Dueling Peaks Stable Secret\n7:31 Outro", "link": "https://www.youtube.com/watch?v=aQI7S8TbUBo", "date_published": "2021-10-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Revisiting The Original Metroid", "description": "With Metroid 5, aka Metroid Dread, right around the corner is it worth starting all the way back at the first entry in 2021?\n\nMetroid was released on the Famicom in Japan on August 6th, 1986, and then August 1987 on the NES in North America. The game follows Samus Aran, the best space hunter in the galaxy, on her mission to defeat the Metroid and destroy the Mother Brain. Metroid’s unique design has gone on to inspire the Metroidvania genre as seen in games like Hollow Knight and Axiom Verge, and it’s also among the first games to feature a female protagonist, so it’s definitely an important one in the history of video games.\n\nBut how is the original Metroid in 2021? Should you go back to it in the leadup to Metroid Dread? Hopefully this video will help answer that question, and the answer might not be what you think it is. Regardless, the original NES Metroid is currently available through Nintendo Switch Online making it easy to try out if you’re interested in doing so.\n\nSomething even I didn’t realize before Dread’s announcement is that each of the 2D Metroid games is a numbered entry and one continuous story. There’s the original NES Metroid and it’s remake Zero Mission, Metroid II: Return of Samus and it’s remake Samus Returns, Super Metroid which is Metroid 3, and Metroid Fusion which is Metroid 4. Unfortunately if you want to play Metroid 2 & 4 you’ll need to own a Nintendo 3DS and Wii U. I always knew owning a Wii U would be cool one day.\n\nMetroid NES Map: https://nesmaps.com/maps/Metroid/MetroidCompleteMapBG.html\n\nMetroid Instruction Booklet: https://www.nintendo.co.jp/clv/manuals/en/pdf/CLV-P-NAAQE.pdf\n\nChalk Font: https://www.dafont.com/chalk.font\n\nRevisiting The Original No More Heroes: https://youtu.be/wSVXloMQXGY\n\nMore Metroid videos:\nThe Complete Metroid Timeline Explained: https://youtu.be/SrCFB-jxPVg\nThe Metroid Franchise - Which Are Worth Playing/Buying?: https://youtu.be/04aibjsKiXo\nMetroid Dread's Tension Is Relentless | Hands-On Preview: https://youtu.be/Gy9LZ2sSnHM\nMetroid Dread - 5 Minutes of Off-Screen Gameplay: https://youtu.be/HzrGWR4cgt0\nMetroid Dread Review: https://youtu.be/mYFZwzo7qlQ", "link": "https://www.youtube.com/watch?v=3FCtAdnjK7M", "date_published": "2021-10-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]