[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Sech: Tiny Desk (Home) Concert", "description": "From Sept. 15 through Oct. 15, Tiny Desk is celebrating Hispanic Heritage Month with an \"El Tiny\" takeover of the (home) concert series, featuring J Balvin, Camila Cabello and several more musicians from all corners of Latinidad.\n\nStefanie Fernández | October 4, 2021 \nThe first florid trills of piano wash in, and Sech is here to celebrate reggaetón in its home. The scene: the light-soaked Biblioteca de la Autoridad del Canal de Panamá Roberto F. Chiari.\nSech arrives with a book he places on the table. His blazer bears his name, the isthmus of Panama and its flag, and the likeness of Panamanian Yankee great Mariano Rivera and his jersey number, 42 (the namesake of Sech's most recent album). He approaches the mic for a silky version of \"Playa\" that, like the rest of his Tiny Desk set, is nearly entirely acoustic.\n\nSech's discography is itself a place of learning for the Latin pop industry he has reinvigorated. The history of reggaetón often dwells disproportionately on Puerto Rico in the 1990s, overshadowing its creation by Black Panamanians in the 1980s with plena and reggae en español, born from Jamaican reggae and dancehall and iterated in Río Abajo, Sech's hometown in Panama City. \"Otro Trago\" introduced Sech's honeyed, melodic vocal range as a promising young player in an industry enamored with its own reductive powers. In Sech's hands, reggaetón is given the care of a people's history.\n\nMusic fills every corner of the library, from the violin-DJ-bass trio nested in the second-floor balcony, to the background vocals, keys and drums (anchoring the whole thing in lush, acoustic dembow), to Sech and his guitarist and producer Jhon el Divertido in the forefront. The sterile fluorescents among the stacks shift to disco lighting for the bitter ex-text \"911,\" which eventually melts into an a cappella chorus. It ends on a melancholy violin riff that blooms seamlessly into the jazzy opening of \"Sal y Perrea.\" Sech might be singing about stalking an ex's social media or pointing a newly single woman toward tequila to forget some payaso, but his modern textbook feels timeless in this hybrid arrangement, showing — as well as telling — the story of dembow and its power to heal.\n\nSET LIST\n • \"Playa\"\n • \"911\"\n • \"Sal y Perrea\"\n\nMUSICIANS\n • Sech: vocals\n • Michael Ward: DJ\n • Abdiel Morales: drums\n • Rasta Lloyd: bass\n • Jhonattan Reyes: guitar\n • Omar Perez: vocals\n • Anabel De Jesus: vocals\n • Marie Camille Alerte: vocals\n • Florlenz Alerte: vocals\n • Julio Montes: vocals\n • Joshue Ashby: violin\n\nCREDITS\n • Video: Moises Morales, Andrés González\n • Audio: Guillermo \"Memo\" Bailey, Ramón González, Eduardo \"Cerebro\" Fernandez\n • Gaffer: Guillermo Yanguez\n • Grip: Eric González\n • Assistant Camera: Antonio Zaenz, Abdiel González\n • Backline: Ricardo \"Yoshi\" Castillo\n\nTINY DESK TEAM\n • Producer: Anamaria Sayre\n • Video Producer: Maia Stern\n • Audio Mastering: Josh Rogosin\n • Alt.Latino 'El Tiny' Team: Felix Contreras, Reanna Cruz, Anaïs Laurent, Stefanie Fernandez\n • Tiny Production Team: Bob Boilen, Bobby Carter, Kara Frame, Sofie Hernandez-Simeonidis\n • Executive Producer: Keith Jenkins\n • Senior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #eltiny #sech", "link": "https://www.youtube.com/watch?v=jdHPotMqv1M", "date_published": "2021-10-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Jhay Cortez + Buscabulla: Una Conversación Con Alt.Latino", "description": "We kicked off our Hispanic Heritage Month live interviews with a joint interview between reggaetón artist Jhay Cortez and electronic duo Buscabulla. Host Felix Contreras talked to the three artists about their music, collaboration, and the free-flowing creativity of artistry on the island.\n\n#eltiny #jhaycortez #buscabulla", "link": "https://www.youtube.com/watch?v=ZaxR9EQJLS8", "date_published": "2021-10-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]