[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "Using Linux at work - KDE Edition", "description": "Improve your VM patching workflow with QEMUCare: https://tuxcare.com/live-patching-services/qemucare/#features\n\nGet your Linux desktop or laptop here: https://slimbook.es/en/\n\nThis is an update on the Linux at work series I started a while ago! At the time, I was using elementary OS on a Huawei matebook 13, to work as a Product Owner. Since then, remote work became a lot more prevalent, and I also changed distros, and laptops, so let's see how I'm making Linux and KDE work as my primary OS, on my laptop, and desktop!\n\nBecome a channel member to get access to a weekly patroncast and vote on the next topics I'll cover:\nhttps://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nSupport the channel on Patreon: \nhttps://www.patreon.com/thelinuxexperiment\n\nFollow me on Twitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\nFollow me on ODYSEE: https://odysee.com/@TheLinuxExperiment:e\nOr join ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\nLinux Scoop video for the Edna Theme: https://www.youtube.com/watch?v=qTF9Nmt3iXY\n\n\n## What I do\nLet's begin with what I do: I'm a product owner, which means I'm basically a specification writer, tester, and planner all at once. I have to plan our development sprints in advance, write the specifications that our developers will follow to code what we need on our apps and websites, and work with our graphics designer to make nice mockups of the new features.\n\nThis means I need a versatile system that can let me multitask easily, and has a wide variety of applications.\n\n## What I use at home\nSo there are 2 parts for what I use: I work from home 3 days a week, and at the office the other 2 days. Which means I have 2 setups: one with my laptop, and one with my desktop.\n\nLet's start with the one you guys might be more familiar with: the desktop.\n\nIt's the same hardware I use to run the channel: my Slimbok Kymera desktop, with a ryzen 7 5800X CPU, an RTX 3070, 32Gb of RAM, and 2Tb of SSD. It's plugged in to my LG 35' ultrawide, with a 1440p resolution and 100hz refresh rate. On top of that, I use an MX Master 2S, and the slimbook RGB Keyboard.\n\nIn terms of software, the desktop runs Manjaro KDE. It's heavily customized: I use latte dock to add a dock at the bottom of the screen, and a top panel with the applications menu, a global menu bar, the date and time, and the indicators.\n\nI use the Edna theme for Kvantum and plasma, with the inverse-blue icons, and I switched my titlebar buttons to have close and minimize on the left, and maximize on the right.\n\nThis layout is great on an ultrawide screen like this one: all my apps are centered on the dock, so they're super easy to reach, and if the menubar doesn't take space on each of my window, it's hidden on the top bar, where I can just fling my mouse up and access it when I need to, which is very rarely.\n\nI use 2 KDE activities. If you're not familiar with these, they basically give you multiple sets of virtual desktops you can use, with different wallpapers, widgets and applications.\n\nI have my \"default\" activity, which is the one I use when I'm working on the channel, gaming, or just doing unproductive stuff on the internet.\n\nAnd I have my \"Work activity\", where I do, well, all things related to my day job.\n\nOn the default activity, I have a few widgets related to my computer's performance, and the weather.\n\nOn the work activity, I have a less colorful, simpler wallpaper, and different widgets:\n- A color picker\n- a calculator\n- A network speed monitor\n- A sticky note widget\n\n## What I use at the office\n\nNow, let's see what the office setup looks like.\nI use a Slimbook Pro X 14, which is a fantastic laptop I just got, decked out with my logo on the back and on the super key. It has an 8 core Ryzen 7 4800H, with integrated vega graphics, 16Gb of RAM, and 256Gb of SSD. It's fast, responsive, has about 6 to 7h of battery life, and I can even play some games on my lunch break, which is a nice plus.\n\nThe display is 1080p, which is just the right size for a 14'' laptop, and it has really good viewing angles, and a nice port selection, with 3 USB ports, and ethernet jack, a full HDMI port, an audio jack, and a USB C port.\n\nThis laptop is plugged in to an external display, wich is a basic Iiyama 23 inch 1080p screen, and I use a super janky black usb mouse, with an apple bluetooth keyboard.\n\nIn terms of software, the laptop runs KDE Neon. The layout is pretty much bog standard: I don't use latte dock here, or a global menu. I want to have as much screen real estate as possible, and since I very rarely use the menubar anyway, and mostly use one window at a time, one on each monitor, I'm not bothered by the fact that apps have menubars in KDE.\n\nThe theme is just Breeze Dark, which I kinda like, but might change for Edna in the future, to be more coherent with my desktop.", "link": "https://www.youtube.com/watch?v=nxAYN4Y2dew", "date_published": "2021-07-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]