[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "10 Minutes of Aliens Fireteam Elite Co-op Gameplay", "description": "We recently got hands-on time with a preview build of Aliens: Fireteam Elite. You're watching a three-player co-op from the first mission of the second campaign.\n\nAliens: Fireteam Elite is a new co-op action shooter set within the legendary Alien franchise. As a loose sequel to the 1986 film, this game sees colonial marines face off against xenomorphs and other hostile foes that pull on deep threads of Alien lore. We recently got some hands-on time with the game, playing through the first half of the game's campaign, and we saw just harrowing encounters can get when running and gunning through space stations and ancient tombs filled with xenomorphs and hostile synthetic soldiers.\n\nIn this new gameplay video, we play through the first mission of chapter 2, taking place on a planet that was once under control by the ancient Engineers--the mysterious alien race from the 2012 film Prometheus. Our squad of marines not only came face to face against xenomorphs but also saw some of the more surprising story turns in the game's campaign. As a squad-based shooter, you and two other players will be able to play as marines with different class types and weapon loadouts. Our squad used the gunner class to lay in fast damage in this gameplay, the demolisher class to tear through enemies with a high-powered smart flamethrower, and the tactician class to lay down support turrets. Fireteam Elite pays some hearty tribute to the Alien franchise, particularly the 1986 film, and it also lays the groundwork for what comes next. We're excited to see more of the game, and what's to come in the rest of the campaign.\n\nAliens: Fireteam Elite will release on August 24 for PC, PS4, PS5, Xbox One, and Xbox Series X|S.\n\n#aliens #aliensfireteamelite", "link": "https://www.youtube.com/watch?v=zVBaR8y2iYY", "date_published": "2021-07-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Aliens: Fireteam Elite Final Preview", "description": "We got hands on with over 8 hours of Aliens: Fireteam Elite and Phil Hornshaw gives his impressions on the game's first two campaigns.\n\nThe essential feeling of the movie Aliens is that everything is falling apart.\n\nAnd that's exactly what Aliens: Fireteam Elite is going for. You start out a confident Marine as you head into a xenomorph-infested facility, but slowly, you find yourself more and more overwhelmed as you fight through swarms of aliens. As ammo and medpacks get lower in key moments, you start to get a bit worried.\n\nThen, at the end of the mission, you're stuck standing in front of an elevator, knowing that as soon as you hit the button to call it and make your escape, the aliens will come for you. Even with full ammo and defensive tools like sentry guns and mines, you're about to be in a fight for your life. \n\nIt's the aspect of Aliens, the 1986 James Cameron movie that most games based on the film struggle to capture, or miss altogether. In the movie, the Colonial Marines lose. They spend most of their time getting picked off, trying to defend against overwhelming odds, and running for their lives. In the eight or so hours of Aliens: Fireteam Elite we played in a preview build, the game did a pretty good job of distilling that sensation into a cooperative third-person shooter. No matter how well-equipped you are, you're going to find yourself starting to sweat as threats close in from all sides.\n\nTimestamps:\n00:00 - Intro\n01:20 - The Basic Structure & Aliens\n02:58 - Classes & Weapons\n04:24 - Locations & Story\n05:12 - Synthetics\n06:05 - Lore From The Alien Universe\n06:57 - Upgrades & Customization\n07:50 - Replay Value\n09:15 - Outro\n\n#aliens #aliensfireteam", "link": "https://www.youtube.com/watch?v=45SuKSiDZ0M", "date_published": "2021-07-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield V, Microsoft Flight Simulator 2020, The Ascent | Xbox Game Pass Show", "description": "Learn about what's new, what's leaving, and what you should be playing on Game Pass. This your Game Pass digest for July 20, 2021.\n\nGame Pass has a lot of games, and twice a month there's more coming, and some leaving. It can be a lot to keep track of, not to mention figuring out what to play from its massive library. That's why we created the Game Pass Show. \n\nJoin Persia to learn what's new, what's leaving, and what you should consider playing. This week, Game Pass sees the arrival of Microsoft Flight Simulator 2020, The Ascent, Blinx: The Time Sweeper, and more. Persia also takes the time to elaborate on what she's been playing: No Man's Sky. Also, make sure to stick to the end for the pick of the week.\n\n#gamepass #BattlefieldV #theascent", "link": "https://www.youtube.com/watch?v=MdzmCX6D1Zw", "date_published": "2021-07-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Death's Door Review", "description": "Tight, challenging combat and a gorgeous world to explore makes the morbid act of reaping souls a delight in Death's Door. This is GameSpot's official review of Death's Door.\n\n#deathsdoor", "link": "https://www.youtube.com/watch?v=jcSrUDbTHgI", "date_published": "2021-07-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "FIFA 22 Next Gen Gameplay Powered by Hypermotion Technology", "description": "The EA SPORTS FIFA development team go in-depth on next gen gameplay, powered by brand new HyperMotion technology coming to FIFA 22 on PlayStation®5, Xbox Series X|S, and Stadia.\n\nESRB EVERYONE.\n\n#easpotlight #fifa22", "link": "https://www.youtube.com/watch?v=DKqZWR5c08w", "date_published": "2021-07-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]