[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Maple Glider: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nBob Boilen | July 21, 2021\nTori Zietsch, aka Maple Glider, is in her Australian home surrounded by her bandmates and friends. Comforting landscape paintings cover the walls: Tori's first vinyl album, Melanie's 1971 album Gather Me, hangs alongside the pictures. She fingerpicks her guitar and sings \"Mama It's Christmas,\" the closing track to her debut album, To Enjoy Is the Only Thing. As she sings the words: \"Oh it's Christmas time again / Where is my brother / Where is my friend / Mama it's Christmas time, again / Doesn't he know I've got ribbons to wrap him in.\" Looking at the camera's wide shot, I sense her watching bandmates and those landscape paintings morph into a warm, comforting blanket.\n\nTori grew up steeped — and trapped — in a restrictive, religious home. Music was her way out. She was part of a duo known as Seavera, and when that disbanded, she moved to Brighton in the U.K. She wrote a stockpile of solo music and came back to Melbourne with what she describes as a SoundCloud packed with demo tunes. I first became enchanted by the second song here, \"As Tradition.\" It's the first single she put out as Maple Glider, and it speaks to the loss of identity in both relationships and religion. On the lighter side, she refers to her talented band as \"The Yeeehawwws\" because they sing ultra country versions of her songs during rehearsals. There may come a time when levity becomes part of Maple Glider; for now, these heavy tunes, packed with thoughtful words and sung so longingly, are here to enjoy.\n\nSET LIST\n\"Mama It's Christmas\"\n\"As Tradition\"\n\"Baby Tiger\"\n\"Good Thing\"\n\nMUSICIANS\nMaple Glider: guitar, piano, vocals\nBridgette Winten: piano, vocals\nAdam Heath: guitar, vocals\nJim Rindfleish: drums\nMalachi Milham: bass\nHannah McKittrick: vocals\n\nCREDITS\nDirector: Claudia Sangiorgi Dalimore\nRecording and Mixing: Matt Redlich\nCameras: Nick McKinlay, Lucy Campbell\nColour Grade: Ted Deacey\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Kara Frame\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Maia Stern, Gabrielle Pierre\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #mapleglider", "link": "https://www.youtube.com/watch?v=DHvPWoMeDtE", "date_published": "2021-07-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "The Weather Station: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nBob Boilen | July 20, 2021\nThere's a desk and a band playing songs filled with nature's imagery somewhere in the woods of Mulmur in Southern Ontario, Canada. It's the perfect setting for The Weather Station. Outdoor locations are familiar to anyone who's seen recent videos for \"Robber,\" \"Parking Lot,\" \"Tried to Tell You\" and \"Atlantic,\" all songs from the band's fourth album, Ignorance, and all songs performed here for its Tiny Desk (home) concert. Songwriter and singer Tamara Lindeman told NPR Music's Marissa Lorusso of her deep feelings on the climate crisis: \"I just basically fell down the rabbit hole that happens to you when you take in the full reality of what it means, and what two degrees [of warming] means and how far over the cliff we already are.\" And so the songs for this Tiny Desk (home) concert are filled with imagery of nature and our relationship with our planet.\n\nWith images of a blood-red sunset in the song \"Atlantic\" and the lines \"Thinking I should get all this dying off of my mind / I should really know better than to read the headlines / Does it matter if I see it? / No, really, can I not just cover my eyes?,\" Tamara writes about her passion for the earth and its future, but the tunes are calming and thoughtful, not doctrines or lectures. This big band with two drummers, two guitars, keyboards and a sax seems at home in the great outdoors. I, however, look forward to seeing them in a club again when their tour begins in September.\n\nSET LIST\n\"Tried to Tell You\"\n\"Parking Lot\"\n\"Atlantic\"\n\"Robber\"\n\nMUSICIANS\nTamara Lindeman: vocals\nKieran Adams: drums\nChristine Bougie: guitar\nPhilippe Melanson: percussion\nKaren Ng: saxophone, clarinet\nJohnny Spence: keys\nBen Whiteley: bass\n\nCREDITS\nVideo: Adam Crosby / Tiny Pictures Inc.\nRecording and Live Sound: Patric McGroarty\nMixed: Howie Beck\nSpecial thanks to Joan Hope\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Maia Stern\nAudio Mastering: Andy Huether\nAssociate Producer: Bobby Carter\nTiny Production Team: Kara Frame, Josh Rogosin, Gabrielle Pierre\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #theweatherstation", "link": "https://www.youtube.com/watch?v=p6Fj-Uq6Q4s", "date_published": "2021-07-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]