[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Tiny Desk Meets globalFEST: Minyo Crusaders, Hit La Rosa, Natu Camara, Emel", "description": "January 12, 2021 | Bob Boilen\nThe Tiny Desk is teaming up with globalFEST this year for a thrilling virtual music festival: Tiny Desk Meets globalFEST. The online fest includes four nights of concerts featuring 16 bands from all over the world. From Monday, Jan. 11, through Thursday, Jan. 14, we'll be streaming new performances at 8 p.m. ET on NPR Music's YouTube channel and NPR.org.\n\nEvery January, I attend globalFEST at a New York City nightclub and see some of the most fantastic music I'll experience all year. Now, given the pandemic's challenges and the hardening of international borders, NPR Music and globalFEST is moving from the nightclub to your screen of choice and sharing this festival with the world. Each night, we'll present four artists in intimate settings (often behind desks donning globes), and it's all hosted by African superstar Angélique Kidjo, who performed at the inaugural edition of globalFEST in 2004.\n\nOn Tuesday night, we have Minyo Crusaders' new spin on Japanese folk music, Peruvian cumbia music from Hit La Rosa, Natu Camara's combination of West African soul, rock and pop music, and Tunisian singer and activist (and globalFEST Alum) Emel.\n\n0:00 INTRO\n2:24 MINYO CRUSADERS\n24:05 HIT LA ROSA\n41:01 NATU CAMARA\n58:55 EMEL\n\nBelow you'll find short descriptions about each act, written by the globalFEST team.\n\nMINYO CRUSADERS\nMin'yō folk music was originally sung by Japanese fishermen, coal miners and sumo wrestlers hundreds of years ago, and the Minyo Crusaders are on a mission to make these songs relevant to an international audience. For their performance, the Crusaders found a unique take for their desk: a \"kotatsu,\" which is a heated Japanese table traditionally used for gathering in the winter months.\n\nSET LIST\n\"Hohai Bushi\"\n\"Yasugi Bushi\"\n\"Aizu Bandaisan\"\n\n-\n\nHIT LA ROSA\nFrom the candle-lit home of their lead singer, Hit La Rosa comes in hot and doesn't stop until the final measure. The band explores the many facets of Peruvian cumbia music, infusing it with pop music, folklore, jazz and dancehall to produce its distinctive grooves and hooks. The band's precise-yet-dreamlike music and punk sensibility all come together to make music that explores life's shadowy sides. Despite living through a political crisis in Peru, the band brings a message of hope and joy in the midst of struggle and upheaval.\n\nSET LIST\n\"La Montañita\"\n\"La Marea\"\n\"Salvia\"\n\n-\n\nNATU CAMARA\nFrom a studio space in Brooklyn, Guinean native Natu Camara mixes West African soul, rock and pop music. As a builder of inter-cultural bridges, Camara uses her songs to bring people together, weaving a tapestry of musical stories and visions of her beloved home.\n\nSET LIST\n\"Ka Hirdé\" - Intro\n\"Waa\"\n\"Dimedi\"\n\"Arabama di\"\n\n-\n\nEMEL\nTunisia-born singer Emel first performed at globalFEST in 2015, the same year she performed her song of Tunisian Revolution, \"Kelmti Horra,\" at the Nobel Peace Prize Concert. Emel was hailed by NPR as a \"21st century catalyst for change.\" She created her latest album, The Tunis Diaries, equipped with only a laptop, tape recorder and a crowdsourced guitar after she was unexpectedly quarantined in her childhood home in Tunis last spring.\n\nSET LIST\n\"Holm\"\n\"Everywhere We Looked Was Burning\"\n\n\n-\n\nTiny Desk Meets globalFEST\n\nTINY DESK TEAM\n\nProducer: Bob Boilen\nVideo Producer: Morgan Noelle Smith\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Kara Frame, Maia Stern\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann\n\nGLOBALFEST TEAM\n\nCo-Directors: Shanta Thake, Isabel Soffer, and Bill Bragin\n2021 Curators: Shanta Thake, Isabel Soffer, Bill Bragin, and Viviana Benitez\nEvent Producer: Ian Thake\nHost: Angélique Kidjo\nSocial Media Manager: Valerie French\nPublicity: Brendan Gilmartin, Chart Room Media\nLegal Services: Tamizdat\nLegal Services: Duane Morris\nProducer: THE OFFICE performing arts + film\nVideo Production: MODEMA Studios\n\nTHE OFFICE performing arts + film consists of Diane Eber, Rachel Chanoff, Laurie Cearley, Olli Chanoff, Erica Zielinski, Gabrielle Davenport, Catherine DeGennaro, Noah Bashevkin, Lynn Koek, Bruna D'Avila, Chloe Golding, Kyla Gardner, Zion Jackson, Tess Peppis, Scout Eisenberg\n\nMODEMA Studios consists of Jammal Lemy (director and editor), Matt Deitsch (producer), Theo Braun (audio), and Gary Blake (editor)\n\nSpecial Thanks: Joshua Feigenbaum, Mona Golub, Steven Kirkpatrick, Daniel C. Smith, Ken Umezaki\n\nglobalFEST 2021 funders include The Andrew W. Mellon Foundation, The National Endowment for the Arts, NYC Department of Cultural Affairs, The Québec Government Office in New York", "link": "https://www.youtube.com/watch?v=RyBMNprEeQM", "date_published": "2021-01-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Tiny Desk Meets globalFEST: Dedicated Men Of Zion, Labess, Sofia Rei & DakhaBrakha", "description": "January 11, 2021 | Bob Boilen\n\nThe Tiny Desk is teaming up with globalFEST this year for a thrilling virtual music festival: Tiny Desk Meets globalFEST. The online fest includes four nights of concerts featuring 16 bands from all over the world. From Monday, Jan. 11, through Thursday, Jan. 14, we’ll be streaming new performances at 8 p.m. ET on NPR Music’s YouTube channel and NPR.org.\nEvery January, I attend globalFEST at a New York City nightclub and see some of the most fantastic music I'll experience all year. Now, given the pandemic's challenges and the hardening of international borders, NPR Music and globalFEST is moving from the nightclub to your screen of choice and sharing this festival with the world. Each night, we’ll present four artists in intimate settings (often behind desks donning globes), and it's all hosted by African superstar Angélique Kidjo, who performed at the inaugural edition of globalFEST in 2004.\nFor our opening night, we have the gospel sounds of the Dedicated Men of Zion, the flamenco and Gypsy jazz-influenced North African sounds of Labess, the award-winning vocalist and songwriter Sofia Rei, who blends Argentine and other South American folk traditions with experimental pop and electronic music, and Tiny Desk alum DakhaBrakha, a Ukranian rock band overflowing with joy and energy. Below you’ll find short descriptions about each act, written by the globalFEST team.\n\n0:00 WELCOME\n2:30 DEDICATED MEN OF ZION\n15:32 LABESS\n28:07 SOFIA REI\n43:40 DAKHABRAKHA\n57:53 FAREWELL \n\nDEDICATED MEN OF ZION\nDedicated Men of Zion come to you from their backyard barbecue in North Carolina, bringing with them an electrified version of sacred Gospel soul music. This family band (all related through blood or marriage) has been isolating together during the pandemic, and the members are excited to play together as an uplifting note during difficult times.\n\nSET LIST\n\"Father, Guide Me, Teach Me\"\n\"Can't Turn Me Around\"\n\"It's A Shame\"\n\nLABESS\nWhen we look at global arts, it's amazing to see how many traditions and nations can come together to make music together. Nowhere is that clearer than the music of Labess, an Algerian and Canadian band that is performing and recording their set from France and Colombia, proving that music has no boundaries even in times of isolation.\n\"Labess\" means \"everything is fine\" in Arabic, and their flamenco and Gypsy jazz-influenced North African chaabi (folk) music brings that message to life. \n\nSET LIST\n\"Yal Maknin\"\n\"Yemma\"\n\"La Vida Es Un Carnaval\"\n\nSOFIA REI\nRecording from her apartment in Brooklyn, award-winning vocalist and songwriter Sofia Rei provides a concert that blends Argentinian and other South American folk traditions with experimental pop and electronic music. This mix of tradition and modernity is even present in her setting, which blends traditional iconography with robotic 'saints' and exuberantly grown plants with sound boards and looping pedals.\n\nSET LIST\n\"Un Mismo Cielo\" (The Same Sky)\n\"Negro Sobre Blanco\" (Black On White)\n\"Escarabajo Digital\" (Digital Beetle)\n\nDAKHABRAKHA\nRecorded from Ukraine, DakhaBrakha returns both to globalFEST and Tiny Desk. Their first globalFEST performance was in 2014, and their time with Tiny Desk in 2015 remains a favorite. We've had them in our spaces, so it's a real treat to see them in theirs, the Dakh Theater in Kyiv, where the band formed and where they've crafted their amazing catalogue of songs. Coming together, their performance maintains the energy and joy that define their music, bouncing off each other musically and emotionally.\n\nSET LIST\n\"Komora\"\n\"Vynnaya ya\"\n\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Morgan Noelle Smith\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Kara Frame, Maia Stern\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann\n\nGLOBALFEST TEAM\nCo-Directors: Shanta Thake, Isabel Soffer, and Bill Bragin\n2021 Curators: Shanta Thake, Isabel Soffer, Bill Bragin, and Viviana Benitez\nEvent Producer: Ian Thake\nHost: Angélique Kidjo\nSocial Media Manager: Valerie French\nPublicity: Brendan Gilmartin, Chart Room Media\nLegal Services: Tamizdat\nLegal Services: Duane Morris\nProducer: THE OFFICE performing arts + film\nVideo Production: MODEMA Studios\n\nTHE OFFICE performing arts + film consists of Diane Eber, Rachel Chanoff, Laurie Cearley, Olli Chanoff, Erica Zielinski, Gabrielle Davenport, Catherine DeGennaro, Noah Bashevkin, Lynn Koek, Bruna D'Avila, Chloe Golding, Kyla Gardner, Zion Jackson, Tess Peppis, Scout Eisenberg\n\nMODEMA Studios consists of Jammal Lemy (director and editor), Matt Deitsch (producer), Theo Braun (audio), and Gary Blake (editor)\n\nSpecial Thanks: Joshua Feigenbaum, Mona Golub, Steven Kirkpatrick, Daniel C. Smith, Ken Umezaki\n\nglobalFEST 2021 funders include The Andrew W. Mellon Foundation, The National Endowment for the Arts, NYC Department of Cultural Affairs, The Québec Government Office in New York", "link": "https://www.youtube.com/watch?v=rUF2yr7CC4w", "date_published": "2021-01-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]