[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC2eYFnH61tmytImy1mTYvhA", "title": "Myth as Science and Prehistoric Knowledge: Hamlet's Mill", "description": "Known history is less than 1% of the time humans have inhabited earth, and thus most of our past survives only in the partial evidence of myth, genetics and badly decayed archaeological remains. In particular, mythology is not just a collection of arbitrary stories, but as the authors of Hamlet's Mill argue, it is a long-lost theoretical language used to store astronomical and scientific knowledge.\r\n\r\n While we all know that myth can store relevant information in a memorable format, it can also embed very specific details of a preexisting system of knowledge also attested in archaeoastronomy, even in well-known sites like Stonehenge, the \"neolithic calculator\" which shows astronomical knowledge far more precise than that of any average person of today.\r\n\r\n The reason the earliest philosophical and religious mythology seems absurd or opaque to us is partially because it is speaking in a jargon which has been lost, like alchemy or primeval sciences. In the right context, we can see a long tradition of knowledge preserved from at least the Stone Age.\n\nCorrection: I mentioned that an Indian Vedic Nakshatra was analogous to a lunar phase, but this isn't accurate (I was adlibbing). It is a region of the sky the moon transits through.\n\nI also when talking about Stonehenge said that 56 divided by 3 is about ~2.9. Lol. Obviously mispoke. I meant 56 divided by 19.\n\n0:00:00 Issuing an Extension on Human Prehistory\n0:02:24 An Argument from Plausibility for R*ddit Soyentists\n0:05:17 Constant Emergence of Civilization\n0:06:31 Myth as the Science of Prehistory\n0:07:44 I hate Hamlet's Mill.\n0:10:12 Which came first: the Planets or the Gods?\n0:11:50 Astronomical Myths in India and the Vedic Tradition\n0:15:28 On Al-Biruni and his bad pronunciation\n0:18:00 Mythology as technical language\n0:20:40 Hamlet's Mill and the Precession of the Equinox\n0:23:15 Hamlet and his story and Cosmic Mill\n0:27:15 Hyperdiffusionism\n0:30:24 Donations https://donate.notrelated.xyz\n0:31:21 On podcast length and density again\n0:33:15 Why .ogg instead of .mp3?\n0:36:08 Thor Heyerdahl\n0:38:40 The Polynesian discovery of America, physical and genetic evidence\n0:43:16 Aboriginal Australians discover America in prehistory.\n0:50:20 On Denisovans and Homo erectus\n0:51:55 Diversion on Solutreans in Europe\n0:53:50 On alchemy and technical language\n0:56:19 Hipparchus and Babylonian astronomy\n0:57:25 Ancient Memes we use every day\n0:59:50 How many degrees are in a circle?\n1:01:20 Babylonian Math https://www.youtube.com/playlist?list=PLIljB45xT85CdeBmQZ2QiCEnPQn5KQ6ov\n1:03:51 Full development of science in prehistory\n1:04:25 Panini's Ashtadhyayi and its deductive predecessors\n1:06:52 The Memory Code by Lynne Kelly\n1:08:41 The Cosmos and Ancient Astronomy\n1:09:49 Stonehenge as a Neolithic Calculator\n1:12:25 Poverty Point\n1:13:12 Closing on the Precession of the Equinoxes", "link": "https://www.youtube.com/watch?v=KD-B3zwyV5I", "date_published": "2021-10-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]