[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "God of War: Ragnarok Was Delayed - We Know Why | GameSpot News", "description": "The reason behind God of War: Ragnarok’s delay was revealed by the game’s voice actor Christopher Judge. The rumored GTA remastered collection is rated ahead of any official reveal or announcement. Sony acquires Bluepoint Studio and adds to its ever growing collection of first party studios.\n\nTimestamps:\n00:00 - Intro\n00:31 - God of War: Ragnarok Delayed\n01:00 - Geoff Keighley Announces TGA 2021\n01:41 - GTA Remastered Collection Gets Rating\n02:28 - Sony Acquires Blue Point Games\n\n#godofwar #ragnarok", "link": "https://www.youtube.com/watch?v=AknSSgWTLJc", "date_published": "2021-10-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New Metal Gear, Silent Hill, and Castlevania Games? | GameSpot News", "description": "In today’s GameSpot News, Konami might be working on new Metal Gear, Silent Hill, and Castlevania games, the PS5 now has an 8K game but with a catch, and the Stranger of Paradise demo is out now.\n\nIn this video, Persia talks about a recent report of Konami making new installments and remakes in some of its franchises such as Metal Gear, Castlevania, and Silent Hill. All of these new projects are said to be announced in 2022. \n\nPersia also goes over the only game to currently offer 8K on PS5, except there’s a catch. While The Touryst renders internally at 8K resolution, the PS5 doesn't actually support that output over HDMI 2.1 and the developer Shin'en Multimedia is using an extreme supersampling technique to downsample every pixel on any connected 4K TV. \n\nLastly, Team Ninja's new Final Fantasy game, Stranger of Paradise: Final Fantasy Origin, will launch in March 2022. A second demo is now available for PS5 and Xbox Series X and S. \n\nFor more information on all of these topics, please visit gamespot.com.\n\nTIMESTAMPS:\nIntro - 00:00\nKonami working on new Metal Gear, Silent Hill, and Castlevania games? - 00:15\nThe PS5 finally has an 8K game, but there's a catch - 01:14\nStranger of Paradise: Final Fantasy Origin demo out now - 02:27\nOutro - 03:14", "link": "https://www.youtube.com/watch?v=ilRlsdW_jZ4", "date_published": "2021-10-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New World Ultimate Beginner’s Guide", "description": "In this New World beginner’s guide, we give tips for fast leveling, making the most of gear in and out of combat, as well as how to make the most of trade skills.   \n\nNew World is an MMORPG from Amazon Games set on the mythical island of Aeternum. For thousands of years explorers have ventured to the island in search of its mysterious resource known as Azoth. This substance grants power and eternal life but often at a cost and has led to the corruption of the island as well as the island’s former masters to nearly go extinct. \n\nIn this video, DeVante talks about all the important things a beginner should know about New World before they start playing. He breaks down ways to maximize XP gain in order to level up faster as well as how to cut down on travel time in games. Later in the video, DeVante details New World’s combat, weapons, damage types and armor sets as well as discussing tips for trade skills like gathering and crafting.  \n\nNew World released for PC on September 28, 2021 and is now available via Amazon or Steam. \n\nTIME STAMPS\n00:00 - Intro\n00:49 - Early Questing  / Leveling Fast\n08:24 - Combat, Armor & Weapons\n12:18 - Trade Skills\n13:44 - Outro", "link": "https://www.youtube.com/watch?v=zbkybKHyew8", "date_published": "2021-10-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "SQUARE ENIX PRESENTS TGS2021 with (English subtitles）", "description": "Watch the  SQUARE ENIX PRESENTS TGS2021 for the latest news about our upcoming titles, along with the pre-announced information.\n\nLearn more about Actraiser Renaissance, Chocobo GP, FINAL FANTASY VII THE FIRST SOLDIER, FORSPOKEN, Marvel's Guardians of the Galaxy, STRANGER OF PARADISE FINAL FANTASY ORIGIN, TRIANGLE STRATEGY, Voice of Cards: The Isle Dragon Roars.\n\n#TGS", "link": "https://www.youtube.com/watch?v=ayzMeSaAixc", "date_published": "2021-10-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Square Enix Presents TGS 2021 Livestream", "description": "Tune in for SQUARE ENIX PRESENTS TGS2021 will give you the latest news about our upcoming titles, along with the pre-announced information.\n\nLearn more about Actraiser Renaissance, Chocobo GP, FINAL FANTASY VII THE FIRST SOLDIER, FORSPOKEN, Marvel's Guardians of the Galaxy, STRANGER OF PARADISE FINAL FANTASY ORIGIN, TRIANGLE STRATEGY, Voice of Cards: The Isle Dragon Roars.\n\n#TGS", "link": "https://www.youtube.com/watch?v=mpzBp7qrBKM", "date_published": "2021-10-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Stranger Of Paradise: Final Fantasy Origin Hands-On Preview", "description": "We played the second demo for Stranger of Paradise: Final Fantasy Origin, which shows off the game's extensive job system and takes players to a new mission.\n\nOne of the most notable and exciting things about Final Fantasy VII Remake was the way it updated the original game's combat system, merging the feeling of menu-based commands and action game controls. Stranger of Paradise: Final Fantasy Origin does something similar with a take on the jobs system that's a big part of Final Fantasy's history. The ability to switch between combat roles on the fly allows for a whole lot of interesting versatility, adding tactical considerations to protagonist Jack's angry shouting, slashing, and headbutting.\n\nWe recently got a chance to go hands-on with the second playable demo of Stranger of Paradise ahead of its release. This new look at the game includes everything that was in the first demo, with some added story context. It also included another section that gives a sense of Final Fantasy Origins' take on the series and how expansive the job system really is, as well as how the gear systems and mission-based approach seem like they'll work on a large scale.\n\n#strangerofparadise #finalfantasyorigin", "link": "https://www.youtube.com/watch?v=WM-rS3sFSqs", "date_published": "2021-10-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Elder Scrolls Online: Deadlands DLC Reveal Livestream", "description": "Tune to the ESO Gates of Oblivion Year-End stream at 1pm PT / 4pm ET and see the reveal of the latest DLC, Deadlands.", "link": "https://www.youtube.com/watch?v=VUKbP7pvx8s", "date_published": "2021-10-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Capcom Monster Hunter Spotlight | Tokyo Game Show 2021", "description": "Catch up on the latest details of the newly announced Monster Hunter Rise: Sunbreak, as well as news and updates for Monster Hunter Rise and Monster Hunter Stories 2: Wings of Ruin, courtesy of the development team.\n\n#TGS2021 #tokyogameshow2021 #capcommonster", "link": "https://www.youtube.com/watch?v=WmosJjrTK44", "date_published": "2021-09-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Diablo II Resurrected Review", "description": "Diablo II: Resurrected is a painfully faithful remaster of the original classic, which makes it difficult to get into over two decades later.\n\nAlessandro clicked thousands of enemies to death across 20 hours with Diablo II: Resurrected, trying out both a Paladin and Necromancer across the game's campaign and expansion. Code was provided by the publisher.\n\n#diablo #diablo2 #diablo2review", "link": "https://www.youtube.com/watch?v=NlFhMvRWQmM", "date_published": "2021-09-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Dying Light 2 Livestream | Dying 2 Know Episode 4", "description": "Learn more about the open world of Dying Light 2 in this latest Dying 2 Know episode. This is the 4th episode you'll get more details on exploration, combat, character interactions, and secrets you might find in the city. \n\nAlso stay tuned to the end for a big reveal for a new character and the celebrity that plays them. \n\n#dyinglight2", "link": "https://www.youtube.com/watch?v=yqLMG1N1sKk", "date_published": "2021-09-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "FIFA 22 Review", "description": "FIFA 22 excels on the pitch with a patient and more methodical style, but additions elsewhere are only incremental and microtransactions still leave a bad taste. FIFA 22 is out on October 1st for PC, PS4, PS5, XB1, XBS X/S, and Switch.\n\nRichard played FIFA 22 for 25 hours, splitting his time amongst each of its game modes. Review code was provided by the publisher.\n\n#fifa #fifa22 #fifa22review", "link": "https://www.youtube.com/watch?v=u1pVqQ_iZUU", "date_published": "2021-09-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Free October Games For PS Plus & Xbox Gold | GameSpot News", "description": "In today’s episode, Persia talks about all of the free games coming in October for PlayStation Plus and Xbox Gold users, Forbidden West developers Guerrilla Games hiring for a multiplayer game, and Netflix acquiring game developer Night School Studio.\n\nIn this video, Persia talks about the free games you can play with a PS Plus or Xbox Gold subscription. Sony has now officially announced the free PlayStation Plus games for October 2021 which includes one PlayStation 5 game, Hell Let Loose, as well as a pair of PlayStation 4 games, PGA Tour 2K21. and Mortal Kombat X. On the Xbox side of things, Microsoft has announced the free Games With Gold titles coming in October, and these include Aaero, Hover, Castlevania: Harmony of Despair, and Resident Evil Code: Veronica X.\n\nHorizon: Forbidden West developer Guerrilla Games' new job shows that the company is looking to hire a Senior Social Systems Designer and Senior Narrative System Designer, both of which point to a multiplayer game being in the works. \n\nLastly, Persia talks about Netflix acquiring Night School Studio, the developer behind Oxenfree, Afterparty, and Next Stop Nowhere. The developer is the first game studio bought by Netflix, which earlier this year announced its plans to expand into the video games industry. Similar to Netflix's shows and films, games will also be included in the service's memberships, with the added benefit of having no advertisements or in-app purchases.\n\n For more information on all the topics today, please visit gamespot.com.\n\nTIMESTAMPS:\nIntro - 00:00 \nFree Games - 00:16\nGuerrilla Games - 01:29 \nNetflix  - 02:35\nOutro - 03:53\n\nYou can read more about all of today’s topics on gamespot.com\n\n#freegames #xbox #playstation", "link": "https://www.youtube.com/watch?v=4hNgizY6uiE", "date_published": "2021-09-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Xbox Livestream | Tokyo Game Show 2021", "description": "Tune in for a 50-minute Xbox livestream focusing on games and updates for players in Japan and across Asia.\n\nThis year marks the 25th anniversary of Asia’s biggest gaming event, with the show again taking a virtual format. The 2021 theme of Tokyo Game Show aims to emphasise the power of gaming to close the distance between people and carries with it the inspiring event tagline of ‘We’ll always have games.’\n\nFollowing a return to the Tokyo Game Show stage last year, we are pleased to confirm Xbox will be back with a virtual stream curated for players in Japan and across Asia on Thursday, September 30.\n\n#TGS2021 #tokyogameshow2021", "link": "https://www.youtube.com/watch?v=YKSAH_nej8k", "date_published": "2021-09-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]