[{"source": "https://lukesmith.xyz/rss.xml", "title": "Modern \"Freedom\" Means Being a Slave to Impulses", "description": "<h2 id=\"what-does-freedom-mean\">What does freedom mean?</h2>\n<p>See this article in video form\n<a href=\"https://lukesmith.xyz/articles/modern-freedom-means-being-a-slave-to-impulses\">here</a>.</p>\n<p>Which of the following two people is more free:</p>\n<ol>\n<li>A drug addict.</li>\n<li>A average man who is only not a drug addict because he lives in a\ncountry where drugs are regulated or shamed in a way to make them\nhard to obtain.</li>\n</ol>\n<p>Most modern people will have a kind of cognitive dissonance, a kind of\nglitch in their matrix here. In the modern view of freedom, freedom\nmeans the ability to do what you want without the government or society\ntelling you what to do, so (1), the drug addict, should be more\n&quot;free.&quot;</p>\n<p>But at the same time, this feels wrong. (2) probably lives a better\nlife. He is more suited to make more and better decisions. Someone\naddicted to drugs is highly constrained in the kind of life they have to\nlive to fulfill their addiction.</p>\n<p>Even extreme libertarians will probably say (2) is in a better place,\nbut might chalk things up to (1) needing to have more discipline and\nthey'll make up some just-so story as for why unambiguously bad drugs,\nor pornography, or dangerous things should be allowed anyway.</p>\n<h2 id=\"classical-freedom\">Classical freedom</h2>\n\n<figure class=\"resright\"><img src=\"https://lukesmith.xyz/pix/paul.jpg\" /></figure>\n\n<p>In reality, since the Enlightenment, we have had a hobbled understanding\nof what &quot;freedom&quot; is. Enlightenment &quot;freedom&quot; is only the freedom to\nperfectly follow the whims of impulses and vices indiscriminately.</p>\n<h3 id=\"the-christian-tradition\">The Christian tradition</h3>\n<p>Christians stated the classical view of freedom very clearly. Paul\nwrites that all men are either &quot;slaves to Christ&quot; or &quot;slaves to\nsin.&quot; The modern man wants to retort that he doesn't want to be a\nslave to anything, but wants to be his own master, but there is really\nno such thing.</p>\n<p>One can be guided by Christ, or more generally, by consistent moral\nprinciples, restraint and forethought. Or one can abandon the pretense\nof morality and by definition follow his impulses to fornication,\nsubstance-abuse, and general reckless living.</p>\n<p>These masters aren't equivalent either. Being a slave to one is nothing\nlike being a slave to another. Slaves to sin are wrapped up into\nincoherent and uncontrollable behavior. Following one's sexual whims\nmight be inconsistent and thoughtless behavior that one likes one second\nand is disgusted by the next. It might mean someone exploding in rage\nand emotion.</p>\n<p>This &quot;free&quot; man, a slave to sin, is only bound by the practical\nconsideration that he might get caught or shamed by &quot;prudes&quot; and that\nmight dampen his ability to follow his inpulses more.</p>\n<h3 id=\"impulses-are-not-the-man\">Impulses are not the man</h3>\n\n<figure class=\"titleimg\"><img src=\"https://lukesmith.xyz/pix/nihilism.jpg\" /></figure>\n\n<p>If we look at the modern world as if it has desires and goals for us, it\ncertainly seems like it is trying to induce as many people as possible\ninto being slave to sin. People no long have identity in who they\nactually are, but in accidental preferences formed over years of\nimpulse-seeking: their sexual fetishes, drugs of choice, their favorite\nTV show to consoom or their favorite music they constantly pump in their\nhead to dampen the possibility that an original reflective thought might\noccur to them.</p>\n<p>More than that, these people often can't even fathom of life without\ntheir master sins, and retort in rage when someone dares to direct them\notherwise or &quot;judge&quot; them. They don't just have a kind of Stockholm\nSyndrome with sin, but they can't comprehend the fact the people are\nsomething deeper than their pleasure habits.</p>\n<h3 id=\"control-of-impulses-leads-to-freedom\">Control of Impulses Leads to Freedom</h3>\n<p>However if one can constrain his impulses, he will be free to truly sit\ndown and deliberate and make free decisions on what is best to do.</p>\n<p>This is where true freedom begins. The concept is totally alien to the\ncoomer, the slave to sin, because he can't even afford the mental space\nto think further than his constant service to sin.</p>\n<p>To him, it is merely &quot;me having fun,&quot; versus &quot;some haters who are\nagainst fun.&quot;</p>\n<h2 id=\"slaves-to-vices-are-slaves-in-general\">Slaves to Vices are Slaves in General</h2>\n\n<figure class=\"titleimg\"><img src=\"https://lukesmith.xyz/pix/fedora_consoomer.jpg\" /></figure>\n\n<p>If you indentify with your impulses, it's very easy to get you\nmotivated to defend them with the same impulsivity if you are told that\nthey are &quot;under attack.&quot; While impulsive people might be hard to be\naround as individuals, they are easy to control as groups and can be\nherded around like unthinking sheep.</p>\n<p>People who are reactive in politics are always the losers, and what is\nan impulsive life but one that is entirely reactive and therefore\ncontrollable?</p>\n<h2 id=\"the-kingly-state\">The Kingly State</h2>\n<p>With the classical understanding of freedom, the goal of social\nconventions, traditional morality and the good government is to increase\ntrue liberty by minimizing one's temptation to vice. People are born\nwith some tendency to vice (original sin to Chrisitians) that can be\neasily made worse. The goal of normal society is to lead people away\nfrom lasciviousness and impulsive behavior. (That is clearly not the\ngoal of the modern West, however.)</p>\n<p>A drug addict is not free. A teenager who gets home from school\neveryday, closes his door and watches internet pornography is not free.\nA person who compulsively checks their social media feed when they wake\nup or are minorly bored is not free. A woman who sleeps around\nthroughout her twenties and is left with nothing is not free. A boy who\nstays up late because he has to &quot;grind&quot; on a video game is not free.</p>\n<p>No one can say that these people truly want what they do: no one <em>fully</em>\nconsents to any impulsive behavior. This is actually why in the Catholic\ntradition, sins of incontinence are not as grave as deliberate sins.\nIt's not a fair game.</p>\n<p>Either way, the goal of the church, or a moral society and moral\ngovernment generally, is to increase freedom by being a countervailing\npower to inborn vices.</p>\n<p>The point of moral instruction is not to restrain man, but to make him\nmore free by eliminating the true causes of his enslavement: his vices,\nhis bad habits, his sexual paraphilias, his gluttony and greed.</p>", "link": "https://lukesmith.xyz/articles/modern-freedom-means-being-a-slave-to-impulses/", "date_published": "2021-05-06 00:00:00+00:00", "persistent": true, "user": null, "language": "en-US"}, {"source": "https://lukesmith.xyz/rss.xml", "title": "Conspiratorial Thinking and \"Multiple Outs\"", "description": "<h2 id=\"how-to-do-magic-tricks\">How to do magic tricks...</h2>\n<p>Magicians have this concept called &quot;Multiple Outs.&quot; It's actually how\nyou can do simple magic tricks. Suppose you have a person pick a card\nand say you will guess the suit of their card.</p>\n<p>They pick a diamond card and announce it, and you tell them to check\nunderneath their chair to reveal a slip of paper that says, &quot;You will\npick a diamond card.&quot;</p>\n<p>That might sound like a nice trick, but if they had picked a spade, you\nhave another piece of paper under the fruitbowl that says, &quot;You will\npick a spade.&quot; If they pick a club, you unbutton your shirt to reveal a\ngiant club written on your undershirt, etc.</p>\n<p>In essence, for any possible outcomes, you have a response planned that\nseems natural and predictive. This is one of the ways that magicians do\nwhat they do, often with more complicated mechanisms.</p>\n<h2 id=\"applications\">Applications</h2>\n<p>Multiple outs are actually real magic.</p>\n<p>You've heard the expression &quot;hope for the best and plan for the\nworst,&quot; but the concept of multiple outs is that one should be planning\nfor <em>all possible</em> outcomes, including those that you yourself might not\neven anticipate now.</p>\n<p>Every business plan should have multiple outs. Your major life decisions\nshould be planned with multiple outs. You should even tacitly plan dates\nwith multiple outs, so that unexpected events can be met with a\nconfident, perhaps even better replacements.</p>\n<h2 id=\"multiple-outs-in-political-power\">Multiple outs in political power</h2>\n<p>Any longstanding group in political power is by the mere fact of their\nsurvival sure to have mastered the sleight of hand of &quot;multiple outs.&quot;</p>\n<p>This serves not only to continue in political power, but to cement their\npower further by the appearance of inevitability. A ruler or ruling\nclass puts themselves in a position to benefit from any possible\noccurrence: be ready even to use disaster to your benefit, as Obama's\nchief of staff Rahm Emmanuel put it succinctly: &quot;You never let a\nserious crisis go to waste.&quot;</p>\n<h3 id=\"conspiracy\">Conspiracy?</h3>\n<p>People skeptical of the state sometimes devolve into thinking that every\nmajor political event is in one way or another is planned in advance.\nThis is because they don't understand and apply the concept of multiple\nouts. They see that their rulers are good at benefiting from any chaos\nor unforeseen events, so assume these events must've been engineered.</p>\n<p>Look at the corona virus: it's a great example of an event that has\nhugely benefited a small elite: it has bankrupted small businesses in\nfavor of Amazon, destroyed churches and mom and pop stores in favor of\npassively consooming digital infotainment from curated social media\nsites and more. It is a rationalization of state location and contact\nmonitoring and things far beyond what anyone dreamed of. It was a\nrationalization for sending out unsolicited ballots to unverified voter\nrolls which had very obvious beneficiaries. It has produced a cult of\ndoomsday believers crying for the state to lock them in their houses and\nmake them wear fetishistic masks.</p>\n<p>Seeing all this and asking who benefits, &quot;Cui bono?&quot; might lead you to\nthink that the whole thing was planned: perhaps the disease itself is\nfake, or maybe it was real, but spread on purpose, or perhaps it was\nengineered. You've probably seen stuff like this, and while I won't\ndismiss this kind of thinking out of hand, it's unnecessary.</p>\n<p>In reality, the ruling classes of the West have openly prepared to\nbenefit from a pandemic scenario. COVID19 was deemed &quot;closed enough&quot;\nto a pandemic, and the momentum of the system took over. It's not even\nthat they <em>wanted it to happen</em>, but they were prepped to benefit from\nit as a contingency plan if it might occur.</p>\n<h3 id=\"the-conspiracy-rabbit-hole-and-the-omnipotent-cathedral\">The Conspiracy Rabbit Hole and the Omnipotent Cathedral</h3>\n<p>There are some people who see how the ruling class is in a position to\nbenefit from every school-shooting, police encounter, foreign\nentanglement, dissident politician and everything else and thus assume\nthat everything they see must be arranged in advance. There is a logic\nbehind believing this: it does seem <em>way</em> to convenient for all of this\nto happen at what retroactively seems to the best time, but this leads\npeople to the much more uneconomical idea that the System is so\nomnipotent that it controls every event and every reaction to every\nevent.</p>\n<p>In reality, our rulers just know how to use multiple outs. When you know\nhow to do that, it seems like you are always in control, and by nature,\npeople attribute a kind of magical power to you. All you have to do is\nstay cool and play it off like you predicted it all.</p>\n<h3 id=\"this-is-why-the-system-always-seem-to-win\">This is why &quot;the System&quot; always seem to win.</h3>\n<p><strong>The system knows how to play with multiple outs.</strong></p>\n<p>There is a canned response, or at least a reasonably ad-libbed response,\nfor every event and every possible event. They are in a position of\nantifragility and can gain from nearly any possible event. When they\ncan't, the media can at least throw enough mud on public perception to\ninspire apathy or confusion.</p>\n<p>There are certainly portions of the System which are &quot;conspiratorial.&quot;\nMajor news organizations usually coordinate on what editorial line to\npublish, but in general, their entrenched power comes from a detached\nability to be flexible in new events.</p>\n<p>The omnipotence and permanence of the Soystem is illusory. It comes from\nthat flexibility.</p>\n<h2 id=\"multiple-outs-in-your-life\">Multiple outs in your life</h2>\n<p>Even aside from politics, it's important to behave yourself in a way\nthat allow yourself to have multiple outs. Business, social life, major\ndecisions and in everything else. Never tether yourself to one option;\nthat's when you lose. Have a smart response to co-opt anything that can\nhappen, no matter how good or bad.</p>", "link": "https://lukesmith.xyz/articles/conspiratorial-thinking-and-multiple-outs/", "date_published": "2021-05-05 00:00:00+00:00", "persistent": true, "user": null, "language": "en-US", "tags": ["conspiracy theories"]}, {"source": "https://lukesmith.xyz/rss.xml", "title": "The Problems with Utilitarianism", "description": "<p>I originally wrote this essay in 2014 or 2015 in a Chinese buffet in\nAthens, Georgia. I've changed some of it and am re-adding it here. I\ntalk about the issues with Utilitarianism and a bad book by Sam Harris.</p>\n<hr />\n<h2 id=\"utilitarianism\">Utilitarianism</h2>\n<p>At a dumb intuitive level, the &quot;ethical&quot; idea of\n[Utilitarianism]{.dfn} in principle gets pretty close to what most\npeople reflexively want from social-political affairs: the greatest good\nfor the greatest number of people&mdash;who doesn't want that?</p>\n<p>The problem is that that intuitive idea is <em>incoherent</em>. It sounds good,\nbut there's not really such a thing as &quot;the greatest good for the\ngreatest number of people.&quot; If there were, it wouldn't even be\nactionable.</p>\n<h2 id=\"maximizing\">&quot;Maximizing&quot;</h2>\n<p>So the first problem is one any mathematician will realize right off the\nbat: it's rarely possible to maximize a function for two variables.</p>\n<p>If we had the means, we could maximize (1) the amount of good in society\nor (2) the number of people who feel that good, but nearly certainly not\nboth (if we can it's a bizarre coincidence).</p>\n<p>It's sort of like saying you want to find a house with the highest\navailable altitude and the lowest available price; the highest house\nmight not have the lowest price and vice versa, the same way the way of\nrunning society which maximizes happiness is nearly certainly not be the\nway which maximizes all individuals' happiness.</p>\n<p>There are some classic moral puzzles that bring this out: Let's say\nthere's a city where basically everyone is in absolute ecstasy, but\ntheir ecstasy can only take place if one particular person in the city\nis in intense and indescribable pain. Or to put it another way, to\nmaximize <em>my</em> happiness, we might need to make everyone in the world my\nslave and allow me to rule as I please. Although this might maximize my\nhappiness, it might not maximize anyone else's (if it does however, we\nmight want to consider it).</p>\n<h2 id=\"the-well-being-of-conscious-creatures\">The Well-being of Conscious Creatures</h2>\n<p>So I recently read Sam Harris's <em>The Moral Landscape</em> which is either a\nfailed attempt to bring Utilitarianism back to life or a misguided book\nsimply ignorant of what the problems with it were. I don't actually\nrecall Harris using the term &quot;utilitarianism,&quot; although that is really\njust what he's arguing for.</p>\n<p>Harris repeats one mantra basically every paragraph of the book: &quot;the\nwell-being of conscious creatures&mdash;the well-being of conscious\ncreatures&mdash;the well-being of conscious creatures.&quot; In addition to\nbeing repetitive, the term is problematic for important reasons. So\nHarris wants our Utilitarian engineers to maximize &quot;the well-being of\nconscious creatures,&quot; but the problem is we can't <em>just add up</em>\nenjoyment in the first place. There's no way of taking my enjoyment of\ncandy, subtracting the pain of a broken nose and adding/subtracting an\nexistential crisis or two.</p>\n<p>Now his hope is eventually we'll understand the neurology of the brain\nenough to do just that. I don't take Harris for a fool, and he <em>does</em>\nhave a Ph.D. in neuroscience (obviously I am being sarcastic), but I\nthink he's ignoring all the important problems either to appeal to a\npublic audience or just to convince himself. We <em>can</em> study the\nneurology of feelings and get readings of neural activity, but objective\nneural activity is certainly not subjective experience. Twice as much\nneural activity doesn't mean &quot;twice&quot; the subjective experience.</p>\n<p>We can no better look at brain activation to understand subjective\nexperience any better than we can look at the hot parts of a computer to\nsee what it's doing.</p>\n<h3 id=\"you-cant-do-math-with-feelings\">You can't do math with feelings</h3>\n<p>Of course one of the problems of qualia/subjective experience is that\nthey are necessarily unquantifiable: imagine how you felt the last time\nyou got a present you really enjoyed&mdash;now imagine yourself feeling\nexactly <em>twice</em> as happy&mdash;now <em>1.5</em> times as happy&mdash;now <em>100</em> times as\nhappy.</p>\n<p>You can't do it, and even if you could, you couldn't compare that\nexperience with other experiences&mdash;you can't really understand what it\nmeans to be as happy as you were sad a month ago, and that prevents us\nfrom actually adding up your experiences into one number to be\nmaximized.</p>\n<p>But again <em>even if we could</em> it would be impossible to add that number\nup with someone else's experience. Humans have different subjective\nexperiences: caffeine affects me demonstrably different than other\npeople, but I can't quantify that; some people are more affected by\npain (to my understanding, women seem to have a neurology more\npain-prone than men), but how can we precisely relate the precise ratios\nof every individual person?</p>\n<p>And of course, although Harris wants to maximize &quot;the well-being of\n<em>conscious creatures</em>,&quot; we have no <em>clue</em> what kinds of conscious\nexperiences define animal life, or how many animals are &quot;conscious&quot; in\nany recognizable sense. As Thomas Nagel noted, we can't even begin to\nimagine what it's like to be a bat, but to quantify their experiences\nand compare them to our own? Forget about it!</p>\n<p>Douglas Adams in his <em>Hitchhiker's Guide to the Galaxy</em> presented the\nidea of a genetically engineered cow which not only was made to be able\nto speak, but to enjoy the prospect of being eaten and encourage others\nto kill and eat him. Experience itself is not some kind of thing arbiter\nof morality. Pain, in fact, might be a negligible or incomplete guide to\nwhat is not good. Children have to put up with being drug around to do\nmany things they don't enjoy. That doesn't mean some immorality in\nanything.</p>\n<p>The philosophical problems here are so endless as to make any kind of\nobjective application of Utilitarianism based on neuroscience far beyond\neven fancy. I will be so bold as to say that this will simply never be\npossible, regardless of what chips Elon Musk wants to put in your brain.</p>\n<h3 id=\"to-repeat\">To repeat:</h3>\n<ul>\n<li>We cannot quantify any particular feeling.</li>\n<li>On top of that, we cannot compare the values of different feelings.</li>\n<li>On top of that, we certainly not weigh the subjective feelings of\nall humans or beasts against other humans' feelings.</li>\n<li>On top of that, even if we could do that, we can't maximize for\nutility in such a way to maximize all individual happiness and\ncollective happiness simultaneously.</li>\n</ul>\n<p>Utilitarianism isn't just impossible, it's impossible every step of\nthe way.</p>\n<p>To be clear, these are not technological problems that a future\ntotalitarian government might be able to &quot;solve.&quot; There really is no\ncoherent sense in which we can put a number to a certain feeling of\nhappiness and subtract from that another person's feeling of\nunhappiness. Qualia are qualia. It's like subtracting the sound of an\nairplane from the color blue.</p>\n<h2 id=\"what-utilitarianism-really-is\">What Utilitarianism really is</h2>\n<p>Anyway, the tradition of Utilitarianism was always a failure, but it's\nan interesting sign of the times. The Enlightenment was a time of some\n(less than usually thought) scientific advancement and the idea was that\nas we began to understand the nature of the body and the stars and\neverything else, we could fully understand too human society.</p>\n<p>Eventually we could engineer and control them all. But as fast as we\nlearn things about the world, even faster do complications arise and we\nend up &quot;[restoring nature's] ultimate secrets to that obscurity, in\nwhich they ever did and ever will remain&quot; in Hume's words.</p>\n<p>The only really unfortunate thing is that the ruling class of the West\neither doesn't know or does care. There's a cynical sense in which\nthey are attempting to re-engineer or &quot;Build Back Better®️&quot; the world\non Utilitarian principles where every decision is determined to be\nacceptable by some centralized utilitarian calculus.</p>", "link": "https://lukesmith.xyz/articles/the-problems-with-utilitarianism/", "date_published": "2021-05-05 00:00:00+00:00", "persistent": true, "user": null, "language": "en-US"}]