[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Epic Vs Apple Explained", "description": "The trial between tech giants Apple and Epic Games has started. But why are Fortnite developer Epic suing Apple, and why is Fortnite still unavailable on Apple and Google devices? This video explains it all.", "link": "https://www.youtube.com/watch?v=K2O1dQ2IhTA", "date_published": "2021-05-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil Village - Early Hours Livestream", "description": "Jean-Luc and Ben take a look at the early parts of Resident Evil Village as well as some of The Mercenaries.", "link": "https://www.youtube.com/watch?v=NRCk33Z8aAY", "date_published": "2021-05-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Science Behind Why We Love Scary Games", "description": "Being stalked and pursued is a trope that's deeply rooted into the survival horror genre, and has been since the first Clock Tower in 1995. But it wasn't until Resident Evil 3: Nemesis that it became a staple in the long running franchise. Since Nemesis' debut in 3, players have been chased and terrorized by likes of Mr. X in the RE2 Remake, RE7's Jack Baker, RE6's Ustanak, and now the ever-adored Lady Dimitrescu in Resident Evil Village--and they're all equally very stressful and horrifying. \n\nKurt Indovina gets scared very, very easily. Yet, in spite of his trembling fear of being chased, he considers survival horror his favorite genre. And with Resident Evil Village here, a game he's very eager to play, he's left trying to understand why he enjoys these games so much, despite his near incapability of being able to handle them. In an effort to try and understand why people, like himself, enjoy being scared and chased, he turned to clinical psychologist Dr. Ken Carter, author of the novel Buzz!: Inside the Minds of Thrill-Seekers, Daredevils, and Adrenaline Junkies.\n\nIn the above video, Dr. Ken Carter helps Kurt understand the many theories as to why people enjoy the thrill of the scare. From Freudien ideology to science, there are many reasons to explain why people enjoy being scared despite the stress it causes. Some believe it's just the adrenaline, but according to Dr. Carter, it's a little more complicated than that.\n\nHopefully you'll leave watching this video having a better understanding behind the science as to why you may love the thrill of being scared too, or maybe why you don't like horror games at all!", "link": "https://www.youtube.com/watch?v=P_diFuZ5urw", "date_published": "2021-05-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Titanfall 2's 2021 Comeback", "description": "Respawn Entertainment decided to allow free access to Titanfall 2 from April 30th to May 3rd, and suddenly, new players abound have discovered the brilliance of Titanfall 2. So, after repeatedly being dealt a bad hand, this is why Titanfall 2's resurgence is well deserved.\n\nWhile Titanfall 2 was an oft missed gem in 2016, suddenly longtime players are posting videos stomping on a horde of new players. That’s right - new players. The game just had one of its best weeks in years, but why now, and what exactly have new players been missing all this time? This is the history of Titanfall 2, and why, 5 years after the fact, people are just now discovering its brilliance.", "link": "https://www.youtube.com/watch?v=Nq5WtCpgvCg", "date_published": "2021-05-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Biomutant - The Final Preview", "description": "Before its full release on May 25, we had the chance to check out a final preview of Biomutant. The game balances various mechanics and approaches to storytelling, which certainly make for an enticing take on a post-apocalyptic adventure game. \n\nDescribed as a \"post-apocalyptic kung-fu fable,\" the action and storytelling on display in Biomutant present an adventure that's an intriguing mix of the classic animated film Secret of Nimh, along with the platforming and action of games like Enslaved: Odyssey To The West and Devil May Cry. And therein lies the hook for Biomutant; it wears its weirdness on its sleeve, presenting an alluring take on what the post-apocalyptic Earth would look like once the animals inherit the world.\n\nIn our preview, we got a clearer sense of the game's focus on action and storytelling, and how the hero's journey will evolve in a world full of talking animals and decaying automatons. First revealed back in 2017, Biomutant is the debut game from Experiment 101, made up of former developers from the Just Cause series. Biomutant is a departure from that particular series, which instead focuses more on exploring a Zelda-like map with action-RPG mechanics that blend third-person combat and RPG-like progression. \n\nBiomutant releases for PS4, Xbox One, and PC on May 25th.", "link": "https://www.youtube.com/watch?v=HjXqDTETjqM", "date_published": "2021-05-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil Village Video Review", "description": "The sequel to Resident Evil 7 leans heavily on Resident Evil 4's brand of action, but adds its own sensibilities to the mix.\n\nPhil Hornshaw scoured the ramshackle houses and strange environs of Resident Evil Village for about 12 hours on PlayStation 5, which included blasting off quite a few lycan heads in The Mercenaries. Review code was provided by the publisher.", "link": "https://www.youtube.com/watch?v=Kmkm-LQbcDo", "date_published": "2021-05-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]