[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 Gameplay Finally Shows Specialists In Action | GameSpot News", "description": "Persia talks about new gameplay revealed for Battlefield 2042, Hideo Kojima’s Director’s Cut trailer for Death Stranding which releases September 8th, Fortnite's end of Season 7 live event, and an adorable new update for Ghosts of Tsushima.\n\nIn this video, Persia talks about the new gameplay of Battlefield 2042 that was released along with plans to change Falck’s Syrette pistol after feedback from the alpha. \n\nShe also covers the Director’s Cut trailer released on September 8th that was edited by Hideo Kojima himself and also discusses Fortnite’s upcoming event Operation: Sky Fire. This event will bring Fortnite Chapter 2 to a close and will be a limited-time event.\n\nLastly, Persia talks about a very important and very adorable update for Ghosts of Tsushima that adds new charm to its foxes of Ikki Island with heart-melting animations.\n\nIntro - 00:00 \nBattlefield 2042 - 00:19\nDeath Stranding - 01:22 \nFortnite - 02:28\nGhosts of Tsushima - 03:28 \nOutro - 04:24\n\nYou can read more about all of today’s topics on gamespot.com\n\n#Battlefield2042 #Battlefield", "link": "https://www.youtube.com/watch?v=vQOErPdS5_c", "date_published": "2021-09-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Everything We Know about DokeV", "description": "DokeV's latest trailer was unleashed during Gamescom and its exciting style, world, and similarities to Pokemon have gotten people excited. But, what exactly do you do in the game? Here's everything we know so far.\n\nOne of Gamescom’s biggest trailers this year was for an upcoming game titled DokeV. The trailer was fun, stylish, and flashy—and had Pokemon in a big city vibes. But ultimately, we still don’t know all that much about the game. So, what the heck is DokeV… and why am I so excited about a trailer that ultimately didn’t really show actual gameplay?\n\n#DokeV", "link": "https://www.youtube.com/watch?v=nqTvgrKGx-8", "date_published": "2021-09-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Fallout 4’s Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of Fallout 4, including a selection of the game’s bizarre pipe-based firearms, the infamous 10mm pistol, and the man-portable cannon, the Broadsider.\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of Fallout 4 and compares them to their real-life counterparts.\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\n#firearms #fallout4 #royalarmouries", "link": "https://www.youtube.com/watch?v=5FVzcoRjoN4", "date_published": "2021-09-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "NEW Battlefield 2042 Specialists Overview Gameplay Trailer", "description": "Check out new gameplay for Battlefield 2042's Specialist system, which is based on Battlefield's four Classes: Assault, Support, Engineer, and Recon. Each Specialist has one unique Specialty and Trait, but the rest of the loadout can be customized.\n\nWebster Mackay comes from the Canadian military and is a part of the Assault class. He has a grappling hook that can help him get around to other areas quicker. Mackay also has the Nimble Trait, which allows him to move more quickly when aiming down sights.\n\nMary Falck served in the German army for six years and is a combat medic, based on Battlefield's Support class. Her S21 Syrette Pistol fires syringes that heal allies and damage enemies. Being a combat surgeon, she can nurse downed enemies back to full health when reviving.\n\nPyotr \"Boris\" Guskovsky is a Russian engineer and a weapons expert. He has a SG-36 Sentry that automatically spots and shoots at enemies within a certain radius. When his sentry gun locks onto a target, he also becomes aware of the enemy's position as well.\n\nLastly, Wikus \"Casper\" Van Daele is from South Africa and part of the Recon class. His OV-P Recon Drone can spot moving targets and disorient them with EMP blasts. He also has a Movement Sensor that alerts him to approaching enemies should they try to sneak up on him while he's on the ground or piloting his drone.", "link": "https://www.youtube.com/watch?v=YjQmBvQ31Bk", "date_published": "2021-09-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "When To Watch The PlayStation September Showcase | GameSpot News", "description": "Major announcements have been made today including PlayStation and THQ Nordic revealing showcases for September and Minecraft Live coming this October. Destiny 2 has also released patch notes for an update that will be adding cross-platform voice chat and more.\n\nIn this video, Persia talks about the major announcements of 3 upcoming showcases along with Destiny 2’s newest patch. \n\nPlayStation has announced the PlayStation Showcase event for September 9 that will reveal updates on upcoming games that will be around 40 minutes in length and will begin at 1 PM PT / 4 PM ET. Horizon Forbidden West, God of War: Ragnarok, Final Fantasy XVI, and more are among the games we could possibly see more from.\n\nTHQ Nordic will be hosting a digital showcase event on September 17 at 12 PM PT / 3 PM ET led by The Game Awards executive producer Geoff Keighley and will feature six new game announcements - Including a tease in regards to the return of a “legendary franchise” that “fans have been waiting decades to get their hands on.”\n\nMinecraft Live, will return in 2021 through a digital showcase scheduled for October 16th. The Minecraft Live event will celebrate \"all things blocky,\" promising an \"epic livestream\" for fans to tune in to.\nPersia also talks about Bungie’s reveal of the patch notes for Destiny 2's Update 3.3.0.1, which is the first update following the launch of Season of the Lost and will implement cross-platform voice chat, hot fixes, and more.\n\nVisit gamespot.com for more information on all of the topics in this video.\n\n#playstation", "link": "https://www.youtube.com/watch?v=ii5vTwfBRxg", "date_published": "2021-09-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]