[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Delta plus and long covid", "description": "Delta plus, First identified in India in 2020\n\nhttps://www.bbc.com/news/world-asia-india-57564560\n\nIndia and Europe classified a new VOV\n\nAY.1, additional mutation K417N (Aldo found in Beta, SA stain)\n\nIndia says, spreads more easily, binds more easily to lung cells, potentially resistant to monoclonal antibody therapy\n\nNo data to be over concerned now\n\nUSA, UK, Portugal, Switzerland, Japan, Poland, Nepal, Russia, China\n\nLong covid and vaccination\n\nhttps://covid.joinzoe.com/post/double-covid-vaccination-halves-risk-of-long-covid\n\nRisk factors and disease profile of post-vaccination SARS-CoV-2 infection in UK users of the COVID Symptom Study app: a prospective, community-based, nested, case-control study\n\nhttps://www.sciencedirect.com/science/article/pii/S1473309921004606\n\nDouble vaccination\n\n31% less likely to experience acute COVID symptoms\n\n47% less likely to get Long COVID if they become infected\n\n73% less likely to be hospitalised\n\nMost common symptoms\n\nSimilar to unvaccinated adults\n\nAnosmia, cough, fever, headaches, fatigue\n\nAll milder and less frequently\n\nHalf as likely to get multiple symptoms in the first week of illness\n\nSneezing, only symptom more common in vaccinated\n\nTim Spector\n\nVaccinations are massively reducing the chances of people getting Long COVID in two ways. \n\nFirstly, by reducing the risk of any symptoms by 8 to 10 fold \n\nand then by halving the chances of any infection turning into Long COVID, if it does happen.\n\nWe are encouraging people to get their 2nd jab as soon as they can\n\nSajid Javid\n\nCOVID-19 vaccines have saved more than 105,000 lives and prevented over 24 million infections in England alone\n\nThis research is encouraging, suggesting vaccines are not only preventing deaths but could also help prevent some of the longer lasting symptoms\n\n80 long COVID assessment services have opened across England\n\nIt is clear vaccines are building a wall of defence against the virus and are the best way to protect people from serious illness\n\nAustralia\n\nhttps://www.bbc.com/news/world-australia-58406526\n\nPrime Minister Scott Morrison\n\nTime to leave lockdowns\n\nCome out of the cave, live with the virus\n\nRadical change from ‘fortress Australia’\n\n‘Covid zero’\n\nE.g. Melbourne, 200 days of lockdown over 2 years\n\nNow\n\nVaccinating fact\n\nAll over 12years\n\nEase out of lockdowns\n\nVaccinated people, more freedoms\n\nContinue testing and tracing\n\nRetain low-level restrictions, mask-wearing, social distancing\n\nBorders open at 80% threshold double dosage\n\n?? December\n\nProf Ivo Mueller, Melbourne\n\nThe plan that is proposed is actually very thoughtful and careful\n\nIt's not 'Freedom Day, it's not let's throw everything out the window and go party\n\nPredicted\n\n13 – 1,500 deaths in 6 months", "link": "https://www.youtube.com/watch?v=KlxFfiJsEfM", "date_published": "2021-09-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Covid bounce back", "description": "COVID bounce back, based on PCR and LFT test data\nhttps://covid.joinzoe.com/data#levels-over-time\n\nhttps://covid.joinzoe.com/post/covid-bounces-back-as-cases-start-to-rise\n\nBased on PCR and LFT test data\n\n7th to 21st August 2021\n\nAround one million weekly contributors\n\n25,876 recent swab tests\n\nSymptomatic cases in fully vaccinated (UK), 29.4% of the total new daily cases\n\nOur data shows post-vaccination infections are much more like a cold than the flu, with the top symptoms being runny nose, headache, sneezing, sore throat and loss of smell. \n\nWe’re again calling on the government to add these cold-like symptoms to their list to help educate the public and catch more cases\n\nNew cases are highest in the 18-35 age groups\n\nFollowed by the 0-18 year olds\n\nPrevalence\n\nOn average 1 in 100 people in the UK currently have symptomatic COVID\n\nUK R value is 1.1 (Scotland, 1.2)\n\nLong covid\n\nEstimated that 870 cases a day will go on to experience symptoms for longer than 12 weeks\n\nProbability of long COVID is much lower than the previous wave\n\nProbability of contracting long COVID is much higher in younger people\n\nDriven by the fact that more young people are contracting COVID now compared to older \ngenerations\n\nProfessor Tim Spector\n\nUnfortunately, we’re back in a position where cases, hospitalisations and deaths are all going up and the UK has the highest rates of COVID in Europe, despite our superior vaccination rates. \n\nThe main difference between the UK and Europe is our lack of restrictions. In many parts of Europe, people are still wearing face coverings and observing some social distancing. \n\nIn the UK, where we eagerly declared ‘freedom’ from COVID and did away with even the most basic social measures, COVID has found an opportunity to spread. \n\nAs kids head back to the classrooms, there’s a good chance cases will continue to rise from here.\n\n\nUK data\n\nhttps://coronavirus.data.gov.uk\n\nUnited States data\n\nhttps://covid.cdc.gov/covid-data-tracker/#trends_dailytrendscases\n\nhttps://covid.cdc.gov/covid-data-tracker/#vaccination-trends\n\nhttps://covid.cdc.gov/covid-data-tracker/#hospitalizations", "link": "https://www.youtube.com/watch?v=b_d7OLO_2nE", "date_published": "2021-09-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]