[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCyl5V3-J_Bsy3x-EBCJwepg", "title": "The Bee Weekly: Big Tech Challenges With Dan Dillon and The Voice of The Bee", "description": "CTO Dan Dillon and the Voice of The Bee, Austin Robertson, join Kyle and Ethan this week to talk about big tech challenges, The Bee’s ambitions for the future, and how there’s always money in the Lakewood Church bathroom. Dan Dillon designed Not The Bee too. The guys play a game to find out who knows the most about The Babylon Bee and Dan Dillon discusses the challenges of running conservative websites in today’s internet environment.\n\nThis episode is brought to you by Issues, Etc.radio talk show and podcast which features expert guests, expansive topics, while extolling Christ. Go to http://issuesetc.org/babylonbee today!\n\nBe sure to check out The Babylon Bee’s sister site, Not The Bee, which has real news articles that we can’t believe aren’t satire and a full-fledged social media experience: http://notthebee.com\n\nKyle, Ethan, Dan, and Austin go through the week’s weird news including an Italian man avoiding the vaccine with a fake arm, a breastfeeding airline passenger whose child might actually be a cat, and the money that is pouring out of the walls of Joel Osten’s church bathroom. They talk about the week’s Banger and Bomb of the Week at The Babylon Bee, including how the unemployment rate for both Cuomo brothers has gone up 100%. Of course Austin Robertson reads the extra salty hate mail in his super sultry voice.\n\nIn the subscriber lounge, CTO Dan Dillon answers questions submitted by Not The Bee subscribers before the guys read subscriber-submitted headlines, read love mail, and Dan Dillon and Austin Robertson answer The Ten Questions!\n\nBecome a premium subscriber:  https://babylonbee.com/plans\n\nThe Official The Babylon Bee Store:  https://shop.babylonbee.com/\n\nFollow The Babylon Bee:\nWebsite: https://babylonbee.com/\nTwitter: https://twitter.com/thebabylonbee\nFacebook: https://www.facebook.com/TheBabylonBee\nInstagram: http://instagram.com/thebabylonbee", "link": "https://www.youtube.com/watch?v=fv9NEzaCsIY", "date_published": "2021-12-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]