[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Tiny Desk Meets SXSW: clipping.", "description": "Every year, NPR Music participates in the SXSW music festival, whether it's curating a stage or simply attending hundreds of shows at the annual event in Austin, Texas. Last year, the festival was canceled due to the pandemic, but it returned this March as an online festival. We programmed a 'stage' of Tiny Desk (home) concerts and presented them on the final day of the festival. Now, we present to you Tiny Desk Meets SXSW: four videos filmed in various locations, all of them full of surprises.\n\nStephen Thompson | April 8, 2021\nLeave it to clipping. to innovate around the central notion of the Tiny Desk; to take the series' emphasis on close-up intimacy and transport it to new heights of, well, tininess.\nThis is, after all, a band that contains multitudes. Producers William Hutson and Jonathan Snipes craft a bed of hip-hop, industrial music and noisy experimentalism, then set loose rapper Daveed Diggs, whose violent imagery summons '90s horrorcore and a thousand bloody movies. The band's last two album titles — There Existed an Addiction to Blood and Visions of Bodies Being Burned — offer up a sense of the vibe, but Diggs' gift for rapid-fire wordplay also acts as a leavening agent. The guy won a Tony Award for playing Thomas Jefferson and the Marquis de Lafayette in Hamilton, and he still knows how to sell every word that leaves his lips.\n\nSo, yeah, multitudes. Plus, in this video, a few surprises to trick your eye and help pull you into a clever and disorienting world of sound.\n\nSET LIST\n ▪ \"Something Underneath\"\n ▪ \"Bout That\"\n ▪ \"Check the Lock\"\n ▪ \"Shooter\"\n ▪ \"The Show\"\n ▪ \"Nothing Is Safe\"\n\nMUSICIANS\n ▪ Daveed Diggs: vocals\n ▪ William Hutson: beats, effects\n ▪ Jonathan Snipes: beats, effects\n ▪ Chukwudi Hodge: drums\n\nCREDITS\n ▪ Video: Cristina Bercovitz, Erin Bates, Daveed Diggs\n ▪ Audio: clipping.\n ▪ Tiny furniture fabricated by: Cristina Bercovitz\n\nTINY DESK TEAM\n ▪ Producer: Bob Boilen\n ▪ Video Producer: Maia Stern\n ▪ Audio Mastering: Josh Rogosin\n ▪ Associate Producer: Bobby Carter\n ▪ Tiny Production Team: Kara Frame\n ▪ Executive Producer: Lauren Onkey\n ▪ Senior VP, Programming: Anya Grundmann\n\n\n\n#nprmusic #tinydesk #clipping", "link": "https://www.youtube.com/watch?v=Fn6S9NTpPvk", "date_published": "2021-04-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Tiny Desk Meets SXSW: DUCKWRTH", "description": "Every year, NPR Music participates in the SXSW music festival, whether it's curating a stage or simply attending hundreds of shows at the annual event in Austin, Texas. Last year, the festival was canceled due to the pandemic, but it returned this March as an online festival. We programmed a 'stage' of Tiny Desk (home) concerts and presented them on the final day of the festival. Now, we present to you Tiny Desk Meets SXSW: four videos filmed in various locations, all of them full of surprises.\n\nBobby Carter | April 7, 2021\nDUCKWRTH decided to do something special for Tiny Desk Meets SXSW: brand new music. \"Welcome to my Tiny Desk,\" he says. \"We are gonna play some new songs for y'all if that's OK. Y'all ain't got no choice!\"\n\nThe dynamic R&B singer proceeded to debut two exclusives: a slow jam titled \"make u go,\" which he dedicates to the \"lovers and freaks,\" and the upbeat \"Birthday Suit,\" which KCRW astutely compared to Estelle's \"American Boy.\"\n\nThe new material wasn't the only thing that made this Tiny Desk such a treat. For this funky and flamboyant performance, DUCKWRTH dressed his backing band entirely in white and switched up the lighting for each song so that the hue matched the mood he was laying down.\n\nDUCKWRTH has long been a creative soul. He spoke with NPR in 2019 about growing up in a Pentecostal household in South Central Los Angeles, and how those two worlds helped shape his journeys between R&B and West Coast G-funk.\n\nSET LIST\n\"Kiss U Right Now\"\n\"make u go\"\n\"Birthday Suit\"\n\"Super Good\"\n\nMUSICIANS\nDUCKWRTH: vocals\nJustin \"Jhawk\" Hawkins: guitar\nDarryl Staves Jr.: drums\nSolomon \"Solo\" Smith: bass\nDevin Smith: keys\nAmber Olivia Kiner: vocals\nOlivia Walker: vocals\n\nCREDITS\nVideo: BT Studios, Jonathan Salmon, Lopes\nAudio: Lucas Palmieri\nMixed by: Josh Rogosin\nCreative Director - Abdi Ibrahim\nDirector of Photography - Adam Linssen\nSpecial Thanks: Beehive Studios\n\nTINY DESK TEAM\nProducer: Bobby Carter\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Bob Boilen, Kara Frame\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #DUCKWRTH", "link": "https://www.youtube.com/watch?v=0-PlG-SU8sc", "date_published": "2021-04-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]