[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCmKurapML4BF9Bjtj4RbvXw", "title": "Eye of the Tiger - Survivor (Lullaby Version) The Piano Guys", "description": "GET OUR LATEST ALBUM: https://smarturl.it/TPG_LATEST_ALBUM \n“Eye of the Tiger” by Survivor lullaby piano cover from The Piano Guys.\nSTREAM THIS SONG & GET SHEET MUSIC: https://smarturl.it/tigereye_landing | LIVE TOUR: https://smarturl.it/the10tour | SUBSCRIBE https://bit.ly/2XH4GCF | Our NEWEST videos: https://youtube.com/playlist?list=PL7j5iXGSdMwdfnzc8Faa-HJITq9hPEEdI&playnext=1&index=2\n\nLearn about our beliefs here: https://smarturl.it/TPG_Beliefs \n\nFollow The Piano Guys:\nInstagram: https://instagram.com/thepianoguys\nFacebook: https://facebook.com/ThePianoGuys\nTwitter: https://twitter.com/thepianoguys\n\nWatch More of The Piano Guys: \nCovers: https://youtube.com/playlist?list=PL7j5iXGSdMwc7n8Tsjl-I8zEOEZsjWydx&playnext=1&index=2 \nOfficial Music Videos: https://youtube.com/playlist?list=PL7j5iXGSdMwfDukj_bIIB_1JhbYtaWRYg&playnext=1&index=2 \nNewest Videos: https://youtube.com/playlist?list=PL7j5iXGSdMwdfnzc8Faa-HJITq9hPEEdI&playnext=1&index=2\nMost Popular: https://youtube.com/playlist?list=PL7j5iXGSdMweXm56WEjskhCT5oAeEZJQF&playnext=1 \n\nListen to The Piano Guys: \nSpotify: https://open.spotify.com/artist/0jW6R8CVyVohuUJVcuweDI?si=8GgyFRhiTz6POs8b0ir2IA&dl_branch=1 \nApple Music: https://music.apple.com/us/artist/the-piano-guys/498030399 \nAmazon Music: https://amazon.com/The-Piano-Guys/e/B00BXLTTI4 \n\nStory Behind the Music: \nThis is Track #1 on our new ALBUM “LULLABY”. They say a journey of a thousand miles begins with a single step. This album’s journey of a thousand notes began with a single notion. \n\nWhat if “Eye of the Tiger” was a lullaby? We often hear from beautiful people such as yourself that much of our music can be used as a sleep aid. “Counting sheep 2.0” -- a symphonic prescription for insomnia. In fact, one of our favorite emails of all time was from a brave navy man who served on a submarine. In his letter he talked about his struggle with claustrophobia. Can you imagine? He said he couldn’t get to sleep at night in his shoebox-sized space...until he found our music. Every night he’d don his headphones, hit play and then close his eyes. He said our music would transport him to a place where there was plenty of room for peace of mind. He could finally fall asleep.\n\nStories like this made us want to compose a whole album full of musical melatonin. But not just any old lullabies -- with cliché melodies and icky toy music box sounds. We wanted to go all out (as we like to do). We wanted to rewrite household “hits” with a thoughtful lullaby filter to see if they could stand up to helping people like you lie down.\n\nThe result of such an endeavor starts with this tune you’re watching now and will be fully released in October! The album is called “LULLABY” and it is dedicated to our friend, the courageous claustrophobic serviceman; to you parents who tirelessly, and often sleeplessly, love your children into becoming their best selves, praying for them as they sleep; AND to you insomniacs out there whose creative minds refuse to turn off at night. We know how that feels. \n\nWe hope you’ll support us and buy (or stream) this album and make it part of your nightly routine -- a soundtrack to sleep by! Thank you from the bottom of our feather pillows for listening to our music, watching our videos and for supporting us. Without you all our dreams would still be asleep.😴\n\nLove, The Piano Guys\n\nP.S. The BEST way to support this project is by putting your name on it! CLICK HERE to print your name (or the name of someone you love) in this album: https://smarturl.it/Chill_Lullaby \n\nSong & Video Credits:\nEye of the Tiger written by: Frankie Sullivan & Jim Peterik (as performed by Survivor)\nArranged by Jon and Michelle Schmidt \n(Includes melody from the traditional lullaby  “All The Pretty Little Horses”)\nRecorded and Produced by: Jon Schmidt\nMixed & Mastered by: Al van der Beek\nPerformed by: Jon Schmidt (piano) \nSheet music transcriptions - Craig Knudsen \nCinematography & Editing by: Nick Sales (Aevium Films)\nLocation: Foleys Mixed Martial Arts, Ogden Utah\n\nAbout The Piano Guys:\nPaul, a Yamaha dealer who dabbled in videography, Jon, a professional pianist, Al, a music producer and studio engineer, and Steve, a cellist with a creative superpower called ADHD, all serendipitously joined forces to create the most successful YouTube instrumental music group in history. The Piano Guys’ mission is to inspire and spread hope through incomparably imaginative piano music videos filmed all over the world. On this channel you can regularly find piano covers of music from genres like top 40, pop, classic rock, R&B, hiphop, country, and more. \n\n#Survivor #PianoCover #Piano #EyeOfTheTiger #Lullaby", "link": "https://www.youtube.com/watch?v=0h9tC3FM9UI", "date_published": "2021-09-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]