[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Death Stranding Director's Cut Video Review", "description": "While the new features and missions are nice, the world around us has made Death Stranding better.\n\nJustin Clark spent 40 hours on Death Stranding Director's Cut, half from the beginning, half with his imported PS4 clear save. He is currently accepting applications for babies to carry around in a clear container on his stomach for Halloween. A code was provided by the publisher.\n\n#deathstranding", "link": "https://www.youtube.com/watch?v=rfmb_tv52L4", "date_published": "2021-09-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To MORE Rainbow Six Siege Guns", "description": "Firearms Expert Reacts To MORE Rainbow Six Siege Guns\nBy popular demand, Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down EVEN MORE weapons and gadgets from Rainbow Six Siege, including the C8-SFW, the V308 Vector and the infamous BOSG.12.2.\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of Rainbow Six Siege and compares them to their real-life counterparts.\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\n#firearms #expertreacts #rainbow6siege", "link": "https://www.youtube.com/watch?v=TQlpXtv-IN4", "date_published": "2021-09-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Infinite Weapons & Super Punch Glitch Leak | GameSpot News", "description": "Halo Infinite’s multiplayer beta is live once again and with it comes the leak of new weapons and a similar glitch to an old Halo 2 one. Gameplay footage from Battlefield Mobile is spotted online. And The Last of Us is getting new content.\n\nIn this video, DeVante talks about Halo Infinite’s newest weapons that were revealed by accident in the current multiplayer beta. Alongside the weapons are a new glitch, reminiscent of an old “BXB” glitch from Halo 2. 343 Industries have also given more details on the future of Infinite’s bots. \n\nLater in the video, DeVante goes over new Battlefield Mobile gameplay footage that surfaced online after EA soft launched the game in Philippines and Indonesia. Battlefield Mobile does not have a release date yet. \n\nOn September 26, 2021, Naughty is planning to reveal “all new content”, however at this time it is unclear what exactly that content will be. Fans can expect the announcement at 9am PT / 12pm ET on Sunday.\n\nTIME STAMPS:\n00:00 - Intro\n00:14 - New Halo Weapons Leak\n00:57 - Halo Infinite Glitch Spotted\n01:23 - Halo Infinite Bots Getting Smarter\n02:06 - Battlefield Mobile Gameplay Footage \n02:49 - Perfect Dark Reboot Being Co-Developed By Crystal Dynamics\n03:15 - The Last of Us Getting New Content\n\n#halo #haloinfinite #superpunch", "link": "https://www.youtube.com/watch?v=Iwl28_HQaIU", "date_published": "2021-09-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Best Nintendo Direct Trailers (September 2021)", "description": "Nintendo Direct for September 2021 has wrapped up, and in this video we're taking a look at the best trailers from the event. We got to see a brand new reveal for Kirby and the Forgotten Land, a gameplay trailer for Bayonetta 3, another look at Splatoon 3, and much more. \n\nCheck out the video for a look at all of the most exciting reveals.\n\n00:00 - Kirby and the Forgotten Land\n02:17 - Bayonetta 3\n06:03 - Chocobo GP\n07:00 - Monster Hunter Rise: Sunbreak\n08:03 - Actraiser Renaissance\n10:43 - Splatoon 3\n12:44 - Metroid Dread\n15:17 - Disco Elysium - The Final Cut - Switch Edition\n\n#nintendodirect2021", "link": "https://www.youtube.com/watch?v=ZAfsxYPSZbU", "date_published": "2021-09-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Vanguard Beta vs Modern Warfare", "description": "Call of Duty: Vanguard feels like a hybrid between Modern Warfare 2019 and Call of Duty: WW2. It has many of Modern Warfare’s advances like gun customization and adds some flavor to maps by way of limited destruction. But Vanguard also falls behind Modern Warfare in a few key areas. Let’s talk about where Vanguard stacks up to recent Call Of Duty games and how it might compete this year with other AAA shooters like Battlefield. \n\nCall of Duty: Vanguard, being developed by Sledgehammer Games, is the next title following Black Ops - Cold War. Unlike Cold War, Vanguard runs on a modified engine used for Modern Warfare 2019. As we played through the recent Vanguard beta, we couldn't help but notice the major similarities, and important differences, between Vanguard and Modern Warfare. \n\nIn this video, we’re going to take a look at the Vanguard Beta from a Modern Warfare perspective and analyze how, in some cases, Vanguard feels like a reskinned version of 2019's title. For many fans, Modern Warfare took the COD franchise in a completely new direction, with its porous open maps, tactically inspired weapon handling, and heavy gun customization. Modern Warfare also introduced the now free-to-play battle royale game Warzone. Vanguard appears to expand on Modern Warfare's Gunsmith menu and adds some new features like limited environmental destruction, movable objectives, a reworked minimap, and the ability to choose the \"combat pacing\" which varies the number of players and the kinds of matches you play with others. However, Vanguard takes steps back toward classic Call of Duty map design with smaller three-lane layouts, easier-to-handle weapons, and familiar killstreaks. \n\nWe don’t know much yet about the new Warzone map coming with the launch of Vanguard, but we do know the transition between multiplayer and battle royale will be much smoother than in past series entries, with Vanguard sporting many of the same mechanics as Modern Warfare. Call Of Duty: Vanguard is set to launch on November 5, now two weeks before the delayed Battlefield 2042.\n\n#cod #callofduty #codvanguard", "link": "https://www.youtube.com/watch?v=7gFCxiQV_K8", "date_published": "2021-09-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Infinite Technical Preview Round Two Livestream", "description": "Join Persia for the second round of the Halo Infinite Multiplayer Technical Preview. This weekend features 4v4 Arena matches.\n\n#halo #haloinfinite", "link": "https://www.youtube.com/watch?v=ivbp-F-Eez4", "date_published": "2021-09-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "N64 & Sega Genesis Games Coming To Nintendo Switch Online | GameSpot News", "description": "Nintendo’s September Direct features the . Halo Infinite’s multiplayer beta was almost delayed due to \"late-breaking issues\".  And Respawn hints at a if there could be a new Titanfall in the future. \n\nIn this video, DeVante goes over the highlights from Nintendo September Direct. Some key moments include: the announcement of N64 and Sega Genesis games coming to Nintendo Switch Online, Bayonetta 3 gameplay, a new Kirby game and the reveal of the Mario movie cast. \n\nLater, DeVante explains how Halo Infinite’s multiplayer beta was almost delayed due to \"late-breaking issues\" and how Titanfall may have a future with Respawn.\n\n#n64segagenesis #segagenesis", "link": "https://www.youtube.com/watch?v=60_BN7YIgC0", "date_published": "2021-09-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]