[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "17 Best Dogs in Games", "description": "In-game companions come in many different shapes and sizes but this video is all about the doggos. Join Persia as she highlights dogs from fan-favorite titles such as Hades, GTA V, Animal Crossing, and many more. \n\nLet’s face it--dogs are amazing and we can never get enough of them. GameSpot very much acknowledges this, which is why we’ve gone ahead and rounded up what we think are the best puppies in gaming for your viewing pleasure. \n\nJoin Persia as she guides us through 17 amazing, beautiful puppers seen in video games. Reminisce on wonderful gaming canines such as D-Dog from Metal Gear Solid 5, the loveable Chop from Grand Theft Auto 5, Okami’s majestic Amaterasu and the Kusa 5, or even the three-headed doggo, Cerberus, from Supergiant Games’ Hades. \n\nBegging for more dogs? Let us know which ones we’re missing in the comments below. Want to see the best cats in games? Or maybe the worst cats in games? Let us know!", "link": "https://www.youtube.com/watch?v=_JZnTEzh8uU", "date_published": "2021-02-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Zelda BOTW Expert Reacts To MORE Viral Clips", "description": "Max “RinHara5aki” Blumenthal with over 2300+ hours experience with Breath of the Wild, reacts and breaks down clips from viral speedruns, combat, glitches, and more.\n\nBe sure to check out Max's previous episode in BOTW Expert Reacts here: https://youtu.be/8LntT_fN_74\n\nBreath of the Wild's complex mechanics and overlapping intricacies led players to push the game's boundaries, resulting in several gameplay clips that took the internet by storm. Some of these are so complex, it's hard for the average player to decipher exactly what's even happening. \n\nIn the above video, Max, our in-house BOTW expert, reacts to some of the most viral BOTW clips, and breaks down techniques commonly used in speedruns like Shield Surf Forced Ragdoll, Fireball Marking, Bomb Parrying, and more.\n\nWant Max to react to your clips? Have suggestions for anything you want to see? Drop them in the comments below. \n\nSources:\n00:37 — Clip 1: https://youtu.be/tvVG0_0jzjk?t=1066\n2:23 — Clip 2: https://youtu.be/u-NYJfD4kvI?t=1196\n4:56 — Clip 3: https://youtu.be/bylERGdS_z8?t=69\n5:59 — Clip 4: https://twitter.com/smaho_neko/status/1348231383508946952\n8:53 — Clip 5: https://www.reddit.com/r/Breath_of_the_Wild/comments/dtifkk/yep_shock_arrows_are_precious/\n10:09 — Clip 6: https://twitter.com/HylianVicki/status/1359174210266910724\n12:07 — Homework", "link": "https://www.youtube.com/watch?v=RPlHQEAXrYo", "date_published": "2021-02-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]