[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Age of Empires: Fan Preview Livestream", "description": "Tune for surprises, reveals, new gameplay civilizations and campaigns, and much more Age of Empire first-looks. The stream begins on Saturday, April 10th at 9am PT/ 12pm ET.", "link": "https://www.youtube.com/watch?v=8vALjV1pkqE", "date_published": "2021-04-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Metro Franchise Guns", "description": "If you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can purchase Jonathan's book here - https://www.headstamppublishing.com/bullpup-rifle-book", "link": "https://www.youtube.com/watch?v=XKRTkZOFiuk", "date_published": "2021-04-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "How Awful Can You Be In Disco Elysium?", "description": "In this video, Jake breaks down his experience of playing as the worst detective there is in Disco Elysium.", "link": "https://www.youtube.com/watch?v=5xijCtokEK4", "date_published": "2021-04-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Diablo 2 Resurrected Alpha vs Diablo 2 Gameplay Comparison", "description": "With the technical alpha for Diablo II Resurrected finally arriving we compare the new remastered version with the original. In this clip we show off different parts of Act 1 as a Sorceress.\n\n\nThe technical alpha for Diablo 2 Resurrected is available for the few who have access to it via Battle.net on PC. One of its key features is the ability to seamlessly switch between the new overhauled graphics and the original visual style on the fly with a keystroke. In going between the enhanced HD visuals in 16:9 widescreen and the old-school look in 4:3 aspect ratio, you realize how much Diablo 2 has aged, and you can see exactly how in the video above.\n\nGameplay was captured on PC using the ability to swap visual style in the same instance. You'll see the redone assets, updated animations, and silky smooth frame rate when using the Resurrected visual mode. But since both versions of the game exist simultaneously, the core gameplay experience remains intact. Other than a revamped user interface and a few quality of life changes, Diablo 2 Resurrected will play exactly as you remember it from all those years ago. It's evident in the Sorceress gameplay in the video above with all the familiar mechanics and systems that made Diablo 2 a classic RPG.\n\nDiablo 2 Resurrected is scheduled to release sometime in 2021 on PC, PS4, PS5, Xbox One, Xbox Series X|S, and Switch. Blizzard has a beta phase planned before launch as well, so more people will be able to get a chance to try this remaster.", "link": "https://www.youtube.com/watch?v=JUZkCIRT09U", "date_published": "2021-04-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Diablo 2 Resurrected Barbarian Alpha Gameplay Livestream", "description": "Tune in as we take the Barbarian for a whirl around Act 1 and Act 2 of the Diablo II Resurrected Technical Alpha.", "link": "https://www.youtube.com/watch?v=vz3CUMN3dJs", "date_published": "2021-04-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Outriders Review", "description": "People Can Fly's Outriders mixes a lot of well-worn shooter and RPG elements to create something that feels fresh, if you can get used to its balance.\n\nPhil Hornshaw has spent about 40 hours on Enoch as a Devastator in the PC version of Outriders, using flying rocks to turn insurgents into a fine pink mist. Code was provided by the publisher. Read the full review on GameSpot.com: https://bit.ly/3mHlHVG", "link": "https://www.youtube.com/watch?v=ky2OHIK05NA", "date_published": "2021-04-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]