[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "Slimbook Titan - a Portable Powerhouse running Linux", "description": "This is the Slimbook Titan, Slimbook's most powerful laptop that basically comes with all the options, including a mechanical keyboard, a high refresh rate display, and monster specs. Oh and also it's fast because it has RGB and Stickers. Let's take a look at what that thing can do!\n\nBecome a channel member to get access to a weekly patroncast and vote on the next topics I'll cover:\nhttps://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nSupport the channel on Patreon: \nhttps://www.patreon.com/thelinuxexperiment\n\nFollow me on Twitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\nFollow me on ODYSEE: https://odysee.com/@TheLinuxExperiment:e\nOr join ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\nThe Linux Experiment merch: get your goodies there! https://teespring.com/en-GB/stores/the-linux-experiment\n\n\n00:00 Intro\n00:21 Specs\n00:59 Build Quality\n02:19 I/O\n02:45 Display\n03:51 Keyboard\n04:32 Slimbook Desktop Keyboard\n05:08 RGB\n05:46 Touchpad\n06:22 Performance\n08:27 Battery Life\n11:46 Conclusion\n\n## Device\n\nIt uses a ryzen 9 5900HX, with an nvidia RTX 3070. It's paired to an amazing 1440p 15 inch IPS display with freesync, an opto mechanical keyboard.\n\nIt comes with 16Gb of RAM, and 500Gb of SSD.\n\nThe chassis is made of black aluminium for the most part, with only the bottom plate being made out of black plastic. It's a hefty laptop, at 2.2 kilograms, and it's a thicc boi, at 26mm.\n\nThe build quality is really, really good. There is absolutely no flex, or give, on the keyboard, or around it.\n\nThe branding on the back is nice and minimal, which I like, it gives a classy, professional look, but under the screen, it's a bit too big for my tastes.\n\nTt's got great I/O, with a USB 3.1 gen 2 port, an audio and a microhpone jack on the left side, a full size SD card reader and 2 USB 3.1 ports on the right side, and a USB C 3.2 gen 2 port with video out, an HDMI 2.1 port, a 2.5gigs ethernet jack, and the barrel charger on the back.\n\nThe display itself is a thing of beauty. First, the 1440p resolution on a 15 inch screen makes sense, even though it might be a bit small for some people.\nSecond, it can go up to a 165hz refresh rate, which makes it an excellent display for gaming.\nThird, it's freesync compatible, which means no screen tearing.\n\nThe bezels are alright, except for the bottom one, which is pretty big, but it's a really good panel. Viewing angles are perfect, brightness is really high, and the contrast is quite nice too.\n\nNow let's talk about that keyboard. It's an opto-mechanical one.\nIt's got a real nice feel to it, with a decent 2mm key travel, very good key stability, and the keycaps are nice and big, so typing is really easy on that thing. The sound is just right for me, but it might be a bit too clacky for some people who like their keyboards quiet.\n\nThe Titan comes with per-key LED RGB, which means that you can get some pretty crazy RGB effects in that keyboard.\nIf that's not enough RGB for you, there is also a light bar in the front, that you can also customize.\n\nMoving on, the touchpad feels nice, smooth and responsive, it's precise, and supports gestures. Out of the box, Slimbook os allows for a 3 fingers up swipe to get to the GNOME activities, and 3 fingers swipe left and right to get back and forward gestures inside of Firefox.\n\nOh and also, you can remove the back plate, and upgrade the storage, the battery, and the RAM yourself, so this thing is pretty future proof as well.\n\n## Performance\nI pushed it to the maximum settings using the Slimbook Ryzen Controller, an app they ship by default to control the power profile of the CPU.\n\nRunning Geekbench 5, this device got up to 1511 in single core, and 8170 in multi core, which is pretty freaking high, destroying the ryzen 7 4800H of the KDE SLimbook, which scored 7307 in multi-core, and beats my desktop Ryzen 7 5800X in single core.\n\nIt is also a really, really noisy device. At full speed, this thing will fill the whole room with the fan noise.\n\nIn terms of battery life, with the screen at half brightness, with wifi on, and the ryzen controller set to low power, without any keyboard RGB the laptop lasted for just 3 hours, just playing youtube videos back to back in firefox, ads included.\n\nThat's pretty low, especially with the huge 93Wh battery, so why is that happening?\n\nTurns out that screen brightness can't be controlled for the moment when both GPUs are active, and SLimbook had disabled the integrated AMD graphics as a result on my review unit. i re-enabled it in the BIOS, and ran the exact same battery test, with the screen brightness at 100%, and this got me 4h and a half hours.\n\nI'd expect that with a brightness reduced to 50%, you could get up to 6 hours if you don't use the dedicated GPU.\n\n\nThe Titan will definitely not be very enduring, but that's also not really the intended goal for such a device", "link": "https://www.youtube.com/watch?v=FKCtKVY_g48", "date_published": "2021-06-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]