[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCAKcSON6PSG_JkTbXh2WdIg", "title": "Dave Simonett - The Sun Oh Yeah (live MN Session for The Current)", "description": "For The Current's Minnesota Sessions, Dave Simonett brings acoustic tunes to the Wolf Ridge Environmental Learning Center. You know Dave as the frontman of Duluth-based bluegrass act Trampled by Turtles as well as his work under the moniker Dead Man Winter, and he's developed a legacy as an endearing and thoughtful songwriter. Watch Dave play \"The Sun Oh Yeah\" from his 2021 solo EP, Orion.\n\nMinnesota Sessions are presented by Lovin' Lake County. \n\nSubscribe to our channel:\nhttp://www.youtube.com/user/893TheCurrent\n\nLike/Follow:\nhttps://www.facebook.com/TheCurrent/​​​​\nhttps://twitter.com/TheCurrent​​​​\nhttps://www.instagram.com/thecurrent/\n\nThe Current encourages all music fans to support their local artists and the continued longevity of their craft. As part of this effort, The Current will be compensating artists for their performances in Minnesota Sessions through the Legacy Amendment Arts and Cultural Fund.", "link": "https://www.youtube.com/watch?v=Sc0nRX15VkI", "date_published": "2021-07-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCAKcSON6PSG_JkTbXh2WdIg", "title": "LineCheck - Supporting Safe Music Spaces in Minnesota (full video)", "description": "How can venue operators make their spaces more inclusive for artists and music fans of all identities?\n\nIn the third episode of LineCheck, The Current's virtual conversation series, musician/author Shawna Potter interviewed a batch of event experts: security consultants Kimmy Hull and Shannon Blowtorch (Sequeerity), event organizer Ryan Kroening (Events by Lady K), and producer/community organizer rØ. Each panelist discussed event security and positive, practical steps toward inclusivity.\n\nTo open and close the evening, Mayda performed \"Mrdr PxP\" and \"Hurricane\" from her album \"Mrdr Pxp.\"\n\nFull LineCheck schedule: https://www.thecurrent.org/feature/2021/05/18/linecheck-series", "link": "https://www.youtube.com/watch?v=qwPODgpzK8s", "date_published": "2021-07-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCAKcSON6PSG_JkTbXh2WdIg", "title": "Minnesota Sessions: Dave Simonett at Wolf Ridge", "description": "For The Current's Minnesota Sessions, Dave Simonett brings acoustic tunes to the Wolf Ridge Environmental Learning Center in Finland, Minnesota. You know Dave as the frontman of Duluth-based bluegrass act Trampled by Turtles as well as his work under the moniker Dead Man Winter, and he's developed a legacy as an endearing and thoughtful songwriter. \n\nSongs Played\n00:01 The Sun Oh Yeah\n04:31 The High Road\n08:38 Pisces, Queen Of Hearts\n\nMinnesota Sessions are presented by Lovin' Lake County. \n\nSubscribe to our channel:\nhttp://www.youtube.com/user/893TheCurrent\n\nLike/Follow:\nhttps://www.facebook.com/TheCurrent/​​​​\nhttps://twitter.com/TheCurrent​​​​\nhttps://www.instagram.com/thecurrent/\n\nThe Current encourages all music fans to support their local artists and the continued longevity of their craft. As part of this effort, The Current will be compensating artists for their performances in Minnesota Sessions through the Legacy Amendment Arts and Cultural Fund.", "link": "https://www.youtube.com/watch?v=n05sZRRWGEw", "date_published": "2021-07-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]