[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Dry Cleaning: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nLars Gotrich | July 6, 2021\nUp until now, Dry Cleaning's post-Brexit post-punk relied on a robust dynamism of jagged, thudding lushness and a speak-song voice. It's music that coos and quizzes at once. How energizing to hear Dry Cleaning recontextualize its established sound for a relatively subdued Tiny Desk performance from World of Echo, a record store in East London beloved to the British band.\n\nSurrounded by tapes and vinyl — and framed by posters of Wipers and The Fall — the four members look cozy in the small space. Tom Dowse trades his effects pedals and electric guitar for an acoustic; its weird bends and weirder chords surprisingly complement the atmospheric keyboards and minimal beats of Nick Buxton, who's normally on drums. Lewis Maynard's bass doesn't throttle at this volume, but still grooves.\n\nThe bedroom-quiet arrangements of songs from its latest album, New Long Leg (plus \"Viking Hair\" from a previous EP), allows Florence Shaw's voice, an instrument of resolute deadpan, to bloom. Some might call her delivery wry, even disaffected — her lyrics non-sequitur — but here a sly inquisitiveness inclines a smile (\"I'd like to run away with you on a plane, but don't bring those loafers\") and burns a harsh memory (\"Never talk about your ex / Never, never, never, never, never slag them off / Because then they know\"). If Dry Cleaning's records are labyrinths of pulsing sound and droll poetry, think of this Tiny Desk (home) concert as the narrow path that lays bare the band's gnarled roots.\n\nSET LIST\n\"Her Hippo\"\n\"Unsmart Lady\"\n\"Leafy\"\n\"Viking Hair\"\n\nMUSICIANS\nFlorence Shaw: vocals\nTom Dowse: guitar\nLewis Maynard: bass\nNick Buxton: keys\n\nCREDITS\nVideo: Tilly Shiner\nAudio: Joshua Sinclair\nSpecial thanks to Natalie Judge, Stephen Pietrzykowski & Johnny Healey\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Kara Frame\nAudio Mastering: Andy Huether\nAssociate Producer: Bobby Carter\nTiny Production Team: Maia Stern, Josh Rogosin, Gabrielle Pierre\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #drycleaning", "link": "https://www.youtube.com/watch?v=Xdv9whWY-ZY", "date_published": "2021-07-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]