[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Cha Wa: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nBob Boilen | October 18, 2021\nGathered at Preservation Hall in New Orleans, a hallowed space for Black American music, Cha Wa's set begins with hand-clapped rhythms and light percussion – then, a burst of horns gives way to \"My People,\" a song that zeroes in on the disparities between the haves and the have-nots:\n\n\"Rich people living in paradise\nPoor people under the bridge at night, oh yeah\nMost people know what it takes to survive\nBut my people know how to do it and thrive.\"\n\nCha Wa celebrates Black culture through the medium of rhythm, while also punctuating cultural differences with the hope of opening up the eyes and ears of those ignorant of, or ignoring, those differences. Decked out in a brilliant green feathered \"Indian suit,\" Joseph Boudreaux Jr. celebrates the roots of Mardi Gras Indian culture.\n\nThe concert, filmed during the pandemic, was a challenge for a band so used to the stomping feet and smiling faces of a sweaty New Orleans nightclub. It's something they thrive on – an audience can give as much energy as it receives, after all – so performing in front of a camera crew without that same energy was a challenge. All that said, the spirit and message of these songs, from their new album My People, come through loud and clear for a not-so Tiny crowd.\n\nSET LIST\n\"My People\"\n\"Bow Down\"\n\"Morning Glory\"\n\"Wildman\"\n\nMUSICIANS\nJoseph Boudreaux Jr: lead vocals\nAurélien Barnes: trumpet, vocals\nJoe Gelini: drums\nStephen Gladney: saxophone, vocals\nJoseph Maize: trombone, vocals\nAlexey Marti: percussion\nTJ Norris: bass, vocals\nAri Teitel: guitar, vocals\nAndriu Yanovski: piano, vocals\n\nCREDITS\nVideo: New Niveau Productions\nAudio: Justin Armstrong, Adam Keil, Chris Finney\nVideo Editing: Tony Broussard\nPiano Tuning: Dave Doremus\nSpecial thanks: The Golden Eagle Mardi Gras Indian Tribe, Ron Rona & Preservation Hall, Single Lock Records\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bobby Carter, Kara Frame, Sofie Hernandez-Simeonidis\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #nprmusic #chawa", "link": "https://www.youtube.com/watch?v=nMlnt85iysY", "date_published": "2021-10-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Emeraude Toubia: Una Conversación Con Alt.Latino", "description": "Alt.Latino host Felix Contreras talks with actress Emeraude Toubia about life as a Latina in film -- from telenovelas to Hollywood -- and discuss some exciting projects in the works.⁠\n\n#eltiny #emeraudetoubia #altlatino", "link": "https://www.youtube.com/watch?v=zci87SxHC1A", "date_published": "2021-10-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]