[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Active Child: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nJanuary 6, 2021 | Bob Boilen\nFrom a stunning room overlooking the San Gabriel Mountains in Pasadena, Calif., we hear the ethereal sounds of Active Child. \"I chose this space, as this is where I've written nearly every piece of music for my active child project. my music and this house / this view are completely intertwined.\"\n\nActive Child is the music of Patrick Grossi. For his Tiny Desk (home) concert, he layers his choral-styled voice on top of melodic harp and piano. Electronic beats propel selections from his latest album, In Another Life, as well as one of his earliest and well-known songs, \"Hanging On,\" that we featured on NPR Music back in 2011. Active Child makes music like no one else, and this Tiny Desk (home) concert is a perfect way to experience his music.\n\nSET LIST\n\"Hanging On\"\n\"In Another Life\"\n\"Cruel World\"\n\nMUSICIANS\nActive Child (Patrick Grossi): vocals, harp, piano, beats\n\nCREDITS\nVideo & Audio: Patrick Grossi\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Bob Boilen, Kara Frame, Morgan Noelle Smith\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann", "link": "https://www.youtube.com/watch?v=e9hZFjbOsWg", "date_published": "2021-01-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Sevdaliza: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nBob Boilen | January 5, 2021 \n\"Good afternoon humans, my name is Sevdaliza, you're very welcome on flight 808; our destination is Shabrang.\" And so begins our elegant, ethereal journey. We hear an old reel-to-reel tape machine spinning some Brazilian bossa nova sounds, then shift to something more somber. Sevdaliza is seated, the tones are golden and brown, and her yearning voice sings, \"I am flesh, bones / I am skin, soul / I am human.\" The song, \"Human,\" which casts away the notion of artists — particularly female artists — as products.\n\nIt's a defiant stand from this Iranian-born artist. Sevdaliza is an original, a truly creative soul. Her collaborators play delicate textures — electronic percussion, buzzing, swirling synth sounds, and cello and violin beautifully enhance texture and melody.\n\nThe home for this Tiny Desk (home) concert is a culturally significant bookstore and publishing house in Amsterdam called MENDO. Its warmth sets the tone for songs from Sevdaliza's album Shabrang. If you haven't heard her record, this is a perfect introduction to an album you shouldn't have missed in 2020.\n\nSET LIST\n\"Human\"\n\"Dormant\"\n\"All Rivers at Once\"\n\"Gole Bi Goldoon\"\n\nMUSICIANS\nSevdaliza: vocals\nAnthony Amirkhan: drums\nLeon den Engelsen: keys\nJonas Pap: cello\nMihai Puscoiu: violin\n\nCREDITS\nVideo: Daniel Porcedda, Jair Mahazri\nAudio: Olivier Fournier, Jonas Gehrmann\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Morgan Noelle Smith\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Bob Boilen, Kara Frame, Maia Stern\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann", "link": "https://www.youtube.com/watch?v=2o-4iD-ZNFc", "date_published": "2021-01-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]