[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "22 Minutes of NEW Back 4 Blood Gameplay", "description": "Check out 22 minutes of gameplay of the new Blue Dog Hollow Campaign, which will be playable in the Back 4 Blood beta.\n\nWe here at GameSpot got our hands on the upcoming Back 4 Blood beta a little early. For those unaware, Back 4 Blood is the upcoming zombie co-op shooter from Turtle Rock Studios, the people who brought you the original Left 4 Dead. Anyone who spent hours fighting the undead hordes in that game well into the night will feel right at home here.\n\nOur early look at the beta gave us access to the game’s PvE campaign mode, including The Devil’s Return, which was in last year’s closed alpha, and Blue Dog Hollow, a newly featured campaign that's the focus of this gameplay video.\n\nThe first act of Blue Dog Hollow, Bad Seeds, had our crew making its way through an infected farmland. The Ridden, Back 4 Blood’s name for zombies, have started to set up nests, corrupting the land with horrifyingly gross flesh piles. In the second act, Hell’s Bells, we traveled to a church, ending with an overwhelming horde showdown during which we needed to board up windows to complete the act.\n\nThe Back 4 Blood beta will also give players a chance to run around Fort Hope, an interactive lobby where you can hang out and practice at a shooting range while you wait for your match to load. The final piece of the beta is the PvP mode, Swarm, in which one team takes on the role of survivors and the other plays the Ridden in a best of three, before the teams swap roles.\n\nThe Back 4 Blood beta is open to players who pre-ordered the game as well and those that registered and got early access, and starts at noon PT / 3 PM ET on Thursday, August 5 and runs until Aug 9. But don’t fret, as there will be an open beta for everyone running August 12-16.\n\n#back4blood #back4bloodgameplay", "link": "https://www.youtube.com/watch?v=f5npwcj0R44", "date_published": "2021-08-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "7 Reasons to Try Call of Duty Mobile", "description": "Since its launch in 2019, Call of Duty Mobile has separated itself from its console counterparts. Let's take a look at a few reasons why you might want to try it out for yourself.\n\n\nCall of Duty Mobile is a sleeping giant. Even with more than 500 million downloads, it’s fan base is a relatively quiet bunch. For a game packed to the brim with content (much of it for free) it’s astounding how little COD Mobile hits the radar of Call of Duty fans as a whole. Everything from fan-favorite maps to every operator you can think of, there’s more than enough to satisfy fans of the series. In this video Richie Bracamonte discusses seven reasons why you should try Call of Duty Mobile.   \n\n\nThere’s a lot to love about COD mobile. Most of which gets little love in the world of FPS and Mobile gaming. Whether you’re partial to Apple, Android or even PC, COD Mobile is a free-to-play game. Not only does it contain multiplayer with classic maps, but also included is a Battle Royale mode and rebooted Zombies siege mode. Whichever mode you play, you’re rewarded with loads of weapon skins, XP, and even COD credits that let you choose from a store of more unlockable goodies. \n\n\nMainline Call of Duty games on consoles and PC will always get exposure. Every year they’re highly marketed and have no trouble making headlines. But maybe after checking out Richie’s list, you’ll consider taking Call of Duty with you on the go, too. Stay up to date with Call of Duty and other upcoming FPS games like Halo Infinite and Battlefield 2042 on GameSpot.com and Gamespot’s YouTube page.\n\n#cod #callofduty #codmobile", "link": "https://www.youtube.com/watch?v=yAh0DrS9LEo", "date_published": "2021-08-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Hades, Katamari Damacy Reroll, Skate | Xbox Game Pass Show", "description": "Learn about what's new, what's leaving, and what you should be playing on Game Pass. This your Game Pass digest for August 3, 2021. \n\nGame Pass has a lot of games, and twice a month there's more coming, and some leaving. It can be a lot to keep track of, not to mention figuring out what to play from its massive library. \n\nThat's why we created the Game Pass Show. Join Kurt to learn what's new, what's leaving, and what you should consider playing. Over the next couple of weeks, Game Pass sees the arrival of Hades, Skate, Katamari Damacy Reroll, and more. Kurt also takes the time to elaborate on what she's been playing: Last Stop. Also, make sure to stick to the end for the pick of the week.\n\n#GamePass #Xbox", "link": "https://www.youtube.com/watch?v=cv2dHboCW9s", "date_published": "2021-08-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]