[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Tiny Desk Contest Top Shelf: Episode 3 with Tobe Nwigwe", "description": "NPR Music received thousands of submissions to this year's Tiny Desk Contest, our annual search for the next great undiscovered artist to play a Tiny Desk concert. Before we announce this year's winner, this year's Contest judges are sharing their favorite entries in our weekly Tiny Desk Contest Top Shelf livestream series.\n\nEpisode 3 was hosted by Tiny Desk producer Bobby Carter and musician Tobe Nwigwe. Featured entries:\n- \"Running\" by Freakquencee https://www.youtube.com/watch?v=16CsnLXWai8 \n- \"Far From Shore\" by Rotem Sivan https://www.youtube.com/watch?v=ZurVzTEc7aQ\n- \"ON\" by Xella https://www.youtube.com/watch?v=LIpV6kXc0n0 \n- \"Tweedlee Dee\" by Quiana Lynell https://www.youtube.com/watch?v=H2SS3z81ZvA\n- \"Monarch\" by Bird & Butterfly https://www.youtube.com/watch?v=ystNfhu5iOQ\n\nLearn more about the Tiny Desk Contest: https://npr.org/tinydeskcontest.\n\n#tinydesk #tinydeskcontest #tinydeskcontesttopshelf", "link": "https://www.youtube.com/watch?v=zZs9EmpW04Y", "date_published": "2021-08-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Hiatus Kaiyote: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nAbby O'Neill | August 4, 2021\nMelbourne alt-soul collective Hiatus Kaiyote tricked out its avant-garde recording studio, The Villa, and lathered it with props: a miniature desk, alien costumes, and loads of furry friends. Frontwoman Nai Palm shared with me the impetus behind the design. \"I'm a treasure hunter at heart,\" she said, \"and the beautiful thing about dressing a set with sentimental artifacts from my house is that I feel super comfy to perform.\" Every intricate detail of this Tiny Desk (home) concert evokes feelings of coziness, psychedelia and joyful performance art.\n\nLaunching into this brilliant performance with \"Sip Into Something Soft,\" Hiatus takes us on a sweet and sultry journey through a host of selections from their new album, Mood Valiant. On \"Rose Water,\" the tightness of the band (comprised of Paul Bender, Simon Mavin and Perrin Moss, and joined by their longtime backing vocalists) is on full display.\n\nHiatus Kaiyote came onto the scene with their debut album, Tawk Tomahawk, back in 2012 and created a groundswell of buzz among global music heads. Since then, they've gone on to win varying international awards and were the first Australian group to get nominated in the R&B category at the Grammys for best R&B performance in 2013. This uber-fun and exhilarating set will appease diehards and new fans alike.\n\nSET LIST\n\"Sip Into Something Soft\"\n\"Rose Water\"\n\"And We Go Gentle\"\n\"Get Sun\"\n\"Blood And Marrow\"\n\nMUSICIANS\nNai Palm: vocals, guitar\nPaul Bender: bass\nSimon Mavin: keys\nPerrin Moss: drums, percussion, vibraphone\nAlejandro 'Silentjay' Abapo: vocals, keys\nLaura Christoforidis: vocals\nJace Excell: vocals\n\nCREDITS\nVideo: Claudia Sangiorgi Dalimore, Nick Mckk, Leah Oborn\nAudio: Phil Noy, Haima Marriott\nExtras: Marissa Matar, Sam Kuzich (aliens); Daniela Lucchetti, Matt Kelly (birds); Kiki Megumi (mothman)\n\nTINY DESK TEAM\nProducer: Abby O'Neill\nVideo Producer: Kara Frame\nAudio Mastering: Josh Rogosin\nSeries Producer: Bobby Carter\nTiny Production Team: Bob Boilen, Maia Stern, Gabrielle Pierre\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#hiatuskaiyote #tinydesk #nprmusic", "link": "https://www.youtube.com/watch?v=eCK1QnrTXvA", "date_published": "2021-08-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]