[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Possible UK surge", "description": "Alaska, immunization available to anyone 16 and older who lives or works in the state\n\nUS, past 7 days, 2.15 million doses per day\n\nFists dose, 61 million\n\nSecond dose, 32 million\n\nCases and deaths, CDC data\n\nhttps://covid.cdc.gov/covid-data-tracker/#trends_dailytrendscases\n\nPossible UK surge\n\nhttps://www.bbc.co.uk/news/health-56334902\n\nProf Chris Whitty\n\nUnlocking too quickly, substantial surge while a lot of people are not protected\n\nA lot of people may think this is all over. \n\nIt is very easy to forget how quickly things can turn bad\n\nThree weeks to build up immunity\n\nSo only the first four priority groups - the over-70s, health and care staff and the extremely clinical vulnerable\n\nNearly half of hospital admissions have been seen in the under-70s\n\nMost transmission driven by younger people\n\nTherefore, UK strategy will not impact spread for a while yet\n\nUK, now\n\nCases, +5,766 (+ 40,600)\nDown 24.5%\n\nDeaths, + 231(+1,329)\nDown 33.2%\n\nAdmitted, + 590 (+5,154)\nDown 29.8%\n\nHospitalised, 9,418 (first time below 10,000 since 25th October)\n\nVaccinated\n\nFirst dose, 22,592,528\n\nSecond dose, 1,181,431\n\nUK is not using a one dose strategy\n\nhttps://coronavirus.data.gov.uk/details/vaccinations\n\nHow do the Pfizer and Oxford AstraZeneca COVID-19 vaccines compare? And how do they affect different people?\n\nhttps://covid.joinzoe.com/post/vaccines-webinar-immune-variation\n\nMarch 8, 2021\n\nN = 700,000\n\nInjections, daily health reports\n\nPfizer vaccine first now, Oxford AstraZeneca as well\n\nBoth vaccines cause the body cells to produce the required antigen\n\nBoth vaccines induce really high levels of antibodies and T cells\n\nConsistent with phase 3 data\n\nTim Spector\n\nWe see around a 70% reduction in mild disease after the vaccine, which is what we would expect. It’s really good news\n\nSystemic side effects\n\nTiredness, headache, chills\n\nFirst dose, Oxford AstraZeneca vaccine, 30%\n\nPfizer vaccine, 10%\n\nPfizer systemic effects worse if people have had CoViD infection\n\nPfizer side effects worse after second dose\n\nAfter effects seem less than phase 3 data\n\nCan’t associate measured immune responses with protection, eg. antibodies may be low, but protection good\n\nFemales, younger people, people who had a previous COVID infection, more likely to report after-effects from either vaccine\n\nNot related to level of immunity generated\n\nFDA\n\nhttps://www.fda.gov/consumers/consumer-updates/why-you-should-not-use-ivermectin-treat-or-prevent-covid-19?utm_medium=email&utm_source=govdelivery\n\nThe FDA has received multiple reports of patients who have required medical support and been hospitalized after self-medicating with ivermectin intended for horses.\n\nIvermectin is not an anti-viral (a drug for treating viruses). \n\nhttps://www.nature.com/articles/s41429-020-0336-z\n \nIvermectin: a systematic review from antiviral effects to COVID-19 complementary regimen\n\nIvermectin proposes many potentials effects to treat a range of diseases\n\nantimicrobial, antiviral, and anti-cancer properties\n\nIt is highly effective against many microorganisms including some viruses\n\nIn this comprehensive systematic review, antiviral effects of ivermectin are summarized including in vitro and in vivo studies over the past 50 years\n\nSeveral studies reported antiviral effects of ivermectin on RNA viruses such as Zika, dengue, yellow fever, West Nile, Hendra, Newcastle, Venezuelan equine encephalitis, chikungunya, Semliki Forest, Sindbis, Avian influenza A, Porcine Reproductive and Respiratory Syndrome, Human immunodeficiency virus type 1, and severe acute respiratory syndrome coronavirus 2\n\nFurthermore, there are some studies showing antiviral effects of ivermectin against DNA viruses such as Equine herpes type 1, BK polyomavirus, pseudorabies, porcine circovirus 2, and bovine herpesvirus 1\n\nIn vivo studies of animal models revealed a broad range of antiviral effects of ivermectin\n\nCrump A, Ōmura S. Ivermectin, ‘wonder drug’ from Japan: the human use perspective. Proc Jpn Acad Ser B Phys Biol Sci. 2011;87:13–28. https://doi.org/10.2183/pjab.87.13.\n\nKircik LH, Del Rosso JQ, Layton AM, Schauber J. Over 25 years of clinical experience with ivermectin: an overview of safety for an increasing number of indications. J Drugs Dermatol. 2016;15:325–32.\n\nGonzalez Canga A, Sahagun Prieto AM, Diez Liebana MJ, Fernandez Martinez N, Sierra Vega M, Garcia Vieitez JJ. The pharmacokinetics and interactions of ivermectin in humans–a mini-review. AAPS J. 2008;10:42–6. https://doi.org/10.1208/s12248-007-9000-9.\n\nGermany\n\nhttps://www.washingtonpost.com/nation/2021/03/10/coronavirus-covid-live-updates-us/\n\nFamily doctors will be allowed to administer vaccine from April\n\n3% currently fully vaccinated, since late December\nAZ now used in over 65s\n\nThomas Mertens, Vaccination committee\n\nSupport for the Sputnik V\n\n(European Union officials warn against) \n\nRolling review, Czech Republic, Hungary and Slovakia.", "link": "https://www.youtube.com/watch?v=mnF2GRs2Llk", "date_published": "2021-03-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Vaccination in immune compromise", "description": "Are COVID-19 vaccines safe for people with weakened immune systems?\n\nhttps://covid.joinzoe.com/post/covid-vaccines-immunocompromised\n\nProfessor Ellie Barnes, Oxford University\n\nCauses of immunosuppression\n\nAuto-immune conditions (e.g. lupus, rheumatoid arthritis, multiple sclerosis, inflammatory bowel disease, \nCrohn’s disease)\n\nGenetic conditions\n\nChronic diseases, liver, kidney disease, cancer \n\nPost organ or bone marrow transplant\n\nComplications of vaccination in immunocompromise\n\nProblems with live vaccines\n\nMeasles, mumps, rubella\nSmallpox\nYellow fever\n\nReduced immune response may lower vaccine efficacy\n\n\nAre the COVID vaccines safe for people who are immunocompromised?\n\nCurrently in UK, Oxford/AstraZeneca vaccine and the Pfizer vaccine\n\nNeither of these are live vaccines. \n\nAnd because of that, there's no theoretical reason why these vaccines would not be completely safe, even \nfor people who are severely immunocompromised\n\nPfizer mRNA vaccine\n\nNo virus involved with that at all\n\nOxford/AstraZeneca vaccine\n\nViral vector carries RNA to cells\n\nCannot replicate in cells or cause disease\n\nThese vaccines have been shown to be very safe\n\nThere's no reason why an immunocompromised person would have a different adverse effect profile, compared to a healthy person after receiving a COVID-19 vaccine\n\nAllergies\n\nExtremely rare\n\nNot expected to be more likely in immunocompromised people\n\nVaccine efficacy in immunocompromise\n\nThe phase three vaccines studies generally recruited healthy people and excluded people with severe disease and immunosuppressive therapy\n\nAlthough it’s likely that vaccines can provide some level of protection for people who are immunocompromised, \n\nright now we don’t have any solid data on how well COVID-19 vaccines will work in people with weakened immune systems\n\nOCTAVE study\n\nBritish Society for Immunology\n\nWhile COVID-19 vaccination might provide a lower level of protection in people who are immunosuppressed or immunocompromised compared with the rest of the population,\n\nit is still very important that you get vaccinated as it will offer you a certain amount of protection against catching COVID-19.\n\nIt is important that you receive two doses of the vaccine to maximise the protection that vaccination offers you.\n\nCOVID-19 vaccination will work best if you have a functioning immune system. \n\nIt’s important to remember that the COVID-19 vaccines can protect you from getting seriously ill with COVID-19, \n\nalthough if your immune system isn’t functioning optimally this protection will not be complete.”\n\nProfessor Ellie Barnes\n\nThe vaccines will not harm you, and they may give you some protection\n\nSo my advice to patients currently is: if you're offered a vaccine, take it\n\nWhen You’ve Been Fully Vaccinated\n\nTwo weeks after second dose in a 2-dose series, like the Pfizer or Moderna vaccines\n\nTwo weeks after a single-dose vaccine, like Johnson & Johnson’s Janssen vaccine\n\nhttps://www.cdc.gov/coronavirus/2019-ncov/vaccines/fully-vaccinated.html\n\nWhat Hasn’t Changed\n\nKeep taking precautions in public places, wearing a mask, 6 feet, avoiding crowds, poorly ventilated spaces until we know more\n\nIn public\n\nGathering with unvaccinated people\n\nVisiting an unvaccinated person\n\nStill avoid medium or large-sized gatherings\n\nStill delay domestic and international travel\n\nStill watch out for symptoms\n\nStill get tested if symptomatic\n\nStill self isolate\n\nStill need to follow guidance at your workplace.\n\nWhat’s Changed\n\nGather indoors with fully vaccinated people without wearing a mask\n\nGather indoors with unvaccinated people from one other household, unless any of those has an increased risk of severe illness\n\nIf you’ve been around someone who has COVID-19, you do not need to stay away from others or get tested unless you have symptoms.\n\nHowever, if you live in a group setting, and are around someone who has COVID-19, you should still stay away from others for 14 days and get tested, even if you don’t have symptoms\n\nWhat We Know and What We’re Still Learning\n\nWe know COVID-19 vaccines are effective at preventing COVID-19 disease, especially severe illness and death.\n\nWe’re still learning how effective the vaccines are against variants \n\nWe know that prevention measures help stop the spread of COVID-19, and that these steps are still important\n\nWe’re still learning how well vaccines prevent spread\n\nWe’re still learning how long vaccines can protect people.\n\nEstonia\n\nhttps://www.bbc.co.uk/news/live/uk-56330945\n\nNew lockdown from Thursday, education and shops\n\nUK variant\n\nDetection dogs in Germany\n\nhttps://www.dw.com/en/coronavirus-trained-dogs-detect-covid-94-of-the-time-german-study-finds/a-56447514\n\nEsther Schalke, Armed forces school for service dogs\n\n94% accuracy, even if asymptomatic\n\nFrom 1,000 + samples\n\ncoronavirus odor, emitted from cells in infected people\n\nHolger Volk, Hanover's University of Veterinary Medicine", "link": "https://www.youtube.com/watch?v=SV7ML38WfXk", "date_published": "2021-03-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]