[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "12 Biggest Plot Twists In Games", "description": "Some of the best moments in games are the plot twists that hit you when you least expect it. Join Persia as she breaks down 12 iconic plot twists in games that have immortalized themselves in gaming history.", "link": "https://www.youtube.com/watch?v=uD_g8_W7CZg", "date_published": "2021-03-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Best USB Mics Under $150 - Hyper X Quadcast vs Blue Yeti", "description": "Blue Yeti: https://amzn.to/3v50qcl\nHyperX QuadCast: https://amzn.to/3rzqTMH\n\nWant to get great audio in your streams, multiplayer games and content creation? Today we are talking about two of the most popular USB microphones on the market right now, that is the Hyper X Quadcast and the Blue Yeti, both extremely popular choices for gamers and Twitch streamers alike.\n\nBoth the HyperX Quadcast and the Blue Yeti have been out for a while now, but they are constantly compared to each other and are still real competitors when it comes to being some of the best USB mics in their price range. \n\nThe Quadcast comes in HyperX's trademark black and red colours, with the microphone being illuminated whenever the user is audible. If you want to go a level higher to the Quadcast S you get the bonus of RGB customization, but the base model is fixed in crimson.  The regular Quadcast does come with some features that make it a great mic for streaming and content creation straight out of the box, such as its integrated pop filter and tap-to-mute functionality. \n\nUp against it is the Blue Yeti. It's a larger and heavier device than the Quadcast but still comes with the same four audio profiles. It does, however, have better audio monitoring functionality with its adjustable passthrough to allow the user to monitor their audio levels during livestreams or recording sessions. \n\nWhile these USB microphones are very similar, in the video above we go through the differences that separate them and name our mic pick for gamers and content creators. \n\nAudio and voiceover were recorded with each microphone during the relevant sections, and treated with identical post-production settings to ensure a fair comparison.", "link": "https://www.youtube.com/watch?v=kVfcLEERG3o", "date_published": "2021-03-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Teenage Mutant Ninja Turtles: Shredder’s Revenge Trailer - Official Gameplay Announcement", "description": "Teenage Mutant Ninja Turtles: Shredder’s Revenge reunites Leonardo, Raphael, Michelangelo, and Donatello to kick shell in a beautifully realized pixel art world invoking the turtles’ classic 1987 design.", "link": "https://www.youtube.com/watch?v=ijKD0HIpgJM", "date_published": "2021-03-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Best Super Mario Trailers (1985-2021)", "description": "In celebration of Super Mario's 35th anniversary this year, we take a look at the best trailers and commercials from the Super Mario games.", "link": "https://www.youtube.com/watch?v=rUO3Dm_3zOU", "date_published": "2021-03-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "From Sonic To Batman: Roger Craig Smith Breaks Down His Best Roles", "description": "Veteran voice actor Roger Craig Smith breaks down some of his biggest roles, including Batman, Apex Legends' Mirage, and of course, Sonic The Hedgehog. \n\nDo you ever just watch something and recognize a voice in it and it drives you up the wall until you Google who they are, and discover they've lent their voice to some of your favorite characters? Enter: Roger Craig Smith.\n\nA veteran of voice acting, Roger Craig Smith joins us to talk through some of his most iconic roles, and boy, does he have a lot of those under his belt. Roger has voiced dozens of well-known characters over the years, from the caped crusader Batman in 2013's Arkham Origins and Chris Redfield in Resident Evil 5, to everyone's favorite Italian assassin, Ezio Auditore da Firenze in Assassin's Creed. He's probably best known for his ten-year stint as Sonic the Hedgehog, a role he recently has moved on from. In this video, he tells behind the scenes stories about the characters he's played, and even talks about what it's like to be recognized for Say Yes To The Dress. \n\nYou can find Roger on Twitter @RogerCraigSmith, and if you like this video, consider checking out our stream with Roger and his Apex Legends co-star Justine Huxley from last summer, where we raised money as part of our Play For All event. You can find all the VODs at youtube.com/GameSpot.", "link": "https://www.youtube.com/watch?v=svDDP6nx5jg", "date_published": "2021-03-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Microsoft & Bethesda Official Announcement Trailer - \"Here's To The Journey\"", "description": "Check out the official announcement trailer for Microsoft and Bethesda. The acquisition of Bethesda by Microsoft was approved on March 8th, 2021 and now represents a merger of gaming titans in the space of Xbox and Bethesda.", "link": "https://www.youtube.com/watch?v=yHhBS3qvYqs", "date_published": "2021-03-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Evolution of Unreal Engine (1996-2021)", "description": "From Unreal Tournament, BioShock, Batman, Arkham, Final Fantasy VII Remake, to, of course, Fortnite, the Unreal Engine is the backbone of many of our favorite games. Let's take a trip down memory lane to see how far the game development technology has come.  Get a glimpse of how the Unreal Engine has evolved from its first iteration all the way to its fifth iteration. \n\nThroughout its history, the Unreal Engine has maintained itself as one of the most popular development tools in the games industry. From its early days in the mid 90s, to its powerhouse performance as a games and film visual creation engine, the Unreal Engine has powered many of the most iconic video games over the course of nearly three decades--which includes Gears of War, BioShock, and Fortnite.\n\nIn this video, we're taking a look at the evolution of Epic Games' tech. Starting with 1996's Unreal Engine 1 tech demo, we look at how Epic Games'  early tech revolutionized the rendering of 3D environments. Then after, we go over how Unreal Engine 2 took things further by adding improved lighting, detailed character animations, and a greater sense of depth in 3D spaces. From there, the video continues on, from Unreal Engine 3 all the way to the current day where we're now still awaiting the upcoming release of Unreal Engine 5, which adds more realistic visuals and lighting. \n\nAlong with this look back at the advances to the Unreal Engine, we've also published an extensive video on the evolution of PlayStation consoles. For more information on what's to come with the Unreal Engine 5, be sure to check back with GameSpot for more details.\n\n\n0:00 Unreal Engine 1\n0:22 Unreal Engine 2\n0:52 Unreal Engine 3 (2004)\n02:26 Unreal Engine 3 (2011)\n03:49 Unreal Engine 4 (2013 PS4 Demo)\n05:16 Unreal Engine 4 (2019)\n06:31 Unreal Engine 5 (2021 PS5 Demo)\n08:56 Metahuman Creator", "link": "https://www.youtube.com/watch?v=XoJM0Yp5IV8", "date_published": "2021-03-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Xbox And Bethesda Deal: Are Bethesda Games Xbox-Exclusive Now?", "description": "Xbox's landmark $7.5 billion acquisition has gone through, making it one of the biggest gaming deals of all time. But what does it mean for Bethesda games going forward? The Console Crew analyze the statements from Xbox and Bethesda.", "link": "https://www.youtube.com/watch?v=1PFWVgEng6Y", "date_published": "2021-03-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]