[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Big Brain Academy: Brain vs. Brain Review", "description": "Big Brain Academy: Brain vs. Brain is a solid collection of mental exercises, but the focus on competition loses the game some of its friendly, self-improvement vibe.\n\nNintendo's Big Brain Academy: Brain vs. Brain will be available on Nintendo Switch on December 3, 2021. You can read the full written Big Brain Academy: Brain vs. Brain review by Steve Watts on GameSpot: https://www.gamespot.com/reviews/big-brain-academy-brain-vs-brain-review/1900-6417796/", "link": "https://www.youtube.com/watch?v=lm-w1Uwu3sY", "date_published": "2021-12-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New Minecraft Update Is Deep | GameSpot News", "description": "In this episode of GameSpot News, we talk about the release of Minecraft’s 1.18 update, The GTA Trilogy’s major patch, and update to Halo Infinite’s Multiplayer progression and new details for Warzone Pacific. \n\nIn this video, DeVante talks about the release of Minecraft’s Caves and Cliffs Part 2 update. This features taller mountains, deeper caves and new biomes. Features like the Deep Dark biome and the Warden have been delayed. \n\nDeVante also talks about The GTA Trilogy getting a major update that includes general stability improvements across all three games and fixes a long list of bugs. In particular, the update improves how rain looks so it's not totally overwhelming in GTA III. \n\nLater in the video, Halo Infinite’s multiplayer progression gets another update and Activision reveals more about the Warzone Pacific map.", "link": "https://www.youtube.com/watch?v=kzxSQU6yU3s", "date_published": "2021-12-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "PlayStation Plus Games Confirmed… But Godfall Is Different | GameSpot News", "description": "In this episode of GameSpot News, we talk about December’s PlayStation Plus games being confirmed, Titanfall 1 being taking off digital store shelves, physical copies of GTA: The Trilogy being delayed and Fall Guys not coming to Xbox and Switch alongside season 6 content. \n\nIn this video, DeVante talks about December’s PlayStation Plus games including Mortal Shell, Lego DC Super Villains and Godfall Challenger Edition. This version of the game allows players to jump straight to max level and experience Godfall’s endgame modes, lightbringer, dreamstones, and ascended tower of trials. \n\nDeVante also talks about physical copies of Grand Theft Auto: The Trilogy - The Definitive Edition being delayed. They will now be released on December 17, while the Nintendo Switch version of the game will launch sometime during early 2022. All physical editions were originally scheduled for a December 7 release date.\n\nLater in the video, Titanfall 1 is taken off digital store shelves and Fall Guys not coming to Xbox and Switch alongside season 6 content.", "link": "https://www.youtube.com/watch?v=5gfNCW7mDd8", "date_published": "2021-12-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Solar Ash Review", "description": "Solar Ash is an exhilarating action-adventure game with strong puzzles and flashy boss fights.", "link": "https://www.youtube.com/watch?v=0bQSLJgw-_U", "date_published": "2021-12-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "19 Best Survival Games  You Should Play Right Now", "description": "Through the years, the survival game genre has expanded and adapted to fit different styles like action to horror. From Minecraft to Dying Light, these are 19 of the best survival games you can play right now.\n\nTime Stamps:\n00:15 - Dying Light\n00:52 - Minecraft\n01:27 - No Man's Sky\n02:12 - Escape From Tarkov\n02:50 - Rust\n03:27 - Subnautica\n04:08 - Valheim\n04:55 - Ark: Survival Evolved\n05:35 - Don't Starve\n06:13 - The Flame in the Flood\n06:54 - The Forest\n07:34 - The Long Dark\n08:01 - Outward\n08:35 - Frostpunk\n09:15 - Terraria\n09:39 - Surviving Mars\n10:15 - RimWorld\n10:57 - This War of Mine\n11:28 - Starbound", "link": "https://www.youtube.com/watch?v=BRtqt6K18tc", "date_published": "2021-11-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Infinite Multiplayer Has Cheaters Because Of Course It Does | GameSpot News", "description": "In this episode of GameSpot News, we talk about Halo Infinite suffering from cheaters and hackers, progression backlash, ranked balancing issues and campaign leaks due to physical copies releasing early. \n\nIn this video, DeVante talks about Halo Infinite players taking to social media to report instances of cheating and hacking in the game. This problem seems to be more widespread on PC, and as a result, players are asking 343 to introduce a cross-play toggle so console players can more easily avoid cheaters.\n\nDeVante also talks about 343’s Jerry Hook revealing more “robust\" updates are coming to Halo Infinite’s multiplayer progression system. This system was criticized almost immediately after the game's multiplayer launched on November 15 for being slow and too challenge based. \n\nLater in the video, 343’s community manager reacts to Halo Pro LxthuL’s complaints about ranked matchmaking and promises to share more detailed updates on a solution.", "link": "https://www.youtube.com/watch?v=ZQ1bh1R-QjI", "date_published": "2021-11-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Infinite | Campaign Launch Trailer", "description": "Check out the Halo Infinite campaign launch trailer! Halo Infinite dropped the multiplayer portion of the game early but now you can check out the launch trailer for the Halo Infinite Campaign that launches on December 8th, 2021.", "link": "https://www.youtube.com/watch?v=6IJnu94LL9w", "date_published": "2021-11-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Warframe - The New War Cinematic Trailer: Discover Your Power Within", "description": "(Presented by Warframe) Sign up to play WARFRAME on all platforms for free today at https://t.warframe.com/c/fkeu0p\n\nWarframe’s most ambitious, cinematic expansion - The New War - launches on December 15. Watch the official The New War Cinematic trailer and prepare to embark on an epic quest and discover your power within. \n\nJoin 50M+ registered players in Warframe, a cooperative, third-person looter shooter set in a constantly evolving sci-fi universe.", "link": "https://www.youtube.com/watch?v=_ckLOyVEVVs", "date_published": "2021-11-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]