[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCoOjH8D2XAgjzQlneM2W0EQ", "title": "How Celebrities are Making MILLIONS with Selling JPG’s (NFT’s)", "description": "🚀 Easily launch your startup! Use code \"JT\" for a discount & white-glove concierge service: http://first.ba/JakeTran\n\n😈 Watch exclusive 40+ minute documentaries that are too controversial to ever be released to the public: https://jake.yt/join \n\n📹 Take a peak at all the private documentaries here: https://jake.yt/hidden-vids\n\n🎥 Business is complicated. Subscribe to curiosity: http://bit.ly/jt-sub\n🎙️ Subscribe to the 2nd channel, Intellectual Dropouts: https://jake.yt/id\n✉ Be the first to watch new videos with email notifications: http://bit.ly/jt-inbox\n📸 Follow me on IG:@jaketran // http://bit.ly/jt-ig\n👨👦👦 Join the Tran Mafia Family here: https://bit.ly/patreon-jt\n💬 Join the community Discord: http://discord.gg/BmK8EnQ\n\nSupport this channel monetarily:\n💻 𝗟𝗮𝗽𝘁𝗼𝗽 𝗟𝗶𝗳𝗲𝘀𝘁𝘆𝗹𝗲 𝗔𝗰𝗮𝗱𝗲𝗺𝘆: Learn exactly how I landed my $40/hr work from home job ($83k/yr) at 19 years old: https://jake.yt/LLAd\n🖥️ Website platform I use: https://jake.yt/kd\n💽 Editing software I've used for 7+ years: https://jake.yt/ccd\n📒 Online bookkeeping software I use: https://jake.yt/benchd \n📜 The exact resume I used to get my $40/hr remote web dev job + a lot of bonuses: https://jake.yt/DRBd\n🎥 My video gear, setup, tech, books: https://jake.yt/stored\n\n✉️ Email me: jake@jaketran.io\n\nSubscribe to the backup channel on LBRY, use reward code \"jake-cast\" for free coin: https://bit.ly/LBRY-jt\n\n📰 Sources & visuals: http://bit.ly/3r9BBsA\n\n-----------------------\nThe world of NFT’s today has some stark similarities to the Dot Com Bubble of the 90’s to early 2000’s. So the real question is, is this a bubble?\nThe short answer? Yes\n\nSpeculators are dumping money into anything that is an NFT for the sake of it being an NFT - just like how speculators were throwing money at anything with a dot com in its name, hoping that it’s gonna go up\nNow some of these NFT’s do have the potential to become actual collectibles that go up in price. But real collectibles like trading cards never start out at a high price\nThey start low and gradually go up over time.\n\nWhen you look at the buyers of these expensive NFT’s - what do you find?\nMost were early crypto investors that are sitting on massive gains that they have no idea what to do with. So instead of cashing out and having to pay the tax man, they transfer some of their wealth into these NFT’s.\n\nSo yes, this space is probably in a bubble right now.\nBut then the question becomes, is it going to pop? And if it does pop, are NFT’s here to stay? Do NFT’s even offer any value that would make it last? Or is it just a passing trend?\n\nAt first, the idea of paying money for a jpg or video sounds crazy\nYet… we’re also the type of creatures to pay sometimes an equally crazy amount of money on consumerism\n\nWhy do we buy all these irrational things? Because of one simple thing: status. We’re social creatures - we want others to know that we have good tastes, that we’re high class - socially relevant.\n\nNFT’s for art and collectibles can actually have a lot of merit. Think about the Beeple collage that just sold for $69.3 million dollars. It’s a culturally relevant artist that millennials and Gen Z love. An NFT art piece that happened to take Beeple 13 years of blood, sweat, and tears to make\n\nSure you can download it off his website? But you and I both know that it’s just not the same - that it’s not authentic\n\nThere are also a ton of other value-adds NFT’s offer to artists\n\nAnother idea for NFT’s is allowing creators, YouTubers, influencers, to basically issue stock through an IPO - here’s how it could work\n\n-----------------------\n\nAll materials in these videos are used for educational purposes and fall within the guidelines of fair use. No copyright infringement intended. If you are or represent the copyright owner of materials used in this video and have a problem with the use of said material, please send me an email, jake@jaketran.io, and we can sort it out.\n\nCopyright © 2021 Transcend Visuals, LLC. All rights reserved.\n\nDISCLAIMER:\n\nThis video does not provide investment or economic advice and is not professional advice (legal, accounting, tax).  The owner of this content is not an investment advisor.  Discussion of any securities, trading, or markets is incidental and solely for entertainment purposes.  Nothing herein shall constitute a recommendation, investment advice, or an opinion on suitability.  The information in this video is provided as of the date of its initial release.  The owner of this video expressly disclaims all representations or warranties of accuracy.  The owner of this video claims all intellectual property rights, including copyrights, of and related to, this video.\n\nAFFILIATE DISCLOSURE: Some of the links in this video's description are affiliate links, meaning, at no additional cost to you, the owner may earn a commission if you click through, make a purchase, and/or opt-in.", "link": "https://www.youtube.com/watch?v=xXaYUEspyG8", "date_published": "2021-03-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]