[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Resident Evil 4’s Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of Resident Evil 4, including the powerful Striker shotgun, the distinctive Red 9 pistol, and the ridiculous Infinite Rocket Launcher.\n\nResident Evil 4 saw Capcom’s horror franchise venture into the action genre for the first time and gave players access to an arsenal of unique weapons, including the TMP submachine gun, the H&K VP70M handgun, and the Thompson M1A1, known in-game as the Chicago Typewriter.\n\nIn the latest video in the Firearm Expert Reacts series , Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of Resident Evil 4, and compares them to their real-life counterparts.\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can purchase Jonathan’s book here - https://www.headstamppublishing.com/bullpup-rifle-book", "link": "https://www.youtube.com/watch?v=63USojZa8nU", "date_published": "2021-03-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Oblivion Is Still Excellent 15 Years Later", "description": "Should you play The Elder Scrolls IV: Oblivion in 2021? Jake Dekker revisits Bethesda's classic to see how it holds up 15 years later. \n\nYou don’t have to look hard to find Oblivion’s blemishes, but if you can look past them there is an imaginative, ambitious fantasy adventure that, in many ways, Bethesda hasn’t been able to replicate since. The Elder Scrolls has been around since 1994. However, it didn’t stake its claim in the console space until 2002 with The Elder Scrolls III: Morrowind. Morrowind had a lot of firsts for the series. Most notably, it was the first fully 3D mainline Elder Scrolls game.\n\nMorrowind laid the groundwork for Oblivion, and eventually Skyrim. In this video, Jake revisits Oblivion for its 15th anniversary in order to see what made it so special. From the awkward voice acting to the incredible quests, Oblivion had is still a memorable experience.\n\nOblivion originally came out for Xbox 360, PS3, and PC back in 2006, but it’s currently available on Xbox Game Pass for subscribers.", "link": "https://www.youtube.com/watch?v=HuYCGV4GF98", "date_published": "2021-03-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Biggest Changes In Disco Elysium - The Final Cut", "description": "Check out our interview with lead designer and writer Robert Kurvitz \nhttps://www.youtube.com/watch?v=9X0-W5erEXw\n\nDisco Elysium - The Final Cut brings a myriad of changes to the RPG, including voice acting, quests, and options for streamers. Phil Hornshaw breaks it all down. \n\nDisco Elysium - The Final Cut is releasing on March 30, bringing a free upgrade to PC users and the opportunity for PlayStation 4, PS5, and Stadia players to check out the game for the first time. It's also debuting some pretty huge changes to one of the best games of 2019, including full voice-over support throughout the game and new content.\n\nWe've run down all the changes you can expect to see in Disco Elysium - The Final Cut in the video above. Developer ZA/UM has put in a massive amount of effort in voicing the game, with performances from more than 50 actors all over the world. The developer also detailed how its new political vision quests will work, so expect your character's political alignment to matter a lot more in this new version of the game.\n\nThere are also more improvements to the game's performance, and even some tweaks that bring new Twitch integrations that should make some pretty compelling streams. If you're interested in more Disco Elysium coverage, check out our full preview of the upcoming Final Cut release, plus our in-depth interview with lead designer and writer Robert Kurvitz.", "link": "https://www.youtube.com/watch?v=LK8EvdUQ7MY", "date_published": "2021-03-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Can PlayStation And Nintendo Compete with Xbox Game Pass?", "description": "On this week's episode of Console Crew, the gang celebrates Game Pass. You've heard us, and many others, say this before but Xbox's subscription service is easily the best service in video games when it comes to bang for your buck. But it's not just giving people access to a massive library of video games at no additional cost, it's also changing the industry in a number of ways ranging from making content accessible in various places, to giving smaller developers more exposure, and helping some games develop a strong community where they might otherwise struggle.\n\nOne other key thing Game Pass doing is breeding competition, both directly and indirectly. PlayStation and Nintendo players will now begin to think about how much value those platform holders are delivering to them, and the ways in which they can maximize their money and time when it comes to buying and playing games. \n\nThat's also a big discussion point in this episode of Console Crew, as Lucy, Jordan, and Tamoor discuss Sony, Microsoft, and Nintendo's efforts to entice players to play games on their platform and engage with their ecosystems. This comes as a number of high-profile titles from Bethesda are added to Game Pass and Sony updates the list of free titles that will be available as part of its Play at Home campaign. For its part, Nintendo has a library of classics available through Switch Online, but the question is, are Sony and Nintendo's efforts enough to compete with Game Pass? Do they even need to compete, for that matter? Watch to find out what the crew thinks.", "link": "https://www.youtube.com/watch?v=BpiUFJCbcF0", "date_published": "2021-03-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Genshin Impact Windblume Festival Gameplay", "description": "Genshin Impact recently released their new event in version 1.4, featuring multiple minigames and battles in the Mondstadt Windblume Festival.\n\nMondstadt's Windblume Festival to play fun new games and hang out with Barbara, Chongyun, Bennett and Noelle.\"\n\nAll players who have reached Adventure Rank 20 or above and completed the \"Song of the Dragon and Freedom\" questline are cordially invited to join the citizens of Mondstadt in their annual celebration of freedom and love as dandelion seeds flutter in the warm spring breeze.\n\nAllegedly, the Windblume Festival originated as an occasion to commemorate the liberation of Mondstadt 2,600 years ago. For the citizens of today, however, it has become the season to express true love and participate in all sorts of outdoor games. The Knights of Favonius and the Adventurers' Guild will organize a series of mini-games and challenges for players to enjoy alone or with friends, with generous rewards including two festival-exclusive items — the Windblume Festival Commemorative Balloon and the Windsong Lyre, as well as a new 4-star weapon, Windblume Ode. Meanwhile, a new type of story quest with multiple endings available will give Travelers the opportunity to spend some quality time hanging out with Barbara, Noelle, Bennett, and Chongyun, creating a rich range of memories together.\nIn Version 1.4, more details about the Abyss Order and the fate of the Traveler's long-lost sibling will be revealed. Travelers who continue their investigation with \"Bough Keeper\" Dainsleif will finally come face to face with the formidable Abyss Herald and learn some surprising secrets about the world's first Ruin Guard at Stormterror's Lair.\n\nTwo months after her first appearance in Dragonspine, \"Thorny Benevolence\" Rosaria will now be joining the game as the latest 4-star playable character. Wielding a polearm and the power of Cryo, Rosaria can quickly maneuver herself behind her enemy to attack from the rear. Her Elemental Burst unleashes a mighty slash, dealing high Cryo DMG, followed by constant bursts of AoE Cryo DMG to nearby enemies over a period of time.\nNew functions and optimizations will also be introduced to improve player experience. In Version 1.4, players can hold up to five Condensed Resin in their Inventory at any one time. Additionally, players can opt to lower their World Level to suit their needs both in Single-Player and Co-Op Mode.", "link": "https://www.youtube.com/watch?v=KRgLUVBSpLU", "date_published": "2021-03-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "What's Nintendo's Next Console?", "description": "The Nintendo Switch is starting to show its age, and with the rumors of a Switch Pro swirling, the GameSpot After Dark crew attempts to predict Nintendo's next move.\n\nIf you enjoyed this video be sure to listen to the full episode of GameSpot After Dark on a podcast server of your choice. Also, be sure to check out 0ptimysticgamer's Twitch and YouTube channel!\n\nSpotify Page: https://open.spotify.com/show/5qmuPYfpj7R7yHXEtKBocG?si=pdGW-FvKRGi8pkzh6Zb9-Q \n\n0pti's Twitch: https://www.twitch.tv/0ptimysticgamer\n\n0pti's YouTube: https://www.youtube.com/channel/UCpGerLi8cihp3uWNrycjsfQ", "link": "https://www.youtube.com/watch?v=lBk1TXnf5sQ", "date_published": "2021-03-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]