[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCNTqu16j3F6RbtHZI-3untg", "title": "How Apple Started A Dark Age of the Internet", "description": "This is the story of Apple, the forbidden fruit, that led us into a dark age of consumerism, conformity, and control. In this documentary, I explore how we got here, and how we might be able to find light in this darkness.\n\nwritten, edited, filmed, and produced by me\n\nwith copywriting assistance by VinceVintage and friends\n\nTrack List:\n\nOpening - The Legend of Zelda Majora's Mask\nQuestion - Million Eyes\nRevolution - The Beatles 8 Bit\nCantos de Medicina\nTrmble - Lemoti\nOne Hundred Mornings - Windows96\nDay Tripper - The Beatles 8 Bit\nAmaze - Major Tweaks\nJerk It Out - Caesars 8 Bit\nTemple of Ruhna - ELFL\nArabesque No 1 - Debussy\nClock Town Third Day - The Legend of Zelda Majora's Mask\nDream Baby Dream - Cover by Kevin Bessey (produced for this video)\nOp 90 No 3 Una Corda Cotton - Shubert\nGraze - Cover by Shuler and Slush (vocals by Slush, prod. by Shuler)\n\nSpecial thanks to Kevin Bessey and Shuler for producing original tracks for this video, thanks to Slush for singing (I sang the \"let me begin\" part)\n\nCheck out Kevin Bessey's spotify: https://open.spotify.com/artist/53h4243mR88lDJIjU5JsOb\n\nThe G-Links:\n\nhttps://twitter.com/GlinkLive\nTwitter, where I publish all my hot takes and dank memes\n\nhttps://www.reddit.com/r/glink/\nReddit, nobody uses this, but you can post memes here\n\nhttps://www.instagram.com/glink_between_worlds/\nInstagram, this is where things get real  a e s t h e t i c \n\nhttps://discord.gg/xtwYypf\nMy Discord, only for REAL gamers\n\nhttps://www.patreon.com/Glink\nSupport me on Patreon and be included in Q & As, audio updates, discord roles, and credits at the end of my videos \n\nhttps://teespring.com/stores/shop-glink\nWant to look fly while supporting my channel? Buy a T-shirt or poster here, all designs are custom made and completely original, not mention tasteful and artistic\n\nhttps://www.youtube.com/channel/UChJT4Jg89AHMyybcXFeKp_A\nMy podcast with Slush", "link": "https://www.youtube.com/watch?v=8_-fcFivTS8", "date_published": "2021-03-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]