[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "GNOME 41 - The first step towards a GNOME Platform?", "description": "Wanna get your own Linux server? Visit https://www.linode.com/linuxexperiment for a 100$ credit ! \n\n\n\nGet your Linux desktop or laptop here: https://slimbook.es/en/\n\n\nGNOME 41 has just been released. While it doesn't bring as many visual changes as GNOME 40 did, there are still loads of stuff to talk about, especially if you consider that GNOME is now taking steps to become a platform, not just a desktop, so stick around till the end to hear my thoughts on this.\n\n\n\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nJoin us on our new Discord server: https://discord.gg/xK7ukavWmQ\nTwitter : http://twitter.com/thelinuxEXP\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\nFollow me on ODYSEE: https://odysee.com/@TheLinuxExperiment:e\nOr join ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\n00:00 Intro\n01:38 GNOME Software\n03:59 Desktop changes\n06:52 Applications Changes\n08:18 The GNOME Platform\n\n\n\n\n\nOK The first BIG thing is GNOME software, the App Store of GNOME. The homepage has also been vastly improved, with big colorful headers for featured apps, a list of categories with nice artwork, and some editor's picks to showcase specific applications.\n\nThe application detail pages also have received a lot of love. There is a lot more info, presented in a much more user friendly way, with big tiles. You'll find the download size, or a safety level determined by which permissions the app can access.\n\nYou'll also get a tile to let you know on which devices the app will work well, including desktop, mobile or tablets, and an age rating. The version history is better laid out, and you get some nice info about the app's license and open source status, which is really nice.\n\nFinally, you get some links to the project's website, translations, bug tracker, help, or even donations, and the user reviews at the bottom. Oh, and you also get a lot more space for these screenshots.\n\n## Desktop\n\nYou now get a lot more options to change how this layout works, though, as the work to port GNOME Tweaks settings into the main settings app continues.\n\nYou'll find a new mutitasking settings panel, with a bunch of options. The first one is the ability to disable the hot corner for the activities view. You can also disable the tiling of windows when moving them to a screen edge, useful for multi-monitor setups when you want to just whip windows between displays.\n\nWorkspaces can also be configured to be dynamic, as in \"a new workspace is created each time the previous one has something in it\", or with a fixed number that you can define. You also get to choose if your workspaces span all of your displays, or are limited to your primary display, with secondary monitors having their own unique workspace. That's another welcome improvement for multi monitor users.\n\nFinally, you can decide to display apps from all workspaces when using alt+Tab, or only count those from the current virtual desktop. \n\nOn laptops and devices with a battery, you now also get power profiles, directly from the main system menu.\n\nIn terms of settings, you'll also get the ability to disable animations in the accessibility settings.\n\nInput latency has also been improved, which should be more noticeable on low refresh rates display.\n\n## Apps\nNow, in terms of the default apps, GNOME Calendar has received the ability to open .ics files and import their content to any of the already existing calendars. This means you can finally set it up as your default calendar application. Clicking on an event also shows a new event popover.\n\nNautilus, the file manager, now displays some information in the Trash folder, to let you know if your items will be deleted after a certain period of time. A Settings button will let you go and change that behavior.\nIt also now can compress archives into zip and password protected zip formats. \n\nThere is also a brand new application for handling remote desktops, called Connections. It can handle RDP and VNC and connect to Windows, Mac or Linux hosts.", "link": "https://www.youtube.com/watch?v=qCeVAqj97DQ", "date_published": "2021-09-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]