[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "13 Things To Know Before Playing Kena: Bridge of Spirits", "description": "Kena: Bridge of Spirits is a lot harder than the cute art style lets on--to help out, we've got 13 tips and tricks to help you be a better spirit guide.\n\nDeveloper Ember Lab's debut title, Kena: Bridge of Spirits, is out. The PlayStation console exclusive is available for PS5, PS4, and PC (via the Epic Games Store). If you're jumping in, you may have noticed that Bridge of Spirits is more challenging than the game's cute art style originally lets on--we've got 13 tips to help you be a better spirit guide.\n\nIn Bridge of Spirits, you play as Kena, a spirit guide on a personal quest that sees her stumbling upon a deserted village. The village and its surrounding areas are full of the spirits of the people who once lived there, many of whom can't move on as a result of their individual traumas. Kena's goal lies beyond the village, but she'll only be able to reach it if she helps the spirits she encounters.\n\nFor those still on the fence, check out GameSpot's Kena: Bridge of Spirits review, in which Phil Hornshaw writes, \"Kena: Bridge of Spirits is ultimately a game about making those connections, just like it's about making a connection with the game world around you through the Rot. It centers on characters who tried valiantly but failed to help one another, and what dealing with that pain did to them. It's about exploring a world and seeing what it once was, and helping to restore it again. And while Kena: Bridge of Spirits is full of familiar-feeling combat and exploration, its ability to find different ways to look at those ideas makes for a beautiful, emotional, and exciting journey.\"\n\n#kena #bridgeofspirits", "link": "https://www.youtube.com/watch?v=JE79Xj6AlS8", "date_published": "2021-09-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Infinite Big Team Battle Gameplay Demo", "description": "Check out the Halo Infinite Big Team Battle Gameplay that was unveiled during a Halo Infinite Technical livestream. Big Team Battle will bring a fan favorite game mode back to Halo and this is the first look at some of the gameplay. \n\nThe technical livestream was the second that Halo Infinite has hosted showing off gameplay and various features with this livestream being heavily focused around the multiplayer aspects of Halo Infinite. Additionally, another Halo Infinite Beta is fast approaching.\n\n#haloinfinite #halo", "link": "https://www.youtube.com/watch?v=LjVrR82xdE0", "date_published": "2021-09-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Infinite Multiplayer Tech Preview Early Look", "description": "Get a glimpse of the first look at Halo Infinite's Multiplayer tech preview early with the 343 Industries including developer interviews, a first look at Big Team Battle, Training Mode, and much more! For more information on Halo Infinite and to join us for upcoming previews and more. The technical preview starts on Friday September 23rd at 10am PT. \n\n#Halo #HaloInfinite #BigTeamBattle", "link": "https://www.youtube.com/watch?v=1hvv5BuXcqs", "date_published": "2021-09-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Marvel's Guardians of the Galaxy - Hands-On Preview", "description": "Here is an early look at Marvel's Guardians of the Galaxy including the game's combat system, early story, and mechanics that emphasize a teamwork-focused approach. See how Star-Lord, Groot, Rocket, and Gamora work, or don't, together.\n\nMost superhero games give you all the power--you are, of course, the hero of the story. With Marvel's Guardians of the Galaxy, developer Eidos Montreal is taking a different approach, putting you into a superhero team with the focus on making you feel like part of the group. You can't deal with every problem on your own, but it's remarkable how, through the teamwork mechanics within the game, you quickly start to feel like you can work together with the other Guardians to handle any obstacle.\n\nWe recently got to spend about two hours playing a chapter of Guardians of the Galaxy, which gave a sense of both how the choice-based story will unfold and how you'll handle controlling the entire team of Guardians in battle. In both cases, your choices as the de facto leader of the Guardians is important, but yours isn't the only voice that matters. Through its mechanics and its character development, Guardians of the Galaxy puts its focus on being a single-player game that's all about teamwork.\n\n#Marvel'sGuardiansoftheGalaxy #Marvel #GuardiansoftheGalaxy", "link": "https://www.youtube.com/watch?v=f3OmyU9Sh5E", "date_published": "2021-09-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Xbox Game Pass In September", "description": "The Game Pass library got a lot bigger this September with the addition of Final Fantasy XIII, SkateBird, and The Artful Escape, with plenty more on the way.\n\nLearn about what's new, what's leaving, and what you should be playing on Game Pass. It can be a lot to keep track of, not to mention figuring out what to play from its massive library. That's why we created the Game Pass Show. Join Kurt  to learn what's new, what's leaving, and what you should consider playing. \n\nSeptember sees the arrival of 13 games including Surgeon Simulator 2, Nuclear Throne, and Superliminal. Also coming this month is Lemnis Gate, Sable, and Subnautica : Below Zero. For this episode's staff pick, Chris Morris joins the chat to talk about Planet Coaster: Console Edition.\n\n#xboxgamepass", "link": "https://www.youtube.com/watch?v=xh1YdPAO1AE", "date_published": "2021-09-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Diablo 2 Resurrected: Everything You Need To Know", "description": "Diablo II Resurrected is upon us and it brings the classic to consoles for the first time. The classic game’s got a brand new look as well as a few tweaks and additions to modernize the experience, so here’s everything you need to know and all the biggest changes. \n\nFor the latest on what's happening at Activision Blizzard with regard to the ongoing legal action taken by the California Department of Fair Employment and Housing, take a look at our timeline of events: https://www.gamespot.com/articles/activision-blizzard-lawsuits-and-investigations-timeline-of-events/1100-6494785/\n\nIt’s been 21 years since Diablo II, and if you missed the seminal classic or are hankering to revisit, then the remaster, Diablo II Resurrected, is upon us and is coming to PlayStation, Xbox, and Nintendo Switch for the first time. \n\nThe classic game’s got a brand new look as well as a few tweaks and additions to modernize the experience for a new and returning audience, so here’s everything you need to know and all the biggest changes, including remastered cinematics, new visual style, ultrawide support, 4k resolution. The gameplay has been mostly unchanged, but there are a few quality of life changes that you can toggle on and off at will. \n\nDiablo 2: Resurrected is the first major game release from Blizzard as parent company Activision Blizzard continues to address allegations from a state of California lawsuit accusing parent company Activision Blizzard of fostering a \"frat boy culture\" of harassment and discrimination against women. For the latest on what's happening with regard to the ongoing legal action, take a look at our timeline of events: https://www.gamespot.com/articles/activision-blizzard-lawsuits-and-investigations-timeline-of-events/1100-6494785/\n\n#diablo #diablo2 #diabloresurrected", "link": "https://www.youtube.com/watch?v=BuL63MeYy-o", "date_published": "2021-09-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Infinite Beta Dates And Microtransactions System | GameSpot News", "description": "New Halo Infinite multiplayer details are revealed including the schedule for the upcoming beta. Phasmophobia gets a new update that overhauls the game’s journal. Forza Horizon 5’s multiplayer modes are revealed during a livestream. \n\nIn this video, DeVante talks about the new Halo Infinite multiplayer beta dates and 343 Industries reaction to multiplayer progression criticism. \n\nPhasmophobia gets a new update that overhauls it’s journal in celebration of it’s release one year ago. \n\nLater in the video, DeVante breaks down the multiplayer modes of Forza Horizon 5 which releases on November 5th, 2021.\n\n#halo #haloinfinite", "link": "https://www.youtube.com/watch?v=lJL9rw3nVhY", "date_published": "2021-09-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Kena Hardest Difficulty NO HUD Flawless Gameplay", "description": "Kena: Bridge of Spirits' combat can be deceptively difficult, but we pull off the first minor boss fight on the hardest difficulty without taking damage.\n\nIn the video, the game is set to Master Spirit Guide, the hardest difficulty in the game, setting rules such as losing courage when getting hit, enemies becoming much more aggressive, and enemies dealing more damage. We conquer the first minor boss in this mode with no HUD and no damage taken to up the ante. Master Spirit Guide only unlocks once you've beaten the game.\n\n#kena #bridgeofspirits", "link": "https://www.youtube.com/watch?v=vsdUiR3iXIU", "date_published": "2021-09-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Kena: Bridge of Spirits First 20 Minutes 4K Gameplay", "description": "Kena: Bridge of Spirits is a gorgeous-looking game especially in 4k. Here are the first 20 minutes on the PlayStation 5 which showcases Kena's staff in action, meeting adorable Rot creatures, and learn about the world. We explore the opening area, find treasures, solve a puzzle, and fight our way through some enemies to embark on our journey.\n\nIn Bridge of Spirits, you play as Kena, a spirit guide on a personal quest that sees her stumbling upon a deserted village. The village and its surrounding areas are full of the spirits of the people who once lived there, many of whom can't move on as a result of their individual traumas. Kena's goal lies beyond the village, but she'll only be able to reach it if she helps the spirits she encounters.\n\nKena: Bridge of Spirits is a third person action-adventure game created by Ember Lab. You'll play as Kena, a young spirit guide who uses her magical abilities to help deceased people move from the physical to the spirit world. \n\nKena Bridge of Spirits releases on PlayStation 4, PlayStation 5 and PC through the Epic Game Store on September 21, 2021.\n\n#kena #kenabridgeofspirits", "link": "https://www.youtube.com/watch?v=BwN90a5SJEs", "date_published": "2021-09-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Kena: Bridge of Spirits Review", "description": "Though it relies on familiar combat and exploration mechanics, Kena: Bridge of Spirits gives a new perspective through its beautiful art direction, emotional story, and super-cute Rot companions.\n\nKena: Bridge of Spirits is, in some ways, a familiar action-adventure game. You'll see similarities in it from the likes of titles such as Okami, Star Wars Jedi: Fallen Order, Sekiro: Shadows Die Twice, and a host of other titles in the genre. But developer Ember Studios does a great job of giving a new look on the familiar throughout the game, both to tell the deep and emotional story of a spirit guide helping traumatized ghosts move on from this world, and in how it uses gameplay for some deceptively tough combat and smart puzzles.\n\nYou play as Kena, a spirit guide trying to find out what has happened in the area around an abandoned village, where all the inhabitants have fallen to tragedy. The pained spirits have been twisted by what has happened to them, causing the land around the village to be poisoned by a spreading corruption. Kena's role as a spirit guide is to help heal those ghosts, and to do that, you have to fight their twisted forms with a combination of melee attacks, dodges, and parries.\n\nBut you also have access to the Rot, a group of tiny spirit companions who change up everything about the way Kena plays. The Rot can be used in battle to distract enemies or to power up Kena's special spirit energy attacks. They also work together with your combat abilities to make most fights feel like a puzzle to be solved. The Rot are essential to destroying the poisoned hearts that spread the corruption, and you'll need to think tactically to deploy them at the right time, and in the right way, to defeat Kena's tough enemies and bosses.\n\nWith a big world to explore, lots of innovative puzzles to solve with the abilities of both Kena and the Rot, and some excellently designed boss fights, Kena does a lot to stand apart from similar action-adventure games. Its combination of story and mechanics make it a beautiful journey to take. For more, check out our full written Kena: Bridge of Spirits review.\n\n#kena #bridgeofspirits #kenareview", "link": "https://www.youtube.com/watch?v=s1K6-3VCKu4", "date_published": "2021-09-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Lost Judgment Early Access Livestream (Spoiler-Free)", "description": "Jean-Luc is joined by Yakuza boys Ben and Evan to show off an early look at Lost Judgment. The stream will avoid any main plot and instead show off the wealth of side activities and mini-games.\n\n#lostjudgement", "link": "https://www.youtube.com/watch?v=biTwVi2fSFM", "date_published": "2021-09-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "NEW Star Wars Game Rumors Surface | GameSpot News", "description": "A new Star Wars game from Detriot: Become Human developer Quantic Dream is rumored to be in development. A Battlefield 2042 developer speaks out on the game’s delay to November 19. Splitgate is reportedly getting a Forge mode before Halo Infinite. \n\nIn this video, DeVante talks about new rumors involving Quantic Dream and the possibility that they are developing a new Star Wars game. \n\nA member of Battlefield 2042’s development team speaks on the game’s recently delay from October to November and reassures fans that everything is alright. \n\nLater on, DeVante explains Call of Duty: Vanguard’s open beta hacker problem and talks about Splitgate’s plan to include a forge mode before Halo Infinite.\n\n#starwars", "link": "https://www.youtube.com/watch?v=QHmrbdhQe78", "date_published": "2021-09-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]