[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCsXVk37bltHxD1rDPwtNM8Q", "title": "Can YOU Fix Climate Change?", "description": "You want to learn more about science? Check out our sciency products on the kurzgesagt shop – all designed with love and produced with care. \nGetting something from the kurzgesagt shop is the best way to support us and to keep our videos free for everyone. \n►► https://kgs.link/shop-149\n(Worldwide Shipping Available)\n\nSources & further reading:\nhttps://sites.google.com/view/sources-climate-how/\n\nThis video was supported by Gates Notes, the personal blog of Bill Gates, where he writes about global health, climate change, and more. Check out it out to learn more about ways the world can work together to reach zero greenhouse gas emissions:\nhttps://www.gatesnotes.com/Climate-and-energy?WT.mc_id=2021_ClimateCtr2021_CTRKurt-YT_&WT.tsrc=CTRKurtYT\n\nTo get some background on how we deal with sponsorships please read this blog post:\nhttps://medium.com/@Kurzgesagt/kurzgesagt-sponsorships-on-youtube-3121a45b0fe9\n\nNever before in human history have we been richer, more advanced or powerful. And yet we feel overwhelmed in the face of rapid climate change. It seems simple on the surface. Greenhouse gases trap energy from the Sun and transfer it to our atmosphere. This leads to warmer winters, harsher summers. Dry places become drier and wet places wetter. Countless ecosystems will die while the rising oceans swallow coasts and the cities we build on them. \n\nSo why don’t we just like… prevent all of that? Well, it’s complicated. \n\nOUR CHANNELS\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nGerman Channel: https://kgs.link/youtubeDE \nSpanish Channel: https://kgs.link/youtubeES \n\n\nHOW CAN YOU SUPPORT US?\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nThis is how we make our living and it would be a pleasure if you support us!\n\nGet Merch designed with ❤ https://kgs.link/shop-149\nJoin the Patreon Bird Army 🐧  https://kgs.link/patreon  \n\n\nDISCUSSIONS & SOCIAL MEDIA\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nReddit:            https://kgs.link/reddit\nInstagram:     https://kgs.link/instagram\nTwitter:           https://kgs.link/twitter\nFacebook:      https://kgs.link/facebook\nDiscord:          https://kgs.link/discord\nNewsletter:    https://kgs.link/newsletter\n\n\nOUR VOICE\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nThe Kurzgesagt voice is from \nSteve Taylor:  https://kgs.link/youtube-voice\n\n\nOUR MUSIC ♬♪\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\n700+ minutes of Kurzgesagt Soundtracks by Epic Mountain:\n\nSpotify:            https://kgs.link/music-spotify\nSoundcloud:   https://kgs.link/music-soundcloud\nBandcamp:     https://kgs.link/music-bandcamp\nYoutube:          https://kgs.link/music-youtube\nFacebook:       https://kgs.link/music-facebook\n\nThe Soundtrack of this video:\nNuclear Death Toll:\nSoundcloud: https://bit.ly/2W2g9fn\nBandcamp: https://bit.ly/3krkW3n\nClimate Doom\nSoundcloud: https://bit.ly/2XQFcmD\nBandcamp: https://bit.ly/3hWCfrt\nClimate Change:\nSoundcloud: https://bit.ly/3o2jdUB\nBandcamp: https://bit.ly/3lTUSh4\n\nIf you want to help us caption this video, please send subtitles to subtitle@kurzgesagt.org\nYou can find info on what subtitle files work on YouTube here:\nhttps://support.google.com/youtube/answer/2734698?hl=en-GB&ref_topic=7296214\nThank you!\n\n🐦🐧🐤 PATREON BIRD ARMY 🐤🐧🐦\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nMany Thanks to our wonderful Patreons (from http://kgs.link/patreon) who support us every month and made this video possible:\nMrXPotato, Pete Stoppani, Kyona Jarrett, Rey, Patsch, eSyr, Csaba Vajai, Phantom Foreskin, Willis Scothorn, William Pyburn, Amdla Chadwick, Nguyễn Thái Minh, Joan Oliveras Torra, Oivind, Juniper, Amallama, Serge-Eric Tremblay, Saul, Doctor Beer, 何智超, Beanslinger2, Friso Sikkema, Guntard, Kim Allen, Bianca Rosner, Vladimir Smykalov, KaTech, Alex, Kenneth Smith, Jason Azarpay, Karin Busby, christina yessaian, TehWeezle, timo, Colin Christopher, DIOMEDES ABCMNXYZ, Greg Schein, Partho P. Das, Olivier Maigniez, Steffan R., Jesse Newsome, Nikolas Anctil, Timothy James Fritz, Matrisku Boldivan, Ethan Hernandez, Ignimbrite Tuff, Dragonisser, Albert Mark, A, Vivek Narsimha Dondeti, Dimitri Averboukh, DJ 0zymandias, Leewyn Jacobs, John Allemang, RoboPhred, meat man, DRHAKE, Yohan Lee, Mecenate, Héctor Díaz, Steven Giallourakis, Dylan Savosnick, jamx2, Ben C, Kevin Finni, Tom Timmerman, ConfettiBoxer, Ivan, Elliot Moore, Nym Moondown, Fredrik Dreyer, LeqKsi, Ruchira Ramachandra, Martin Kristjansen, Bruce Welch, Talon Gutierrez, Alexander de Weese, Christopher Dasenbrock, Alexis White, Gadjiz Goblin, Megs, Kevin Winoto, WernO, Erik O., CyberValkyrie, Chad McHenry, António Lima, Ruth Korwel, Matthew Korwel, Anibal Gomez, Paul Gaffey, Mayank Singh, nate dolan, Beert, Bernadette Eve, jveezy, Frederik Polachowski, Felix the Cat, Surya Avala, Ewan Cassidy, Stefanie Saw, David Hayes, Hayden Christensen, Tealer, Luiz Vieira Pinto Neto, Mykola Ohoiko, Grey_Matter, Tomasz Paź, Joshuah hinojosa, Rob OBrien, Gavin H, Nico Latzel, Berbnote, Klara C.", "link": "https://www.youtube.com/watch?v=yiw6_JakZFc", "date_published": "2021-09-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]