[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "21 Minutes of MLB The Show 21 PS5 Gameplay", "description": "Watch as the Oakland Athletics take on the Miami Marlins in MLB The Show 21 on PlayStation 5. Get a glimpse of over 20 minutes of gameplay in an epic struggle between both teams at the Oakland Coliseum. Find out who wins in this showdown. MLB The Show 21 will be playable for those who purchased the Jackie Robinson Edition or the Deluxe Edition. It will be playable on April 16th onward, otherwise the full release is on April 20th.", "link": "https://www.youtube.com/watch?v=TXOgTU3Vacg", "date_published": "2021-04-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Everything We Know About Resident Evil Village's Lady Dimitrescu", "description": "It's been love at first sight with Lady Dimitrescu, however, looks can surely be deceiving. And while we’re all a little busy fetishizing the tall vampire lady, what do we actually know about her?\n\nCheck out our complete Resident Evil timeline explained here: https://youtu.be/QkPgowr-T9g​ \n\nWe’re only a few weeks away from the release of Resident Evil Village, but we still can’t seem to stop talking about the internet’s most notoriously tall vampire woman: Lady Alcina Dimitrescu. We’re all still very thirsty to know as much as possible about her, and thanks to the recent RE Village showcase we have a little more information on the tall lady--just enough to hold us over. \n\nIn the above video, Kurt Indovina fulfills everyone’s stalkier desires, and uncovers everything we know so far about the Romanian vampire, Lady Dimitrescu. Kurt goes over her obvious height, being a vampire, and art director Tomonori Takano's inspirations, which include Morticia Adams and Hungarian noblewoman/serial killer Elizabeth Báthory. Carrying over from Resident Evil 7, there’s a returning motif of antagonistic family. Dimitrescu mentions Mother Miranda, her daughters, and a brother named Heisenberg. \n\nResident Evil Village is very much a  continuation of the previous installment, carrying over RE7's first-person view and protagonist Ethan Winters, while taking direct inspiration from Resident Evil 4’s more gothic,and European influence. Still, there are many questions left unanswered, like whether or not Dimitrescu is actually the main antagonist, and why is Ethan’s child so important? \n\nHopefully our dreams will be made true on May 7.", "link": "https://www.youtube.com/watch?v=MdGss8-va64", "date_published": "2021-04-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Genshin Impact 6 Months Later: Is It Still Good?", "description": "How is Genshin Impact after 6 months of not playing the game? We take a quick look and see if it still holds up since its September launch.\n\nGenshin Impact is a massive game that, on its initial launch, was truly magical. But I think we won't be alone here to say that most people had a honeymoon phase, and the end game became the crossroads for many players. But six months later, picking up Genshin Impact again turned out to be an interesting experience because of a unique combination of traits this game has that we never thought about.\n\nWhat has changed in Genshin Impact? What's been added? And how is it for returning players? We go over what we think while playing on the newest update.", "link": "https://www.youtube.com/watch?v=HFJbRsxoANo", "date_published": "2021-04-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Core Games - Official Early Access Cinematic Trailer", "description": "Check out the Core Games official early access cinematic trailer! \n\nCore Early Access is here and available in the Epic Games Store for free at https://www.epicgames.com/store/p/core​.  Join Kenton (voiced by WWE's Austin Creed) as he gains access to the Core multiverse. Play thousands of Unreal-powered games in every genre imaginable, or create, share, and earn from your own!\n\n#EpicGames #CoreGames", "link": "https://www.youtube.com/watch?v=Bj9DTD9rpqU", "date_published": "2021-04-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Days Gone PC Features Trailer", "description": "Check out this official trailer for Days Gone outlining all the features coming to the game for PC. Days Gone comes to PC on May 18th! \n\nDays Gone is an open-world action-adventure game set two years after a devastating global pandemic. Play as Deacon St. John, a bounty hunter facing a brutal struggle for survival while searching for a reason to live.", "link": "https://www.youtube.com/watch?v=JT_gdAMuY3I", "date_published": "2021-04-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil 4 VR Reveal Trailer | Resident Evil Showcase", "description": "Resident Evil 4 is getting the VR treatment. Check out this world premiere trailer that brings the original landmark classic to the world of VR!", "link": "https://www.youtube.com/watch?v=_FJFnm9PCfY", "date_published": "2021-04-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil Village April Showcase Livestream", "description": "Tune into Capcom’s showcase for Resident Evil Village to see a brand new trailer and gameplay. The event begins on April 15th at 3pm PT.", "link": "https://www.youtube.com/watch?v=aIgJrN6mmGI", "date_published": "2021-04-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil Village Demo: Everything To Know", "description": "The Resident Evil Showcase showed off a bunch of new things for Resident Evil Village! This shows off all the information to know about the upcoming cross platform demo for Resident Evil Village! \n\n#ResidentEvil #ResidentEvilShowcase #ResidentEvilVillage", "link": "https://www.youtube.com/watch?v=z4mi8yV6QwY", "date_published": "2021-04-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil Village Mercenaries Mode Reveal Trailer  | Resident Evil Showcase", "description": "The classic, frenetic survival mode makes its glorious return to the series with new abilities and customization options. Check out the reveal trailer shown off during the Resident Evil Showcase event!", "link": "https://www.youtube.com/watch?v=WiOTdbT9RSI", "date_published": "2021-04-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil Village Trailer  | Resident Evil Showcase", "description": "Ethan Winters is dealing with some serious mommy issues in this brand new trailer for Resident Evil Village kicking off this month's Resident Evil showcase. Join him, Chris Redfiled, and of course, tall vampire ladies when it launches on May 7th!", "link": "https://www.youtube.com/watch?v=tjfTxFzGh3Q", "date_published": "2021-04-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]