[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCxt2r57cLastdmrReiQJkEg", "title": "CANCEL CULTURE: Who's Afraid of the Online Mob?", "description": "Watch this video ad-free on Nebula: https://nebula.tv/videos/tom-nicholas-cancel-culture-who-s-afraid-of-the-online-mob\n\nA video about Cancel Culture and \"mobs\".\n\n*Chapters*\n0:00​ The Canceling of Tom Nicholas\n01:01​ 1. Introduction\n07:12​ The Apology\n09:20​ 2. The Birth of the Mob\n16:50​ The Livestream\n19:43​ 3. The Madness of Crowds\n28:09​ Things Escalate\n29:26​ 4. Online Mobs and Public Shaming\n36:55​ The Book Deal\n39:45​ 5. The Mob and the Individual\n47:20​ Thanks!\n\n*Credits*\nThanks to all the amazing creators who contributed bits to this video!\n\nCommenters:\n\nCommenter 1: @HeyItsVadim \nCommenter 2: @ThoughtSlime \nCommenter 3: @WereInHell \nCommenter 4: @LackingSaint \nCommenter 5: @SecondThought \nCommenter 6: @jordanatheresa  \nCommenter 7: @JohntheDuncan \nCommenter 8: @WhatsSoGreatAboutThat \nCommenter 9: @JonTheLitCritGuy \n\nLivestream Host: @TheSerfsTV / @TheSerfTimes \n\nPublisher: @SophiefromMars \n\n*Some Copy about the Video for the YouTube Algorithm*\n\nIn this month's video, we're looking at cancel culture (or call-out culture or \"public shaming\" depending on your preference). In 2015, the pop-psychology writer Jon Ronson published a book called \"So You've Been Publicly Shamed\", which argued that the contemporary internet (Twitter most of all) had become an increasingly hostile place on which users would frequently gather together to ruin the lives of those with which they disagreed. Since then, this idea (which has since come to be referred to as \"cancel culture\") has gained popularity, with the media dedicating countless screen hours and column inches to worrying about the \"online mob\".\n\nConcerns about cancel culture reached fever pitch in 2020. It was the year which both saw the publication of the \"Harper's letter\" and J.K. Rowling receiving backlash for doubling-down on her problematic rhetoric.\n\nAs ever, we're going to be taking the longer view, considering what these contemporary fears about woke \"Twitter mobs\" might inherit from historical fears about physical ones.\n\nSupport the channel on Patreon at http://patreon.com/tomnicholas\n\nIf you've enjoyed this video and would like to see more including my What The Theory? series in which I provide some snappy introductions to key theories in the humanities as well as video essays and more then do consider subscribing.\n\nThanks for watching!\n\nTwitter: http://twitter.com/tom_nicholas\nInstagram: http://instagram.com/tomnicholaswtf\nPatreon: http://patreon.com/tomnicholas\nWebsite: http://www.tomnicholas.com/​\n\n#cancelculture​ #canceling​ #tomnicholas​", "link": "https://www.youtube.com/watch?v=Ns_qnfUqEJI", "date_published": "2021-02-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]