[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Joss Favela: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nAnamaria Sayre | November 3, 2021\nEvery inch of Joss Favela’s Sinaloa-based, sombrero-shrouded “El Tiny” concert invokes the musical lineage of Mexican Regional music. Mixing soulful vocals with twangy guitars and a classic accordion, he opens with a sweet rendition of a genre staple, love ballad “Pienso en Tí.” Next, he dips into a heartfelt, piano-driven version of a song he wrote for his sister “La Mejor Versión de Mi.” Taking a beat between the tracks, he invites us to partake in the legacy of generations of caballeros that preceded him. “Yo soy de un rancho que se llama Caitime, Sinaloa, Mexico y con esta música crecimos,” he says, “esta música vivimos, y nos gusta porque son nuestras raíces, nuestra cultura, nuestra gente. (I’m from a ranch town called Caitime, Sinaloa, Mexico and we grew up with this music, we live this music and we like it because it’s our roots, our culture, our people.)”\n\nAfter moving through an upbeat performance of “El Alumno,” Kinky bassist Cesar Pliego Villarreal joins the ranchero ensemble. The Monterrey native uses his bass to infuse a different Mexican tradition on three more classic Regional tracks: “Me Vas a Extranar,” “Bonita” and “Cuando Fuimos Nada.”\n\nAs torch-bearers of a complex and beloved sonic tradition, one can imagine there are moments for Mexican Regional stars where preservation precedes performance. At the end of his Tiny Desk, the caballero pauses and allows sweet accordion sounds carrying souls of the past to fill the space.\n\n“Muchas gracias Tiny Desk,” Favela says, “por llevar nuestra música regional a tantos lugares,\ny tantos corazones. (Thank you very much Tiny Desk for taking our regional music to so many places, and so many hearts.)”\n\nSET LIST\n* \"Pienso en Ti\"\n* \"La Mejor Versión de Mí\"\n* \"El Alumno\"\n* \"Me Vas a Extrañar\"\n* \"Bonita\"\n* \"Cuando Fuimos Nada\"\n\nMUSICIANS\n* Joss Favela: vocals, guitar\n* Cesar Pliego Villarreal: bajo quinto\n* Daniel Valenzuela León: accordion, bass\n* Gustavo A. Cota: piano, bass\n* Rafa Sixx: drums\n\nCREDITS\n* Video: Julián García, Patricio Carvente, David Padilla\n* Audio: Ricardo Orrantia\n\nTINY DESK TEAM\n* Producer: Anamaria Sayre\n* Video Producer: Kara Frame\n* Audio Mastering: Josh Rogosin\n* Tiny Production Team: Bob Boilen, Bobby Carter, Maia Stern, Sofie Hernandez-Simeonidis\n* Executive Producer: Keith Jenkins\n* Senior VP, Programming: Anya Grundmann\n\n#tinydesk #eltiny #jossfavela", "link": "https://www.youtube.com/watch?v=l4c4PUNkawc", "date_published": "2021-11-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Neffy's journey to the Tiny Desk", "description": "Neffy won our 2021 Tiny Desk Contest with a song about returning home. After working from home for many months, a small Tiny Desk production crew returned to the Tiny Desk to record her special concert. This is Neffy's journey to the Tiny Desk.\n\nThanks to @statefarm for its support of the Tiny Desk Contest.\n\n#tinydesk #neffy #tinydeskcontest", "link": "https://www.youtube.com/watch?v=Hq4SuewheZQ", "date_published": "2021-11-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]