[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 New Portal Gameplay", "description": "Get an all brand new look at Battlefield 2042's Portal Gameplay in this latest trailer. Create and play Battlefield the way you want to.\n\n#Battlefield2042", "link": "https://www.youtube.com/watch?v=8btI7myXgO0", "date_published": "2021-11-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Vanguard World Premiere ft. Migos, #LilsVsBigs and more", "description": "Tune in November 3rd at 6pm PDT for the World Call of Duty: Vanguard Premiere with VERZUZ. \n\nStarting off will be a showcase of the Vanguard Campaign, followed by a multiplayer showdown between Lils and Bigs. Plus an exclusive first look at Zombies and Call of Duty Warzone Pacific.", "link": "https://www.youtube.com/watch?v=ulBe5t-yRw0", "date_published": "2021-11-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New Battlefield Portal Gives Us ALL The Options | GameSpot News", "description": "In today’s GameSpot News, Persia talks about the new Battlefield Portal details, Elden Ring gameplay that’s coming November 4th, and more. \n\nBattlefield Portal details have been revealed and it will give players the chance to create the Battlefield experiences of their dreams with content from Battlefield 3, Battlefield Bad Company 2, Battlefield 1942, and 2042 available to choose from. Gameplay modes, maps, weapons, UI, AI, and more can all be tuned to your liking. \n\nBandai Namco will show off more of From Software's eagerly awaited RPG Elden Ring on November 4th, 2021. It will air at 7 AM PT / 10 AM ET and you can watch the footage on YouTube and Twitch.\n\nAs announced in its latest quarterly earnings, Activision Blizzard has delayed the releases of both Overwatch 2 and Diablo 4, two of Blizzard's most anticipated upcoming titles. In another part of the investor presentation, Activision Blizzard noted that the Overwatch League will still play an early build of Overwatch 2 starting next spring. \n\nAnd in case you didn’t know, a new category has been added to Twitch called “Animals, Aquariums, & Zoos”. This week is Animal Week and Twitch is partnering with select groups to raise awareness for the conservation of wildlife.\n\nFor more information on all of our topics, please visit gamespot.com\n\nTIMESTAMPS:\nIntro - 00:00\nBattlefield 2042 - 00:10\nElden Ring - 02:03\nOverwatch 2 & Diablo 4 - 02:52\nCute Animals & Outro - 04:14", "link": "https://www.youtube.com/watch?v=rkaWzL323g0", "date_published": "2021-11-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Uncharted 3 Is Still The Most Important Entry 10 Years Later", "description": "What makes Uncharted 3: Drake’s Deception the most important game in the series? DeVante Chisolm takes a look at how Uncharted 3 lived up to its predecessor, what it did for the franchise and how it holds up in a post-Uncharted 4 world.\n\nNovember 1st, 2021, marks the 10th anniversary of Uncharted 3: Drake’s Deception and even though Uncharted 2 and 4 are widely held up as the best in the series, Uncharted 3 is the most important for Nate’s development. If each game boils down to searching for treasure, then Uncharted 3 was the first to include the subtext of Nate searching for himself. \n\nIn this videos, DeVante celebrates the anniversary of Nathan Drake’s third adventure and revisits Uncharted 3 to see what makes it so special. \n\nUncharted 3 originally released on PS3 in 2011, but is now available on PS4/PS5 via The Nathan Drake Collection. The game will also come to PC in early 2022 via the Uncharted: Legacy of Thieves Collection.\n\nTIME STAMPS:\n00:00 - INTRO\n01:13 - Among Success\n02:46 - Drake’s Development\n07:27 - A Video’s End\n09:29 - OUTRO", "link": "https://www.youtube.com/watch?v=J2YntvBGNL0", "date_published": "2021-11-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Apex Legends Season 11 Livestream", "description": "Tune in as Persia checks out day one of Apex Legends Season 11 and new character Ash.", "link": "https://www.youtube.com/watch?v=OmrVg58QAnY", "date_published": "2021-11-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Bowser Pleads Guilty… No Not That Bowser | GameSpot News", "description": "In this episode of GameSpot News, we talk about a hacker named Bowser pleading guilty to his crimes against Nintendo, the Nintendo Switch production being cut, Skyrim becoming a board game, and Netflix Games releasing on Android. \n\n\nIn this video, DeVante talks about a hacker named Gary Bowser pleading guilty for his participation in unlocking Nintendo Switch systems. As part of his plea deal, Bowser agrees to pay Nintendo $4.5 million and could face prison time. \n\n\n\nDeVante also talks about the ongoing semiconductor shortage causing Nintendo to revise its production estimates for the rest of the fiscal year. A planned 30 million units has been reportedly cut down to 24 million units. \n\n\nLater on the video, Skyrim is being made into a board game currently set for release sometime in 2022,  PlayStation Plus games and Xbox Games with Gold for November are now available, and Netflix Games is coming to Android devices on November 3, 2021.", "link": "https://www.youtube.com/watch?v=NZ0Z0kP_GSo", "date_published": "2021-11-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Forza Horizon 5 - Everything To Know", "description": "Here is everything to know about Forza Horizon 5 before the game launches on Nov 9th for all Xbox systems and PC.\n\nCar fans rejoice, as one of game’s best racing franchises is back with Forza Horizon 5. The Horizon series is known for its more arcade-y take on the Forza formula, with gorgeous open worlds to explore and a seemingly endless amount to do. 5 looks to be no different and is a perfect time for new players to jump in thanks to its day one availability on Xbox game pass.\n\n#ForzaHorizon5", "link": "https://www.youtube.com/watch?v=F4iHKA92XAY", "date_published": "2021-11-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]