[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "America After 9/11: Emma Sky (interview) | FRONTLINE", "description": "Emma Sky advises on conflict and reconciliation in the Middle East. She advised both U.S. Gen. Raymond Odierno and Gen. David Petraeus in Iraq. Sky is the author of “The Unravelling: High Hopes and Missed Opportunities in Iraq” and “In a Time of Monsters: Travels Through a Middle East in Revolt.”\n\nThe following interview was conducted by Jim Gilmore on April 15, 2021. It has been edited for clarity and length.\n\nThis interview is being published as part of FRONTLINE’s Transparency Project, an effort to open up the source material behind our documentaries. Explore the transcript of this interview, and others, on the FRONTLINE website: https://www.pbs.org/wgbh/frontline/interview-collection/america-after-9-11/\n \n#AmericaAfter911 #EmmaSky #FrontlineInterview\n \nSubscribe on YouTube: http://bit.ly/1BycsJW \nInstagram: https://www.instagram.com/frontlinepbs \nTwitter: https://twitter.com/frontlinepbs \nFacebook: https://www.facebook.com/frontline \n\nFRONTLINE is streaming more than 200 documentaries online, for free, here: http://to.pbs.org/hxRvQP\n \nMajor funding for FRONTLINE is provided by the Ford Foundation. Additional funding is provided by the Abrams Foundation; the John D. and Catherine T. MacArthur Foundation; Park Foundation; and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation, and additional support from Koo and Patricia Yuen.", "link": "https://www.youtube.com/watch?v=FuoyRIInut8", "date_published": "2021-09-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "From 9/11 to Jan. 6 | “America After 9/11” | FRONTLINE", "description": "Watch a scene from the opening of “America After 9/11,” a FRONTLINE documentary that examines how the U.S. response to Sept. 11 ushered in an era of fear, mistrust and division.\n\nSubscribe on YouTube: http://bit.ly/1BycsJW\n\nOn the evening of Sept. 11, 2001, members of Congress gathered on the steps of the U.S. Capitol building, the symbolic seat of American democracy. It had been just hours since Al Qaeda operatives killed nearly 3,000 people in the worst terror attack on the U.S. in the country’s history, turning four passenger airplanes into deadly weapons.\n\nStanding before the building that’s believed to have been the intended target of one of the hijacked planes, Republicans and Democrats alike raised their voices to sing “God Bless America” in a stirring moment of unity. It wouldn’t last.\n\n“America After 9/11,” a special, two-hour FRONTLINE documentary from acclaimed filmmaker Michael Kirk and his team, reveals why, finding in the U.S. response to 9/11 a chain of unintended consequences that would usher in an era of fear, mistrust and division.\n\nDrawing on both new interviews and those from the dozens of documentaries Kirk and his team have made in the years since 9/11, the documentary offers an epic re-examination of the decisions that changed the world and transformed America. \n\nWatch \"America After 9/11\" in full starting Sept. 7, 2021: https://www.pbs.org/wgbh/frontline/film/america-after-9-11/\n\nFind FRONTLINE on the PBS Video App, where there are more than 300 FRONTLINE documentaries available for you to watch anytime: https://to.pbs.org/FLVideoApp \n\nSubscribe on YouTube: http://bit.ly/1BycsJW \nInstagram: https://www.instagram.com/frontlinepbs \nTwitter: https://twitter.com/frontlinepbs \nFacebook: https://www.facebook.com/frontline \n\nMajor funding for FRONTLINE is provided by the Ford Foundation. Additional funding is provided by the Abrams Foundation; the John D. and Catherine T. MacArthur Foundation; Park Foundation; and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation, and additional support from Koo and Patricia Yuen.", "link": "https://www.youtube.com/watch?v=oJXNn_8IDk8", "date_published": "2021-09-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]