[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call Of Duty: Vanguard Multiplayer Mode Details | GameSpot News", "description": "Call Of Duty: Vanguard’s multiplayer mode has been revealed, an Alan Wake remaster has been announced for Fall of 2021, Mass Effect may be built on Unreal Engine instead of Frostbite, and Halo Infinite is making changes to the radar after the first technical preview.\n\nIn this video, Persia talks about the reveal of Call Of Duty: Vanguard’s multiplayer mode and other details that were showcased in a livestream. \n\nThere was also the announcement of the Alan Wake remaster that is releasing this year and will include the core 2010 game, plus The Signal and The Writer DLC, along with a new commentary track from creative director Sam Lake. She also goes over rumors that EA is considering Unreal Engine for Mass Effect 5 instead of its own proprietary Frostbite engine. \n\nLastly, Persia talks about changes coming to the radar in Halo Infinite after feedback from the technical preview. Notes on these changes and more coming to the next Halo Infinite flight were also shared in an in-depth blog post from the developers. If you want a chance to play Halo Infinite ahead of the game’s release on December 8, you can still sign up for the Halo Insider program on HaloWaypoint.com\n\nFor more information on all of the topics in this video, visit gamespot.com.\n\n#cod #codvanguard", "link": "https://www.youtube.com/watch?v=eAYp6V5pxuw", "date_published": "2021-09-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Sony Teases New Project Ahead Of PlayStation Showcase | GameSpot News", "description": "PlayStation’s newest studio, Firesprite, teased a new project, the Steam Deck may not play your favorite game. Plus, Blizzard reveals why you can’t play Diablo 2: Resurrected in a 21:9 aspect ratio.\n\nIn this video, DeVante talks about PlayStation acquiring their 14th studio, Firesprite, and teases a new project. \n\nCodeweavers president James B. Ramey revealed why Valve’s Steam Deck won’t play all your Steam games at launch despite previous reports and confusion. \n\nJust a few weeks before launch, Blizzard has revealed additional insight regarding certain features of Diablo 2: Resurrected, including 21:9 ultrawide monitor support.\n\n#sony", "link": "https://www.youtube.com/watch?v=bAIaAnNMi3k", "date_published": "2021-09-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Aliens Fireteam Elite New Phalanx Class Exclusive First Look", "description": "Alien: Fireteam Elite's first season of new content features the Phalanx class, a new marine with a deployable shield. The Phalanx class is free to all Aliens: Fireteam Elite players starting on September 8th, 2021. \n\nThe Phalanx's primary ability is a shield you can toggle on and off--there's no cooldown on this thing. When you pull the shield out, it allows you to absorb attacks without getting hurt, so long as they're coming from in front of you.\n\nThe Phalanx's second ability by default is the Shock Pulse. It stuns enemies in a radius around you, making it great for those moments when you're unexpectedly surrounded and your shield isn't helping.\n\nThe Phalanx's passive ability, Bulwark, increases the damage your weapons do for every attack you block with your shield, so there's a big incentive to try to keep it deployed as much as possible.\n\n#aliens", "link": "https://www.youtube.com/watch?v=Gy2HRgCI9uw", "date_published": "2021-09-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Vanguard - Hands On With the Beta", "description": "GameSpot was able to playtest the Call of Duty: Vanguard Beta and check out what's changed and what’s been added. This includes more weapons, maps, game modes, and customization. Join Richie as he breaks down his experience with the hands-on gameplay session. Call of Duty: Vanguard's Beta will be open to PlayStation players Sep 10th-13th, and will open to all other platforms September 18th-20th. \n\nCall of Duty: Vanguard will soon be launching their public Beta. (Sep 10th for PlayStation and Sep 18 for all platforms) GameSpot was able to play the beta before launch and Richie Bracamonte is here to break it all down. Several updates were made including more game modes, perks, killstreaks and more. Developer Sledgehammer Games also addressed issues plaguing the Alpha including lighting and wounded player effects where the screen would darken on the brink of death.\n\nAside from these fixes, the beta build included four new maps of all sizes. A large, snowy city map (Red Star), A lush beach map (Gavutu), a hotel map (Hotel Royal) and an indoor mountain-top map (Eagles Nest). All of which have been confirmed for the public beta. 20 total maps have been confirmed for the full release, four of which are 2v2 gunfight exclusives. Other features have been added to the beta such as the returning field upgrades and create-a-class system. Despite using weapons from the second World War, there are many ways to upgrade your loadout with a gunsmith that follows closely in line to the style of 2019’s Modern Warfare.\n\nCall of Duty: Vanguard releases November 5th and has two more public betas scheduled later this month. Stay tuned to GameSpot for more coverage of Vanguard as well as the upcoming Battlefield 2042 and Halo Infinite.\n\n#cod #codvanguard", "link": "https://www.youtube.com/watch?v=SEc-a1bbHH4", "date_published": "2021-09-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Marvel's Midnight Suns Gameplay Showcase Full Presentation", "description": "Watch as The Hunter and Wolverine are teaming up against Sabretooth in our this gameplay clip of Marvel's Midnight Suns.\n\nWolverine's abilities include razor-sharp claws, regenerating health, and his ability to taunt enemies into focusing on him making him well-suited to fighting on the front line. The Firaxis development team also talks about the Hunter, Marvel's Midnight Suns' protagonist and the first customizable original hero in the Marvel Universe. The Hunter has training and experience to draw on from his past life and can fill a number of different combat roles by focusing on dealing damage, supporting allies, controlling enemies, mitigating incoming damage, or any combination thereof.\n\nThey have to go up against Wolverine's age-old nemesis Sabretooth, another mutant with a superpowered healing factor and the animalistic instincts and strength of a fearsome predator. Even in a two-on-one battle, Sabretooth should prove to be a fierce opponent. \n\nMarvel's Midnight Suns arrives March 2022.\n\n#marvelsmidnightsun #midnightsun", "link": "https://www.youtube.com/watch?v=za2onYbxSNY", "date_published": "2021-09-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Tales of Arise is Shaping Up to Be the Next Big Action RPG", "description": "(Presented by Bandai Namco) With its epic story, layered combat, and stunning world to explore, Tales of Arise might just be the next big action-RPG to sink your teeth into. Here’s everything you need to know!\n\n#talesofarise", "link": "https://www.youtube.com/watch?v=FaLGVnfO5Vc", "date_published": "2021-09-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]