[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Yebba: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nBobby Carter | September 8, 2021\nAs the camera slowly rises to the room, we see Yebba in the center of a circle, complete with band members, background singers and a string quartet. The room is part of Electric Lady Studios, where her debut album, Dawn, was recorded. The album bears the name of Yebba's mother, whom she tragically lost in 2016, and its songs find the Memphis native delving inward to process it all.\n\nThe singer is a bit of a live wire, rarely giving the same performance twice, and that's on display during most of this Tiny Desk (home) concert. The songs differ slightly or not so little compared to the studio sessions from Dawn, especially on the swelling interpretation of the lead single, \"Distance.\" In between each song, Yebba shares unfocused and playful banter that just feels like she's family, and that feeling persists throughout this entire set, right down to the eye contact she shares with keyboardist and co-writer James Francies when speaking candidly about the final song, \"How Many Years.\"\n\nThis Tiny Desk concert has been in the works since the spring of 2020, when the album was completed but shelved until Yebba (and the rest of the world) was in a better place. It was worth the wait.\n\nSET LIST\n\"Stand\"\n\"Distance\"\n\"All I Ever Wanted\"\n\"How Many Years\"\n\nMUSICIANS\nYebba: vocals\nJames Francies: keys\nBurniss Travis: bass\nStro Elliot: MPC drums\nCharles Myers: guitar\nNiya Norwood: vocals\nSchadrack Pierre: vocals\nBrandon Pain: vocals\nMarta Bagratuni: cello\nFrancesca Dardani: violin\nSulamit Gorski: violin\nNicole Wright: viola \n\nCREDITS\nProducer: Abbey Smith \nVideo: Andy Swartz, Bo Zhang, Ina Ubaite \nAudio: Gosha Usov, Brandon Bost\nAssistant Engineers: John Muller, Daniel Perez\nGaffer: AJ Holden\nKey Grip: Hunter Herrick\n\"A\" Camera Operator: Andy Poland\n1st Assistant Camera: Rob Ko\n\"B\" Camera Operator: Alan Jensen\nDolly Grip: Tom Sarvello\nElectric: Greg Deseve\nProduction Assistant: Styven Jeune\nManagement: Ross Michaels, David Lai, Ina Ubaite\n\nTINY DESK TEAM\nProducer: Bobby Carter\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Kara Frame, Gabrielle Pierre\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #yebba", "link": "https://www.youtube.com/watch?v=aBMGvHHkr9Y", "date_published": "2021-09-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Meet the 2021 Tiny Desk Contest Community", "description": "We received thousands of entries to this year’s Tiny Desk Contest. From Maine to California and every state in between: Meet some of the artists who sent in videos from their desks with big dreams to play behind ours.", "link": "https://www.youtube.com/watch?v=kKBBdZbnn2I", "date_published": "2021-09-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]