[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Dark Souls: Biggest Mysteries Explained", "description": "In this episode of Gaming Mysteries, Dave goes over some of Dark Souls best known secrets. Who is Gwyn's Firstborn Son, What does the Pendant Do, What is the Skull at Ash Lake, and Who is the Narrator? Dive into some of Dark Souls Mysteries and find out which are solved and which remain unsolved!\n\nThanks to its unique world and deep lore, Dark Souls fans have dove into every aspect of the game. We've found cut content showcasing the Witch of Izalith's original boss fight, questioned if Manus is the Furtive Pygmy, and even had some of our questions answered in Dark Souls 3. But, there are still many burning Dark Souls questions and mysteries.\n\nAt this point, some of these mysteries are solved, but there still remain many that we don't know the answers to, and many still theorize about. How is Velka related to the overall plot of the game? Where did Gwynevere flee to? And, many questions this video tackles, such as who is Gwyn's Firstborn son, and is this related to Solaire or Andre of Astora? Does the pendant actually do anything, or is it more of Hidetaka Miyazaki's trickery? Soulsborne is full of these mysteries, and today we focus on Dark Souls 1.\n\n#DarkSouls", "link": "https://www.youtube.com/watch?v=wgzAZRXy8Uo", "date_published": "2021-10-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Forza Horizon 5 Hands On Preview", "description": "We recently took part in a hands-on preview event for Forza Horizon 5 where we got to play the racing game's opening prologue and sample a few story missions before being set free to roam the open world of Mexico. \nCredits: Eddie Makuch, Richard li, kurt indovina\n\nThe demo also let us try a series of races involving different types of cars in a variety of settings. All of these were impressive with their attention to detail and core driving mechanics, but our favorite part of our limited time with Forza Horizon 5 was exploring the open road and experiencing the world at my own pace.\n\n#ForzaHorizon5", "link": "https://www.youtube.com/watch?v=RQayYIgziRc", "date_published": "2021-10-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokemon Legends: Arceus Is Not Fully Open World | GS News", "description": "In this video, Persia talks about how the not-so-open world will work in Pokemon Legends: Arceus, a possible Fortnite movie, and persistent Diablo 2 Resurrection server issues.\n\nWhile many fans have compared Pokemon Legends: Arceus to the Legend of Zelda: Breath of the Wild, the world may not work the way players may think. Instead, the world will operate similarly to the Monster Hunter series. In a statement to Kotaku, The Pokemon Company states that players set out from a central hub village, before accepting missions and venturing forth into different \"open areas\" of the Hisui region.\n\nFortnite may currently be unavailable on iOS and Google Play stores, but Epic Games is now considering a Fortnite movie as a trio of former LucasFilm employees have joined the company. There have already been discussions about a Fortnite movie according to a report by The Information.\n\nDiablo II: Resurrected launched over two weeks ago and is still suffering from many of the same login issues, with the game even going offline for multiple hours over the weekend for emergency maintenance. As of this afternoon, Blizzard said on Twitter that players should begin to see improvements.\n\nFor more information on all of our topics, please visit gamespot.com.", "link": "https://www.youtube.com/watch?v=tfWnVGua1oM", "date_published": "2021-10-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "SAINTS ROW The Districts of Santo Ileso Trailer", "description": "This is the biggest Saints Row city yet, and it’s packed with things to do. Santo Ileso is filled with crime. In this trailer you'll see varied districts, points of interest and inhabitants just living their best (or worst) lives. Your job is to build a new criminal empire to take control of these districts from Marshall, Los Panteros and The Idols. The key territories are Rancho Provedencia, Lakeshore, and Monte Vista.\n \n#SaintsRow", "link": "https://www.youtube.com/watch?v=MQXXXWd3Fwo", "date_published": "2021-10-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Vanguard | Story Trailer", "description": "Check out the Call of Duty: Vanguard Story Trailer released on October 11th, 2021. Call of Duty: Vanguard is Activision's latest installment in the Call of Duty series taking the game series back to the World War II Era.", "link": "https://www.youtube.com/watch?v=1Jlw8Hs9gxg", "date_published": "2021-10-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Evolution of the STG44 in Call of Duty", "description": "The STG44 (also known as the MP44) has been in Call of Duty games from the very beginning. Let's take a look back at every game to feature the iconic World War II assault rifle.\n\nWhen Call of Duty launched in 2003, the World War II first-person shooter offered several weapons in both its campaign as well as multiplayer. Of these, the STG44 quickly became one of the most used and recognizable assault rifles. A a well-rounded weapon, the STG has made its way back into several other Call of Duty titles from Call of Duty 2 and 3, to more modern titles like Call of Duty: Advanced Warfare and 2017's Call of Duty: WWII. \n\nWith every entry, the STG has seen minor changes. Earlier titles offered little in the way of gunsmithing or cosmetic customization, but beginning with Advanced Warfare, the rifle received optional skins and tactical upgrades such as upgradable optics and magazine sizes. For the most part however, the biggest changes include sound design, reload animations, and how close (or far) the player holds the rifle while aiming down sights. Some games like Black Ops 3's Zombies mode also have unique stock iron sights.\n\nWith a strong presence in more than a dozen titles, the STG44 will be returning to the series with Call of Duty: Vanguard this November. Stay tuned to GameSpot for the latest coverage on all things Call of Duty, as well as your other favorite FPS titles like Battlefield and Halo.\n\n\nTime Stamps:\n00:22 - Call of Duty\n01:09 - Call of Duty 2\n02:30 - Call of Duty 2: Big Red One\n03:48 - Call of Duty N-GAGE\n04:33 - Call Of Duty 3\n06:03 - Call of Duty: Roads to Victory\n07:00 - Call of Duty 4: Modern Warfare\n08:24 - Call of Duty: World at War\n09:03 - World at War Zombies\n09:41 - Call of Duty: World at War DS\n10:37 - Call of Duty: World at War Final Fronts\n11:54 - Call of Duty: Black Ops\n12:55 - Call of Duty: Black Ops 2\n13:43 - Call of Duty: Advanced Warfare\n15:01 - Call of Duty; Black Ops 3\n15:47 - Call of Duty; WWII\n16:34 - WWII Zombies\n17:12 - Call of Duty: Vanguard BETA", "link": "https://www.youtube.com/watch?v=pHSlikh22OE", "date_published": "2021-10-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]