[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Son Lux: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nRobin HIlton | April 28, 2021\nWatch this stunning \"home\" Tiny Desk performance from Son Lux and you might conclude the band members live together in an all-white universe without walls or boundaries. But it's all an illusion. In fact, guitarist Rafiq Bhatia, drummer Ian Chang and singer-keyboardist Ryan Lott, who started Son Lux as a solo project back in 2008, each shot their own, separate video with their iPhones, at different times, at their homes scattered across different states. So did the guest vocalists, Nina Moffitt and Kiah Victoria. Editor Evan Chapman then stitched all the videos together.\n\nThe effect is dizzying and sometimes disorienting as superimposed images flicker and warble over one another against Bhatia's skittering guitar lines. Everything is bent and a little off – intentionally, not because of the production challenges – and nothing sounds quite like you expect it to. Watch Bhatia's all-too-short solo on \"Only\" or Lott as he walks his fingers over the keys near the beginning of \"Vacancy.\" Together – and alone – they've perfectly captured the upside-down world we've been living in this past year, where the lines between what's real and imagined are blurred, all sense of place fades into the ether and the normally predictable rhythms of life come undone.\n\nThe setlist for this performance includes a song from each of the band's last three albums, a trilogy released over the past eight months, called Tomorrows I, II and III.\n\nSET LIST\n\"Prophecy\"\n\"Only\"\n\"Vacancy\"\n\nMUSICIANS\nRyan Lott: vocals, synth\nRafiq Bhatia: guitar\nIan Chang: drums\nNina Moffitt: vocals\nKiah Victoria: vocals\n\nCREDITS\nVideo: Evan Chapman, Four/Ten Media\nAudio: Brandon Peralta and Ryan Lott\nMastering: Brandon Peralta\nGuitars and Nina Moffitt's vocals recorded by Todd Carder at The Bunker Studio, New York. Drums recorded by Jeff Saenz at Modern Electric Sound Recorders, Dallas, Texas\nProject Managers: Hannah Houser and Michael Kaufmann\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Kara Frame\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann\n#tinydesk #nprmusic #sonlux", "link": "https://www.youtube.com/watch?v=Lr3T3BxxSVA", "date_published": "2021-04-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Lake Street Dive: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nJosh Rogosin | April 27, 2021\nLake Street Dive filmed its Tiny Desk (home) concert where the band is most at home: on stage at the “biggest little venue in NYC,” Pete’s Candy Store. All five band members managed to squeeze onto a stage no larger than the actual Tiny Desk to shine a spotlight on the Save Our Stages Act. Congress passed the $15 billion grant program last December as part of the $900 billion coronavirus relief bill. In the middle of the home concert, bassist Bridget Kearney recalls driving to the Williamsburg neighborhood of Brooklyn for a gig at Pete’s, then driving back to Boston the very same night, long before they ever sold out Radio City Music Hall on the other side of the East River. \n\nIt’s hard to believe the band has released seven studio albums. Its latest, Obviously, provided the setlist for this intimate performance and prominently features the newest member and co-songwriter, keyboard and vocalist Akie Bermiss. Hopefully we’ll all be packed into tight venues again soon, adding the thunderous applause we’re all yearning to contribute. Until then, we’ll just have to settle for clapping at our screens.\n\nSET LIST\n • \"Hypotheticals\"\n • \"Same Old News\"\n • \"Anymore\"\n • \"Making Do\"\n\nMUSICIANS\n • Rachael Price: vocals\n • Bridget Kearney: bass\n • Akie Bermiss: keyboards, vocals\n • Mike \"McDuck\" Olson: guitar\n • Mike Calabrese: drums\n\nCREDITS\n • Video: Johnny Frohman\n • Audio: Jared Herman, Robin MacMillan\n • Camera Operator: Katie Sadler\n • Camera Operator: Connor Smith\n • Gaffer: Eric Bowers\n\nTINY DESK TEAM\n • Producer: Josh Rogosin\n • Video Producer: Maia Stern\n • Audio Mastering: Josh Rogosin\n • Associate Producer: Bobby Carter\n • Tiny Production Team: Kara Frame, Bob Boilen\n • Executive Producer: Lauren Onkey\n • Senior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #lakestreetdive", "link": "https://www.youtube.com/watch?v=N_t55quR7x8", "date_published": "2021-04-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]