[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 - Irish Specialist Breakdown And How Story Works", "description": "Battlefield 2042 releases in October and might not have a campaign, but its story is already hitting hard by killing off a Battlefield 4 character and introducing the horrors of being stateless. The Exodus Short Film Trailer introduces a new engineer Specialist Irish who can deploy cover and grenade interceptors as well as sets up what looks like a Season 1 fight over a downed secret weapon on the Hourglass map. \n\nBattlefield 2042 seems like it will tell a gripping story despite not having a single-player campaign. The Exodus Short Film Trailer revealed a lot about how Specialists’ struggles will be revealed through the different seasons and what kind of scenarios players will be thrown into through the multiplayer All-Out Warfare mode. \n\nIn this video, we’re going to go over details from the trailer. The story so far includes two returning Battlefield 4 characters, Irish and Pakowski. There’s a larger conflict brewing between the United States and Russia and also a much more personal conflict between No-Pats--people who've been driven from their home countries by natural disasters and political turmoil. The story sets up a conflict between Irish and Oz: Irish is a former US Marine who has broken away to save his family and wants acceptance for the refugees under his watch, while Oz is a shadowy figure who wants to start a war between superpowers by uncovering state secrets. The trailer ends by setting up a scenario on the Hourglass map, where players seem to be able to fight for one side or the other over a crashed prototype weapon.\n \nIn this video, we will also break down the new Specialist. Irish is an Engineer Class. His unique equipment allows him to build a Fortification System called DCS deployable cover. He can also deploy a device to shoot down explosives called the APS-36. His Trait is Veteran, which gives him extra armor.\n\nDICE is currently running a Battlefield 2042 technical alpha test, with open betas coming in September and the game's full release in October.", "link": "https://www.youtube.com/watch?v=Ccs-YYXA-vQ", "date_published": "2021-08-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Diablo 2 Resurrected Paladin Livestream (Early Access Beta)", "description": "The early access beta for Diablo II Resurrected is starting on August 13th and with this beta we get to try our hands at multiplayer, the Paladin, Druid and more.\n\nFollowing the Early Access weekend, on August 20 at 10:00 a.m. PDT, the Open Beta weekend will be open to everyone on a supported platform.\n\n#diablo2", "link": "https://www.youtube.com/watch?v=34DkLgrijNY", "date_published": "2021-08-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Naraka Bladepoint - 11 Minutes of Gameplay", "description": "Here's a quick look at Naraka: Bladepoint before you jump into the fray. \n\nNaraka: Bladepoint is a 60-player action battle royale game with a variety of melee, ranged weapons, abilities, and unique movement options. There's a lot to unpack, but here's a quick look at Naraka: Bladepoint before you jump into the fray, which is available now on PC.\n\n#narakabladepoint #naraka", "link": "https://www.youtube.com/watch?v=I4jk5eQH_hg", "date_published": "2021-08-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "You Need To Play Splitgate", "description": "Splitgate sells itself as \"Halo meets Portal\", and has recently blown up in popularity. Jean-Luc is here to tell you the game is the real deal and worth checking out.\n\nThis free-to-play early access shooter has actually been around for over 2 years now but recently it has taken the internet by storm going from a peak player count of less than 1,000 back in June to over 67,000 at the time of this video and growing, thanks to it’s recent release on PlayStation and Xbox. In an age where the competitive shooter space is highly crowded, and indie shooters don’t really make much of an impression, this is impressive to say the least. It begs two questions, what makes Splitgate so damn appealing and should you play it?\n\n#splitgate", "link": "https://www.youtube.com/watch?v=HfKm5m3yGPw", "date_published": "2021-08-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 - Exodus Short Film Trailer", "description": "Battlefield 2042 just dropped its most recent short film showing off some of the backstory for the game. \n\nBattlefield 4’s Kimble “Irish” Graves returns - no longer a Marine, but the commander of the No-Pat vessel Exodus, forced to choose between the lives of the 200 refugees on his boat and the future of all the Non-Patriated. Witness the events that will trigger an all-out war in this standalone short film set in the World of 2042\n\nBattlefield 2042 is a first-person shooter that marks the return to the iconic all-out warfare of the franchise. Adapt and overcome in a near-future world transformed by disorder. Squad up and bring a cutting-edge arsenal into dynamically-changing battlegrounds supporting 128 players*, unprecedented scale, and epic destruction.\n\n#battlefield2042 #battlefieldexodus", "link": "https://www.youtube.com/watch?v=2vyIe7cwOb4", "date_published": "2021-08-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]