[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Mick Jenkins: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nRodney Carmichael | December 10, 2021\nBeneath Mick Jenkins' smooth veneer lies a smoldering intensity. It comes across in subtle fashion, as he stays seated, cool and collected for the duration of his Tiny Desk (home) concert shot in Los Angeles. But like the embers glowing in the adjacent fireplace, you can feel the heat emanating from this brother's soul.\n\nHe opens his set with \"Carefree,\" a song from 2020's The Circus, that reminds us why living without a care isn't a universal privilege for Black boys. The Chicago-bred MC then moves to songs from his newest release, Elephant In The Room. Backed by a four-piece band, Jenkins alternates between sung hooks and intricate wordplay during a set that just simmers with soul. The highlights \"Gucci Tried to Tell Me\" and \"Scottie Pippen\" both find him contemplating how the best kind of love can leave you \"lost in the sauce.\"\n\nIn a year brimming over with hip-hop, Jenkins' third studio LP may have missed the arbitrary deadline to make most year-end lists, but it definitely ranks among the best. He put time and intention into making this album – his last for the label Cinematic Music Group – and it's a luxury he says he's rarely been afforded in the industry. That frustration comes through on \"Stiff Arm,\" the second song of his set, where he puts distance between himself and the Klingons. If it's any hint of what's to come, Jenkins' next incarnation could be fire.\n\nSET LIST\n\"Carefree\"\n\"Stiff Arm\"\n\"Gucci Tried to Tell Me\"\n\"Scottie Pippen\"\n\nMUSICIANS\nMick Jenkins: vocals\nNoah Hyppolite: drums\nBrent Hoyte: bass\nJason Iyama: guitar\nOtto Marloft: keys\nLon Renzell: DJ\n\nCREDITS\nVideo: Bryan Allen Lamb, Matthew Stanley and Eli Tahan\nAudio: Houston Fry\n\nTINY DESK TEAM\nProducer: Rodney Carmichael\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Bobby Carter, Kara Frame, Joshua Bryant, Sofie Hernandez-Simeonidis\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #mickjenkins", "link": "https://www.youtube.com/watch?v=IT9sB1e61BA", "date_published": "2021-12-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]