[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call Of Duty’s Yearly Cycle Is The True Enemy", "description": "Call Of Duty is building up to Season 3 and continues to leave Modern Warfare players behind. It’s time to look at what Call Of Duty players don’t understand about each other and if Activision can ever break from the yearly cycle. \n\nCall Of Duty continues its yearly cycle, and the changes that cycle institutes to Warzone have left the Modern Warfare and Cold War audiences in different worlds. Ever since Cold War took over the Season Pass, store, and events in Warzone, Modern Warfare players have felt left behind. Meanwhile, Call Of Duty: Black Ops Cold War has gathered a classic Call Of Duty fan base looking for an entirely different arcade experience. In this video, we are going to look at the Modern Warfare versus Cold War players, how they are feeling about the state of Call Of Duty, and what each audience is looking for. Important topics we’re going to cover are why Modern Warfare fans feel robbed of Season 7 and missing weapons, what Cold War fans know about Call Of Duty that many new players don’t, and if Modern Warfare is a true Call Of Duty game. \n\nWe’ll also explore how the conflict between Call Of Duty audiences largely comes down to Activision’s yearly release cycle and how that might no longer make sense with titles from Treyarch, Infinity Ward, Raven Software, and Sledgehammer Games being so different, yet all having to tie into Warzone. Finally, we’re going to go back to your response to the rumor that the next Call Of Duty game might go back to World War II. \n\nWe’re expecting more Call Of Duty announcements this spring, including what the rumored WW2 Vanguard game might be. Call Of Duty: Warzone is building up to Season 3, invading the map with zombies, and possibly building up to a nuke event. Make sure to keep coming back to GameSpot’s YouTube page for ongoing news, release dates, and events around Call Of Duty.\n\n#CallofDuty #ModernWarfare #ColdWar", "link": "https://www.youtube.com/watch?v=KV4Qzt7oujU", "date_published": "2021-04-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Splatoon 2’s Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the insane weaponry of Splatoon 2, including the iconic Splattershot, the brutal Splat Roller, and the rapid-fire Hero Shot--a weapon that has a striking resemblance to the FN P90.\n\nSplatoon 2 is Nintendo’s answer to the online multiplayer shooter and offers up a huge arsenal of weapons for players to wrap their tentacles around.\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of Splatoon 2, and compares them to their real-life counterparts.\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can purchase Jonathan’s book here - https://www.headstamppublishing.com/bullpup-rifle-book", "link": "https://www.youtube.com/watch?v=qOYe6yULbws", "date_published": "2021-04-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Minecraft Plus Announcement Trailer", "description": "The Mojang team just dropped this Minecraft Plus Official Trailer! \n\nHead over to http://plus.minecraft.net​, but don’t be alarmed if your computer screen gets a boxy make-over, your mobile device grows a cord, and your hair suddenly sprouts sweet, sweet frosted tips. You’re on a journey back in time with the all new, very old Minecraft Plus! Jump on the information superhighway to get your own (free!) Minecraft screen savers!\n\n#Minecraft #MinecraftPlus #Gaming", "link": "https://www.youtube.com/watch?v=vlliG-M3IZQ", "date_published": "2021-04-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Outriders Launch Trailer - Available Now", "description": "Outriders developed by Square Enix is officially out today, April 1! Outriders is out now on PlayStation 5, Xbox Series X|S, PlayStation 4, Xbox One, PC (Steam, Epic & NVIDIA GeForce NOW) and Stadia!\n\nOutriders is a 1-3 player co-op RPG shooter set in an original, dark and desperate sci-fi universe. As mankind bleeds out in the trenches of Enoch, you’ll create your own Outrider and embark on a journey across the hostile planet.\n\n#Outriders #SquareEnix #Gaming", "link": "https://www.youtube.com/watch?v=BICfhWZeYm4", "date_published": "2021-04-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Among Us Airship Map Is Live", "description": "The new Among Us Airship map is officially out! The InnerSloth team dropped this trailer officially announcing the Airship map is now live in Among Us! \n\n#AmongUs #AirshipMap #Gaming", "link": "https://www.youtube.com/watch?v=K0eXZaiUHEs", "date_published": "2021-03-31 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Genshin Impact PS5 Announcement Trailer", "description": "Check out the official announcement trailer for Genshin Impact coming to the Playstation 5! \n\nMay the songs of Windblume lift your wings high and free,\nMay the ancient stone shape your shield sturdy and strong,\nMay the icy winds of Dragonspine test your bravery,\nMay the daunting enemies you face... uh... spur your growth along?\n\nTraveler, let's go on an adventure!\nThe PS5 version of Genshin Impact is coming soon. Stay tuned!\n\n#GenshinImpact #PS5 #NextGenConsole", "link": "https://www.youtube.com/watch?v=N6XXZII-680", "date_published": "2021-03-31 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Mortal Kombat: Every Guest Character Fatality", "description": "Mortal Kombat's guest characters have some of the wildest fatalities, and we compiled together every single one of them. Enjoy them in all their glory!", "link": "https://www.youtube.com/watch?v=fiPpl5Ml7N0", "date_published": "2021-03-31 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Outriders Early Gameplay Livestream (PS5)", "description": "We take to the world of Enoch with early access review code as the Technomancer in Outriders on the PlayStation 5. We will be playing through the story and side missions past the Demo so be warn of any spoilers if you're worried. Come hang out and chat about your favorite class, abilities, weapons and more.", "link": "https://www.youtube.com/watch?v=H_m6HVYFUjU", "date_published": "2021-03-31 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Elder Scrolls Online: Blackwood Livestream", "description": "Tune in Wednesday, March 31 at 12PM PT to learn more details on the upcoming Blackwood chapter in Elder Scrolls Online and discover what adventures await as the Gates of Oblivion saga continues.", "link": "https://www.youtube.com/watch?v=TkZzUdawUBo", "date_published": "2021-03-31 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]