[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "South Africa VOC in Europe", "description": "Europe\n\nhttps://www.telegraph.co.uk/news/2021/03/30/south-african-covid-variant-accounts-one-seven-cases-europe\n\nSouth African VOC\n\n23 out of 27 EU countries\n\nBelgium, 557 (6.4% of sequenced cases)\n\nGermany, 535 SA cases\n\nAustria, 15% of sequenced cases\n\nLuxembourg, 13.8%\n\nChris Whitty\n\nThe main thing we're concerned about is the risk of importing into the UK variants which could have a reduced effectiveness of the vaccines we're currently using\n\nInternational travel implications\n\nFrance\n\nhttps://www.bbc.co.uk/news/world-europe-56597319\n\nMr Macron, live TV\n\nSchools close, at least three weeks\n\nLockdown measures extended to more districts\n\nAll non-essential shops to close from Saturday\n\nBan on travelling more than 10km from home without good reason\n\nCurfew, 7pm and 6am\n\nPeople given Easter weekend to get themselves to where they want to spend the lockdown\n\nJamie Metzl, WHO's international advisory panel on Human Genome editing\n\nhttps://www.dailymail.co.uk/news/article-9424221/WHO-advisor-slams-organization-outrageous-COVID-origins-report.html\n\nThey did absolutely nothing to even consider the possibility of an accidental leak\n\nAnd it's outrageous that they would insert that it's highly unlikely when they didn't even bother to look into it\n\nWhat they said is that they were given the task of examining the zoonotic origin of the pandemic\n\nSo in the framing of the task, a conclusion was already implicit\n\nmost likely that Covid-19 accidentally leaked from a lab\n\nRobert Redfield, doctor, virologist, former CDC director\n\nI am of the point of view that I still think the most likely etiology of this pathogen in Wuhan was from a laboratory, you know, escaped\n\nNow, other people don't believe that, that's fine.\n\nScience will eventually figure it out. \n\nIt's not unusual for respiratory pathogens that are being worked on in the laboratory to infect the laboratory worker\n\nI do not believe this somehow came from a bat to a human. \n\nAnd at that moment in time, the virus came to the human, became one of the most infectious viruses that we know in humanity for human to human transmission. \n\nNormally, when a pathogen goes from a zoonotic to human, it takes a while for it to figure out how to become more and more efficient\n\nNot a proven fact, I'm allowed to have opinions now\n\nBelieves the virus began spreading, perhaps since September or October\n\nVaccine news\n\nGermany and AZ\n\nhttps://www.bbc.co.uk/news/world-europe-56580728\n\nStarted with AZ for under 65s only\n\nhttps://www.bbc.co.uk/news/health-56594189\n\nSuspended use\n\nStarted again after EMA conformation\n\nNow, only given to over 60s \n\n(France, currently only used in over 55s)\n\nGerman medicines regulator, Paul Ehrlich Institute\n\n31 cases of cerebral sinus vein thrombosis (CSVT) after AstraZeneca in Germany.\n\nAssociated with thrombocytopenia \n\n2.7 million AZ doses\n\nOne case in 87,000\n\nAlmost all the cases are reportedly in younger and middle-aged women.\n\nGerman vaccine committee (Stiko) \n\n\nUK\n\n11 million AZ doses given, 5 cases of CVST, one fatal\n\nOne case in 2.2 million\n\n25 times less common than Germany\n\nCanada\n\nResponded by stopping using AZ in under 55s\n\nHas used 300,000 AZ doses, 0 cases of CVST\n\n\nSputnik V\n\nAustria buying 1 million doses\n\nHungary already rolling out\n\nNot yet EMA approved\n\nNovavax (Novavax)\n\nManufacture in Billingham\n\nProduced in insect cells\n\nProtein based, 2 doses, fridge stable\n\nEfficacy, UK Phase 3, released 28th January\n\nhttps://ir.novavax.com/news-releases/news-release-details/novavax-covid-19-vaccine-demonstrates-893-efficacy-uk-phase-3\n\n86% effective against the Kent variant\n\n96% effective against original strain\n\n49.4% against SA variant (HIV and non HIV)\n\nMedicines and Healthcare products Regulatory Agency assessing now\n\nhttps://www.bbc.co.uk/news/uk-england-tees-56570168\n\nGlaxoSmithKline to bottle 60 million doses in Barnard Castle, fill and finish\n\nInternational pandemic treaty\n\nhttps://www.bbc.co.uk/news/uk-56572775\n\nUK, Germany, France, Italy, Spain, Netherlands, Greece, Romania, Portugal\n\nGlobal settlement for next pandemic \n\nWorld War Two style deal\n\nBuild cross-border cooperation\n\nDr Tedros Adhanom Ghebreyesus\n\nAt that time, following the devastation of two world wars, political leaders came together to forge the multilateral system\n\nThe aims were clear: To bring countries together, to dispel the temptations of isolationism and nationalism, and to address the challenges that could only be achieved together in the spirit of solidarity and co-operation - namely peace, prosperity, health and security\n\nLeaders\n\nCountries be better prepared to predict, prevent, detect, assess and effectively respond to pandemics in a highly co-ordinated fashion\n\nSystems for alerting people about potential pandemics\n\nImproving the sharing of data\n\nDr David Nabarro\n\nWithout some kind of special action, the world as a whole will not be vaccinated until well into 2022\n\nDuring that time all sorts of problems with variants will emerge", "link": "https://www.youtube.com/watch?v=r00Hwu96i1k", "date_published": "2021-04-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "WHO, Viral origins full report", "description": "WHO's Covid report, detailed considered appraisal.\n\nhttps://www.who.int/health-topics/coronavirus/origins-of-the-virus\n\nThe mission\n\nJoint international team, 17 Chinese and 17 international experts\n\n14 January to 10 February 2021 in Wuhan\n\nPrevent reinfection, animals and humans\n\nPrevent establishment of new zoonotic reservoirs, mink, cats\n\nTimeline\n\nOutbreak may have started sometime in the months before the middle of December 2019\n\n(Based on molecular sequence data)\n\nCirculation of SARS-CoV-2 preceded the initial detection of cases by several weeks.\n\nVirus transmission widespread in Wuhan by the first week of 2020\n\nEpidemic in Wuhan preceded the spread in the rest of Hubei Province\n\n174 COVID-19 cases with onset of symptoms in December 2019\n\n8th December 2019, first official case\n\n76,000 ‘cases’ from October and November unlikely\n\n Genomics\n\nHuanan market, at the point of its closing, 923 environmental samples, 73 samples were positive\n\nWidespread contamination of surfaces with SARS-CoV-2\n\nHuanan market cluster had identical virus genomes\n\nOther genomes were also discovered from December / January\n\nUpstream suppliers to the Huanan market taken during 2020, no evidence of SARS-CoV-2 circulating in animals\n\nInitial cases associated with Huanan market, other markets and no markets\n\nCoronaviruses most highly related to SARS-CoV-2 found in bats and pangolins\n\nNone sufficiently similar to SARS-CoV-2 to serve as its direct progenitor\n\nSampling before and after the outbreak\n\n80 000 wildlife, livestock and poultry samples collected, 31 provinces in China\n\nNo positive result for SARS-CoV-2 antibody or nucleic acid\n\nCold chains\n\nCold chain products, not tested at the time\n\nConfirmed international transmission in cold chains\n\nFour conclusions\n\nQualitative risk assessment\n\nDirect zoonotic spillover is considered to be a possible-to-likely pathway\n\nIntroduction through an intermediate host is considered to be a likely to very likely pathway\n\nIntroduction through cold/ food chain products is considered a possible pathway\n\nIntroduction through a laboratory incident was considered to be an extremely unlikely pathway \n\nNext phase\n\nWidespread testing of domestic and wild animals \n\nRhinolophus bats, southern provinces of China, countries around East Asia, South-East Asia and any other regions\n\nMore cold chain analysis\n\nPositive results in sewage, serum, human or animal tissues/swab and other SARS-CoV-2 test by the end of 2019\n\nConvene a global expert group\n\nhttps://www.who.int/director-general/speeches/detail/who-director-general-s-remarks-at-the-member-state-briefing-on-the-report-of-the-international-team-studying-the-origins-of-sars-cov-2\n\nhttps://www.theguardian.com/world/2021/mar/30/who-criticises-chinas-data-sharing-as-it-releases-covid-origins-report\n\nUS, UK, Australia, Canada, Czechia, Denmark, Estonia, Israel, Japan, Latvia, Lithuania, Norway, Republic of Korea, Slovenia, Statement\n\nIt is equally essential that we voice our shared concerns\n\nthat the international expert study on the source of the Sars-Cov-2 virus was significantly delayed\n\nand lacked access to complete, original data and samples\n\nWhile regretting the late start of the study, the delayed deployment of the experts and the limited availability of early samples and related data, \n\nwe consider the work carried out to date and the report released today as a helpful first step\n\nEU statement also called on all relevant authorities to help with the next stages\n\nSo that any gaps in data needed to further the investigation can be addressed\n\nCalled for timely access for independent experts early in future pandemics\n\nAccess to China after months of fraught negotiations\n\nWhite House \nNo space for this section in YT comments, descriptions are of limited length.\n\nTedros Adhanom Ghebreyesus\n\nIn my discussions with the team, they expressed the difficulties they encountered in accessing raw data\n\nI expect future collaborative studies to include more timely and comprehensive data sharing\n\nScientists would benefit from full access to data including biological samples from at least September 2019\n\nI concur with the team’s conclusion that farmers, suppliers and their contacts will need to be interviewed\n\nTeam also visited several laboratories in Wuhan and considered the possibility that the virus entered the human population as a result of a laboratory incident.\n\nHowever, I do not believe that this assessment was extensive enough. \n\nFurther data and studies will be needed to reach more robust conclusions.\n\nLet me say clearly that as far as WHO is concerned all hypotheses remain on the table.\n\nAlthough the team has concluded that a laboratory leak is the least likely hypothesis, this requires further investigation, potentially with additional missions involving specialist experts, which I am ready to deploy\n\nThis report is a very important beginning, but it is not the end.", "link": "https://www.youtube.com/watch?v=2FD54-7qc88", "date_published": "2021-03-31 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]