[{"source": "https://lukesmith.xyz/rss.xml", "title": "Every Web Browser Absolutely Sucks.", "description": "<p>The title explains it all, you don't even have to read.</p>\n<p>There are no good, even passable web browsers. None. Not a single one\neven comes close.</p>\n<p>The weird thing is this: <em>making a good browser should be easy!</em> Among\nthe existing web browsers, you could assemble all the parts necessary\nfor a passable (if not perfect) browser. No one has ever bothered to do\nthis, instead, people assembled 90% good stuff and 10% junk.</p>\n<p>Here I will list:</p>\n<ol>\n<li>Features a <strong>passable</strong> browser must have.</li>\n<li>Features a <strong>good</strong> browser must have.</li>\n</ol>\n<p>Again, no browser out there has all the traits of even a passable\nbrowser, but we might as well list them all here for the record.</p>\n<h2 id=\"features-a-passable-browser-must-have\">Features a <strong>Passable</strong> Browser must have.</h2>\n<h3 id=\"it-must-actually-work-on-the-modern-web\">It must actually work on the modern web.</h3>\n<p>Sorry terminal browsers. lynx, w3m, you're out. There is some role for\nyou in scripting and dumping HTML email as standard output, but no can\nget along using a terminal browser unless they are purposefully limiting\nthemselves to a very small segment of the modern web. I wish this\nweren't the case, but it is.</p>\n<p>Sorry also to niche independent browsers like Dillo. Nice concept, but\nnot usable. I don't think Dillo can even handle my simple modern CSS on\nmy website.</p>\n<h3 id=\"free-and-open-source-software\">Free and open source software.</h3>\n<p>No reason to explain this. Absolutely insane to use a program to browse\nthe internet whose source code isn't publicly auditable.</p>\n<h3 id=\"no-unsolicited-connections\">No unsolicited connections.</h3>\n<p>This will be <em>literally the easiest</em> point to comply with, but also the\nrarest thing in browsers:</p>\n<p>Don't automatically connect to Google.com or Brave.org or some stupid\nstart page or analytics page or Cloudflare or any other site on when I\nopen the browser or at anytime while browsing unless I type the address\nin my URL bar.</p>\n<p>Don't automatically connect to an &quot;autoupdate&quot; site, and especially\ndon't pull updates from it.</p>\n<p>Don't send analytics. Don't <em>make</em> analytics. Actually, don't even\nask me if I want to opt in to &quot;bug reports,&quot; I don't. If something\nbreaks, I'll tell you.</p>\n<p>If you want analytics, I want you to beg for it on an obscure Settings\npage. Tell me your sob story about how it helps you get funding. And I\nwill <em>still</em> not give you analytics because I don't let my file\nmanager, email client, music player, video player, text editor or any\nother random program monitor me for no reason, least of all will I allow\na browser, which often handles the most sensitive information.</p>\n<p>It's a statement of just how bad the browser market is that this is\neven something we're talking about.</p>\n<h3 id=\"ad-blocking-must-come-with-the-browser\">Ad-blocking must come with the browser.</h3>\n<p>No one opens up a browser to view ads. This is just not why browsers\nexist. No human in all of humanity has benefited from involuntary ads.\n100% of people would be better off with browsers without ads, therefore,\na sensible browser should block ads.</p>\n<p>This is no more controversial than saying that if you rent a server from\na company, it should come with sensible defaults, like an operating\nsystem, a solid root password that a Chinese script-kiddy isn't going\nto guess and maybe a firewall.</p>\n<p>Ad-blocking must be universal, so should other sensible\n&quot;add-ons&quot;/features. HTTPS everywhere is a sensible universal browser\nfeature as well. There are no places where using HTTP is preferrable to\nusing HTTPS if available. If there are reasons to ever use HTTP only or\nto view ads, they are so rare as to hide them away in the Settings Menu.</p>\n<p>Brave (Le Shill Lion) has at least done us the favor of blocking ads by\ndefault (it also has HTTPS everywhere). Qutebrowser has a notional hosts\nad-blocker that allegedly blocks I guess some things, but you will still\nget an add-full browsing experience. GNU Icecat has a lot of sensible\ndefault add-ons (I forget if it blocks ads by default), but in truth,\nonly developers have any reasons to use bare browsers without\nad-blockers and other basic add-ons.</p>\n<h3 id=\"basic-options\">Basic options!</h3>\n<p>How long has Google Chrome and its clones been around? A decade? Why has\nliterally no one in that period had a problem with the fact that none of\nthese browsers have an option <em>to not store history!</em></p>\n<p>No, not Incognito mode, I want to keep cookies, but I don't want stupid\nbrowsing history showing up whenever I start typing.</p>\n<p>No, I don't just want you to not suggest previous sites, but still\nstore them all for some reason.</p>\n<p>Thankfully, Firefox browsers at least have this basic option. Brave does\ntoo. Ungoogled Chromium doesn't. Useless. I like that it doesn't send\nmy browsing history to Google and all, but I also don't want it\nbroadcasting it to the people over my shoulder when I type a url. I\nhonestly imagine that the mandatory &quot;we must keep history&quot; aspect of\nChrome is subtle social engineering. &quot;Oh you shouldn't have that\nchoice, you want everything you do to be stored for reference!&quot;</p>\n<h4 id=\"internet-browser-history-is-really-obsolete\">Internet browser history is really obsolete.</h4>\n<p>For normies on the modern web, there is really less and less purpose of\nbrowsing history with every passing year. In the better days of the\ninternet, back when <em>people actually browsed the internet</em> and you would\nsee dozens or hundreds of different websites a day, there is kind of a\nuse to a constant log of history, in case you vaguely remember seeing a\nsite, but couldn't remember how you got there and you couldn't search\nbecause there were no search engines.</p>\n<p>Web history is basically obsolete for 99% of people because:</p>\n<ol>\n<li>They use only Facebook or two other sites and quite simply never see\nany of the rest of the internet.</li>\n<li>Bookmarks exist and are widely used for the few sites people do use.</li>\n<li>People can use a search engine to find a site.</li>\n<li>They are daily watching porn or simping for instathots or doing\nother abominable things for which they will be erasing their\ninternet history anyway.</li>\n</ol>\n<h3 id=\"no-clutter-in-the-browser-experience-and-neutrality\">No clutter in the browser experience and <em>Neutrality</em></h3>\n<p>Brave. Lol.</p>\n<p>I complimented Brave for adding ad-blockers to their browser by default.\nThe issue is that they also continually add more and more and more stuff\nto their browser of extremely niche orientation in every single update.</p>\n<p>Update Brave and there'll be some new Crypto gadget on the main screen\nwhich is probably making some kind of unsolicited connections to\nsomething or another. Brave has been dutiful enough to allow everything\nto be disabled, but none of this is browsing related. I want a browser.\nStop giving me stuff that's not a browser. That's why I liked the idea\nof the ad-block, but it looks like Brave will need a feature-block as\nwell.</p>\n<p>Aside from Brave, about <em>every browser</em> from Pale Meme to unJewgled\nChromium has a distracting stupid start page that advertises your\nhistory or suggests inane sites. When I open a fresh browser window,\nunless I have specifically created an HTML page which I have set as my\nhomepage, I want to see a clean virgin page. I don't want to see giant\nsoy blocks that show a links to my bank account or the Bitchute\ndocumentaries I was just watching. If I want to get there quick, I'll\nbookmark it, thank you.</p>\n<p>I want a browser to be <strong>neutral</strong>, not personalized. Or at least\n<strong>neutral by default</strong>. I don't want it to advertise new features and\nsoftware. I don't want it to change when I visit a site.</p>\n<h3 id=\"do-not-clutter-home\">Do not clutter home!</h3>\n<p>Browsers routinely make messes in home directories. XDG Compliance. Know\nthese directories:</p>\n<ul>\n<li><code>~/.config/</code> &ndash; for configuration files</li>\n<li><code>~/.cache/</code> &ndash; for your cache</li>\n<li><code>~/.local/share</code> &ndash; for share files</li>\n</ul>\n<p>This is where stuff goes so 100 useless folders don't clog up your home\nwhen you <code>ls -a</code>. No one seems to have told this to browser developers.</p>\n<p>Chromium browsers give you this useless <code>~/.pki/</code> directory. If you're\nusing a Furryfox clone, they are going to force at least <code>~/.mozilla/</code>\non you, but you'll also get something else. Installed Librewolf?\nYou'll get <code>~/.librewolf/</code> too.</p>\n<p>I don't know how hardcoded Google and Mozilla made this annoyance, but\nif you can deGoogle Chrome, you can use the proper XDG directories.</p>\n<p>Dishonorable mention <em>definitely</em> goes to Pale Moon. Being an\nindependent browser, you would <em>think</em> they would jump at being less\nannoying. Nope: <code>~/.Moonchild Productions</code> right in your home directory.\nCapital letters and whitespace: a big eff-yew to Unix-based operating\nsystems. (I think they made this lower-case now?)</p>\n<h3 id=\"must-be-written-in-a-sensible-language\">Must be written in a sensible language.</h3>\n<p>Aw, Dang!</p>\n<p>Sorry, Qutebrowser, you thought you could make it all the way right?</p>\n<p>Hey, that's okay, there are a lot of great aspects to being written in\nPython: it's easier for people to play around with your config file and\nscript things into it, but let's be real: you're slow and buggy and\ntake way more system resources than a browser written in C or C++.\nThat's just not going to cut it for a mainstream browser that old\nboomers are going to be watching YouTube and Netflix in with 250 other\nopen tabs.</p>\n<p>Maybe if you were written in Go? Or maybe you could get compiled in\nCython or something? Idk, but as it is, it ain't cutting it.</p>\n<p>Of course I realize that Qutebrowser does basically everything else\nwell. If I had a computer with more CPU power and RAM, I might use\nQutebrowser. It has gotten a lot better over the years.</p>\n<hr />\n<h2 id=\"features-a-good-browser-must-have\">Features a <strong>Good</strong> Browser must have.</h2>\n<p>Now that we've ascended past the summits of the bare minimum, we might\nas well discuss what additional features every browser should have.</p>\n<h3 id=\"a-config-file\">A config file.</h3>\n<p>I don't care if only 2% of people know what a configuration file is,\nyou need one. You can keep your Settings menu for normies, but it's\nnuts that browsers think it's okay to get by without a configuration\nfile.</p>\n<p>Once someone has their browser configured, all they have to do if they\nchange computers or want to replicate their settings is to move one\nfile. Or for someone like me, who has <a href=\"https://larbs.xyz\">people wanting to install my\nsystem configuration a lot</a>, it would be convenient\nto be able to have a single text message that assembles a browser with\nsensible settings. You just can do that though. You can sorta-kinda do\nthat with some Furryfox settings, but for a Chromium browser, forget\nabout it.</p>\n<p>Either way, there needs to be a simple text file that can handle setting\nsettings, like:</p>\n<ul>\n<li>Add-on lists including links to the source (similar to a vim plugin\nmanager)</li>\n<li>Key bindings and custom shortcuts</li>\n<li>Bookmarks</li>\n<li>Search engine prefixes (combination of the two above).</li>\n<li>Graphical settings, color appearance, organization of tabs and\nbuttons</li>\n<li>Font, language</li>\n</ul>\n<p>Config files, even if 2% of people are going to use them now open up a\nnew world of sharable and editable settings. This will solve a lot of\ntech support issues as well, frankly.</p>\n<h3 id=\"actually\">Actually...</h3>\n<p>After the configuration file, every other feature a browser should have\ncomes for free. For example, it would be nice to get vim-like\nkey-bindings for mouseless browsing, but that is really dealt with\ncustom key-binds (and I suppose a link hint feature).</p>\n<p>In general, I feel that once you have the sensible defaults above and\nconfiguration file, you really have everything. Browsers suddenly become\nprograms with the same level of usability and customizability and\nnon-egregiousness of every other program on the computer.</p>\n<hr />\n<h2 id=\"summary\">Summary</h2>\n<p>A browser...</p>\n<ol>\n<li>Must actually work.</li>\n<li>Must be free and open source software.</li>\n<li>Must make no unsollicited connections.</li>\n<li>Must block unsollicited ads and other sensible defaults.</li>\n<li>Must have sensible options for history and cookies.</li>\n<li>Must not be cluttered by features irrelevant to browsing.</li>\n<li>Must not clutter the filesystem.</li>\n<li>Must be written in a fast language light on system resources.</li>\n<li>Must have a configuration file.</li>\n</ol>\n<p>Tell me when a browser finally meets these requirements.</p>", "link": "https://lukesmith.xyz/articles/every-web-browser-absolutely-sucks/", "date_published": "2021-08-28 00:00:00+00:00", "persistent": true, "user": null, "language": "en-US"}]