[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Rust’s Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of the Rust, including the MP5 submachine gun, a variant on the infamous ‘Shovel-AK’, as well as a whole load of ridiculous hand-crafted firearms.\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of Rust and compares them to their real-life counterparts.\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\n#rustsguns #royalarmouries", "link": "https://www.youtube.com/watch?v=X0P-p8dGfsY", "date_published": "2021-08-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Infinite Edition Xbox Series X Is Already Getting Scalped | GameSpot News", "description": "Pre-orders for Halo Infinite’s special edition Xbox Series X, originally listed at $550 USD, are being sold on sites like eBay for marked up prices months before release. \n\nIn a blog post, Microsoft’s Joseph Staten revealed why Halo Infinite’s campaign was absent from Gamescom and Opening Night Live. Meanwhile, community manager John Junyszek revealed how XP will work in the game’s multiplayer. \n\nLocation descriptions from Bethesda’s upcoming game Starfield have been revealed in new developer update videos. These locations include, the United Colonies capital city of New Atlantis, the pleasure city of Neon, and the capital of the Freestar Collective, Akila. \n\n00:17 - Scalpers selling Halo Infinite Xbox Series X Pre-Orders\n01:42 - Halo Infinite Campaign Details\n02:16 - Halo Infinite Multiplayer Details\n03:28 - Xbox Mini Fridge\n03:43 - Starfield Location Details\n\n#haloinfinite #xboxseriesx", "link": "https://www.youtube.com/watch?v=CEPgXf-xsQM", "date_published": "2021-08-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Tim Schafer Answers 23 Questions", "description": "How fast can Tim Schafer solve a Rubik's cube? What's his favorite Ramones album? Or what's his morning routine? Tim answers those and more in this special Q&A.\n\nTim Schafer is the creative mind behind games like Full Throttle, Grim Fandango, Broken Age, and, most recently, the action platformer Psychonauts 2. Tim's career goes back 30 years, starting at LucasArts co-writing The Secret of Monkey Island. In 2000, however, Tim set on his own path and founded Double Fine Productions, with its debut title being the cult-classic Psychonauts. In the above video, Tim answers 23 questions like \"what's the hardest part of writing?\", or \"what's Psychonauts 2's biggest inspirations?\"\n\nIn Kurt Indovina's review, he says \"Psychonauts 2 does more than just fill the shoes of its beloved predecessor, it sets itself apart as a classic in its own right.\" Read the full review here: https://www.gamespot.com/reviews/psychonauts-2-review-mind-over-matter/1900-6417718/\n\nPsychonauts 2 is available now for Xbox Series X|S, PS4, PC, as well as Xbox Game Pass.\n\n#timschafer", "link": "https://www.youtube.com/watch?v=r_JTISAygac", "date_published": "2021-08-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Activision Blizzard Accused Of Shredding Abuse Evidence | GameSpot News", "description": "Niantic has announced that the PokeStop and Gym interaction distance in the U.S. and New Zealand has been increased from 40m to 80m.\n\nEpic Games and Time Studios (of Time Magazine) have teamed up to present the Fortnite March Through Time, a limited-time mode that offers no combat, building, or anything of the usual sort Fortnite is known for.\n\nThe California Department of Fair Employment and Housing has updated its lawsuit against Activision Blizzard, accusing the gaming giant of destroying evidence pertinent to the investigation.\n\n00:14 - Pokemon Go PokeStop and gym interaction distance increased\n01:03 - Fortnite celebrates MLK with in-game march through time mode\n02:10 - Activision Blizzard accused of shredding abuse evidence\n\n#pokemongo #fortnite #activision blizzard", "link": "https://www.youtube.com/watch?v=Ie3AKNxYq6I", "date_published": "2021-08-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty Vanguard Multiplayer Alpha Livestream", "description": "Richie is gonna check out the multiplayer alpha for Call of Duty Vanguard and see how this year's COD is shaping up.\n\n#cod #callofduty #callofdutyvanguard", "link": "https://www.youtube.com/watch?v=A1Y2_2w2etg", "date_published": "2021-08-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Elden Ring: 7 New Details Revealed", "description": "Tamoor recently got to see Elden Ring in action in a behind-closed-doors session at Gamescom 2021, here’s everything he learned about From Software’s upcoming open-world adventure. There was no additional footage given. Only new screenshots. \n\nDespite how little we've seen of Elden Ring, those familiar with From Software's catalogue will have a good idea of what to expect. Surprising absolutely no one, Elden Ring is a dark fantasy action RPG set in an intricately constructed world. It delivers its narrative in fragmented pieces, leaving the player to make connections, fill in the gaps, and draw conclusions. Its gameplay marries the tension of venturing into the unknown with the joy of discovery and, most importantly, it emphasizes a sense of accomplishment that comes from conquering seemingly insurmountable challenges. \n\nElden Ring is the exact kind of game that From Software is known for creating, but it's also an exciting evolution that takes the best of what came before and extrapolates it out onto a much grander scale, potentially realizing that open-world Soulsborne fantasy that many fans have been eager for.\n\nIn the video above, Tamoor Hussain discusses 7 new takeaways from a behind-closed-doors gameplay presentation that he attended at Gamescom 2021. Elden Ring will release on January 21 2022 for PS4, PS5, Xbox One, Xbox Series S, Xbox Series X, and PC.\n\n#elden ring7 #eldenring7 #gamescom 2021", "link": "https://www.youtube.com/watch?v=GOTPRZ5cJno", "date_published": "2021-08-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "No More Heroes 3 Review", "description": "No More Heroes 3 is at its best when you're slicing your way through alien invaders, but the rest of the game wrapped around the energetic combat is a laborious disappointment.\n\nGrasshopper Manufacture's No More Heroes 3 is now available on Nintendo Switch. You can read the full written No More Heroes 3 review by Richard Wakeling on GameSpot: https://www.gamespot.com/reviews/no-more-heroes-3-review-desperate-struggle/1900-6417721/\n\n#nomoreheros 3 #nomoreheros3", "link": "https://www.youtube.com/watch?v=sE08izxLzHY", "date_published": "2021-08-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "SAINTS ROW Welcome to Santo Ileso Trailer", "description": "Learn more about Santo Ileso in the new reboot for Saints Row.\n\nJoin voice of The Boss Bryce Charles and the Volition team as they take you on a tour of a whole new world for the Saints.  Welcome to Santo Ileso, a brand new location in the American Southwest, complete with a brand new cast of characters to discover.  \n\n#saintsrow", "link": "https://www.youtube.com/watch?v=IRQP-KWYtDg", "date_published": "2021-08-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Michael Higham Goodbye Stream", "description": "It's our boy Michael Higham's last day at GameSpot, so we're getting the crew together for one last celebration stream.", "link": "https://www.youtube.com/watch?v=IwIURVwQot0", "date_published": "2021-08-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]