[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Brothers Osborne: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nLyndsey McKenna | May 26, 2021\nSince last year, many musicians have had to confront their own version of the \"if a tree falls in a forest\" thought experiment: If you release a new album but can't tour, will the music still resonate for listeners stuck at home? On their superb 2020 album, Skeletons, Brothers Osborne — a country duo that's long challenged the conventions of country and still managed to top the charts — intentionally turned up the volume to create a stadium-sized sound. The problem? \"We put it out and performed it nowhere,\" John Osborne told Morning Edition.\n\nFor their Tiny Desk (home) concert, brothers John and T.J. scale to fit the setting – John's wood-panelled Nashville living room furnished with plenty of guitars and a tiny desk featuring a Maryland flag mug – but refuse to dial down the intensity. Opening with the explosive instrumental track \"Muskrat Greene,\" Brothers Osborne and their collaborators use their set to showcase the very best of Skeletons. As on the record, they transition immediately into \"Dead Man's Curve,\" a track that's the ideal interplay between John's fiery guitar and T.J.'s singular vocal stylings.\n\n\"I hope it's good,\" T.J. confesses near the concert's conclusion. \"We really haven't been performing a lot for obvious reasons.\" If John and T.J. can create this incendiary of an experience from a living room, just imagine hearing the anthems \"I'm Not For Everyone\" and \"Hatin' Somebody\" surrounded by thousands of fellow fans this fall.\n\nSET LIST\n\"Muskrat Greene\"\n\"Dead Man's Curve\"\n\"I'm Not For Everyone\"\n\"Skeletons\"\n\"Hatin' Somebody\"\n\nMUSICIANS\nJohn Osborne: electric guitar, vocals\nT.J. Osborne: acoustic guitar, vocals\nAdam Box: drums\nPete Sternberg: bass\nJason Graumlich: guitar\nGabe Dixon: keys\nMatt Heasley: accordion\n\nCREDITS\nVideo: Reid Long\nAudio: Logan Hanna, Courtney Warner\n\nTINY DESK TEAM\nProducer: Ann Powers\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Kara Frame, Bob Boilen, Gabrielle Pierre\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #brothersosborne", "link": "https://www.youtube.com/watch?v=YN3SNoTrLY4", "date_published": "2021-05-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Deep Sea Diver: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nMarissa Lorusso | May 25, 2021\nDeep Sea Diver's Jessica Dobson didn't neglect the details for the group's Tiny Desk (home) concert. For starters, she sported an impressive homemade bolo tie that she crafted from an NPR enamel pin and \"a little bit of duct tape.\" She also chose a very particular location for the shoot: \"There were countless times this past year that I wanted to be transported out of my house and into a different world,\" the singer and guitarist explains to NPR via email. \"One of my favorite and most inspiring worlds is that of David Lynch's Twin Peaks. I wanted to pay homage to the show by recreating the red room for our Tiny Desk.\"\n\nInside the red room, the set includes three tracks from Deep Sea Diver's marvelous 2020 album, Impossible Weight, plus \"Stop Pretending,\" which was chosen as one of NPR Music's favorite songs of 2020. Joining the band are some special guests: Natalie Schepman and Meegan Closner of the band Joseph sing background vocals, and Dobson's Beagle, Henry, makes an appearance. (Dobson claims he's the only one who didn't care that Deep Sea Diver couldn't tour last year.) The performance itself is a testament to the group's attention to detail, too; as in many of the best Tiny Desk concerts, the band's magnetic energy and finely-crafted songs make the small space feel huge and joyous.\n\nSET LIST\n\"Impossible Weight\"\n\"Lights Out\"\n\"Wishing\"\n\"Stop Pretending\"\n\nMUSICIANS\nJessica Dobson: vocals, guitar, piano\nPeter Mansen: drums\nElliot Jackson: keys, guitar\nElijah Thomson: bass\nNatalie Schepman: backing vocals\nMeegan Closner: backing vocals\nHenry Lee: beagle\n\nCREDITS\nVideo: Tyler Kalberg, Luke Dumke, Dylan Priest\nAudio: Trevor Spencer\n\nTINY DESK TEAM\nProducer: Marissa Lorusso\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Kara Frame, Bob Boilen, Gabrielle Pierre\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #deepseadiver", "link": "https://www.youtube.com/watch?v=0pq_xv1PB28", "date_published": "2021-05-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]