[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Mass Effect Legendary Edition Review", "description": "Parts of Mass Effect: Legendary Edition show their age, but this remaster is largely an improvement over BioWare's original trilogy.", "link": "https://www.youtube.com/watch?v=72LBtX2vWwM", "date_published": "2021-05-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Unreal Engine 5 Early Access", "description": "Check out the new Unreal Engine 5 Early Access Trailer that was shown off today during the Unreal Engine Stream!", "link": "https://www.youtube.com/watch?v=YTc-JIYrnYU", "date_published": "2021-05-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Why Sniper Rifles Are Usually Broken In COD & FPS Games", "description": "Sniper rifles are notoriously broken and overpowered in video games like Call of Duty, Battlefield, and other multiplayer shooters. From long-range shots to 360 no scopes, it’s time to take a look at why sniper rifles often struggle to translate to video games.\n\nSniper rifles have a rocky history in video games like Call Of Duty, Battlefield, and other multiplayer shooters. The complex physics of real-world long-range shooting is fundamentally too difficult to translate to video games, leading developers to both simplify sniper rifles and also exaggerate their drawbacks to keep them balanced. \n\nIn this video, we’re going to look at what sniper rifles are, how they are used in games, the extreme compromises used to balance them, some things developers aren’t trying to make easier, and what happens when they are forced onto small maps. We’re also just going to marvel at the skill of some players who can quickscope and even do 360 no scopes. \n\nIf you love multiplayer shooters, make sure to head over to GameSpot’s YouTube page to watch our Firearms Expert Reacts series, our coverage of Call Of Duty: Cold War’s mid-season 3 update that includes Rambo, and ongoing coverage up to the release of Battlefield 6.", "link": "https://www.youtube.com/watch?v=sz59NAn-fyU", "date_published": "2021-05-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]