[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Groundbreaking antibody research in UK", "description": "UK, New public antibody test\n\nLink for more videos from Africa, https://www.youtube.com/channel/UCzsLklGgOttU3Se-WGLp7ow\n\nAs opposed to studies and surveys\n\nhttps://www.bbc.co.uk/news/uk-58293249.amp\n\nTo find out about natural protection after infection\n\n8,000 adults each day, over 18s can opt in\n\nAfter PCR test from next Tuesday\n\nWill be sent two home antibody tests\n\nFirst, ASAP after the positive result\n\n(No infection induced antibodies)\n\nSecond, 28 days later to measure antibodies generated by the antigen\n\nNHS test and trace services in England, Scotland, Wales and Northern Ireland\n\nMr Javid\n\nBuild on the massive wall of defence from vaccination\n\nstrengthen our understanding of Covid-19 as we cautiously return to a more normal life \n\nAlso help to understand non-responders after natural infection\n\nVaccine induced immunity only, Antibodies to spike protein only\n\nNatural infection induced immunity, Antibodies to spike protein, envelope protein and nucleocapsid protein\n\nIn case you want to support Our community outreach in Uganda through donations\n\nUSE PayPal\n\nE mail to yowandrewmabonga@gmail.com\n\nOr use this direct link, https://www.paypal.me/awmedicalvideos\n\nTo e mail Wefwafwa directly, best to usewefandrew@gmail.com \n\nUK\n\nhttps://coronavirus.data.gov.uk/details/cases\n\nCases\n\n+ 32,253\n\nHospitalisations\n\n + 948 = 6,221\n\nPatients in hospital\n\nDeaths\n\n + 49= 131,640\n\nCertified, + 609 (7 days) = 154,811\n\nUK, this time last year\n\nCase numbers now are more than 30 times higher\n\n20 August 2021,  37,314 \n\n20 August, 2020, 1,182\n\nMost positive cases year, a person with a cough, fever or loss of sense of smell or taste\n\nNow increased testing for events and trips, picking up more asymptomatics\n\nHospitalisations and deaths also higher than one year ago\n\nProf Paul Hunter, University of East Anglia\n\nIt wouldn't matter a jot if Covid caused a million cases a month if it didn't make anybody sick. \n\nIt's the actual illnesses which have to drive what we do next\n\nThey sort of levelled off but are drifting up again and they're drifting up in summer when viruses spread less readily\n\nThere is concern about what will happen in the autumn\n\nA higher base number heading into Autumn\n\nNearing endemic equilibrium - the point where cases are neither increasing nor falling.\n\nI'm very confident that we're not going to see anything like the amount of disease we saw last time round, in the autumn", "link": "https://www.youtube.com/watch?v=TUMhItD3TkY", "date_published": "2021-08-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "United States hospital pressures", "description": "United States, California, Texas, Florida, over 3 million cases\n\nhttps://www.youtube.com/watch?v=dl1trq3qFYA\n\nFDA likely to give full approval to Pfizer tomorrow\n\nMr and Mrs Jesse Jackson hospitalized after vaccination in January\n\nhttps://www.cdc.gov/mmwr/volumes/70/wr/mm7034e1.htm?s_cid=mm7034e1_w\n\n(NY data)\n\nProtection against infection\n\nJuly 25, 79.8%\n\nAge adjusted effectiveness against hospitalizations\n\nJuly 25, 91.9% to 95.3%\n\nHospital pressure\n\nAlabama, Florida, Georgia, Mississippi, Texas, Arkansas, Louisiana (stroke victims not admitted)\n\nMississippi, $500 (or prison) for not self-isolating if infected\n\nJoel Valdez\n\nhttps://www.washingtonpost.com/health/2021/08/16/joel-valdez-houston-covid-hospitals/\n\nHouston, (ITU at/ above capacity)\n\nHaving broken bones and bullets in me for over a week now, it’s a little frustrating \n\nDue to strained resources, surgical patients are being prioritized based on several factors, which unfortunately may result in a delay of nonemergent surgical procedures\n\nOregon, activated 1,500 members of the National Guard to 20 hospitals\n\nNitesh N. Paryani radiation oncologist, Tampa\n\nhttps://www.washingtonpost.com/opinions/2021/08/21/how-unvaccinated-pandemic-threaten-everyones-health/\n\nThe unvaccinated are killing people in ways they probably never imagined.\n\nMy hospital, one of the largest in central Florida, was full of covid patients, more than 90 percent of whom were unvaccinated. \n\nWe had no beds available. \n\nWe had paused elective surgeries the previous week\n\nOur emergency department had a 12-hour wait that day.\n\nBut I had no choice. For the first time in my career, I had to say no.\n\nPlease, do your part and get vaccinated.\n\nI for one don’t want to have to turn away more people who need care.\n\nMr Trump\n\nI recommend, take the vaccines, I did it, its good, take the vaccines\n\nUnited States data\n\nhttps://covid.cdc.gov/covid-data-tracker/#trends_dailytrendscases\n\nhttps://covid.cdc.gov/covid-data-tracker/#vaccination-trends\n\nhttps://covid.cdc.gov/covid-data-tracker/#hospitalizations", "link": "https://www.youtube.com/watch?v=DUMkXjqkd_U", "date_published": "2021-08-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]