[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty Vanguard Alpha Trailer", "description": "Check out the latest trailer for Call of Duty Vanguard which announces its first Alpha for PlayStation players coming on August 27th-29th.  It includes the new mode Champion Hill which features 8 teams in 4 arenas. Fight on Airstrip, Trainyard, Market, and Courtyard. In addition, there is 2v2 and 3v3 mode.\n\n#callofduty #vanguard", "link": "https://www.youtube.com/watch?v=Wk1OH_e-d7g", "date_published": "2021-08-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New PS5 Model Out In Some Regions | GameSpot News", "description": "Sony has updated the PlayStation 5 with a slightly lighter model that uses a new screw to attach the base. The new model is currently only available in some regions.\n\nCall of Duty: Vanguard alpha is coming to PlayStation players on August 27 to August 29. The alpha will feature Champion Hill, a brand new game mode. You can pre-load the game on your PS4 and PS5 today.\n\nNetflix has unveiled some new Cowboy Bebop images, as well as the release date for the show.\n\n#ps5 #cod #vanguard #cowboybebop", "link": "https://www.youtube.com/watch?v=-50EDtTPl7o", "date_published": "2021-08-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Psychonauts 2 Review", "description": "Psychonauts 2 does more than just fill the shoes of its beloved quirky predecessor, but sets itself apart as a classic in its own right.\n\nSixteen years ago, Psychonauts made a cartoonish, comically lopsided world feel believable and weighted thanks to its loveable characters and earnest storytelling. Now, Psychonauts 2 builds upon this foundation to reach ambitious new heights, while equally deepening its roots to impressive depths.\n\nPsychonauts 2 is the quintessential display of Double Fine's mastery in story, gameplay, and distinct direction, making it the studio's best game to date. \n\nPsychonauts 2 is available now on Xbox One, Xbox Series X|S, Xbox Game Pass, PS4, PS5, and PC.\n\n#Psychonauts2", "link": "https://www.youtube.com/watch?v=0bfz2jvYsFc", "date_published": "2021-08-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "I Played No Man's Sky 5 Years Later", "description": "Back in 2016, No Man's Sky was one of the most anticipated game's of the year. However - after releasing, No Man's Sky was notoriously missing many of its promised features, and people swore not to overhype themselves ever again... until Cyberpunk 2077.\n\nBut, No Man's Sky has received regular free updates, and now many will tell you that No Man's Sky is one of the best redemption arcs in video games, and now worth playing. So - how is No Man's Sky 5 years later?\n\n#nomanssky", "link": "https://www.youtube.com/watch?v=uxgeVXaru7E", "date_published": "2021-08-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Revisiting The Original No More Heroes", "description": "With No More Heroes III right around the corner how does Suda51’s original hold up in 2021? \n\nNo More Heroes was released for the Nintendo Wii in 2007 in Japan and in 2008 everywhere else. The game follows Travis Touchdown, a wrestling and anime fan who wants to become the #1 ranked assassin after winning a Beam Katana in an online auction. The game never takes itself too seriously, for example, if you want to save your game you have to use the toilet to do so, and it even breaks the fourth wall sometimes. \n\nBut how is the original No More Heroes in 2021? Should you go back to it in the leadup to No More Heroes 3? Hopefully this video will help answer that question, and yes there are no spoilers for the plot of the game in this video. The original No More Heroes and its sequel got ports to Nintendo Switch and Steam making it easier than ever to try the series out.\n\nIn terms of the series as a whole, No More Heroes got an “enhanced” port to Xbox 360 and PS3 (but only PS3 outside of Japan), a sequel titled No More Heroes 2: Desperate Struggle in 2010, a Japan only mobile spin-off game, another spin-off for consoles and PC titled Travis Strikes Again: No More Heroes, and now a 3rd numbered entry titled No More Heroes 3 which is set to be released exclusively for the Nintendo Switch on August 27th, 2021. So while it’s not the most successful series in the world, it definitely wasn’t a one hit wonder.\n\nSuda51 Breaks Down His Iconic Career | Audio Logs: https://youtu.be/JgggpKr931U\n\n#nomoreheros", "link": "https://www.youtube.com/watch?v=wSVXloMQXGY", "date_published": "2021-08-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]