[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Buzzy Lee: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nBob Boilen | June 2, 2021\nThere's a comfort to be found singing in a bathroom; we all sound better with our voices bouncing off the tiles. For Sasha Spielberg, a.k.a. Buzzy Lee, she took it a step further, recording her Tiny Desk (home) concert in her childhood bathroom, which her parents decorated with images of fairytales.\n\nSasha Spielberg tells me there's \"Cinderella and her fairy godmother, the Seven Dwarfs and the Three Wise Men of Gotham, which is part of Mother Goose, apparently.\" She continues, \"This bathroom is where I would go to sing. I would make up songs about each of the fairytales on the tiles, and I could sing as loud as I wanted, and it felt as if I had enough privacy. It was my escape. I'd spend hours on end in here dreaming of singing in front of people. It's also where I wrote my first song, age 5, 'You're Just Like Pie Crust.' It was a pop song. Huge hit.\"\n\nBuzzy Lee captured my heart with her 2021 album Spoiled Love, an album produced with Nicolas Jaar. With musicians Adam Gunther sitting in the tub playing modular synths and Jorge Balbi Castellano seated on the 'throne' playing drum pads, we hear songs and tales with different themes: obsession, love, attachment, and self-doubt, all filled with playful wordplay and her passionate voice.\n\nSET LIST\n • \"Strange Town\"\n • \"Coolhand\"\n • \"Spoiled Love\"\n • \"What Has A Man Done\"\n\nMUSICIANS\n • Sasha Spielberg: keys, vocals\n • Adam Gunther: modular synth, modular bass\n • Jorge Balbi Castellano: drums\n\nCREDITS\n • Video: Harry McNally\n • Audio: Adam Gunther\n\nTINY DESK TEAM\n • Producer: Bob Boilen\n • Video Producer: Kara Frame\n • Audio Mastering: Josh Rogosin\n • Associate Producer: Bobby Carter\n • Tiny Production Team: Maia Stern, Gabrielle Pierre\n • Executive Producer: Keith Jenkins\n • Senior VP, Programming: Anya Grundmann\n\n#buzzylee #tinydesk #nprmusic", "link": "https://www.youtube.com/watch?v=cRUvdNsOdVY", "date_published": "2021-06-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Fat Joe: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nAbby O'Neill | June 1, 2021\nLatino hip-hop legend Fat Joe muscled his way out of the streets of the South Bronx with his debut album, Represent, in 1993. He radiates a different energy in 2021, sauntering in his own uptown streetwear shop, fresh fitted in pink leather and a designer bucket hat, but he's still got that old larger-than-life electricity.\n\nA founding member of the D.I.T.C. (Diggin' In the Crates) crew, Fat Joe Da Gangsta has managed to last nearly 30 years and multiple generations in the rap game without ever giving up his lease on the top of the charts. That's no easy feat for a rapper who came out of the early '90s, and positively trailblazing for a Puerto Rican emcee without any notable predecessors. That catalog is on display in a medley of hits performed for his Tiny Desk (home) concert with the Terror Squad Band, and it's clear that Joe is amped up rocking with a live outfit that keeps the essence of his hits while infusing some salsa that reps his Latino heritage.\n\nThat crew turns the rugged \"My Lifestyle\" into a visceral experience with layers of nuance added by Joe's longtime DJ Ted Smooth. On the 2002 smash \"What's Luv,\" Angelica Vila takes the spotlight singing a hook originally performed by Ashanti. \"Sunshine,\" is an effervescent new springtime jam that was spawned by 22-year-old internet sensation Amorphous, who mashed up Luther Vandross's debut single \"Never Too Much\" with Rihanna's \"Kiss It Better.\" Joe, who has always had a solid ear for new talent and a prowess for pinning down a buoyant hit record, came in and gullied this sparkling jam, renewing a glow that's been dim for this last year.\n\nSET LIST\n\"My Lifestyle\"\n\"What's Luv?\"\n\"Lean Back\"\n\"Sunshine (The Light)\"\n\"All The Way Up\"\n\nMUSICIANS\nFat Joe: vocals\nAngelica Vila: vocals\nEugene \"Man-Man\" Roberts: keys\nRashid Williams: drums\nEric Whatley: bass\nSimon Martinez: guitar\nDJ Ted Smooth: DJ\n\nCREDITS\nVideo: Omar Reynoso, Mehdi Zollo, Zach Sky\nAudio: Nathan Bonetto, Sacha Zuckerman, Danny Cheung for DCD Audio, Julian Stewart/DaJuan Williams Live Audio\n\nTINY DESK TEAM\nProducer: Abby O'Neill, Bobby Carter\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nTiny Production Team: Kara Frame, Bob Boilen, Gabrielle Pierre\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #fatjoe", "link": "https://www.youtube.com/watch?v=tJKwzmJSpN8", "date_published": "2021-06-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]