[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Tiny Desk Contest Top Shelf: Episode 1 with Bobby Carter", "description": "NPR Music received thousands of submissions to this year's Tiny Desk Contest, our annual search for the next great undiscovered artist to play a Tiny Desk concert. Before we announce this year's winner, this year's Contest judges are sharing their favorite entries in our weekly Tiny Desk Contest Top Shelf livestream series.\n\nEpisode 1 was hosted by Tiny Desk series creator Bob Boilen and Tiny Desk producer Bobby Carter. Featured entries:\n- \"Hummingbird\" by Selina Moon https://www.youtube.com/watch?v=65jvtJ90-F4\n- \"Khali's Interlude\" by Z The Author https://www.youtube.com/watch?v=dl2guFoaaqM\n- \"Love The World\" by DAP The Contract https://www.youtube.com/watch?v=OlWSXMpoQx4\n- \"Root\" by Seafoam Walls https://www.youtube.com/watch?v=Cdk3QKMlhQE\n- \"Old Empires\" by Lithia https://www.youtube.com/watch?v=OJ8dSHsJ8HM\n\nLearn more about the Tiny Desk Contest: https://npr.org/tinydeskcontest.\n#tinydesk #tinydeskcontest #tinydeskcontesttopshelf", "link": "https://www.youtube.com/watch?v=83nai-eV0vs", "date_published": "2021-07-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Maple Glider: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nBob Boilen | July 21, 2021\nTori Zietsch, aka Maple Glider, is in her Australian home surrounded by her bandmates and friends. Comforting landscape paintings cover the walls: Tori's first vinyl album, Melanie's 1971 album Gather Me, hangs alongside the pictures. She fingerpicks her guitar and sings \"Mama It's Christmas,\" the closing track to her debut album, To Enjoy Is the Only Thing. As she sings the words: \"Oh it's Christmas time again / Where is my brother / Where is my friend / Mama it's Christmas time, again / Doesn't he know I've got ribbons to wrap him in.\" Looking at the camera's wide shot, I sense her watching bandmates and those landscape paintings morph into a warm, comforting blanket.\n\nTori grew up steeped — and trapped — in a restrictive, religious home. Music was her way out. She was part of a duo known as Seavera, and when that disbanded, she moved to Brighton in the U.K. She wrote a stockpile of solo music and came back to Melbourne with what she describes as a SoundCloud packed with demo tunes. I first became enchanted by the second song here, \"As Tradition.\" It's the first single she put out as Maple Glider, and it speaks to the loss of identity in both relationships and religion. On the lighter side, she refers to her talented band as \"The Yeeehawwws\" because they sing ultra country versions of her songs during rehearsals. There may come a time when levity becomes part of Maple Glider; for now, these heavy tunes, packed with thoughtful words and sung so longingly, are here to enjoy.\n\nSET LIST\n\"Mama It's Christmas\"\n\"As Tradition\"\n\"Baby Tiger\"\n\"Good Thing\"\n\nMUSICIANS\nMaple Glider: guitar, piano, vocals\nBridgette Winten: piano, vocals\nAdam Heath: guitar, vocals\nJim Rindfleish: drums\nMalachi Milham: bass\nHannah McKittrick: vocals\n\nCREDITS\nDirector: Claudia Sangiorgi Dalimore\nRecording and Mixing: Matt Redlich\nCameras: Nick McKinlay, Lucy Campbell\nColour Grade: Ted Deacey\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Kara Frame\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Maia Stern, Gabrielle Pierre\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #mapleglider", "link": "https://www.youtube.com/watch?v=DHvPWoMeDtE", "date_published": "2021-07-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]