[{"source": "https://lukesmith.xyz/rss.xml", "title": "The classical book reprinting site is live! LindyPress.net", "description": "<p>For a while, I've hinted that I've been contributing to a project to\nreprint out-of-print classical and medieval texts that are of hidden\nvalue, sometimes even in their original languages. I've worked on this\nproject for a while and now it's live and you can browse the first five\nbooks available.</p>\n<p>See the site at <a href=\"https://lindypress.net\">https://lindypress.net</a>. All works have been\nreformatted in XeLaTeX so that the text is grade-A in readability and\nhas nice little flourishes to make it a little more elegant. A lot of\nother reprinting companies have their work done with less care.</p>\n<p>Here are a list of the books available now:</p>\n<ul>\n<li>Marcus Aurelius's <em>Meditations</em> (in English): a personal log that\nEmperor and Stoic philosopher Marcus Aurelius kept. This is still\ncommonly read as a kind of a book of proverbs and motivation, and is\nthe only book of these where you can commonly find other reprints of\nthis book, but they usually have textual errors and aren't as nice.\nThis is a pocket book, making it easy to port around and read\nleisurely.</li>\n<li><em>Antimodernist Papal Encyclicals</em> (in English): A collection of six\nmajor Catholic writings against liberalism, modernism, communism and\nfor the chastity of marriage and the economic model now called\n&quot;distributism.&quot;</li>\n<li><em>The Books of Enoch and the Book of Jubilees</em>: Hard to find\nextra-Biblical books on the esoteric life and ascension of Enoch,\nthe Nephilim, the true story of the Flood and much more, all\nwell-formatted, translated from Ge'ez, Slavonic and Hebrew and in\none volume.</li>\n<li>Isidore of Seville's book on Etymologies (in Latin): an\nencyclopedia was used as a textbook for centuries in late antiquity\nand the middle ages. It's a great compendium of information on\nevery topic and is a 400+ page hardback which can still be openned\nand read at any point. I recommend this even more strongly for\nLatin-learners because it's written in the simplest and clearest\nprose and is instructive in nature and will help people acquire\nvocabulary while practicing the language. Might even be a good\nchoice for an intermediate Latin class.</li>\n<li>Roger Bacon's <em>Compendium Studii Theologiae</em> (in Latin): It's\nextremely hard to find any prints of Roger Bacon's philosophical,\ntheological or alchemical works, so this is the first I've prepared\nfor reprinting. I'll soon finish his <em>Opus Tertium</em> as well. CST is\na another portable pocket book.</li>\n</ul>\n<p>Check out the site for more information.</p>\n<p>The site accepts either credit cards or Bitcoin/Monero/Ethereum for\npayment. It works with the lightning network too.</p>\n<p>(Note that this uses a print-on-demand service, so you might take a\ncouple days to print your books.)</p>\n<p>I will make this site known on my YouTube channel in several days, but\nfor now, you can browse and get what you want.</p>\n<p>There are many other books already in the works, but email me with\nsuggestions for more if you have them.</p>\n<p>I really want to focus on things that are nearly impossible to find in\nprint in a presentable way. Compilations are also possible, similar to\nthe encyclical compilation.</p>", "link": "https://lukesmith.xyz/updates/the-classical-book-reprinting-site-is-live-lindypressnet/", "date_published": "2021-07-22 00:00:00+00:00", "persistent": false, "user": null, "language": null}]