[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Aspiration, more information", "description": "However, if you have done this and a flash of blood appears in the needle hub, withdraw the needle and select a new site for injection.\n\nhttps://www.youtube.com/watch?v=I7qJfECIUAg\n\nEgro\n\nI checked The Australian Immunization Handbook and incredibly, this is item 5. under 'Intramuscular Injections' \n\nhttps://immunisationhandbook.health.gov.au/vaccination-procedures/administration-of-vaccines\n\nIt is not necessary to draw back on the syringe plunger before injecting a vaccine.14 However, if you have done this and a flash of blood appears in the needle hub, withdraw the needle and select a new site for injection.\n\nhttps://www.path.org/resources/giving-safe-injections-using-auto-disable-syringes-for-immunization/\n\nhttps://path.azureedge.net/media/documents/SI_Giving_Safe_Injections_complete.pdf\n\nSo the technique I was taught decades ago and which you have taught since has been quietly retired. I'll check the science behind this curious decision. Keep up the good work.\n\nGood question\n\nMom\n\nThis doesn’t explain why it’s mostly only happening to adolescent and young males. Matter of fact, that narrow demographic almost excludes your reasoning here unless you’re saying only males are getting accidental IV vaccines.\n\nUS military\n\nhttps://jamanetwork.com/journals/jamacardiology/fullarticle/2781601\n\n23 male patients, (20 after 2nd dose)\n\n2.8 million doses of mRNA COVID-19 vaccines administered.\n\nOne in 121,739\n\nUS series\n\nhttps://jamanetwork.com/journals/jama/fullarticle/2782900\n\n20 had vaccine-related myocarditis\n\n37 had pericarditis\n\n= 57\n\n2,000,277 individuals receiving at least one dose\n\nOne in 35,092\n\nhttps://www.cdc.gov/vaccines/hcp/admin/administer-vaccines.html\n\nhttps://www.youtube.com/watch?v=PqSuCPnPeYE\n\nhttps://www.cdc.gov/vaccines/hcp/acip-recs/general-recs/administration.html\n\nAspiration before injection of vaccines or toxoids (i.e., pulling back on the syringe plunger after needle insertion but before injection) \n\nis not necessary because no large blood vessels are present at the recommended injection sites,\n\nand a process that includes aspiration might be more painful for infants\n\nhttps://www.gov.uk/government/collections/immunisation-against-infectious-disease-the-green-book\n\nhttps://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/147915/Green-Book-Chapter-4.pdf\n\nVaccines should not be given intravenously. \n\nIt is not necessary to aspirate the syringe after the needle is introduced into the muscle (WHO, 2004; Plotkin and Orenstein, 2004). \n\nWHO, Section 5.4, immunization in Prctice\n\nhttps://apps.who.int/iris/bitstream/handle/10665/193412/9789241549097_eng.pdf?sequence=1&isAllowed=y\n\nClinicians who got blood\n\nDeborah, (RN)\n\nA few years ago, I aspirated and got blood return. I was shocked as it had never happened to me before but it confirmed the importance of aspiration.\n\nJH\n\nhospital corpsman in the Navy, I gave thousands of shots over the 4+ years of duty, \n\nwe were taught to always use aspiration when giving IM shots, every person I see on TV or Internet never aspirated before injection\n\nthere were many times I hit a vein and had to retract the needle and try again\n\nwhere do they fine these people who are giving these injections McDonalds or is there just no training for this job?\n\nAvinash (peadatrician)\n\nNurses in UK don't aspirate inspite of requests which is scary.. \n\nYoung adults have more chance of myocardits ,they have turgid blood vessels\n\nAbnormal radial artery is known. Pulse is felt on lateral side and not at usual site. \n\nSo even inside body abnormaly positioned blood vessels or extra vessels are possible.\n\nI came across frank blood while giving vaccines. \n\nI had to remove needle and discard injection. \n\nOnce it was MMR and other was typhoid vaccines. \n\nAlthough rare it can be fatal as well. \n\nWhen my son got Pfizer vaccines twice in England Statford nurse did not aspirate inspite of requests from him. \n\nIt is scary for me to imagine injection without aspirating as I have seen frank blood twice in 32 years\n\nA commenter\n\nI inject myself with anabolic steroids and have done for the past 20 years, \n\nmy preferred injection site is the deltoids, \n\nits a deep intramuscular injection, \n\nI aspirate and on many occasions I have drawn blood, \n\nI would say around 1 out of 30.\n\nGood suggestion\n\nCan I ask for aspiration?\n \nGillian\n\nHi John, when I get my booster, can I ask who ever is administering it to aspirate, before they give it???\n\nJerome (cancer and reconstructive surgeon)\n\nI have never understood why present day training seems to advise against aspiration prior to intramuscular injection in both medical and nursing courses. \n\n\n\nhttps://www.healthline.com/health/intramuscular-injection\n\n\n\nhttps://www.winchesterhospital.org/health-library/article?id=33266", "link": "https://www.youtube.com/watch?v=KgVsd6qoyU4", "date_published": "2021-09-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]