[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Eme Alfonso: Tiny Desk (Home) Concert", "description": "From Sept. 15 through Oct. 15, Tiny Desk is celebrating Hispanic Heritage Month with an \"El Tiny\" takeover of the (home) concert series, featuring J Balvin, Camila Cabello and several more musicians from all corners of Latinidad.\n\nFelix Contreras | September 29, 2021\nAs you gaze into the space where Cuban vocalist Eme Alfonso performs her Tiny Desk (home) concert, you enter a place where music becomes a spiritual language. So much of her history and music is centered around the Afro-Cuban spiritual practice that some know as santería. In the 1980s, her parents started Síntesis, a pioneering band that performed secular versions of that musical liturgy through electric jazz fusion. In fact, her parents, Carlos Alfonso and Ele Valdés, join her on vocals on this three-song set, which she recorded in Havana.\n\nAs with all things spiritual, it's best to start off paying homage to all things greater, which she does with a track from her 2018 album Voy, \"Ayabba,\" a prayer sung in Yoruba and interpreted for voice and jazz trio (in this case, bassist Julio César González, pianist Jorge Aragón and drummer Oliver Valdés).\n\n\"Libre\" showcases the historic musical ties between the US and Cuba, as Alfonso's vocals reflect her love for soul and jazz. Jazz is also part of that long-standing cultural give and take, as evidenced by Aragón's masterful piano solo.\n\n\"El Bote\" features the preternatural family vocal connection between Alfonso and her parents. In an interview I did with her dad Carlos Alfonso, he told me the main inspiration for the choir-like vocals of their group Sintesis were inspired by Freddie Mercury and Queen. There is a bit of those stacked harmonies in the chorus, before a propulsive drum solo by Oliver Valdés that propels the song to a dramatic close.\n\nEme Alfonso is representative of the kind of music that defies expectations of what Cuban music should sound like. This stop in Havana during our \"El Tiny\" tour of Latin music is just the tip of the iceberg of the musical riches of contemporary Cuba.\n\nSET LIST\n • \"Ayabba\"\n • \"Libre\"\n • \"El Bote\"\n\nMUSICIANS\n • Eme Alfonso: vocals\n • Ele Valdés: vocals\n • Carlos Alfonso: vocals\n • Jorge Aragón: piano\n • Oliver Valdés: drums\n • Julio César González: bass\n\nCREDITS\n • Video: Daniel Santoyo, Mauricio Valera, Ana Rafaela Riego\n • Audio: Bosito, José Justo Enrique\n • Director of Photography: Bryan González\n • Colorist: Daniel Alemán\n • Production Assistant: Boris Sergueevich\n • Camera Operator: Carla Franco\n • Camera Operator: Luis Alberto González\n • Camera Operator: Alejandro Calero\n • Camera Assistant: Raúl Amargo\n • Gaffer: Jesús Dulfo\n • Lighting Equipment: Raydel Grizzle\n • Jonathan L. Mendoza: Lighting Technician\n\nTINY DESK TEAM\n • Producer: Felix Contreras\n • Video Producer: Kara Frame\n • Audio Mastering: Josh Rogosin\n • Alt.Latino 'El Tiny' Team: Anamaria Sayre, Reanna Cruz, Anaïs Laurent, Stefanie Fernandez\n • Tiny Production Team: Bob Boilen, Bobby Carter, Maia Stern, Sofie Hernandez-Simeonidis\n • Executive Producer: Keith Jenkins\n • Senior VP, Programming: Anya Grundmann\n\n#eltiny #tinydesk #emealfonso", "link": "https://www.youtube.com/watch?v=fJNSgPqQ1yw", "date_published": "2021-09-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]