[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Capcom Monster Hunter Spotlight | Tokyo Game Show 2021", "description": "Catch up on the latest details of the newly announced Monster Hunter Rise: Sunbreak, as well as news and updates for Monster Hunter Rise and Monster Hunter Stories 2: Wings of Ruin, courtesy of the development team.\n\n#TGS2021 #tokyogameshow2021 #capcommonster", "link": "https://www.youtube.com/watch?v=WmosJjrTK44", "date_published": "2021-09-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Diablo II Resurrected Review", "description": "Diablo II: Resurrected is a painfully faithful remaster of the original classic, which makes it difficult to get into over two decades later.\n\nAlessandro clicked thousands of enemies to death across 20 hours with Diablo II: Resurrected, trying out both a Paladin and Necromancer across the game's campaign and expansion. Code was provided by the publisher.\n\n#diablo #diablo2 #diablo2review", "link": "https://www.youtube.com/watch?v=NlFhMvRWQmM", "date_published": "2021-09-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Dying Light 2 Livestream | Dying 2 Know Episode 4", "description": "Learn more about the open world of Dying Light 2 in this latest Dying 2 Know episode. This is the 4th episode you'll get more details on exploration, combat, character interactions, and secrets you might find in the city. \n\nAlso stay tuned to the end for a big reveal for a new character and the celebrity that plays them. \n\n#dyinglight2", "link": "https://www.youtube.com/watch?v=yqLMG1N1sKk", "date_published": "2021-09-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "FIFA 22 Review", "description": "FIFA 22 excels on the pitch with a patient and more methodical style, but additions elsewhere are only incremental and microtransactions still leave a bad taste. FIFA 22 is out on October 1st for PC, PS4, PS5, XB1, XBS X/S, and Switch.\n\nRichard played FIFA 22 for 25 hours, splitting his time amongst each of its game modes. Review code was provided by the publisher.\n\n#fifa #fifa22 #fifa22review", "link": "https://www.youtube.com/watch?v=u1pVqQ_iZUU", "date_published": "2021-09-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Free October Games For PS Plus & Xbox Gold | GameSpot News", "description": "In today’s episode, Persia talks about all of the free games coming in October for PlayStation Plus and Xbox Gold users, Forbidden West developers Guerrilla Games hiring for a multiplayer game, and Netflix acquiring game developer Night School Studio.\n\nIn this video, Persia talks about the free games you can play with a PS Plus or Xbox Gold subscription. Sony has now officially announced the free PlayStation Plus games for October 2021 which includes one PlayStation 5 game, Hell Let Loose, as well as a pair of PlayStation 4 games, PGA Tour 2K21. and Mortal Kombat X. On the Xbox side of things, Microsoft has announced the free Games With Gold titles coming in October, and these include Aaero, Hover, Castlevania: Harmony of Despair, and Resident Evil Code: Veronica X.\n\nHorizon: Forbidden West developer Guerrilla Games' new job shows that the company is looking to hire a Senior Social Systems Designer and Senior Narrative System Designer, both of which point to a multiplayer game being in the works. \n\nLastly, Persia talks about Netflix acquiring Night School Studio, the developer behind Oxenfree, Afterparty, and Next Stop Nowhere. The developer is the first game studio bought by Netflix, which earlier this year announced its plans to expand into the video games industry. Similar to Netflix's shows and films, games will also be included in the service's memberships, with the added benefit of having no advertisements or in-app purchases.\n\n For more information on all the topics today, please visit gamespot.com.\n\nTIMESTAMPS:\nIntro - 00:00 \nFree Games - 00:16\nGuerrilla Games - 01:29 \nNetflix  - 02:35\nOutro - 03:53\n\nYou can read more about all of today’s topics on gamespot.com\n\n#freegames #xbox #playstation", "link": "https://www.youtube.com/watch?v=4hNgizY6uiE", "date_published": "2021-09-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Xbox Livestream | Tokyo Game Show 2021", "description": "Tune in for a 50-minute Xbox livestream focusing on games and updates for players in Japan and across Asia.\n\nThis year marks the 25th anniversary of Asia’s biggest gaming event, with the show again taking a virtual format. The 2021 theme of Tokyo Game Show aims to emphasise the power of gaming to close the distance between people and carries with it the inspiring event tagline of ‘We’ll always have games.’\n\nFollowing a return to the Tokyo Game Show stage last year, we are pleased to confirm Xbox will be back with a virtual stream curated for players in Japan and across Asia on Thursday, September 30.\n\n#TGS2021 #tokyogameshow2021", "link": "https://www.youtube.com/watch?v=YKSAH_nej8k", "date_published": "2021-09-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Ranking the Best N64 Games", "description": "The Nintendo 64 is celebrating its 25th anniversary this year and it’s getting a lot of love from Nintendo, with their Nintendo Switch Online expanding to include classic N64 games like Super Mario 64, Starfox 64 and the Legend of Zelda: The Ocarina of Time. So with all the N64 love in the air, we’re looking back for that quick hit of nostalgia to decide the best games on the N64.\n\nIn this video, we go over the best games that the Nintendo 64 had to offer over its entire lifetime. From the weirdness of Grunty’s Lair in Banjo-Kazooie to the space adventure of Starfox 64, the 64 era was filled with classic worlds to discover and explore. Not only that, but with games like Super Mario 64, the N64 helped to define what 3D gaming could become. Even more, games like Mario Kart 64 set the template for long-running series that have dominated entire genres.\n\nFor this ranking, we look at everything from the multiplayer madness of Goldeneye 007 to the dark themes of Majora’s Mask to the horrors of Resident Evil 2… and it’s graphics. Even further, we highlight some underappreciated gems like Conker’s Bad Fur Day… though we hope you’ll forgive us if we forget to talk about Superman 64. \n\nIf you want to see how you can replay some of these nostalgic games, check out the news about N64 games, as well as some Sega Genesis classics, will be coming to Nintendo Switch Online later this year here!\n\n#n64 #nintendo", "link": "https://www.youtube.com/watch?v=xWhi0HTvXTs", "date_published": "2021-09-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]