[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "How Westside Gunn And Conductor Williams Inspired Tyler, The Creator To Rap Again | The Formula S2E4", "description": "The growing discography made by the Griselda founder and the noir-inspired Kansas City producer reflect the way these two visionaries have aligned to create something singular.\n\nRodney Carmichael | November 19, 2021\nWestside Gunn may be a connoisseur of many things — art, fashion, champagne, even pro wrestling — but picking beats is where the man truly earns his self-anointed nickname, the Flygod. Simply put, his ears are impeccable. And when he stumbled across video of a producer named Conductor Williams demo'ing beats on his IG page a couple of years back, he knew he'd struck gold. What Gunn heard struck him differently than the grimy sound he'd made synonymous with Griselda Records. This was symphonic but soulful. Gunn was sold. \n\n\"I spent the rest of the day trying to learn Conductor,\" Gunn remembers. \"We reached out to each other and the rest is history.\"\n\nConductor has become integral to the sound Gunn has curated for the Buffalo-based, independently-owned Griselda in the two years since they first worked together. And that sound has become one of the most distinct and influential in hip-hop. Conductor's loop-heavy production, dissonant and often devoid of bass, has a way of elevating Gunn's high-pitched barrage. As one-third of The Heartbreakers — the name Gunn calls his supergroup of in-house producers, which also includes Camoflauge Monk and Denny LaFlare — Kansas City native Williams works his magic like a jazz-era sideman, his select tracks providing the perfect accompaniment on albums ranging from Gunn's \"Pray For Paris\" and Mach-Hommy's \"Pray For Haiti\" (executive produced by Gunn), to Gunn's recently released double-LP \"Hitler Wears Hermes 8.\"   \n\nAs two of the newest collaborators featured in this season of The Formula, where we dig deep into joint discographies between rappers and producers, Westside Gunn and Conductor Williams have already made a major impact. \"Michael Irvin,\" only the second song they made together, served as the sonic inspiration for one of the biggest albums of 2021 when Tyler, the Creator rapped over the same beat on \"SIR BAUDELAIRE,\" the opening song from his \"Call Me When You Get Lost\" LP. In this episode, we get them together in NYC to talk about how they inspire each other and what it feels like to know their music is moving the culture right now.\n\nCREDITS\nHost/Series Producer: Rodney Carmichael; Producers: Tsering Bista, Nickolai Hammar; Editor: Nickolai Hammar; Animators: Jackie Lay, Alicia Zheng; Director of Photography: Nickolai Hammar; Audio Engineer: Josh Rogosin; Videographers: Annabel Edwards, Nickolai Hammar, Christopher Parks; Production Assistants: Amna Ijaz, Trisha Pickelhaupt; Art Director: CJ Riculan; Project Coordinator: Erin Register; Legal Adviser: Kimberly Sullivan; Consulting Editors: Jacob Ganz, Sidney Madden; Supervising Producer, Nick Michael; Senior Producer: Abby O'Neill; Managing Editor: Becky Lettenberger; Executive Producers: Anya Grundmann, Keith Jenkins\n\nMUSIC\n\"Michael Irvin,\" Westside Gunn, Flygod Is An Awesome God 2 (2020); \"Sir Baudelaire (feat. DJ Drama),\" Tyler, The Creator, Call Me If You Get Lost (2021); \"Rose Water\" by DJ Face\n\n#westsidegunn #conductorwilliams #theformula #nprmusic", "link": "https://www.youtube.com/watch?v=ThDoFjsGijw", "date_published": "2021-11-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]