[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCHnyfMqiRRG1u-2MsSQLbXA", "title": "The Big Misconception About Electricity", "description": "The misconception is that electrons carry potential energy around a complete conducting loop, transferring their energy to the load. This video was sponsored by Caséta by Lutron. Learn more at https://Lutron.com/veritasium\n\nFurther analysis of the large circuit is available here: https://ve42.co/bigcircuit\n\nSpecial thanks to Dr Geraint Lewis for bringing up this question in the first place and discussing it with us. Check out his and Dr Chris Ferrie’s new book here: https://ve42.co/Universe2021\n \nSpecial thanks to Dr Robert Olsen for his expertise. He quite literally wrote the book on transmission lines, which you can find here: https://ve42.co/Olsen2018\n \nSpecial thanks to Dr Richard Abbott for running a real-life experiment to test the model.\n \nHuge thanks to all of the experts we talked to for this video -- Dr Karl Berggren, Dr Bruce Hunt, Dr Paul Stanley, Dr Joe Steinmeyer, Ian Sefton, and Dr David G Vallancourt.\n\n▀▀▀\nReferences:\nA great video about the Poynting vector by the Science Asylum: https://youtu.be/C7tQJ42nGno\n\nSefton, I. M. (2002). Understanding electricity and circuits: What the text books don’t tell you. In Science Teachers’ Workshop. -- https://ve42.co/Sefton\n\nFeynman, R. P., Leighton, R. B., & Sands, M. (1965). The feynman lectures on physics; vol. Ii, chapter 27. American Journal of Physics, 33(9), 750-752. -- https://ve42.co/Feynman27\n\nHunt, B. J. (2005). The Maxwellians. Cornell University Press.\n\nMüller, R. (2012). A semiquantitative treatment of surface charges in DC circuits. American Journal of Physics, 80(9), 782-788. -- https://ve42.co/Muller2012\n\nGalili, I., & Goihbarg, E. (2005). Energy transfer in electrical circuits: A qualitative account. American journal of physics, 73(2), 141-144. -- https://ve42.co/Galili2004\n\nDeno, D. W. (1976). Transmission line fields. IEEE Transactions on Power Apparatus and Systems, 95(5), 1600-1611. -- https://ve42.co/Deno76\n\n▀▀▀\nSpecial thanks to Patreon supporters: Luis Felipe, Anton Ragin, Paul Peijzel, S S, Benedikt Heinen, Diffbot, Micah Mangione, Juan Benet, Ruslan Khroma, Richard Sundvall, Lee Redden, Sam Lutfi, MJP, Gnare, Nick DiCandilo, Dave Kircher, Edward Larsen, Burt Humburg, Blake Byers, Dumky, Mike Tung, Evgeny Skvortsov, Meekay, Ismail Öncü Usta, Crated Comments, Anna, Mac Malkawi, Michael Schneider, Oleksii Leonov, Jim Osmun, Tyson McDowell, Ludovic Robillard, Jim buckmaster, fanime96, Ruslan Khroma, Robert Blum, Vincent, Marinus Kuivenhoven, Alfred Wallace, Arjun Chakroborty, Joar Wandborg, Clayton Greenwell, Michael Krugman, Cy 'kkm' K'Nelson,Ron Neal \n\n\nWritten by Derek Muller and Petr Lebedev\nAnimation by Mike Radjabov and Ivy Tello\nFilmed by Derek Muller and Emily Zhang\nFootage of the sun by Raquel Nuno\nEdited by Derek Muller\nAdditional video supplied by Getty Images\nMusic from Epidemic Sound\nProduced by Derek Muller, Petr Lebedev and Emily Zhang", "link": "https://www.youtube.com/watch?v=bHIhgxav9LY", "date_published": "2021-11-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]