[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Get Classic GTA Trilogy For Free… If You Buy The Broken Version | GameSpot News", "description": "In this episode of GameSpot News, we talk about GTA The Trilogy Definitive Edition patches are coming and original games being reinstated on pc, Halo Infinite Campaign Co-Op and Forge delayed further and Forza Horizon 5 is the biggest Xbox game launch in history. \n\nIn this video, DeVante talks about Rockstar Games releasing a statement apologizing for the ongoing issues with GTA: The Trilogy - The Definitive Edition and promising that further updates are coming to improve the experience for everyone. Rockstar also said it will reinstate the original versions of GTA III, Vice City, and San Andreas on the Rockstar Store in a bundle \"shortly.\" \n\nDeVante also talks about Microsoft seemingly delaying Halo Infinite’s campaign co-op given that Season 2's start-date is now coming later than expected. Forge was expected to launch after Season 2, so it, too, has seemingly shifted to a later date. Staten said 343 will make announcements in January about Season 2, as well as its plans for campaign co-op and Forge.\n\nLater in the video, Microsoft announced that Forza Horizon 5 enjoyed the \"biggest first week\" in the history of Xbox, reaching more than 10 million players in that time.\n\n#GTA", "link": "https://www.youtube.com/watch?v=BGLMmS63IP4", "date_published": "2021-11-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Infinite Campaign Hands-On Preview", "description": "Halo Infinite is a strong start for Master Chief's first open-world outing, and it could bode well for the overall single-player experience.\n\nIn the opening moments of Halo Infinite's campaign, a despondent pilot says to Master Chief, \"You have one bullet against an entire army, what can you do on your own?\" Chief, with all the stoicism that fans have come to love him for, replies in that iconic gravelly voice, \"It's enough.\" \n\nAfter a couple of lackluster entries, I've been feeling less and less drawn to the Halo franchise, so it was difficult not to read into that moment. For me, once a diehard fan, Halo Infinite feels like developer 343 Industries' last shot at reinvigorating my fandom. And, based on what I've played of the campaign, it might just be enough. \n\n#HaloInfinite", "link": "https://www.youtube.com/watch?v=fBuDf97q2GM", "date_published": "2021-11-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Brilliant Diamond & Shining Pearl - DS vs. Switch Graphics Comparison", "description": "With Pokémon Brilliant Diamond & Shining Pearl coming to Nintendo Switch, we put Shining Pearl head-to-head with the original Pokémon Diamond on Nintendo DS to see the graphical differences.\n\nPokemon Diamond and Pearl were originally released for the Nintendo DS in 2006 in Japan and 2007 everywhere else. Now, 10 years later, they’re being remade on the Nintendo Switch as Pokemon Brilliant Diamond and Shining Pearl to celebrate the 15th anniversary of the original games and the 25th anniversary of the Pokemon series. \n\nPokemon Diamond and Pearl are the 4th generation of Pokemon games and take place in the Sinnoh region with the two cover Pokemon being Dialga and Palkia. For this video the Nintendo DS version of Pokemon Diamond was captured on a New Nintendo 3DS XL at 720p, and Pokemon Shining Pearl was captured on a Nintendo Switch at 1080p.\n\nPokemon Brilliant Diamond and Shining Pearl are available now on Nintendo Switch. The games are available separately as well as in a double pack. If you purchase the game before February 21, 2022 you can claim the Pokemon Platinum style outfit for your character as well as a Manaphy Egg through the Mystery Gift function. If you’re looking for more Brilliant Diamond and Shining Pearl videos, we’ve got you covered here on GameSpot:\n\nReview-In-Progress: https://youtu.be/tsyXsJvjArM\nFirst 24 Minutes Of Shining Pearl Gameplay: https://youtu.be/8jAXbh-05kI\n\n#Pokemon", "link": "https://www.youtube.com/watch?v=ZQwOMVwRJws", "date_published": "2021-11-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "6 Things The GTA Trilogy Definitive Edition NEEDS To Fix", "description": "Grand Theft Auto’s Definitive Trilogy collection has had a bumpy start into the next generation of gaming. Here’s our list of issues that could use some love to make the experience as smooth and as fun as it was more than a decade ago.\n\nGrand Theft Auto's Definitive Trilogy collection has had a bit of a bumpy start. It's suffering from graphical, audio and gameplay issues across all three titles. In this video Richie Bracamonte breaks down six things Rockstar and Grove Street Games can do to help makes these games as awesome as we remember them. (And more!)\n\nMost of the definitive editions issues seemed to be overlooked as the trilogy transitioned into the Unreal engine. This include old transparency effects, terrifying character models and lighting effects. Other issues didn't occur before, such as de-synched audio, music tracks skipping and problems with aiming, including a glitchy animation for Tommy Verceti when crouched. The  exaggerated rain effect has also made it hard to drive, especially in first-person view. While there appear to big little in the way of game-breaking issues, small upgrades can be made to enhance the general quality of life and gameplay experience. The modding community has already begun making changes, but also have been dealing with Rockstar and Take-Two studios every step of the way.\n\nRemember to subscribe to GameSpot's YouTube page for more GTA coverage including our video about the rough Nintendo Switch port, as well as a collection of bugs and glitches throughout the trilogy.\n\nTimestamps:\n00:31 - Rain\n01:10 - Aiming\n01:45 - Character Models\n02:09 - Mission Briefings MIA\n02:42 - Audio Issues\n03:18 - General Bugginess", "link": "https://www.youtube.com/watch?v=kHsEj52MePE", "date_published": "2021-11-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield  (1942 vs. Portal) El-Alamein Graphics Comparison", "description": "Battlefield 2042 offers a Portal mode, that allows you to dive into some of the classic maps from original Battlefield games such as Battlefield 3, and Bad Company 2. In this video, we take a look at El-Alamein from Battlefield 1942 and compare it with Portal's remaster of the fan favorite map.\n\n#Battlefield2042", "link": "https://www.youtube.com/watch?v=Kbp2ir_ue-U", "date_published": "2021-11-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Grand Theft Auto: The Trilogy -  Should You Play It On Switch?", "description": "GTA: The Trilogy - Definitive Edition is here! And... it's not what anyone was hoping for. While the Grand Theft Auto compilation includes the fantastic GTA 3, GTA: Vice City, and GTA: San Andreas, the GTA Trilogy Definitive Edition port is riddled with bugs and issues.\n\nAll of that asides, if you were to pick up the GTA Trilogy for the Switch as opposed to Xbox or Playstation, is it worth it? How does GTA Trilogy on the Switch compare to the other consoles?", "link": "https://www.youtube.com/watch?v=jgjjdhXMmu8", "date_published": "2021-11-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Grand Theft Auto: The Trilogy Best Bugs and Glitches", "description": "We culled an amazing selection of GTA Trilogy: Definitive Edition bugs and glitches in this action-packed video.  \n\nGTA: The Trilogy — The Definitive Edition contains its share of bugs and glitches. Here's a collection of some of the most captivating bugs from the internet, including freakishly flexible characters, questionable physics, and, of course, cursed CJ.", "link": "https://www.youtube.com/watch?v=4ZeonAbeXpQ", "date_published": "2021-11-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Modders VS GTA ... Bad Timing | GameSpot News", "description": "In this episode of GameSpot News, we talk about Modders Behind GTA Re3 Project Are Fighting Take-Two's Lawsuit, Halo Infinite’s Battle Pass changes, Deathloop Update Adds Controller Remapping and Battlefield 2042 Update Addressing Rubber Banding And Renabling Prox Sensor. \n\nIn this video, DeVante talks about GTA modders fighting against a lawsuit from Take-Two Interactive. The modders were originally sued for their project, Re3, which reverse-engineered the source code for GTA III and GTA: Vice City, allowing the games to run on Nintendo Switch and PlayStation Vita.\n\nDeVante also talks about how Developer 343 Industries is making major changes to the game's battle pass progression system in the wake of a wave of negative feedback about it. These changes include: Halo Infinite players can now earn XP by completing matchmade games. The \"Play 1 Game\" Daily Challenge is worth 50 XP each. The Challenge deck is also being updated to better serve players of all skill levels.\n\nLater in the video, a new Battlefield update, 1 of 3 in the next 30 days, fixes issues plaguing the game. And Deathloop’s 2nd major patch adds controller remapping and makes many NPC changes.\n\nTIME STAMPS\n00:00 - Intro\n00:09 - GTA Modder fight back\n01:58 - Halo Infinite Battle Pass Changes\n02:48 - Battlefield 2042 Update Addresses Issues\n03:18 - Deathloop Patch", "link": "https://www.youtube.com/watch?v=wnzHtQXxeaA", "date_published": "2021-11-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "MultiVersus Official Reveal Trailer", "description": "MultiVersus is a brand-new, free-to-play platform fighter that lets you team up with or against your friends using some of the world’s most iconic characters including Batman, Shaggy, Superman, Bugs Bunny & more.\n\nUse unique co-op abilities, find your favorite fighter combos, and save the Multiverse!\n\nMultiVersus is scheduled for worldwide release in 2022 on PlayStation5 and PlayStation4 consoles, Xbox Series X|S, Xbox One consoles and PC with full cross-play support, dedicated server-based rollback netcode and content-filled seasons. \n\n#Multiversus", "link": "https://www.youtube.com/watch?v=YG7WEltGCIU", "date_published": "2021-11-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]