[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Best 2021 Mobile Games", "description": "The best mobile games use the medium to deliver engaging gameplay and gripping story, and 2021 saw a number of pocket-sized gems. From lovingly crafted RPGs to fresh spins on existing franchises, 2021 was a stellar year for mobile gaming: here’s GameSpot’s best mobile games of the year.", "link": "https://www.youtube.com/watch?v=vteCM8WL_5Y", "date_published": "2021-12-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "PS Plus Games For January LEAKED? | GameSpot News", "description": "In today’s episode of GameSpot News, Persia discusses the free PlayStation Plus games that were reportedly leaked for January, Tesla is being investigated for letting drivers play behind the wheel, and more.\n\nAs shared by Wario64 on Twitter and reported by Dealabs, January's games that are rumored to be featured in the monthly subscription service includes Persona 5 Strikers, the spin-off title which first launched earlier this year in February for PS4, PC, and Nintendo Switch. Alongside that, Deep Rock Galactic and Dirt 5 could also be included.\n\nLater in the video, Persia talks about a report from the LA Times. Tesla is being investigated by the National Highway Traffic Safety Administration following a complaint to the agency that owners can play games while the vehicle is moving. According to the agency and a new document posted to its website, the feature called \"Passenger Play\" could distract the driver and increase the risk of a crash.\n\nAnd lastly, Guillermo del Toro is not working on a new Silent Hill project, despite fan speculation following the Oscar-winning director's recent tease at The Game Awards. Del Toro said in an interview with the Happy Sad Confused podcast where he went on to say, \"I kind of just wanted to tickle the ribs of Konami.”\n\nFor more information on all of our topics, please visit gamespot.com.\n\nTimestamps:\nIntro - 00:00\nPlayStation Plus - 00:07\nTesla Arcade - 01:19\nSilent Hill - 02:50\nOutro - 04:15", "link": "https://www.youtube.com/watch?v=ckO1f5G8uzk", "date_published": "2021-12-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Best PC-Exclusive Games of 2021", "description": "New gaming consoles come and go every few years, but PC gaming endures with some of the best hardware and software that's exclusive to that platform. This year was no exception, as PC gamers had access to imaginative and genre-bending titles, games that pushed the flexible nature of those systems in wild new directions.\n\nWhile PC gaming shared many a hit game with its console brethren, for this list we're looking at the games that could only be found on this platform...with one exception. That means no Resident Evil Village and its incredibly tall ladies, no Deathloop and its masterful approach to Groundhog Day gunplay, and no Halo Infinite reviving the beloved FPS franchise. In this list, it's the efforts of small studios and indie developers that took the top spots, bringing about an exciting selection of games in 2021.\n\n0:00 - Intro\n0:47 - Before Your Eyes\n2:35 - Valheim\n3:55 - Wildermyth\n4:56 - Inscryption\n5:58 - Loop Hero\n7:38 - Outro", "link": "https://www.youtube.com/watch?v=wZ7wOKHMVSQ", "date_published": "2021-12-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Best Nintendo Switch Exclusive Games of 2021", "description": "From Monster Hunter Rise to Metroid Dread, the Nintendo Switch had another great year filled with excellent exclusives.\n\nThe Nintendo Switch may have been the old guy in the room this year when compared to the PS5 and Xbox Series X, but the Switch arguably stole the show when it came to exclusive games in 2021. The Switch is approaching its fifth birthday, and Nintendo has shown no signs of slowing down on its avalanche of games you can only play on the hybrid console.\n\nGiven all of the standout exclusives that landed on Switch this year, it was difficult to whittle down the list to the best of the best, but that's exactly what we've done here. Here are our picks for the five best Nintendo Switch exclusives of 2021.\n\nTimestamps:\nIntro - 00:00\nMetroid Dread - 00:38\nMonster Hunter Rise - 02:12\nNew Pokémon Snap - 03:54\nShin Megami Tensei V - 05:27\nSuper Mario 3D World + Bowser's Fury - 07:12\nOutro - 08:42", "link": "https://www.youtube.com/watch?v=4W-DvHCamvU", "date_published": "2021-12-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo vs. Call of Duty vs. Battlefield … Who Won?", "description": "The three biggest multiplayer shooters of the year just took players on a wild ride of highs and lows. In this video, we’re looking at how huge expectations, buggy betas, changes to core gameplay both good and bad, and surprise launches defined a rocky end to 2021.\n\nTimestamps\n0:00 Introduction\n0:48 Call of Duty Vanguard\n8:00 Battlefield 2042\n15:40 Halo Infinite\n25:38 Final Conclusions", "link": "https://www.youtube.com/watch?v=shL0CcLicU0", "date_published": "2021-12-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Own GTA: Trilogy? Get A Free Game Today! | GameSpot News", "description": "In today’s episode of GameSpot News, Persia talks about how PC Grand Theft Auto Trilogy owners can now get a game for free, Halo Infinite’s new Winter event that just went live, and more.\n\nPlayers who purchased the PC version of the game through the Rockstar Games launcher will have the option to claim one of the following games: Grand Theft Auto V: Premium Edition, Grand Theft Auto IV: Complete Edition, Max Payne 3, LA Noire, or Bully: Scholarship Edition. \n\nLater in the episode, Persia also talks about Halo Infinite's next multiplayer event, Winter Contingency. The event is now live and developer 343 Industries revealed in its latest blog post that the event will run from December 21, 2021 to January 4, 2022. Rewards for Winter Contingency include armor pieces, an armor attachment, holiday-themed coatings for your Spartan and weapons, along with a free nameplate, emblems, and a special backdrop.\n\nLastly, Persia goes over details on a huge new winter wonderland-themed Minecraft world that shows off the potential of Minecraft with RTX, while also raising money for the Great Ormond Street Hospital Children’s Charity. The world can be downloaded for free as long as players have the latest version of Minecraft for Windows installed.\n\nFor more information on all of our topics and more, please visit gamespot.com.\n\nTimestamps:\nIntro - 00:00\nGTA Trilogy - 00:06\nHalo Infinite - 00:47\nMinecraft - 01:29\nOutro - 02:48", "link": "https://www.youtube.com/watch?v=nVInYaAsdSo", "date_published": "2021-12-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]