[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "When Antibiotics Don't Work (full documentary) | FRONTLINE", "description": "Has the age of antibiotics come to an end? From a young girl on life support in Arizona to an uncontrollable outbreak in 20XX at one of the nation’s most prestigious hospitals, FRONTLINE investigates a deadly type of bacteria that our modern antibiotics can’t stop. (Aired 2013)\n\nThis journalism is made possible by viewers like you. Support your local PBS station here: http://www.pbs.org/donate​.\n\nAddie Rerecich was a happy 11-year-old girl who loved sports and talked a mile a minute. But when a mysterious pain in her hip landed her in the hospital in 2011, she began a downward spiral into the nightmare of a new kind of antibiotic-resistant infection that is confounding doctors across the world.\n\nAddie’s precipitous decline might sound unusual, but as FRONTLINE reveals in “Hunting the Nightmare Bacteria”, medicine’s struggle with deadly drug-resistant infections is becoming all too real. After decades of antibiotic overuse, the crisis of untreatable infections has only deepened. Most major drug companies, squeezed by Wall Street expectations and facing steep scientific hurdles, have abandoned the development of new antibiotics. Correspondent David Hoffman takes viewers behind the story of one major drug company’s efforts to overcome the new drug-resistant superbugs—and why, despite those efforts, the drug pipeline is running dry.\n\nLove FRONTLINE? Find us on the PBS Video App, where there are more than 300 FRONTLINE documentaries available to watch any time: https://to.pbs.org/FLVideoApp​ \n\n#Documentary #NightmareBacteria\n\nSubscribe on YouTube: http://bit.ly/1BycsJW​\nInstagram: https://www.instagram.com/frontlinepbs​\nTwitter: https://twitter.com/frontlinepbs​\nFacebook: https://www.facebook.com/frontline\n\nFunding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Major funding for FRONTLINE is provided by the Ford Foundation. Additional funding is provided by the Abrams Foundation; the John D. and Catherine T. MacArthur Foundation; Park Foundation; and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation, and additional support from Koo and Patricia Yuen.", "link": "https://www.youtube.com/watch?v=EkyAuG9RSSU", "date_published": "2021-12-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]