[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Positive UK data", "description": "Less people going to hospital with Omicron infection compared to Delta infection. Apologies, I had a few technical problems with todays video\n\nZoe update: Wednesday 22 December 2021\n\nhttps://www.youtube.com/watch?v=CIGC310hPoI\n\nhttps://covid.joinzoe.com/post/everything-we-know-so-far-about-omicron\n\nhttps://joinzoe.com/learn/category/covid\n\nhttps://joinzoe.com/learn/new-omicron-variant\n\n144,284 new daily symptomatic cases of COVID in the UK\n\nIn people who have had at least 2 vaccine doses\n\n56,346 new daily symptomatic cases in the UK\n\n70% + cases in England are now Omicron \n\nThe UK R value, 1.2\n\nR value in London is 1.5.\n\nFrom 17,000 omicron cases\n\nRunny nose\n\nHeadache\n\nFatigue (either mild or severe)\n\nSneezing\n\nSore throat\n\n(NHS test and trace is not telling users of their Omicron status anymore)\n\nReport 50 - Hospitalisation risk for Omicron cases in England\n\nhttps://www.imperial.ac.uk/mrc-global-infectious-disease-analysis/covid-19/report-50-severity-omicron/\n\nhttps://www.theguardian.com/world/2021/dec/22/risk-of-hospital-stay-40-lower-with-omicron-than-delta-uk-data-suggests\n\nDifferences in the risk of hospitalisation between Omicron and Delta\n\n1st to 14th December inclusive\n\nAnalysed data from all PCR-confirmed SARS-CoV-2 cases in England\n\nCases\n\nS-gene Target Failure (SGTF) and genetic data\n\nOmicron, n = 56,000\n\nDelta, n = 269,000\n\nReduction in the risk of hospitalisation for Omicron relative to Delta infections \n\nEndpoint, any attendance at hospital\n\n20-25% reduced risk\n\nEndpoint, hospitalisation lasting 1 day or longer\n\n40-45% reduced risk\n\nThese reductions must be balanced against the larger risk of infection with Omicron, \ndue to the reduction in protection provided by both vaccination and natural infection. \n\nIntrinsic differences in severity between Omicron and Delta\n\nOmicron may result in slightly less severe disease\n\nFrom the few neither previously infected nor vaccinated, \n\nrisk of hospitalisation, 11% lower for Omicron versus Delta\n\nLevel of protection from previous infection\n\nReduces the risk of any hospitalisation by 50% \n\nReduces the risk of a hospital stay of 1+ days by 61%\n\nRisk of symptomatic infection with omicron\n\nMore protection after PF/MD than AZ \n\nHospitalisation risk by vaccination state\n\nAstraZenca (AZ) (doses 1 and 2)\n\nOmicron hazard ratios are lower than for Delta\n\nPfizer or Moderna (PF/MD) (doses 1 and 2)\n\nOmicron hazard ratios are similar to those seen for Delta\n\nConclusions, after at least 2 vaccine doses\n\nProtection against omicron infection has been largely lost\n\nRemain substantially protected against hospitalisation\n\nDoes not substantially change Sage modelling\n\nPointing to 3,000 daily hospitalisations in England at the peak next month\n\n\n\nOmicron cases in Scotland, Eave II study\n\n(Early Pandemic Evaluation and Enhanced Surveillance of COVID-19) \n\nhttps://www.sciencemediacentre.org/data-from-scotland-on-omicron-severity-from-the-eave-ii-study/\nhttps://www.ed.ac.uk/usher/eave-ii/key-outputs/our-publications/severity-of-omicron-variant-of-concern-and-vaccine\nhttps://www.research.ed.ac.uk/en/publications/severity-of-omicron-variant-of-concern-and-vaccine-effectiveness-\n\nHospital data from 23 November to 19 December\n\nRisk of hospitalisation, 70% lower with Omicron than Delta.\n\n15 hospitalisations with Omicron\n\nOpposed to the 47 admissions from delta\n\n(Expected given the characteristics of those infected)\n\nFirst case of Omicron confirmed by viral sequencing was recorded in Scotland on November 23, 2021\n\nBy December 19, 2021, there were 23,840 S gene negative cases. \n\nThese S gene negative cases were predominantly in the age group 20-39 (11,732; 49.2%). \n\nReinfections, more than 10 times more likely with omicron\n\nOmicron positive cases that were reinfections, 7.6%\n\nDelta cases that were \nreinfections, 0.7%\n\nThe third/booster vaccine dose was associated with a 57% reduction in the risk of symptomatic omicron infection\n\n(relative to ≥25 weeks post second dose)\n\n\nInterpretation \n\nThese early national data suggest that Omicron is associated with a two-thirds reduction in the risk of COVID-19 hospitalisation when compared to Delta. \n\nWhilst offering the greatest protection against Delta, the third/booster dose of vaccination offers substantial additional protection against the risk of symptomatic COVID-19 for Omicron,\n\nwhen compared to ≥25 weeks post second vaccine dose.", "link": "https://www.youtube.com/watch?v=4qzKh_S4Qs0", "date_published": "2021-12-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "The Australian Protocol", "description": "Australia takes the courage of it's convictions\n \nUS\n\nHalf a billion free at home lateral flow tests\n\nMilitary (1,000) helping hospitals\n\nThe omicron virus spread more rapidly than anyone thought\n\nTexas\n\nOne omicron death\n\nMan in his 50s\n\nUnderlying health conditions\n\nUnvaccinated\n\nAustralia\n\nhttps://www.reuters.com/world/asia-pacific/australia-rules-out-lockdowns-despite-omicron-surge-2021-12-21/\n\nNSW, cases + 3,763\n\nVictoria, cases + 1,503\n\nAustralian thinking\n\nTo stop omicron with vaccination, near 100% efficacy with near 100% uptake\n\nWith no waning\n\nNatural infection promotes antibody IgA\n\n(vaccines generate IgM then IgG\n\nPreventing vial replication in the upper airways\n\nAllowing omicron infection up to the point where hospitalisations are manageable\n\nLess pathogenic with shorter hospital stays\n\nNatural immunity giving cross immunity to the next variant\n\nConcurrent booster programme for the elderly and comorbid\n\nOver time need for pharmaceutical and NPIs will diminish\n\nIf hospitalisations do rise, population will self-titrate\n\nhttps://www.doherty.edu.au/our-work/institute-themes/viral-infectious-diseases/covid-19/covid-19-modelling/modelling\n\nMillions of Covid cases by the end of January or early February\n\nInfections, + 200,000 per day\n\nUp to 4,000 hospitalisations a day\n\nPM Mr Morrison\n\nThe modelling assumed the Omicron strain is as serious as Delta\n\nFailed to account for boosters\n\nor people taking sensible behavioural responses in what they're doing\n\nSo I wouldn't want to alarm people over that report. \n\nThat is not what we are actually expecting to happen\n\nThe grim predictions were highly unlikely\n\nThere is a range of scenarios, \n\nof course the number of Omicron cases will increase.\n\nIt's highly infectious. \n\nBut the indications are that it is not as severe and our hospitals, \n\nin NSW and Victoria, have been coping extremely well\n\nProfessor Paul Kelly, Australia chief medical officer\n\nhttps://www.dailymail.co.uk/news/article-10333919/Coronavirus-Australia-Australias-Chief-Medical-Officer-hits-doomsday-Omicron-predictions.html\n\nselective and misleading media reporting about ongoing modelling\n\nthe predicted hospitalisation estimations are unlikely.\n\nEvidence about the characteristics of Omicron is still emerging but early trends seen both internationally and within Australia suggest that it is more transmissible\n\nHowever, early indications around hospitalisation, ICU admission and death show that Omicron could be far less than Delta and other variants \n\nImportantly, after almost four weeks of Omicron in Australia there are currently no confirmed Omicron cases in ICU and no deaths confirmed to date\n\nModelling, it's one of a range of tools and can't be viewed in isolation\n\nA preliminary scenario, of many being considered to help inform decision making\n\nPresents one of the worst case of all potential scenarios\n\nincluding assumptions that the Omicron variant is as severe as the Delta variant, \n\nan absence of hospital surge capacity, \n\na highly limited booster program, \n\nno change to baseline public health and social measures\n\nand an absence of spontaneous behaviour change in the face of rising case numbers\n\nNone of these five assumptions represent the likely state of events, let alone all of them together, \n\ntherefore presenting that scenario as the likely scenario that will occur is highly misleading\n\nFormer deputy chief health officer Nick Coatsworth \n\nWhoever leaked the Doherty modelling without context has committed a gross injustice to the Australian people\n\nFederal Health Minister Greg Hunt \n\nDespite the rapid spread of Omicron\n\nonly a fraction of cases were ending up in hospitals\n\nSA hospital data\n\nhttps://www.nicd.ac.za/diseases-a-z-index/disease-index-covid-19/surveillance-reports/daily-hospital-surveillance-datcov-report/\n\nUK data\n\nhttps://coronavirus.data.gov.uk\n\nhttps://www.gov.uk/government/publications/covid-19-omicron-daily-overview\n\nSelf-isolation pragmatism\n\nhttps://www.bbc.co.uk/news/uk-politics-59749447\n\nPeople infected with Covid in England,\n\nstop self-isolating,\n\nnegative lateral flows on day six and day seven\n\nStrongly advised to limit, contact with vulnerable, crowded or poorly ventilated spaces, work from home\n\nSajid Javid acting on expert advice\n\nApplies to everyone, regardless of vaccination status\n\nShould still isolate if symptomatic\n\nPeople not double-jabbed who have close contact with a positive case must still isolate for a full 10 days\n\nWefwafwa’s Medical videos channel\n\nhttps://www.youtube.com/channel/UCzsLklGgOttU3Se-WGLp7ow\n\nIn case you want to support our community outreach programs please Use, (all donations go directly to the Uganda)\npatreon:https://www.patreon.com/awmedicalvideos\nDonate: SENDWAVE/ WorldRemit/Wise transfer/money Gram\nMobile money number:+256785698803\nCountry: Uganda\nRegistered name : Wefwafwa Andrew", "link": "https://www.youtube.com/watch?v=LVl5OkHcvf4", "date_published": "2021-12-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]