[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC_7PqixGIdE-jjoHKMPYpGA", "title": "Śmierć na dnie Bałtyku?", "description": "📚 Kup moją najnowszą książkę ► https://siedem.alt.pl\nDo 9 listopada darmowa wysyłka na terenie Polski\n\n👉 Patronite ► https://patronite.pl/NaukowyBelkot \n✍ Petycja ► https://www.petycjeonline.com/bron_w_baltyku\n\n📚 Moja książka ► https://altenberg.pl/geny/\n📚 E-book ► https://tinyurl.com/pnp-ebook\n🎧 Mix audio ► http://ratstudios.pl/\n\n3 października 2020 roku udałem się do Trójmiasta, żeby wziąć udział w pokazowym rejsie badawczym organizowanym przez Instytut Oceanologii PAN. Jeżeli mam być szczery - byłem przekonany, że nie dowiem się zbyt wielu rzeczy. Miałem za sobą przecież prawie godzinny film o broni chemicznej. Co nowego mogło dać zobaczenie, jak szuka się broni chemicznej. 12 miesięcy później kończyłem robić ten film. Film, który (mam wrażenie) tylko powierzchownie porusza ten niezmiernie istotny temat.\n\n===\nRozkład jazdy:\n\n0:00 Dużo ton\n2:42 Od początku\n4:50 Oto \"bohater\"\n7:21 Po pierwszej wielkiej wojnie\n9:44 Aliancki incydent\n11:33 Po drugiej wielkiej wojnie\n18:52 Ocena zagrożenia\n26:49 Porozmawiajmy o Bałtyku\n43:28 Co można znaleźć?\n49:56 Nie tylko śmierć\n52:42 Woda na pustyni\n59:35 Polski wkład \n1:07:15 Nie tylko chemiczna\n1:13:20 Co teraz?\n1:24:44 To zależy...\n1:37:12 Trochę od nas...\n\n===\nŹródła (wybrane):\n\nM. Czub i in. - Deep sea habitats in the chemical warfare dumping areas of the Baltic Sea\nM. Reckermann - Human impacts and their interactions in the Baltic Sea region\nP. Vanninen i in. - Exposure status of sea-dumped chemical warfare agents in the Baltic Sea\nT. Lang i in. - The health status of fish and benthos communities in chemical munitions dumpsites in the Baltic Sea\nT. Brzeziński i in. - The effects of chemical warfare agent Clark I on the life histories and stable isotopes composition of Daphnia magna\nK. W. Zieliński - Patologia obrażeń i schorzeń wywołanych współczesną bronią w działaniach wojennych i terrorystycznych\nJ. K. Piotrowski - Podstawy toksykologii\nA. Kołodziejczyk - Naturalne związki organiczne\nJ. Bełdowski i in. - Best practices in monitoring\nA. Beck i in. - In Situ Measurements of Explosive Compound Dissolution Fluxes from Exposed Munition Material in the Baltic Sea\nM. Czub i in. - Acute aquatic toxicity of sulfur mustard and its degradation products to Daphnia magna\nA. Szarejko i in. - The Baltic Sea as a dumping site of chemical munitions and chemical warfare agents\nR. Schuster i in. - Exposure to dissolved TNT causes multilevel biological effects in Baltic mussels (Mytilus spp.)\nM. Czub i in. - Acute aquatic toxicity of arsenic-based chemical warfare agents to Daphnia magna\nhttps://helcom.fi/media/documents/Dumped-chemical-munitions-in-the-Baltic-Sea.pdf\nhttp://www.coastalwiki.org/wiki/Chemical_and_conventional_ammunition_in_the_Baltic_Sea", "link": "https://www.youtube.com/watch?v=K9U1-_JD9BM", "date_published": "2021-10-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]