[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Cyberpunk 2077 3rd Person Is NOT The Way To Play", "description": "Cyberpunk 2077 is a first person experience... or is it? With Jelle Bakker's mod you can finally play Cyberpunk 2077 in the third person using a PC mod created by Nexus Mods user sarunama.\n\nBut just because humanity can do something, doesn't mean it should. As seen in the video above, Jake Dekker and Rob Handlery discover that Cyberpunk 2077 is not a game you want to play in third-person. When we're allowed to see how protagonist V moves, we're met with a hip-shaking, torso twisting abomination of a human being. Granted, the mod is still a work-in-progress, so V's appearance in third-person could be improved in the future.\n\nBut for now, yeah, this mod basically lets you in on the secret that Cyberpunk 2077 is actually some twisted horror game where you're the monster. It's now completely understandable why everyone in Night City is trying to shoot you all the time. \n\nCyberpunk 2077 has had a bit of a rough launch. As noted in GameSpot's Cyberpunk 2077 review, the game can be somewhat buggy on PC and even more so on Xbox One and PS4--it's bad enough that Sony removed the game from the PSN store. Since launch, CD Projekt Red has addressed a few of the bugs in quick hotfixes, one aimed at issues involving specific quests and the other handling a save data corruption glitch. The developer has two future patches scheduled to implement more substantial performance improvements, one this month and the second in February.\n\nJB - TTP MOD: https://www.nexusmods.com/cyberpunk2077/mods/669?tab=description", "link": "https://www.youtube.com/watch?v=YRXAE19O_iM", "date_published": "2021-01-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Medium - Official 14 Minutes Of Xbox Series X 4K Gameplay Trailer", "description": "Bloober Team's next horror game is set across two parallel worlds; check out some extended gameplay showing off the scares that await.", "link": "https://www.youtube.com/watch?v=G20ONXxv5zE", "date_published": "2021-01-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]