[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Pino Palladino + Blake Mills: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nNikki Birch | June 17, 2021\nThe studio backdrop of this Tiny Desk (home) concert is the perfect setting for the dynamic duo headlining this project. Pino Palladino is a prolific bassist whose sound you're already intimately acquainted with (even if you don't know it). Blake Mills, a guitarist and two-time Grammy nominee for producer of the year, has an impressive catalog of his own. Together, in the studio, the topshelf sidemen are in their element, distilling the sonic creativity that is the first release under Palladino's name, Notes With Attachments.\n\nEight pulsing calls from saxophonist Sam Gendel usher us into \"Just Wrong\" a melodic meditation that unfolds like a blossom in timelapse. Guitar, bass, sax and Abe Rounds' colorful dustings of percussion in this song are magical; we soar with the musicians through varied repetitions of the melody before they gently set us back on our feet. The afterimage of our flight is still fading away when Palladino greets the viewers with a short and sweet introduction before opening \"Ekuté,\" a tune that explores traditional West African music, jazz and rock influences with a few modern touches of technology. \"Djurkel,\" the final offering in this set, is also experimental in nature. Palladino's trademark bass sound lies in the cut, the fertile ground on which Mills, Gendel and Rounds dance dreamily around each other. This is session musicianship at its best. Each watch reveals new depths to the mastery.\n\nSET LIST\n • \"Just Wrong\"\n • \"Ekuté\"\n • \"Djurkel\"\n\nMUSICIANS\n • Pino Palladino: bass\n • Blake Mills: guitar\n • Abe Rounds: percussion\n • Sam Gendel: saxophone\n\nCREDITS\n • Video: Jason Tippet, Carl McLaughlin, Julian Chavez\n • Audio: Joseph Lorge\n\nTINY DESK TEAM\n • Producer: Nikki Birch\n • Video Producer: Kara Frame\n • Audio Mastering: Andy Huether\n • Associate Producer: Bobby Carter\n • Tiny Production Team: Bob Boilen, Maia Stern, Josh Rogosin, Gabrielle Pierre\n • Executive Producer: Keith Jenkins\n • Senior VP, Programming: Anya Grundmann\n\n#tinydesk #pinopalladino #blakemills #nprmusic", "link": "https://www.youtube.com/watch?v=a-V77_moZYw", "date_published": "2021-06-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]