[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Sloppy Jane: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nBob Boilen | November 17, 2021\nSloppy Jane seems to be as much an event as it is a band. And despite 11 instruments — including cello, two violins, viola, two guitars, drums, bass, and a trumpet — crammed into a coffee shop called Porcelain in the Ridgewood neighborhood of Queens, that only represents around half of the musicians on Sloppy Jane's new album. Oh, and I do need to mention that the album, Madison, was recorded with more than 20 people, plus a film crew, in the belly of Lost World Caverns, where they lowered an upright piano into the cave! So, it's safe to say there's nothing casual about the music Haley Dahl, aka Sloppy Jane, makes, and the commitment from her accompanying musicians helps bring these crazy ideas to life.\n\nThe drama in Haley Dahl's voice and body movements emphasize the complex and sometimes disturbing imagery in the songs performed for this Tiny Desk (home) concert. These are all singles from Madison, which Haley described as \"the best ambassadors\" of the record and that \"all the songs on the record are about the same thing: unrequited love and feeling like a monster. These three songs (\"Party Anthem,\" \"Jesus and Your Living Room Floor,\" \"Wilt\") are the most tangible.\"\n\n\nMadison is out now on Phoebe Bridgers' Saddest Factory Records. Phoebe Bridgers was the bass player in Sloppy Jane during her high school days so it's a beautiful circle of friendship that has grown from a then three-piece punk band into this epic mix of emotion and grandeur.\n\nSET LIST\n\"Party Anthem\"\n\"Jesus and Your Living Room Floor\"\n\"Wilt\"\n\nMUSICIANS\nHaley Dahl: vocals\nBailey Wollowitz: drums\nAl Nardo: guitar\nNathan Lopez: guitar\nEmma Stacher: bass\nLily Rothman: piano\nLily Desmond: violin\nRuby Wang: violin\nSean Brennan: cello\nJoshua Gerrard: viola\nTree Palmedo: trumpet\n\nCREDITS\nVideo: Brad Wagner\nAudio: Juan M Soria\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bobby Carter, Kara Frame, Sofie Hernandez-Simeonidis\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #sloppyjane", "link": "https://www.youtube.com/watch?v=-MefNjyFer8", "date_published": "2021-11-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]