[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "The Trouble with Chicken (full documentary) | FRONTLINE", "description": "An investigation into the spread of dangerous pathogens in our meat — particularly poultry — and the challenges facing the food-safety system in stopping the threat. (Aired 2015)\n\nThis journalism is made possible by viewers like you. Support your local PBS station here: http://www.pbs.org/donate​.\n\nIn FRONTLINE’s “The Trouble with Chicken,” correspondent David E. Hoffman investigates how and why the standards and laws around Salmonella have failed to keep up with the increasing danger posed by some strains of the bacteria.The film looks closely at one of the largest Salmonella poultry outbreaks on record, when chicken from Foster Farms sickened more than 600 people over 16 months. Delving into the complex world of food safety, the investigation reveals a seeming contradiction: even though hundreds of people were falling ill, Foster Farms was still meeting the U.S. Department of Agriculture’s (USDA) standards for Salmonella contamination.\n\nLove FRONTLINE? Find us on the PBS Video App, where there are more than 300 FRONTLINE documentaries available to watch any time: https://to.pbs.org/FLVideoApp​ \n\n#Documentary #TroubleWithChicken\n\nSubscribe on YouTube: http://bit.ly/1BycsJW​\nInstagram: https://www.instagram.com/frontlinepbs​\nTwitter: https://twitter.com/frontlinepbs​\nFacebook: https://www.facebook.com/frontline\n\nFunding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Major funding for FRONTLINE is provided by the Ford Foundation. Additional funding is provided by the Abrams Foundation; the John D. and Catherine T. MacArthur Foundation; Park Foundation; and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation, and additional support from Koo and Patricia Yuen.", "link": "https://www.youtube.com/watch?v=tIY7jxd7GAY", "date_published": "2021-11-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]