[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "6 Things The GTA Trilogy Definitive Edition NEEDS To Fix", "description": "Grand Theft Auto’s Definitive Trilogy collection has had a bumpy start into the next generation of gaming. Here’s our list of issues that could use some love to make the experience as smooth and as fun as it was more than a decade ago.\n\nGrand Theft Auto's Definitive Trilogy collection has had a bit of a bumpy start. It's suffering from graphical, audio and gameplay issues across all three titles. In this video Richie Bracamonte breaks down six things Rockstar and Grove Street Games can do to help makes these games as awesome as we remember them. (And more!)\n\nMost of the definitive editions issues seemed to be overlooked as the trilogy transitioned into the Unreal engine. This include old transparency effects, terrifying character models and lighting effects. Other issues didn't occur before, such as de-synched audio, music tracks skipping and problems with aiming, including a glitchy animation for Tommy Verceti when crouched. The  exaggerated rain effect has also made it hard to drive, especially in first-person view. While there appear to big little in the way of game-breaking issues, small upgrades can be made to enhance the general quality of life and gameplay experience. The modding community has already begun making changes, but also have been dealing with Rockstar and Take-Two studios every step of the way.\n\nRemember to subscribe to GameSpot's YouTube page for more GTA coverage including our video about the rough Nintendo Switch port, as well as a collection of bugs and glitches throughout the trilogy.\n\nTimestamps:\n00:31 - Rain\n01:10 - Aiming\n01:45 - Character Models\n02:09 - Mission Briefings MIA\n02:42 - Audio Issues\n03:18 - General Bugginess", "link": "https://www.youtube.com/watch?v=kHsEj52MePE", "date_published": "2021-11-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield  (1942 vs. Portal) El-Alamein Graphics Comparison", "description": "Battlefield 2042 offers a Portal mode, that allows you to dive into some of the classic maps from original Battlefield games such as Battlefield 3, and Bad Company 2. In this video, we take a look at El-Alamein from Battlefield 1942 and compare it with Portal's remaster of the fan favorite map.\n\n#Battlefield2042", "link": "https://www.youtube.com/watch?v=Kbp2ir_ue-U", "date_published": "2021-11-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Grand Theft Auto: The Trilogy -  Should You Play It On Switch?", "description": "GTA: The Trilogy - Definitive Edition is here! And... it's not what anyone was hoping for. While the Grand Theft Auto compilation includes the fantastic GTA 3, GTA: Vice City, and GTA: San Andreas, the GTA Trilogy Definitive Edition port is riddled with bugs and issues.\n\nAll of that asides, if you were to pick up the GTA Trilogy for the Switch as opposed to Xbox or Playstation, is it worth it? How does GTA Trilogy on the Switch compare to the other consoles?", "link": "https://www.youtube.com/watch?v=jgjjdhXMmu8", "date_published": "2021-11-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Grand Theft Auto: The Trilogy Best Bugs and Glitches", "description": "We culled an amazing selection of GTA Trilogy: Definitive Edition bugs and glitches in this action-packed video.  \n\nGTA: The Trilogy — The Definitive Edition contains its share of bugs and glitches. Here's a collection of some of the most captivating bugs from the internet, including freakishly flexible characters, questionable physics, and, of course, cursed CJ.", "link": "https://www.youtube.com/watch?v=4ZeonAbeXpQ", "date_published": "2021-11-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Modders VS GTA ... Bad Timing | GameSpot News", "description": "In this episode of GameSpot News, we talk about Modders Behind GTA Re3 Project Are Fighting Take-Two's Lawsuit, Halo Infinite’s Battle Pass changes, Deathloop Update Adds Controller Remapping and Battlefield 2042 Update Addressing Rubber Banding And Renabling Prox Sensor. \n\nIn this video, DeVante talks about GTA modders fighting against a lawsuit from Take-Two Interactive. The modders were originally sued for their project, Re3, which reverse-engineered the source code for GTA III and GTA: Vice City, allowing the games to run on Nintendo Switch and PlayStation Vita.\n\nDeVante also talks about how Developer 343 Industries is making major changes to the game's battle pass progression system in the wake of a wave of negative feedback about it. These changes include: Halo Infinite players can now earn XP by completing matchmade games. The \"Play 1 Game\" Daily Challenge is worth 50 XP each. The Challenge deck is also being updated to better serve players of all skill levels.\n\nLater in the video, a new Battlefield update, 1 of 3 in the next 30 days, fixes issues plaguing the game. And Deathloop’s 2nd major patch adds controller remapping and makes many NPC changes.\n\nTIME STAMPS\n00:00 - Intro\n00:09 - GTA Modder fight back\n01:58 - Halo Infinite Battle Pass Changes\n02:48 - Battlefield 2042 Update Addresses Issues\n03:18 - Deathloop Patch", "link": "https://www.youtube.com/watch?v=wnzHtQXxeaA", "date_published": "2021-11-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "MultiVersus Official Reveal Trailer", "description": "MultiVersus is a brand-new, free-to-play platform fighter that lets you team up with or against your friends using some of the world’s most iconic characters including Batman, Shaggy, Superman, Bugs Bunny & more.\n\nUse unique co-op abilities, find your favorite fighter combos, and save the Multiverse!\n\nMultiVersus is scheduled for worldwide release in 2022 on PlayStation5 and PlayStation4 consoles, Xbox Series X|S, Xbox One consoles and PC with full cross-play support, dedicated server-based rollback netcode and content-filled seasons. \n\n#Multiversus", "link": "https://www.youtube.com/watch?v=YG7WEltGCIU", "date_published": "2021-11-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Activision Employees Stage Walkout Following Bombshell Bobby Kotick Report | GameSpot News", "description": "In today’s episode of GameSpot News, DeVante talks about the latest update involving Activision Blizzard, the modding community improving the GTA trilogy, and more. \n\nThe first story involves a bombshell report from the Wall Street Journal that covers numerous allegations at Activision Blizzard CEO Bobby Kotick, including that he had knowledge of numerous sexual assault and harassment claims at the company's various studios. In the wake of this, Kotick released an internal video message to staff, but a group of employees are now staging a walkout.\n\nDevante also talks about the GTA modding community taking it upon themselves to make improvements to the Grand Theft Auto: The Trilogy - The Definitive Edition. Outside of fixing visual issues, some modders have also gotten busy restoring the classic feel of The Trilogy's games.\n\nLater in the video, DeVante also covers Far Cry 6, as the game's new Vaas Insanity DLC has launched, alongside new Breaking Bad-inspired cosmetics. November 16 also saw the release of a new Far Cry 6 hotfix that fixes various issues and in addition to the paid content, Far Cry 6 will offer free expansions featuring missions involving Danny Trejo, Stranger Things, and Rambo.\n\nFor more information on all of our topics, please visit gamespot.com.", "link": "https://www.youtube.com/watch?v=45Xk3YU1r_w", "date_published": "2021-11-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 Issues? It's Not Your Fault | GameSpot News", "description": "In this episode of GameSpot News, we talk about Battlefield 2042’s rubber banding issues being investigated by DICE, Saints Row Reboot being delayed to August 2022 and shareholders calling for Activision Blizzard CEO Bobby Kotick to resign.\n\nIn this video, DeVante talks about DICE investigating Battlefield 2042’s rubber banding issues. Rubber banding results in players snapping between two positions on a map, hence the name. It stems from high latency or packet loss, as a player's position in-game desynchronizes with the location the game server has them in.\n\nDeVante also talks about the Saints Row reboot being delayed. Originally scheduled for release on February 25, 2022, the game is now launching six months later, on August 23, 2022.  \n\nLater in the video, shareholders call for Activision Blizzard CEO Bobby Kotick to resign following a report that he knew of misconduct at the company. \n\nTIME STAMPS\n00:00 - Intro\n00:06 - Battlefield 2042 Issues\n01:12 - Saints Row Delayed\n02:12 - Activision Blizzard Update", "link": "https://www.youtube.com/watch?v=kF8r5pBveIY", "date_published": "2021-11-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Brilliant Diamond & Shining Pearl Review-In-Progress", "description": "Pokemon Brilliant Diamond and Shining Pearl are comfortably nostalgic, with just enough modern tweaks to smooth over the rough edges.\n\nNintendo and ILCA's Pokémon Brilliant Diamond & Shining Pearl will be available on Nintendo Switch on November 19, 2021. You can read the full written Pokémon Brilliant Diamond & Shining Pearl review-in-progress by Steve Watts on GameSpot: https://www.gamespot.com/reviews/pokemon-brilliant-diamond-shining-pearl-review-in-progress/1900-6417790/", "link": "https://www.youtube.com/watch?v=tsyXsJvjArM", "date_published": "2021-11-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]