[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Company: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nJosh Rogosin | November 15, 2021\nCompany finally is back on Broadway this week after a 20-month hiatus. There were only nine preview performances before all the theaters in New York went dark during the pandemic. Now the cast celebrates its return with a Tiny Desk performance filmed a few blocks away from the Bernard B. Jacobs Theatre at the CIVILIAN Hotel. It's the 35th birthday celebration for the lead character, Bobbie, but also a reunion for this ensemble.\n\n\"It is incredible to come back to this piece, this masterpiece,\" cast member Matt Doyle explains, \"a show that's about company, about togetherness and most importantly about being alive. This is what we get to do on the other side of this and I'm so honored to be in the room with each and every one of you. ... We're having a party tonight.\"\n\nThe musical comedy Company, written by Stephen Sondheim and George Furth in 1970, was re-conceived by director Marianne Elliot for a critically acclaimed run in London that transferred to Broadway. The big change in this production is that Bobby, the lead character, is played by a woman, Bobbie. The audience is taken on an emotional roller coaster through iconic songs with Katrina Lenk, no stranger to the Tiny Desk, as she tries to find the purpose of being alive. (Ms. Lenk won the Tony for her portrayal of Dina in The Band's Visit )\n\nMy Tiny Desk colleague, Sofie Hernandez-Simeonidis, was one of the lucky few who got to see a preview before it was forced to close:\n\n\"While gender-swapping roles for retro media has been popular for years, it feels different for Company,\" she says \"An intentional choice that emphasizes the social pressure for women to settle down, get married and have kids. The heaviness of that was felt by the audience collectively, but it was deeply emotional in other ways, too. There was laughter, tears, but more than anything, there was celebration.\"\n\nSondheim was interviewed by Stephen Colbert about the revival and confessed \"I don't usually tout my own stuff, but I urge everybody here to see it,\" he said \"You're gonna have such a good time. It's really one of the most entertaining evenings I've ever had in the theatre.\" I'll drink to that.\n\nMUSIC AND LYRICS\nStephen Sondheim\n\nSET LIST\n\"Company\"\n\"Someone is Waiting\"\n\"Another Hundred People\"\n\"You Could Drive A Person Crazy\"\n\nCAST\nKatrina Lenk\nMatt Doyle\nChristopher Fitzgerald\nChristopher Sieber\nJennifer Simard\nTerence Archie\nEtai Benson\nBobby Conte\nNikki Renée Daniels\nClaybourne Elder\nGreg Hildreth\nAnisha Nagarajan\nManu Narayan\nRashidra Scott\n\nBAND\nJoel Fram: music direction\nPaul Staroba: piano\nMichael Blanco: bass\nRich Rosenzweig: drums\n\nCREDITS\nVideo: David Givens, Brandon Ivey, HaiTao Wu\nAudio: Richard Levengood, Ana Fernandez, Tyler Postiglione\nStaging: Gina Rattan\nMusic Coordinator: Howard Joines\nProduction Services: O&M ETC\nVideo Production and Editing: Super Awesome Friends\nCreative Director: Jim Glaub\nDirector of Photography: David Givens\nLine Producer: Rebecca Prowler\nProduction Assistants: Ciera Miller, Jenna Rich, Holly Wasson\nEditor: Jim Glaub\n\nTINY DESK TEAM\nProducer: Josh Rogosin\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Bobby Carter, Kara Frame, Sofie Hernandez-Simeonidis\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #company", "link": "https://www.youtube.com/watch?v=SrYSpLGuKwo", "date_published": "2021-11-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]