[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Dying Light 2 Hands-On Preview", "description": "We got hands-on time with Dying Light 2, the anticipated sequel to 2016's open-world post-apocalyptic game. \n\nThe build Mark Delaney played was about a month old and kicked off in the game's opening region Old Villedor. This was, as lead game designer Tymon Smektala explained it, a tamer region meant to allow players to get to grips with the game's melee combat and parkour moves, and come to understand how to manage crowds of infected and survivors alike.\n\nThe first thing I realized when I started to play Dying Light 2 was how fluid the movement felt. Smart changes like faster strafing and back-pedaling, and an always-on sprint ability, make the anti-hero protagonist Aiden Caldwell feel more adept at performing his death-defying feats than Kyle Crane ever was. He's lighter on his feet and animations are smoother, even from the get-go, and despite me seeing some really tantalizing skills not yet unlocked during my play sessions. I especially loved how quickly I was able to intuit whether or not I could make any particular jump. The mechanics are improved across the board and give the controls a faster, more reliable feeling in my hands. \n\n#DyingLight2", "link": "https://www.youtube.com/watch?v=5Pl-MdM1-i4", "date_published": "2021-11-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Fortnite X Naruto Shippuden Trailer", "description": "Naruto and Team 7 from Naruto Shippuden join the Fortnite Crew.\n\nPlay Fortnite Battle Royale, the completely free 100-player PvP mode. One giant map, A Battle Bus, Last one standing wins.\n\n#Fortnite #Naruto", "link": "https://www.youtube.com/watch?v=wYkDeaCfBQo", "date_published": "2021-11-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Infinite Multiplayer Surprise Launch: Co-Op, Forge Details Coming Soon | GameSpot News", "description": "In this episode of GameSpot News, we talk about Halo Infinite’s Multiplayer beta releasing early, Battlefield 2042 crashing on Xbox Series X, the GTA Trilogy returning to PC and Rainbow Six Extractions post-launch DLC plans. \n\nIn this video, DeVante talks about November 15th’s Xbox 20th Anniversary Celebration and the launch of Halo Infinite’s multiplayer. The shooter’s first season is called Heroes of Reach and will run through May 2, 2022. Alongside Halo, Microsoft announced a new six-part documentary series titled Power On and addition of 70+ original Xbox and Xbox 360 titles to the backwards compatibility library of Xbox One and Xbox Series X|S. \n\nDeVante also talks about Battlefield 2042 running into some issues on Xbox Series X. According to a blog post, DICE will release an update on November 17 to resolve the crashing issues. The update is optional until November 23, when it becomes mandatory.\n\nLater in the video, the GTA Trilogy returns to PC and Ubisoft reveals Rainbow Six Extractions post-launch DLC plans.", "link": "https://www.youtube.com/watch?v=G1X5xjgPmFc", "date_published": "2021-11-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Let's Play Elden Ring | Every Boss Fight in the Closed Network Test", "description": "The Elden Ring's Network Test has wrapped up, and Dave Klein of DaveControl tackled the Elden Ring Network Test on PlayStation 5 to see if he could defeat every Elden Ring boss during the 3 hour time limit of 1 session. Not only that, but what Elden Ring secrets we could find just in this network test alone. Elden Ring releases February 25, 2022. Check out all the timestamps below for a glimpse at all the bosses that the Elden Ring Network Test had to offer.\n\n1:41 - Limgrave\n13:02 - Burial Tree Watchdog\n17:05 - Beastman of Farum Azula\n33:24 - Obtaining Ordovis' Greatsword and the Crucible Set\n41:45 - Pumpkin Head\n45:47 - Stormhill Statue Secret Item\n49:27 - Flying Dragon Agheel\n1:03:40 - Stonedigger Troll\n1:09:58 - Bloody Finger Hunter Yura\n1:20:37 - Grave Warden\n1:23:51 - Bloody Finger Nerijus Invasion\n1:27:02 - Spirit Tracks on the Beach\n1:31:30 - Demi-Human Chief\n1:35:48 - Church of Dragon Communion\n1:40:42 - Bloodhound Knight Darriwil\n1:44:33 - Tree Sentinel\n1:50:21 - Margit the Fell Omen\n1:55:34 - Stormveil Castle Route 1\n1:58:35 - Many Armed Key Master\n2:02:42 - Stormveil Castle Route 2\n2:04:55 - Lion Guardian\n2:12:50 - Soldier of Godrick\n2:14:05 - Giant Flower\n2:19:52 - Bridge Knight Battle\n2:22:40 - Hidden NPC\n2:29:04 - Spiritspring Fun", "link": "https://www.youtube.com/watch?v=jkz9cDmFFe4", "date_published": "2021-11-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Brilliant Diamond & Shining Pearl - Everything To Know", "description": "With Pokémon Brilliant Diamond and Shining Pearl's November 19th release date right around the corner, here is everything you need to know about these Nintendo DS remakes.\n\nNearly 15 years after their original release, Pokémon Diamond and Pearl are coming to Nintendo Switch as Brilliant Diamond and Shining Pearl. And like other Pokémon remakes before them, these two games update the classic DS versions with some modern features. \n\nIn this video, we share everything you need to know about Pokémon Brilliant Diamond and Shining Pearl. From the new Grand Underground to modern additions such as autosave, experience sharing and more. \n\nPokémon Brilliant Diamond and Shining Pearl launch exclusively for Nintendo Switch on November 19, 2021.", "link": "https://www.youtube.com/watch?v=6A0p7d16f5c", "date_published": "2021-11-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Infinite Multiplayer Surprise Drop Livestream", "description": "Surprise! Halo Infinite's multiplayer has dropped a few weeks earlier than expected, so let's check it out.", "link": "https://www.youtube.com/watch?v=qkIOEvQt7hE", "date_published": "2021-11-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Infinite | Season 1 Multiplayer - Heroes of Reach Launch Trailer", "description": "Check out the Halo Infinite Season 1 launch trailer, Heroes of Reach. Halo Infinite multiplayer season 1 dropped early on November 15th at the conclusion of Xbox's 20th anniversary stream.\n\n#HaloInfinite", "link": "https://www.youtube.com/watch?v=rA9k-vnr9dM", "date_published": "2021-11-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Outriders New Horizon Update Full Presentation", "description": "During this Outriders Broadcast we learn what updates the team from People Can Fly have been working on. We get more information on the upcoming update, as well as a new expansion coming in 2022. The biggest changes are coming to Expeditions which will no longer be timed. Now players can try different builds without fear of failing the timed Expeditions. Additionally, there will be new Expeditions coming as well for players to experience in Outriders. Legendary Drop rates have also seen a buff, and there will be additional ways to try to help you get the Legendary you're missing.\n\n#Outriders", "link": "https://www.youtube.com/watch?v=iw7D-HIIPPU", "date_published": "2021-11-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Brilliant Diamond & Pokémon Shining Pearl - Overview Trailer", "description": "Check out the Pokemon Brilliant Diamond & Shining Pearl overview trailer coming to Nintendo Switch!", "link": "https://www.youtube.com/watch?v=KYlSjtdRcXM", "date_published": "2021-11-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Xbox 20th Anniversary Celebration Full Presentation", "description": "Check out the 20th Anniversary celebration for Xbox which paid honor to some of Xbox's history  as well as dropping the release of Halo Infinite season 1 multiplayer.", "link": "https://www.youtube.com/watch?v=dUAtrRxjPqQ", "date_published": "2021-11-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Xbox 20th Anniversary Celebration Livestream", "description": "Tune in Nov. 15 at 10am PT for a 20th anniversary celebration of Xbox and Halo.\n\nXbox has confirmed there will be no announcements of new games and instead will focus on looking back at 20 years of Xbox.", "link": "https://www.youtube.com/watch?v=kZBzBXYUMIQ", "date_published": "2021-11-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]