[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCHnyfMqiRRG1u-2MsSQLbXA", "title": "The Universe is Hostile to Computers", "description": "Tiny particles from distant galaxies have caused plane accidents, election interference and game glitches. This video is sponsored by Brilliant. The first 200 people to sign up via https://brilliant.org/veritasium get 20% off a yearly subscription.\n\nThis video was inspired by the RadioLab Podcast \"Bit Flip\" https://ve42.co/BF -- they're brilliant science storytellers.\n\nA Huge thanks to Dr Leif Scheick, Calla Cofield and the JPL Media Relations Team.\n\nThanks to Col Chris Hadfield. Check out his book: https://chrishadfield.ca/books/\n\n▀▀▀\nReferences:\nJ. F. Ziegler, \"Terrestrial cosmic rays,\" in IBM Journal of Research and Development, vol. 40, no. 1, pp. 19-39, Jan. 1996, doi: 10.1147/rd.401.0019. -- https://ve42.co/Ziegler1996\n\nD. Binder, E. C. Smith and A. B. Holman, \"Satellite Anomalies from Galactic Cosmic Rays,\" in IEEE Transactions on Nuclear Science, vol. 22, no. 6, pp. 2675-2680, Dec. 1975, doi: 10.1109/TNS.1975.4328188 https://ve42.co/Binder1975\n\nZiegler, J. F., & Lanford, W. A. (1979). Effect of cosmic rays on computer memories. Science, 206(4420), 776-788 https://ve42.co/Ziegler1979\n\nDrury, L. O. C. (2012). Origin of cosmic rays. Astroparticle Physics, 39, 52-60. https://ve42.co/Drury2012\n\nHess, V. (2018). On the observations of the penetrating radiation during seven balloon flights. arXiv preprint arXiv:1808.02927. --https://ve42.co/Hess2018\n\nCarlson, P., & De Angelis, A. (2011). Nationalism and internationalism in science: the case of the discovery of cosmic rays. The European Physical Journal H, 35(4), 309-329. -- https://ve42.co/Carlson2011\n\nHöeffgen, S. K., Metzger, S., & Steffens, M. (2020). Investigating the effects of cosmic rays on space electronics. Frontiers in Physics, 8, 318. -- https://ve42.co/Hoeffgen2020\n\nEdmonds, L. D., Barnes, C. E., & Scheick, L. Z. (2000). An introduction to space radiation effects on microelectronics. Jet Propulsion Laboratory, National Aeronautics and Space Administration. -- https://ve42.co/Edmonds2000\n\nNASA Mars 2020 website covering the specifications of the Perseverance Rover https://ve42.co/RoverBrains\n\nAustralian Government Australian Transport Safety Bureau report on QF72 -- https://ve42.co/ASTBQantas\n\nAustralian Government Australian Transport Safety Bureau summary on QF72 --https://ve42.co/ASTBQantas2\n\nGreat Blog post about QF72 -- https://ve42.co/DempseyQantas\n\nMichael Barr's report on the Toyota acceleration issue --https://ve42.co/Barr2015\n\nNASA's Report on Toyota -- https://ve42.co/NASAToyota\n\nT. C. May and M. H. Woods, \"A New Physical Mechanism for Soft Errors in Dynamic Memories,\" 16th International Reliability Physics Symposium, 1978, pp. 33-40, doi: 10.1109/IRPS.1978.362815. --https://ve42.co/May1978\n\nP. M. O'Neill and G. D. Badhwar, \"Single event upsets for Space Shuttle flights of new general purpose computer memory devices,\" in IEEE Transactions on Nuclear Science, vol. 41, no. 5, pp. 1755-1764, Oct. 1994, doi: 10.1109/23.317386. -- https://ve42.co/ONeill1994\n\nWikipedia about radiation hardening -- https://ve42.co/RadHardening\n\nToward Monitoring Fault-Tolerant Embedded\nSystems (Extended Abstract) -- https://ve42.co/Goodloe2009\n\nArticle about speed run -- https://ve42.co/BurttSpeedrun\n\nArticle about speed run -- https://ve42.co/BountySpeedrun\n\nArticle about redundant systems in spaceflight -- https://ve42.co/NASAComputers\n\nArticle about the PowerPC750 -- https://ve42.co/Wener-FlignerNASA\n\nFuglesang C, Narici L, Picozza P, Sannita WG. Phosphenes in low earth orbit: survey responses from 59 astronauts. Aviat Space Environ Med. 2006 Apr;77(4):449-52. PMID: 16676658. -- https://ve42.co/Fuglesang2006\n\nGood article about Cosmic Rays causing flashes -- https://ve42.co/AtkinsonEye\n\nGood article about radiation resistance -- https://ve42.co/RoverResistance\n\nSpecial thanks to Patreon supporters: Paul Peijzel, Juan Benet, Ruslan Khroma, Richard Sundvall, Lee Redden, Sam Lutfi, MJP, Gnare, Nick DiCandilo, Dave Kircher, Edward Larsen, Burt Humburg, Blake Byers, Dumky, Mike Tung, Evgeny Skvortsov, Meekay, Ismail Öncü Usta, Paul Peijzel, Crated Comments, Anna, Mac Malkawi, Michael Schneider, Oleksii Leonov, Jim Osmun, Tyson McDowell, Ludovic Robillard, Jim buckmaster, fanime96, Juan Benet, Ruslan Khroma, Robert Blum, Richard Sundvall, Lee Redden, Vincent, Marinus Kuivenhoven, Alfred Wallace, Arjun Chakroborty, Joar Wandborg, Clayton Greenwell, Pindex, Michael Krugman, Cy 'kkm' K'Nelson, Sam Lutfi, Ron Neal \n\nWritten by Derek Muller and Petr Lebedev\nAnimation by Ivy Tello, Mike Radjabov, Fabio Albertelli, Jakub Misiek and Charlie Davies\nSFX by Shaun Clifford\nFilmed by Derek Muller, Raquel Nuno, and Emily Zhang\nEdited by Derek Muller and Petr Lebedev\nSFX by Shaun Clifford\nAdditional video supplied by Getty Images\nRover Footage From  NASA/JPL-Caltech\nQF72 footage from the Smithsonian channel https://youtu.be/H3q5S9PCoJA\nSM64 footage from https://ve42.co/pannenkoek2012\nMusic from Epidemic Sound\nProduced by Derek Muller, Petr Lebedev and Emily Zhang", "link": "https://www.youtube.com/watch?v=AaZ_RSt0KP8", "date_published": "2021-08-31 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]