[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "18 Minutes of Far Cry 6 Co-Op Gameplay", "description": "While Far Cry 6 releases November 7th, we were able to get our hands on it a little early. Check out our hands-on footage of a few co-op missions including defending a bloodthirsty chicken and sneaking around a cargo ship to help hostages onboard.\n\nFar Cry 6 will be releasing on Amazon Luna, Microsoft Windows, PlayStation 4, PlayStation 5, Xbox One, Xbox Series X/S, and Stadia.\n\n#farcry6", "link": "https://www.youtube.com/watch?v=YCN7AF3b4GA", "date_published": "2021-08-31 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "CD Projekt Red Hires Community Modders To Help Cyberpunk2077 | GameSpot News", "description": "Persia talks about today’s latest gaming news. CD Projekt Red is bringing in Yigsoft, the community modding team behind WolvenKit, to help Cyberpunk 2077 and we got our first look at the cast of Welcome to Raccoon City courtesy of images from IGN. We also get to check out the new Dead Space tomorrow for the first time and the Halo: Master Chief Collection’s next Beta is adding some quality of life improvements for PC players.\n\nIn this video, Persia talks about today’s latest gaming news. CD Projekt Red is bringing members of Cyberpunk 2077’s modding community onboard to work on backend Cyberpunk 2077 projects and modding support. The news spread on Twitter after a screenshot of the announcement from the team’s discord was shared online but we’ve yet to hear any official word from CD Projekt Red at this time.\n\nThe three images reveal the new actors for the live-action movie: Kaya Scodelario as Claire Redfield, Avan Jogia as Leon Kennedy, Tom Hopper as Albert Wesker, Nathan Dales as Brad Vickers, Hannah John-Kamen as Jill Valentine, and Robbie Amell as Chris Redfield. The images also revealed Marina Mazepa who will be playing Lisa Trevor. Welcome to Raccoon City comes out in theaters on November 24.\n\nEA will reveal more details on Motive Studio's new Dead Space remake as part of a Livestream event tomorrow on Motive Studio’s Twitch channel. The wording here suggests the presentation won't be the type of showcase that could be expected closer to a game's release, which makes sense given the Dead Space remake isn't expected to release until the end of 2022 at the soonest. The stream begins at 10AM PT and you can view it live on youtube.com/gamespot.\n\nHalo: MCC’s File Share, Game Browser, and more are heading to the next Beta for Season 8 and will improve the quality of life for PC Players. File sharing on PC will arrive with everything players should expect and \"trust levels,\" which can be set for other players. \n\nThe custom games browser will cover not only Halo: Reach, but also Halo: Combat Evolved and Halo 3. This version of the browser will also come with numerous quality of life improvements, including better search functions, filters, and changes to sub-menus.\n\nWhen Season 8 for Halo: The Master Chief Collection launches this week, players will also get to play a brand new map for Halo 3. The map, titled Icebox, is a remake of the Halo 2 map Turf.", "link": "https://www.youtube.com/watch?v=tsrp5L4bq14", "date_published": "2021-08-31 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Dead Space Remake Developer Breakdown", "description": "Join hosts Kahlief Adams and Jackie Butler as they chat with the devs at Motive Studios to learn more about the Dead Space Remake and ask some burning questions from the community.\n\nLearn more from Motive Studios developers on the remake for Dead Space. They breakdown some of the mechanics and how they are building the game. Philippe Ducharme and Roman Campos-Oriola breakdown of how flesh, and limbs are torn off in combat and more. \n\n#deadspace #motivestudios", "link": "https://www.youtube.com/watch?v=llhV-T4dDwI", "date_published": "2021-08-31 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Dead Space Remake Developer Livestream", "description": "Tune in at 10am PT for an early look at the development for Dead Space with the team at Motive Studio.\n\n#deadspace", "link": "https://www.youtube.com/watch?v=4wjPk_DEKRk", "date_published": "2021-08-31 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Far Cry 6 Xbox Series X Gameplay Livestream", "description": "Tune in tomorrow, August 31st at 9am PT to get a first look at Far Cry 6 gameplay on the Xbox Series X with the UbiNews crew!\n\n#farcry6", "link": "https://www.youtube.com/watch?v=I3L38LvnQaM", "date_published": "2021-08-31 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Hearthstone Mercenaries Gameplay Showcase Livestream", "description": "Tune in at 9:15am PT for a gameplay demonstration of Hearthstone Mercenaries featuring members of the dev team.\n\n#hearthstone #hearthstonemercenaries", "link": "https://www.youtube.com/watch?v=bnMilN4swok", "date_published": "2021-08-31 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "We Played 5 Hours Of Far Cry 6", "description": "Far Cry 6 releases in October, and we recently played for five hours. Here’s how we felt about the island of Yara and our time with Amigos, Supremos, and Resolver weapons. \n\nFar Cry 6 attempts to make the island of Yara as much of a character as the brutal dictator ruling over it: Anton Castillo, played by famed actor Giancarlo Esposito. We recently got to play a five-hour hands-on preview of Far Cry 6 and were able to experience a lot of the game’s main systems, including Amigos, Supremos, and Resolver weapons. Our time included gun modding and customization, taking down checkpoints and bases, driving around in tanks, and recruiting a bloodthirsty rooster named Chiccharon.\n\nIn this video, we go in-depth on how Far Cry 6 could form its own identity while using familiar Far Cry mechanics, what the new open-world feels like when players can wield Supremos, which are basically super-abilities, and how the game might avoid getting too repetitive. We also managed to get in a few co-op missions and experienced how the game’s gear and level systems play when you have a friend with you. Overall, Far Cry 6 tries to elevate its story above a mere shooting gallery by tapping into the themes of real-world revolutions.\n\nFar Cry 6 releases October 7 on Xbox One, Xbox Series X/S, PlayStation 4, PlayStation 5, and PC.\n\n#farcry6 #farycry6preview", "link": "https://www.youtube.com/watch?v=WfwQeAYO-bk", "date_published": "2021-08-31 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Evolution of Halo's Magnum in PvP", "description": "From Combat Evolved to Halo Infinite PvP, the pistol has changed many times over the years. In this video, we look at the evolution of the iconic Magnum throughout every Halo game in the series.\n\nIn this video, Persia takes a trip through memory lane by revisiting every Halo to take a closer look at how the Magnum has evolved throughout the last two decades in PvP. From Halo: Combat Evolved to Halo Infinite, the Magnum goes through quite the rollercoaster of changes and tweaks. After the Halo Infinite Technical Preview, there is a little more insight on where the newest iteration of the Magnum is heading and how it stands against its predecessors.\n\nPersia also talks about other various factors like the scopeless days of the Magnum in Halo 2 and Halo 3 courtesy of dual-wielding and even how other mechanics in titles such as Halo 4's removal of the descope hindered the Magnum's overall performance. It can be interesting to see how the Magnum had to adjust to every new idea introduced to the series with each new title.\n\nHalo Infinite releases is set to release during the 2021 Holiday Season but you can play future technical previews by signing up for the Halo Insider program on HaloWaypoint.com\n\n#haloinfitite #halo", "link": "https://www.youtube.com/watch?v=mWjzXTszy6E", "date_published": "2021-08-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]