[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Little Simz: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nBobby Carter | August 31, 2021\nA lot has happened since we last saw Little Simz at the Tiny Desk in 2017. Her stock as an actress has risen thanks to her role on the Drake-pushed reboot of Top Boy on Netflix; her 2019 album, Grey Area, made plenty of best-of-the-year lists, and the London native received the prestigious Pioneer Award at last year's AIM Awards.\n\nFor her Tiny Desk home concert Simz beamed to us from a more modest setting than all of that might imply: a living room, dropped inside a void. But it's an appropriate space for Simz to introduce her self-searching new album, Sometimes I Might Be Introvert. That arc is pulled together here by a proficient group of players interpreting the relaxed sound of producer Inflo (who is on a run like few in the game at the moment – see Sault and Cleo Sol.) They open with the pulsing military drum and grandiose keys of the record's title track, closing with the bounce and sway of \"Woman,\" dedicated to her mom. Between, a brutally honest message for her father, \"I Love You, I Hate You,\" and a premiere of the Afrobeat bop \"Point and Kill,\" featuring fellow London-based artist Obongjayar.\n\nSET LIST\n\"Introvert\"\n\"I Love You, I Hate You\"\n\"Point and Kill\" (featuring Obongjayar)\n\"Woman\"\nMUSICIANS\n\nLittle Simz: vocals\nKadeem 'Kadz Keyz' Clarke: keys\nOsiris 'OTG' Wilson: vocals, percussion, DJ\nEmanuel J Burton: drums\nKenan Shepherd: bass\nChrio Blake: guitar\nObongjayar: vocals\nOlivia 'Livi Lovez' Williams: vocals\nLadonna Young: vocals\nRachael 'Chella Mac' Mckenzie: vocals\n\nCREDITS\nVideo: Jeremy Cole, Neicee Oakley, Untold Studios\nAudio: Claudio Cueni\n\nTINY DESK TEAM\nProducer: Bobby Carter\nVideo Producer: Maia Stern\nAudio Mastering: Andy Huether\nTiny Production Team: Bob Boilen, Kara Frame, Josh Rogosin, Gabrielle Pierre\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #littlesimz", "link": "https://www.youtube.com/watch?v=Nkt93coQzqg", "date_published": "2021-08-31 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]