[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "GNOME 40 - The biggest update to GNOME since GNOME 3, and probably the best one", "description": "Visit https://www.linode.com/linuxexperiment for a 100$ credit on your new Linode account!\n\nThe latest release of GNOME is here, and it moves away from the usual naming convention: no GNOME 3.40, it's just GNOME 40. This release is one of the biggest in recent years, and a lot has changed, so let's take a look at what's new.\n\nBecome a channel member to get access to a weekly patroncast and vote on the next topics I'll cover:\nhttps://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nSupport the channel on Patreon: \nhttps://www.patreon.com/thelinuxexperiment\n\nFollow me on Twitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\nFollow me on LBRY: https://lbry.tv/@TheLinuxExperiment:e\n\nThe Linux Experiment merch: get your goodies there! https://teespring.com/en-GB/stores/the-linux-experiment\n\n## GNOME Shell\nThe workspaces have moved from the left side of the screen to a horizontal line, just like on elementary OS's multitasking view. The dock is also now on the bottom of the screen instead of on the left side.\nThis change makes a lot of sense to me: it's way easier to understand where each window is, and on which workspace, and these workspaces are now a lot more visible and discoverable. The redesign comes with new trackpad gestures as well, with 3 finger swipes allowing for easy navigation around the activities view.\n\nIf you prefer using keyboard shortcuts, you can use Super to open the overview, and Super + Alt + left or right to navigate workspaces.\n\nFinally, you can even configure this view for multiple monitors, to have the workspace switcher on all of your displays, thanks to a settings key.\n\nAs per the app grid, it also now scrolls horizontally instead of vertically, and labels for applications can now sit on multiple lines instead of being truncated.\n\nSpeaking of the dock, it has changed a bit as well: your favorite shortcuts are now separated from the apps that are running but aren't in your favorites, there is a separator between them, and of course, you can drag the apps to the favorites side of the dock to add them there.\n\nThe shell has also seen some touch ups visually, with a new pill style when you click elements in the top bar.\n\n## Apps\n\nThe file manager, Nautilus, now has the ability to show a \"creation date\" column in the list view, by right clicking on the column header, and this column can be used to sort the files. It can also autocomplete when you're typing a path in the URL bar.\n\nThe Nautilus preferences have also been redesigned, and have a more understandable layout.\n\nWhen you rename a file in Nautilus, if the name conflicts with an existing file, it will offer an alternative name. You will also be able to extract password protected archives directly from Nautilus, which is cool.\n\nYou can choose whether to run or edit a script file, in the right click menu: you now get to choose if you want to run a script file, and it will open in a terminal so you can look at the output.\n\nIn GNOME Software, the update reminders won't be visible as often, to avoid nagging you too much. Critical updates will still generate reminders, but will also be more clearly identified.\n\nOn the homepage, the carousel of apps will now automatically cycle between apps, and respond to swipe gestures using the trackpad.\nOn app pages, you'll also have a new version history dialog to look at the various updates an app has received.\n\nEpiphany, or GNOME Web if you prefer, has received a new application icon, and brand new tabs. This new tab widget will allow for way better control, like pinning tabs, seeing which tabs require action, allowing to mute them, see which one play audio...\n\nEpiphany also has experimental WebExtensions support, which means it might soon have access to a LOT of various extensions.\n\nGnome Web will also support Google suggestions when typing in the URL bar, but don't worry, it's disabled by default, and can be enabled using a toggle in the preferences.\n\nGNOME Maps now has a redesigned \"places\" card, in desktop and in mobile view, with more information, a better layout, and a sensible behavior on mobile devices, with a smaller card popping up from the bottom of the screen, that expands when clicked.\n\nTo complete this roundup, GNOME Weather has received a whole new interface.\n\n## Settings\n\nThe settings have also received some attention in GNOME 40:\nFirst, the input settings have been moved from the region and language settings to the keyboard settings.\nThe keyboard shortcut settings have also been improved, with smaller shortcut groups to help you find what you're looking, and this is nicely supplemented by a revamped search which should help as well.\nYou can now also enable the compose key.\n\nThe wifi settings have also been improved, with a revamped sorting method for the various networks you detect.", "link": "https://www.youtube.com/watch?v=eV2KNvtejJw", "date_published": "2021-03-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]