[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCl2mFZoRqjw_ELax4Yisf6w", "title": "Not financial advice bike ride.", "description": "https://tinyurl.com/rossmatrix\nLet's get Right to Repair passed! https://gofund.me/1cba2545\nGetting into stocks to make money when you're broke, IMO, only makes sense if you are working to develop good habits for the future. So long as you are being honest with yourself. \n\nStuff I recorded this video with(you can copy & paste the links if they don't work)\n🔵 DJI Action 4K: https://amzn.to/3aI5dqa\n🔵 DPA 4066: https://amzn.to/3dCbZhJ (my favorite mic, wait for it to show up on eBay for $150-$200 broken and easily fixable it always does)\n🔵 Zoom H1n: https://amzn.to/2Y44HwF (this works amazingly well)\n\n\nWe are not financial services or investment professionals and this is not investment advice. Do your own Research\nOur content is intended to be used and must be used for entertainment purposes only. It is very important to do your own analysis before making any investment based on your own personal circumstances. You should take independent financial advice from a professional in connection with, or independently research and verify, any information that you find in these videos and wish to rely upon, whether for the purpose of making an investment decision or otherwise.\n\nNo Investment Advice\nOur Youtube channel is an opinion/podcast platform. We are not a broker/dealer, we are not an investment advisor, we have no access to non-public information about publicly traded companies, and this is not a place for the giving or receiving of financial advice, advice concerning investment decisions or tax or legal advice. We are not regulated by the Financial Services Authority.\n\nThe value of shares and investments and the income derived from them can go down as well as up;\nInvestors may not get back the amount they invested - losing one's shirt is a real risk;\nPast performance is not a guide to future performance.", "link": "https://www.youtube.com/watch?v=mH0fOR5N4Lo", "date_published": "2021-03-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]