[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Chivalry II - Closed Beta Siege & Battle Gameplay", "description": "Chivalry 2 is shaping up to be a intense, brutal and rather silly take on medieval siege warfare and open field battles. All of which can be fought through as multiple classes with a slew of weapons to dismember and decapitate. \n\nWe played some of the closed beta over the weekend, taking the the field in massive sieges, and in team deathmatch tournaments. Fingers crossed we can take on more knights and archers again in another beta event before the June 8 release date.", "link": "https://www.youtube.com/watch?v=PwhryaUgaU8", "date_published": "2021-04-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "History Of Mass Effect", "description": "With the upcoming launch of Mass Effect Legendary Edition, we decided to update and expand our look back at one of the greatest game series of all time.\n\nFew video game franchises are as revered as BioWare's Mass Effect. When the first game launched in 2007 for the Xbox 360, players were taken aback by this bold new sci-fi universe, which was filled to the brim with choice and consequence, intriguing characters, intergalactic politics, and of course, romance. Over the years, it's certainly had its ups and downs, from the iconic Suicide Mission in Mass Effect 2 to the divisive ending of Mass Effect 3. \n\nWith the impending launch of the Mass Effect Legendary Edition—a remaster of the original trilogy—we thought it was time to revisit our look back at the franchise, made before the release of Andromeda, and modernize it too. We've updated the video to include the fallout from Andromeda, the existence of the Legendary Edition, and the announcement of a brand new Mass Effect, which BioWare is currently working on. \n\nFor more Mass Effect, including an in-depth look at the creation of the Suicide Mission from BioWare's Mac Walters, make sure to like this video and subscribe to GameSpot at youtube.com/gamespot. Mass Effect Legendary Edition launches on May 14 on PS4, Xbox One, and PC.", "link": "https://www.youtube.com/watch?v=ngkFTObFvj8", "date_published": "2021-04-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Apex Legends Legacy Preview", "description": "After going hands-on with Apex Legends Legacy, Persia, Jordan, and Max sat down to talk about Season 9's Arenas mode, new playable legend Valkyrie, Bocek Bow weapon, Olympus map changes, and more.", "link": "https://www.youtube.com/watch?v=Wo9CSF9Ff0w", "date_published": "2021-04-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Apex Legends – Legacy Gameplay Trailer", "description": "Check out the all new Apex Legends - Legacy Gameplay trailer showing off some of the new features, modes, and weapons coming to Apex Legends - Legacy! Apex Legends - Legacy follows season 8 of the popular battle royale title! \n\n#ApexLegends #Legacy", "link": "https://www.youtube.com/watch?v=iol6Qs3uHs8", "date_published": "2021-04-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Dying Light 2 - Developer Ask Me Anything", "description": "The developers behind Dying Light 2 just released an ask me anything taking a look at all the questions from fans after the most recent Dying Light 2 update! \n\nDying Light 2 is the long-awaited sequel to Dying Light and this is the first episode of the developers breaking down some of your most asked questions! \n\n#DyingLight2 #DyingLight #Techland", "link": "https://www.youtube.com/watch?v=GgrR018SXbQ", "date_published": "2021-04-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Fortnite - Neymar Jr. Outfit Cinematic Reveal Trailer", "description": "Check out the official Fortnite Neymar Jr. outfit cinematic reveal trailer! This marks the first official entrance of a full real-life athlete skin entering Fortnite Battle Royale! \n\n#Fortnite #Neymar", "link": "https://www.youtube.com/watch?v=4Rg2otpUf3A", "date_published": "2021-04-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]