[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "UK Omicron emergency announced", "description": "Omicron emergency\n\nhttps://www.bbc.co.uk/news/uk-59631570\n\nNo one should be in any doubt, there is a tidal wave of Omicron coming\n\nIt is now clear that two doses of vaccine are simply not enough to give the level of protection we all need. \n\nBut the good news is that our scientists are confident that with a third dose, a booster dose, we can all bring our level of protection back up\n\nAt this point our scientists cannot say that Omicron is less severe\n\na wave of Omicron through a population that was not boosted would risk a level of hospitalisation that could overwhelm our NHS and lead sadly to very many deaths\n\nAged 18 and over, in England, third jabs from this week\nThree months since second dose\n\nA third booster dose prevents around 75% of people getting any Covid symptoms from Omicron\n\nLive data, hospital patients who have tested positive\n\nhttps://www.nicd.ac.za/diseases-a-z-index/disease-index-covid-19/surveillance-reports/daily-hospital-surveillance-datcov-report/\n\nOmicron cases have now been found in hospital\n\nNadhim Zahawi\n\nWarned of the danger of tens of thousands of hospitalisations,\n\neven if omicron were to prove half as severe as delta\n\nSARS-CoV-2 variants of concern and variants under investigation in England \n\nTechnical briefing 31 \n\nhttps://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1040076/Technical_Briefing_31.pdf\n\nData cut off, 6 December\n\n260 confirmed cases of Omicron VOC-21NOV-01 (B.1.1.529), \n\nIdentified through sequencing or genotyping in England. \n\nAdditional possible cases identified through S gene target failure\n\nHigher risk of transmission from secondary attack rates\n\nRisk of household transmission from an Omicron index case compared to a Delta index case 3.2 \n\nRisk of a close contact becoming a secondary case, adjusted odds ratio 2.09\n\nHousehold secondary attack\n\nOmicron, 21.6%\n\nDelta, 10.7% \n\nThree to eight-fold increased risk of reinfection with the Omicron variant. \n\nA 20 to 40-fold reduction in neutralising activity by Pfizer 2-dose vaccinee sera for Omicron\n\nAt least 10 fold loss of activity when compared to Delta\n\nGreater reduction in activity was seen for AZ 2- dose sera\n\nAn mRNA booster dose resulted in an increase in neutralising activity irrespective of primary vaccination type\n\nData are urgently required on the durability of neutralising activity \n\nA moderate to high vaccine effectiveness of 70 to 75% is seen in the early period after a booster dose. \n\nWith previous variants, vaccine effectiveness against severe disease, has been higher than effectiveness against mild disease\n \nLateral flow, similar sensitivity to detect Omicron compared to Delta\n\nModelling the potential consequences of the Omicron SARS-CoV-2 variant in England\n\nhttps://cmmid.github.io/topics/covid19/omicron-england.html\n\nhttps://www.bbc.co.uk/news/uk-59621029\n\nGrowth rate of the Omicron variant\n\nLevel of immune escape\n\nIntrinsic transmissibility\n\nImmune escape of Omicron\n\n5.1-fold to 12.8-fold reduction in neutralisation relative to Delta\n\nIntrinsic transmissibility\n\nOmicron variant is growing in England at an exponential growth rate of r = 0.29 per day\n\nThis corresponds to a 2.4-day doubling time\n\nReproduction number Rt = 4.0\n\nGeneration interval of 5.5 days\n\nSurge in SARS-CoV-2 transmission beginning in late December 2021\n\nInfections exceeding peak levels recorded during the January 2021 wave in England\n\nThe most optimistic scenario, 1 December to 30 April in England\n\nOmicron has low immune escape and booster jabs are highly effective\n\n20.9 million infections\n\n175,000 hospital admissions\n\n24,700 deaths\n\nMost pessimistic scenario, 1 December and 30 April in England\n\n34.2 million infections\n\n492,000 hospital admissions\n\n74,900 deaths\n\nConclusions and discussion \nWithout the implementation of further control measures,\nhospital admissions resulting from the Omicron wave of transmission,\ncould exceed the peak levels recorded in England during the previous winter wave in 2020-2021\nIn populations with high levels of immunity such as England and South Africa\nOmicron variant has the potential to cause significant disruption\nIn populations with low levels of immunity such Africa\nOmicron may or may not out compete delta\n\nLink to free download of my 2 textbooks\nhttp://159.69.48.3/\n\nCampbell's Pathophysiology Notes, Amazon orders for the UK, https://www.amazon.co.uk/dp/B012HWC8SU/ref=cm_sw_em_r_mt_dp_AYC5Q7G3H2B3T4BCHQY0\n\nCampbell's Physiology Notes \nhttps://www.amazon.co.uk/dp/0955379725/ref=cm_sw_em_r_mt_dp_K0MXMAP26Y77TY4J90FB", "link": "https://www.youtube.com/watch?v=XteixwzvNtc", "date_published": "2021-12-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Good fortune with omicron", "description": "South Africa, as of 4th December, R = 2.5\n\nhttps://www.nicd.ac.za/diseases-a-z-index/disease-index-covid-19/surveillance-reports/covid-19-special-reports/the-initial-and-daily-covid-19-effective-reproductive-number-in-south-africa/\n\nhttps://www.nicd.ac.za\nhttps://www.nicd.ac.za/diseases-a-z-index/disease-index-covid-19/surveillance-reports/\n\nhttps://www.nicd.ac.za/diseases-a-z-index/disease-index-covid-19/surveillance-reports/weekly-epidemiological-brief/\n\nhttps://www.dailymaverick.co.za/article/2021-12-08-covid-19-symptoms-now-are-far-milder-than-in-the-first-three-waves-says-netcare-ceo/\n\nThe National Institute for Communicable Diseases\n\nThe percentage of positive tests nationally:\n\n24.9% (16.4%) higher than last week\n\nGauteng, 35%\n\nLimpopo, 32.7%\n\nMpumalanga, 26.9%\n\nNorth West, 26.0%\n\nFree State, Western Cape and KwaZulu-Natal, 10% to 15%\n\nEastern Cape and Northern Cape, less than 10%\n\nDr Richard Friedland, chief executive officer Netcare\n\nhttps://www.netcare.co.za\n\nOmicron variant data, Covid-19 symptoms now are far milder than the first three waves\n\nHaving personally seen many of our patients across our Gauteng hospitals,\n\n their symptoms are far milder than anything we experienced during the first three waves\n\nApproximately 90% of Covid-19 patients currently in our hospitals require no form of oxygen therapy,\n\nand are considered incidental cases. \n\nIf this trend continues, it would appear that, with a few exceptions of those requiring tertiary care,\n\nthe fourth wave can be adequately treated at a primary care level\n\nIn the first three waves\n\nNetcare, across 49 acute-care hospitals\n\nTreated 126,000 Covid-19 patients, \n\nof whom,\n\n44% required admission\n\n26% required DC or ICU\n\nSignificantly, all Covid-19 patients admitted were sick and required some form of oxygen therapy. \n\nThe high admission rate, as well as the high percentage of patients requiring ICU or high care is indicative of the severity of cases during the first three waves\n\nNow\n\n337 Covid-19 positive patients admitted\n\n(72% of these patients are in the Gauteng area and 18% in KwaZulu-Natal)\n\nOf these 337,\n\nApproximately 10% are on some form of oxygenation\n\nversus 100% in the first three waves\n\nEight of 337 (2%) are being ventilated of these, \n\ntwo are primary trauma cases\n\nDuring the first three waves\n\nWhen the overall community positivity rate breached 26% across South Africa\n\nFirst wave admissions\n2,000\n\nSecond wave admissions\n2,500\n\nThird wave admissions\n3,000\n\nFourth (omicron) wave admissions\n337\n\nOf the patients admitted to Netcare hospitals and facilities since 15 November\n\n75% not vaccinated\n\nSeven deaths in Netcare facilities due to Covid-19 complications\n\nAge distribution of patients\n\nCovid-19 patients admitted since 15 November are on average younger than those seen during the first three waves,\n\n71% being 50 years\n\nAverage age of 38.5 years\n\nPatients presentations\n\nMild to moderate flu-like symptoms\n\nBlocked or runny nose\n\nHeadache\n\nScratchy or sore throat\n\nIt is our considered view at this early stage that, \nshould this trend continue, \n\nCovid-19 may be effectively managed at a primary care level, \n\nwith the exception of certain cases requiring admission to tertiary facilities\n\nDr Fareed Abdullah, Office of Aids and TB Research, SA Medical Research Council\n\n80% of admissions below the age of 50 years,\n\nthroughout the Gauteng province in the last two weeks\n\nThe best indicator of disease severity is measured by the in-hospital death rate.\n\nThere were 10 deaths in the in the past two weeks (cohort of 166)\n\nmaking up 6.6% of the 166 admissions\n\n(23% for all previous waves)\n\nFour deaths, aged 26-36\n\nFive deaths, aged over 60\n\nThere were no Covid-19-related deaths among 34 admissions in the paediatric Covid wards over the last two weeks\n\nOmicron variant could act as a natural vaccine\n\nProfessor Eleanor Riley, immunology and infectious diseases, University of Edinburgh\n\nhttps://www.telegraph.co.uk/global-health/science-and-disease/covid-news-booster-cases-vaccine-passport-coronavirus-omicron2/\n\nOmicron variant could act as a natural vaccine in the unvaccinated\n\nBritons are very likely to contract the variant in the next couple of weeks\n\nEverybody’s very likely to experience it in the next few weeks. \n\nIf it is milder, and we know infection induces an immune response, \n\nit is possible that this could act as a natural vaccine, \ngetting to those people who have so far been unwilling to be vaccinated\n\nBut I think we have to exercise a huge degree of caution with that, \n\nbecause there’s a huge ‘if’ about this ‘is it milder?’ \n\nAnd I think it’s very dangerous to compare data from South Africa to the UK. \n\nIn the South African population there’s been so many waves of infection they’ve gone through, \n\nlots of immunity and a much younger population\n\nAdvised people to act on the basis that anybody they come into contact with could have coronavirus", "link": "https://www.youtube.com/watch?v=m2vI4XczqZ8", "date_published": "2021-12-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Vitamin D in Israel", "description": "Check out Dr.Cohen's channel, Whats Up Doc, https://www.youtube.com/@whatsupdoc.\nThis video is for educational purposes only and must not replace advice from your own health care provider. Always consult your own doctor before taking any medication or supplements. It is not possible to give generalised medical guidelines, for example vitamin K2 may interfere with some anticoagulant medications, so you should see your doctor for individualises advice. \nDr Michael Cohen discusses the importance of Vitamin D and zinc for the optimisation of the immune system. Vitamin K2 is also used to distribute calcium to the correct tissues. Thankyou Dr Cohen for this excellent explanation of preventing and minimising infection by enabling the amazing natural immune response.\nDr. Cohen, Surgery details\nhttps://telaviv-doctor.com\nNotes on doses of Zinc, Vit D and Vit K2 for educational purposes only. This link will be updated from time to time to keep it up to date, https://telaviv-doctor.com/supplements-guidelines/", "link": "https://www.youtube.com/watch?v=w9h-XQm2qEY", "date_published": "2021-12-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]