[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "I'd buy THIS over a MacBook Pro - Tuxedo InfinityBook Pro 14 Review", "description": "The first 1,000 people to use this link will get a 1 month free trial of Skillshare: https://skl.sh/thelinuxexperiment12211\n\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nI also do a Gaming Podcast: https://www.youtube.com/channel/UCbRPZ11S1quJ4ESoj42A3ug\nJoin us on our new Discord server: https://discord.gg/xK7ukavWmQ\nTwitter : http://twitter.com/thelinuxEXP\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\nFollow me on ODYSEE: https://odysee.com/@TheLinuxExperiment:e\nOr join ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\n\n00:00 Intro\n00:25 Sponsor: Learn something new\n01:29 The Device\n03:59 That 3K Display\n05:02 Webcam and Mic\n05:57 Keyboard and Touchpad\n07:32 Performance and Battery Life\n10:18 Price and final thoughts\n\nOk, as always, let's begin with the basics! The InfinityBook Pro 14 is a 14 inch laptop. It weighs about 1 kilogram and it's made of the same magnesium alloy that other Tuxedo laptops already use.\n\nIt's rocking an Intel 11th gen CPU, my review unit comes with an i7-11370H, but you can get it with a range of other intel CPUs starting from an i5 1135G7.  \n\nBy default, it comes with the integrated Intel Xe graphics, which are good enough for most people's use case, but  you can choose to give it an nvidia RTX 3050Ti.\ne, which I always enjoy, **just like the lack of stickers on the chassis.**\n\nIn terms of IO,  the InfinityBook Pro 14  has a USB C 3.2 gen 2 port that can also serve as the charging point for the laptop and supports DisplayPort protocol, a USB 1 3.2 gen 1 port, a full size SD Card reader and a 2 in 1 audio jack for headphones or mic on the left side.\n\nOn the right, you get a Thunderbolt 4 port which can also serve as the charging port, another USB-A 3.2 Gen1 port, an HDMI 2.0 port, and the barrel charger.\n\nThis is the main part of the InfinityBook Pro story, though: the display. You can get it with a regular 1080p screen, or go for their Omnia 3K display, which is the one I got in my review unit.\n\nIn short, it's amazing. The resolution is 2880x1800, with a 16:10 aspect ratio for a bit more vertical screen space. \n\nIt can go up to  400nits of brightness, which is good enough for use outside, and it covers 99% of sRGB. It also has a 90hz refresh rate, which makes operating the desktop a smooth dream.\n\nThe keyboard is reactive, key travel is reasonably deep, and the keys are quite stable.\n\nThe sound is really nice as well, softer than the clacky keyboards found in macbooks, but not plasticky or rubbery.\n\nThe trackpad is HUGE. Probably just as big as what you'd find on Apple laptops nowadays. It's covered in glass, and it's super smooth. It's still a hinge trackpad, though, so you'll be stuck either tapping it, or clicking at the bottom of the trackpad. \n\nPerformance-wise, that thing runs really well. Tuxedo has added a dual cooling system, with 2 fans and 2 heatpipes, even if you don't go for the Nvidia model, which means that this thing should stay cool even under load.\n\nOn Geekbench 5, the intel i7 11370H got a single core score of 1675 and a multi core score of 5709. \n\nIn terms of battery life, Tuxedo states a maximum of 12 hours, which you can only reach if you're watching content located on the laptop itself. A more realistic estimate, from my tests, is around 7 and a half hours, doing office work: writing video scripts, creating invoices, the occasional youtube video in the background for music playback, all with wifi and bluetooth enabled and used.", "link": "https://www.youtube.com/watch?v=t7mWBNv4jeA", "date_published": "2021-12-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]