[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Madden NFL 22 All-Access: Scouting – EA PLAY Live 2021 Spotlight", "description": "Join EA SPORTS’ Seann Graddy, Tom Lischke, and Andre Weingarten, as they come together to discuss the vision for their ultimate sandbox mode, Franchise, and get the first ever deep dive reveal of the brand new scouting feature coming to Madden NFL 22.\n\nESRB EVERYONE.\n\n#maddennfl22 #eaplaylive2021", "link": "https://www.youtube.com/watch?v=O-9sLBYcQZA", "date_published": "2021-07-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Psychonauts 2 Final Preview", "description": "We got an early hands-on preview of Psychonauts 2, and it's an ambitious, refined, and mature return to the cult classic.\n\nPsychonauts 16 years later: https://www.youtube.com/watch?v=eIdXHvxzcQc\nWritten hands-on preview: https://www.gamespot.com/articles/psychonauts-2-hands-on-preview-an-ambitious-return-to-a-classic/1100-6494086/\n\nIt's been 16 years since the cult classic Psychonauts was release, but we're finally getting a sequel on August 25. That's a lot to live up to, but thankfully after 5 hours of hands-on time with the game, the game is shaping up to be an ambitious and mature take on its predecessor, while still honoring what made the first one so special all those years ago.\n\nIn the above video, Kurt Indovina details his time with the preview version, going over its writing, gameplay, and level design. Like the original, it's bursting with studio Double Fine's unhinged creativity, and director Tim Schafer's signature writing and charm.\n\nThe game is expected to release on August 25 for PC, PS4, and will be available day one on Game Pass for Xbox One, and Xbox Series X|S.\n\n#Psychonauts2", "link": "https://www.youtube.com/watch?v=OL_I_Yhjlso", "date_published": "2021-07-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Tom Clancy's XDEFIANT Announcement Trailer", "description": "Check out the all new Tom Clancy's XDEFIANT Trailer developed by Ubisoft. This is the first look and announcement of the new Ubisoft game featuring first-person shooter style gameplay.\n\n#XDEFIANT", "link": "https://www.youtube.com/watch?v=yzQPVKmeYR4", "date_published": "2021-07-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "28 MORE Things You STILL Didn't Know In Zelda Breath Of The Wild", "description": "Returning with more secrets that you probably don't know about in Breath of the Wild! This time we dive into an object you can multi-stasis, what diaries around Hyrule actually say, teleporting fire with the Master Cycle, and much more!\n\nIn the video above, we cover 28 tips and tricks that aren’t quite as well known, ranging from secrets to glitches, some that are pretty simple and others that are fairly complex. Breath of the Wild has been out for four years at this point, and players have found some amazing things, intended or not, that keep the game and its sense of discovery feeling fresh.\n\n0:00 Intro\n0:12 How To Avoid Mudpit Drowning   \n0:32 Propogate Fish\n0:41 Fish Swim In Mud, Ice Water, and Lava\n0:53 Horse Follow Command\n1:13 All Books Are April Fools Jokes\n1:41 Kiltons Real Shop Name\n1:48 Typos\n2:08 Multi-Stasis\n2:28 Moblin Arm-Blocking\n2:38 Sleepy NPC's Ignore Weapons\n2:55 Campfire Glitch Uses\n3:18 Sheikah Tower Hidden Designs\n3:30 Sheikah Tower Ledge Secret\n3:45 Memory Launch\n4:07 Shop Item Weirdness\n4:18 Camouflaged Lizalfos Are Weird\n4:40 Horse Don't Give A Damn\n4:49 Fairy Refueling\n5:02 Master Cycle Teleports Fire\n5:24 Tree Jumping\n5:30 Octoballoon Weight Momentum\n5:46 Giant Horses In Deep Water\n6:00 Turn Things Invisible\n6:23 Get Cool Snapshots\n6:38 Lynel Speedkilling\n7:13 Forest Octorok's Drown?\n7:24 Ganon Selfie\n7:31 Pull The Legendary Master Bomb\n\n#zelda #zeldabreathofthewild #breathofthewild", "link": "https://www.youtube.com/watch?v=WHQ9v5vxfEU", "date_published": "2021-07-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Warframe New War 30 Minute Gameplay Demo | Tennocon 2021", "description": "At TennoCon 2021, we got our first look at Warframe's next major expansion, The New War. Coming later this year, this new cinematic quest will see the Tenno will face off against the growing force of the Sentients, who have now invaded Earth.\nIn this extended gameplay reveal, we see the full invasion of Cestus, Earth's major human settlement, showing off the scale of the Sentient invasion.  But in a surprise twist, we then cut to gameplay for characters other than our familiar Tenno. While your adventures throughout Warframe have focused on the Tenno, The New War will mark the first time players take on an active role as side characters for story missions. In the gameplay we saw during the stream, The New War will feature missions letting you control the sword-wielding Teshin of the Conclave faction, Kahl-175 of the Grineer, and the Corpus engineer Veso. These standalone missions will focus on each character's particular loadout and skills, making them stand apart from the slate of Frames you've become well accustomed to over the years. However, The New War will still focus on the Tenno and their actions during this questline.\n\n#warframe #warframenewwar #tennocon2021", "link": "https://www.youtube.com/watch?v=ylV8c3jnbig", "date_published": "2021-07-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]