[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "How NSO Group's Pegasus spyware was found on Jamal Khashoggi's fiancée's phone. | FRONTLINE", "description": "A consortium of news outlets from around the world, including FRONTLINE, has been investigating the use of the spyware called Pegasus and the Israeli company, NSO Group, that sells it to foreign governments. Pegasus has been used by NSO clients to spy on journalists, human rights activists and others. One target: Jamal Khashoggi’s fiancée.\n\nSubscribe on YouTube: http://bit.ly/1BycsJW \n\nThe investigation is coordinated by the journalism nonprofit Forbidden Stories, with technical support from Amnesty International’s Security Lab.\n\nWashington Post reporter Dana Priest is one of more than 80 journalists from 17 media organizations working on the collaboration, known as “The Pegasus Project.” She traveled to Turkey to verify if Pegasus had been used to surveil Khashoggi’s fiancée, Hatice Cengiz. NSO Group says its spyware is used to fight terrorism and serious crimes, and that its technology was not associated in any way with Khashoggi’s murder.\n\nThis reporting is part of an upcoming FRONTLINE documentary produced with Forbidden Stories to air on PBS.\n\n#PegasusProject #Khashoggi #NSOGroup\n\nFind more from FRONTLINE on the PBS Video App, where there are more than 300 FRONTLINE documentaries available for you to watch any time: https://to.pbs.org/FLVideoApp\n\nSubscribe on YouTube: http://bit.ly/1BycsJW \nInstagram: https://www.instagram.com/frontlinepbs \nTwitter: https://twitter.com/frontlinepbs \nFacebook: https://www.facebook.com/frontline\n\nFunding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Major funding for FRONTLINE is provided by the Ford Foundation. Additional funding is provided by the Abrams Foundation; the John D. and Catherine T. MacArthur Foundation; Park Foundation; and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation, and additional support from Koo and Patricia Yuen. Additional support for this video was provided by Mediawan Rights.", "link": "https://www.youtube.com/watch?v=a2BIYWHdfTE", "date_published": "2021-07-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]