[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "Ubuntu Touch on the Pinephone - is this the best Linux mobile interface?", "description": "The first 1000 people to use the link will get a free trial of Skillshare Premium Membership: https://skl.sh/thelinuxexperiment05211\n\nI already covered Phosh, the mobile port of GNOME, and Plasma Mobile, both running on the pinephone. Now it's time to take a look at the other main alternative for mobile Linux interfaces, the one that has been around for a while now: Ubuntu Touch, or Lomiri. Let's take a look at how well it runs\n\nBecome a channel member to get access to a weekly patroncast and vote on the next topics I'll cover:\nhttps://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nSupport the channel on Patreon: \nhttps://www.patreon.com/thelinuxexperiment\n\nFollow me on Twitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\nFollow me on ODYSEE: https://odysee.com/@TheLinuxExperiment:e\nOr join ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\nThe Linux Experiment merch: get your goodies there! https://teespring.com/en-GB/stores/the-linux-experiment\n\nThis shell is based on gestures starting from the screen edges. A short swipe from left to right will bring a launcher with the default applications pinned to it, and your current open applications as well, appearing on top of the pinned shortcuts.\nA longer swipe from the left edge will bring the whole list of applications.\n\nIf you swipe from the right towards the left in a short motion, you'll switch to the next open app. If you make a long swipe from the right edge, then you'll get to a multitasking view, with apps displayed in a 3D layout.\n\nYou can swipe an app's card up to close it, or tap an app to resume it. \n\nFinally, a swipe from the top edge of the screen will bring the notifications, and the quick settings, which don't display as on most other operating systems: they're in a straight line, that you can scroll from left to right, and tap each icon to get to a quick few shortcuts, like enabling or disabling a specific feature, or dive deeper into the settings.\n\n## The Applications\nOut of the box, you get a nice calculator that handles rotation beautifully to display more options, and lets you swipe from the bottom in portrait to still get access to these options. The default calendar app looks good, with an Agenda view that shows your various events in order, a day, week, month, and year view.\n\nI won't dwell on the camera app, as support for the pinephone camera is still in its infancy, it's rare that it even displays an image.\n\nThe Clock application lets you add various clocks from all around the world, start a timer, or use a stopwatch. Swiping from the bottom in the \"clock\" tab lets you create alarms, although I would have preferred alarms to be a full tab in the app instead of hiding that behind a swipe.\n\nThe contacts app does what you'd expect, list your contacts and allow to set some as favorites and you can swipe from the bottom to create a new one. The file manager looks good, although it's a bit slow to start, and lets you create files, and change how the directories look.\n\nThe messaging app works as you'd expect, letting you type messages and send them to your contacts. You can also swipe up from the bottom edge of the screen to start a new message.\n\nThe web browser is alright, if a bit slow to start.It lets you pick your search engine and homepage, and display web pages in desktop mode, but there are no sync capabilities for history, bookmarks, or passwords, so it's not going to be  fantastic to use.\n\nThere is also a terminal app that looks really good and has quick aliases in the bottom left corner. The Notes app is also pretty competent, letting you swipe up from the bottom to create a new note, and syncs with evernote.\n\nThis leaves us with the phone dialer, letting you pick a contact, or just type the number you want to call, and the weather app, which is really black and white and pretty spartan, and it reminds me of a windows phone app.\n\n## The Settings\nThe settings page uses a sensible icon grid.\n\nUbuntu Touch is pretty barebones in that regard: in terms of customization, you can change the wallpaper, the ringtone for calls and messages, and that's about it. A few apps let you switch to a dark mode in the settings, and some offer to respect a \"system preference\", but that's not something I could find in the settings.\n\n## The AppStore\nThe OpenStore serves as the App Store for Ubuntu Touch. It's not a package manager like you could find on other Mobile Linux alternatives: no way to download a desktop program here, at least not graphically.\n\nYou'll get apps that were made specifically for ubuntu touch, and there are around 400 of these in total.\nYou can also get a few Matrix clients, and a nice email client called Dekko 2, among other applications.\n\nUpdates are handled in the system settings, with over the air updates for the system itself, and for the apps, grouped at the same place.", "link": "https://www.youtube.com/watch?v=LVkOWclo52c", "date_published": "2021-05-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]