[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "FF7 Remake PS5 Upgrade Reaction, and Xbox Cloud Plans", "description": "In this week's packed episode of Console Crew, Lucy, Tam, and Jordan discuss PSVR2, as well as react to the PlayStation State of Play and the new content coming to Final Fantasy 7 Remake on PS5. They talk about Xbox's plans for the Cloud and the upcoming Smash Direct.", "link": "https://www.youtube.com/watch?v=URmlQblN4EQ", "date_published": "2021-02-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Hunt: Showdown’s Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of Hunt: Showdown, including the Sharps Derringer pistol, the Spencer 1882 pump-action shotgun, and a very unique single-barrelled shotgun.\n\nHunt: Showdown is a supernatural take on the Wild West complete with an arsenal of period weaponry that includes interesting takes on the Colt Single Action Army revolver, the LeMat revolver, and the Winchester Model 1873 rifle.\n\nJonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of Hunt: Showdown and compares them to their real-world counterparts.\n\nIf you're interested in seeing more of Jonathan, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. -https://royalarmouries.org/support-us/membership/\n\nYou can purchase Jonathan's book here - https://www.headstamppublishing.com/bullpup-rifle-book", "link": "https://www.youtube.com/watch?v=dLE31drHO0Y", "date_published": "2021-02-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokemon Brilliant Diamond & Shining Pearl Trailer Comparison - Switch vs DS", "description": "Pokemon Brilliant Diamond & Shining Pearl have officially been revealed! To celebrate we go back and compare the newly revealed footage in the trailers to the original Diamond & Pearl gameplay in this side by side comparison video!\n\nPokemon Diamond and Pearl are almost 15 years old, having originally launched for Nintendo DS in September 2006 in Japan. The games were released four years after the previous entry, Pokemon Ruby & Sapphire, and we wouldn’t get the next generation, Pokemon Black and White, for another four years. Instead, we indulged in some Pokemon nostalgia with games like Pokemon HeartGold & Soulsilver--so it wasn’t completely empty.\n\nNow, Nintendo and The Pokemon Company are inviting us to take a trip down memory lane again with Pokemon Brilliant Diamond and Shining Pearl, which are remakes of the classic DS titles. This gives us the perfect excuse to put both versions of the two games side-by-side to see just how far we've come.\n\nAs you might have guessed the DS and Switch versions don’t look similar at all. The Switch version went with a chibi art-style the harcons back to the little sprites on the DS, but otherwise everything is shiny and new including the battles between Pokemon.\n\nPokemon Brilliant Diamond & Shining Pearl will be released in Late 2021 on Nintendo Switch. The Pokemon Company also revealed Pokemon Legends: Arceus, a brand new open-world Pokemon title that seems to have some similarities to The Legend of Zelda: Breath of the Wild. Pokemon Legends: Arceus will be released in Early 2022 for the Nintendo Switch.", "link": "https://www.youtube.com/watch?v=XyhG7H3keXU", "date_published": "2021-02-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Valheim: How To Find Scrap Iron And Make Iron Gear", "description": "You need to get to specific places to find Iron in Valheim, which requires you to take down a boss and find the right items. Here's what you need.", "link": "https://www.youtube.com/watch?v=bAiB3U0LDlY", "date_published": "2021-02-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Bravely Default 2: 8 Tips You Should Know Before You Play", "description": "If you’ve never played a Bravely Default game, then 2 can actually be kind of tough. So, we’ve compiled 8 tips to help you navigate the world and give you the edge in combat.", "link": "https://www.youtube.com/watch?v=rMPxBVvGDJ0", "date_published": "2021-02-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Celebrating Black History Month with The MIX Live", "description": "To celebrate Black History Month, The MIX presents a digital event in partnership with Humble Games that has a special emphasis on the Black Game Developer Fund.", "link": "https://www.youtube.com/watch?v=eSe0YA8CrNY", "date_published": "2021-02-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Outriders Demo - PS4 Pro Vs PS5 Graphics and Loading Times Comparison", "description": "See the differences between the current gen and previous gen versions of Outriders' prologue.\n\nThe demo for Outriders is now out, allowing you to play through the opening hours of developer People Can Fly's upcoming multiplayer-focused action RPG. You can play the demo on Xbox Series X|S, Xbox One, PS5, PS4, and PC--the only system that doesn't support the demo but will play the game at launch is Stadia.\n\nIn the video above, we do a side-by-side comparison of the Outriders demo, playing it both on PS4 and PS5. We take a look at how well the game performs on the two systems, both in terms of graphical quality and loading times.\n\nIn Outriders, you play as an Outrider, a specialized combat scout charged with leading humanity's exploration across a new world after the destruction of Earth. Mutated by a freakish storm upon your arrival, you become an Altered--someone who can bend the elements to their will. You have the choice of commanding earth, fire, time, or technology. \n\nThe demo for Outriders covers the opening chapter, which includes several campaign missions and optional side quests. Your progress in the demo will transfer over to the full game once it launches on April 1. Like that version, the Outriders' demo supports co-op, allowing you to team up with other players in three-person squads.", "link": "https://www.youtube.com/watch?v=-jCxsNKOE20", "date_published": "2021-02-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokemon Brilliant Diamond and Shining Pearl Reveal Trailer!", "description": "Check out the official reveal for Pokemon Brilliant Diamond and Shining Pearl! Pokemon Brilliant Diamond and Shining Pearl will release late 2021 and are part of the celebration of the 25th year of Pokemon!", "link": "https://www.youtube.com/watch?v=maIfkfLgqrk", "date_published": "2021-02-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokemon Presents Full Presentation", "description": "Check out the full presentation for Pokemon Presents that unveiled February 26th, 2021 featuring the reveal of Pokemon Brilliant Diamond, Pokemon Shining Pearl, Pokemon Snap latest gameplay, and the all new Pokemon Legends Arceus!", "link": "https://www.youtube.com/watch?v=xW6lL08YT0U", "date_published": "2021-02-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokemon Snap Latest Gameplay Reveal Trailer", "description": "Check out the gameplay footage that was shown during the Pokemon Presents presentation for Pokemon Snap coming in April. This footage takes place in the Lental region of Pokemon!", "link": "https://www.youtube.com/watch?v=84MBJNOJjOo", "date_published": "2021-02-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Legends Arceus Reveal Trailer", "description": "Check out the Pokemon Legends Arceus Reveal Trailer officially unveiled during the Pokemon 25th Anniversary Pokemon Presents. This game will take place in a Sinnoh region of old and will be a new take on the Pokemon journey. Pokemon Legends Arceus is set to launch sometime in 2022.", "link": "https://www.youtube.com/watch?v=kFW2JnwQdrg", "date_published": "2021-02-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]