[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "This Ryzen 7 laptop is a lightweight beast! TUXEDO AURA 15 Review", "description": "I take a look at the Aura 15, a full AMD Ryzen laptop from Tuxedo, with a Ryzen 7 4800u. It's an impressive device.\n\nBecome a channel member to get access to a weekly patroncast and vote on the next topics I'll cover:\nhttps://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nSupport the channel on Patreon: \nhttps://www.patreon.com/thelinuxexperiment\n\nFollow me on Twitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\nFollow me on LBRY: https://lbry.tv/@TheLinuxExperiment:e\n\nJoin us on Discord: https://discord.gg/nN8wwZPpwr\n\nThe Linux Experiment merch: get your goodies there! https://teespring.com/en-GB/stores/the-linux-experiment\n\n\n## Unboxing experience:\nI received\n- The laptop, the charging brick and cable, some documentation and goodies: notepad and pen, lanyard, usb key allowing you to restore your system, a microfiber cloth, a quickstart guide in many different languages\n- There was also a booklet explaining how to use Tuxedo OS, the Ubuntu budgie based distro that Tuxedo ships on their devices if you haven't selected anything else.\n- Finally, I got a DVD with the drivers and user manual, I'd expect it to be more useful for people who would want to install windows on the device, even though it doesn't have a DVD drive...\n\n## The device\n- At its biggest, it's 2cm, and it weighs a bit more than 1 and a half kilo, less than 4 pounds. it's amazingly lightweight, as a matter of fact, for a 15 inch.\n- It's built out of aluminium, for the top lid and the bottom case, and resin for the palm rest and the screen hinge cover.\n- 15.6 inch, 1080p matte display. Minimal bezels, apart from the bottom of the screen.\n- Amazing viewing angles, no color shift at all\n- Color accuracy feels good\n- Glare and reflections are minimal \n- Lid is engraved with the Tuxedo logo, laser etched.\n- It has an AMD Ryzen 7 4700u, with AMD Renoir graphics, but you can get it with a Ryzen 3, or 5, both 4th gen\n- Mine came with 16Gb of RAM, but it can go up to 64, and up to 2Tb of SSD storage. Mine had 1Tb of PCIe SSD storage.\n- I/O is good: 2 USB 2.0 ports, a folding ethernet jack, micro SD and SIM card slot fir 4G and LTE, headphone jack on the left side.\n- 1 Usb 3.2 port, 1 USB-C port with full displayport protocol support, an HDMI port, and the barrel charger\n- USB-C can't be used for charging, that's a shame\n- Only 1 USB 3 seems like a miss, but it's not a dealbreaker at all\n- I received a french keyboard, as I asked for that, but Tuxedo offers about every western layout you could ask for.\n- A bit of give in the middle of the keyboard, you definitely feel it when typing\n- Palm rest is sturdy\n- Trackpad is huge, very nice to use\n- It's fast and reactive, a very nice trackpad\n- The fingerprint scanner is unfortunately not recognized under Linux, although Tuxedo told me they were working on it, with one of their developers being involved in a community project to add support for it.\n- The keys are a bit too small for my taste. I get why you would want to cram a numerical pack on a 15'' laptop, but this makes every key quite small, and I'm not used to that at all. It made typing at the beginning pretty tricky, but I got used to it after a day or so.\n- The super key is a little Tux logo, which is nice. No windows logo here.\n\n## Performance\n- I set up the default profile to be at max performance.\n- The Ryzen 7 got a single core score of 1214 and a multi core score of 6612.\n- It single handedly beat my Ryzen 5 2600 desktop, my 8th gen core i7 Matebook 13, and almost equals the Neptune 15, with a 10th gen Core i7, that I've reviewed on this channel.\n- This CPU is a beast. It did make the fan run a bit, but it wasn't even at full speed. You can definitely expect to use programs like Kdenlive without a hitch on this device. Any CPU intensive task is doable here.\n- With the Ryzen 3 or 5 options, expect lower scores, but this CPu family is definitely very capable.\n- On Dawn of War 2, at 1080p, mid settings, the laptop reached an average framerate of 64Fps. \n- On Dawn of War 3, a bit more recent, but not that well optimized either, at 1080p on the lowest settings, the Aura 15 got an average of 43FPS.\n- On Shadow of the Tomb Raider, at 1080p, on the lowest presets, I got more an average of 34FPS\n\n- You can definitely game on this thing. At the native resolution, you'll get acceptable performance from even AAA titles, if you're OK playing at lower settings. More indie games, or strategy titles like Stellaris or Crusader Kings will be perfect on this laptop.\n\n- Battery life: Tuxedo boasts 9h for 1080p video playback. I've used the device to work from home, with day to day tasks: Firefox and Chromium opened with about 6 to 7 tabs each, reloading and loading new pages for almost the whole day , including some web apps, LibreOffice, some light youtube video watching while I was eating.", "link": "https://www.youtube.com/watch?v=vjVXzuPIsS0", "date_published": "2021-02-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]