[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCAKcSON6PSG_JkTbXh2WdIg", "title": "Annie Mack - two songs at The Current (2018)", "description": "In January of this year, Annie Mack released her \"Testify\" EP, and its lead single, \"Shadows of a Kingdom,\" has been featured on The Current. In 2018, Mack released her \"Tell It Like It Is\" EP, and she and her band visited The Current studio to play some songs from the release.\n\nAnnie Mack is based in Rochester, Minn., with roots in Minneapolis. Inspired by her mother's love of music, Annie Mack began singing in remembrance of her, and now, Mack is enjoying a professional career in music. Watch Annie Mack's in-studio performances from 2018.\n\nSONGS PERFORMED\n0:00 \"Closer\"\n4:07 \"Tell It Like It Is\"\n\nPERSONNEL\nAnnie Mack – vocals\nJon Herchert – guitar\nPete Sands – keys\nBilly Thommes – drums\n\nCREDITS\nVideo & Photo: Nate Ryan\nAudio: Michael DeMark\nProduction: Jesse Wiza\n\nFIND MORE:\n2018 studio session: https://www.thecurrent.org/feature/2018/02/23/annie-mack-session\n\nSubscribe to our channel:\nhttp://www.youtube.com/user/893TheCurrent?sub_confirmation=1\nLike/Follow:\nhttps://www.facebook.com/TheCurrent/\nhttps://twitter.com/TheCurrent\nhttps://www.instagram.com/thecurrent/\n\n#anniemack #anniemackmusic", "link": "https://www.youtube.com/watch?v=10b43SwGsEU", "date_published": "2021-02-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCAKcSON6PSG_JkTbXh2WdIg", "title": "Sounds Like Home VI: bugsy, Kid Dakota, Munson-Hicks Party Supplies, Under Violet, Cornbread Harris", "description": "It's time for Sounds Like Home VI, another burst of performances by Minnesota musicians. We've got an incredible lineup — bugsy, Kid Dakota, Munson-Hicks Party Supplies, Under Violet and Cornbread Harris. Join The Current's Andrea Swensson for this latest round of exclusive performances in our virtual festival series.\n\nABOUT THE ARTISTS\nBugsy is an indie-pop quartet that began as the brainchild of Emily Schoonover from Bruise Violet. Outside of Bruise Violet, Schoonover began creating music under the name Sharon is Karen, which later changed to Bugsy. After releasing several solo demos, Bugsy expanded, and now features Griffen Desai on guitar, Shannon Maroney on bass and backing vocals, and Alex Norman on drums. They released their first EP, Teratoma, in February 2020, and have most recently released a single called \"Talk to You\"back in September of 2020.\n\nKid Dakota is the musical moniker of Darren Jackson. The project was initially named “Kid Dakota and the Tumbleweeds,” which acted as both an homage to his home state of South Dakota and a parody of Kid Rock. While the project’s name was initially developed as a parody, Jackson’s music is anything but. He has had lasting power in the Twin Cities’ music scene, as he has been putting out records for just over 20 years now. His most recent album is called Age of Roaches, which was released in December 2020.\n\nMunson-Hicks Party Supplies is a collaboration between John Munson (of the New Standards, Semisonic, and Trip Shakespeare) and Dylan Hicks. Two initially paired up to write a musical together but began to find themselves writing songs that had nothing to do with the plot of this musical, which led to the creation of their self-titled debut record. Hicks tends to do most of the writing, while Munson does most of the singing. The two were joined by Zacc Harris on guitar, Richard Medek on drums, and a handful of other guests to create their record, which was released in September 2020.\n\nUnder Violet are an indie-folk band led by Sara Bischoff, who has previously performed in bands such as Web of Sunsets and Heavy Deeds. The group has been rounded out by other noteworthy local music veterans such as Jeremy Ylvisaker, Chris Bierden, Mike Gunvalson, and more. The band released their self-titled debut in 2019 and appeared on City Pages’ Picked to Click and First Avenue's Best New Bands that year. Under Violet recently released a follow up record called Threes in January 2021.\n\nCornbread Harris is a legendary singer, pianist, and composer also known for his lively stage presence and priceless sense of humor. Harris found passion and comfort in playing the Blues on piano after he finished serving in the U.S. infantry during World War II and has gone on to make a lifelong a career out of it. Harris is now 93 years old and has been extremely active in the Twin Cities music scene ever since. He often performs solo but also performs with his band, Cornbread Harris And the Broken Hipsters.\n\nSubscribe to our channel:\nhttp://www.youtube.com/user/893TheCurrent?sub_confirmation=1\n\nLike/Follow:\nhttps://www.facebook.com/TheCurrent/\nhttps://twitter.com/TheCurrent\nhttps://www.instagram.com/thecurrent/\n\n#soundslikehome #thecurrent", "link": "https://www.youtube.com/watch?v=cOO43dMMG3E", "date_published": "2021-02-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCAKcSON6PSG_JkTbXh2WdIg", "title": "Andra Day - two songs at The Current (2016)", "description": "Five years ago, Andra Day visited our studio as a Grammy-nominated singer for her song, \"Rise Up.\" Today, Andra Day is a Golden Globe nominee for her performance as Billie Holiday in \"The United States vs Billie Holiday,\" out Friday on Hulu. On the eve of the release of that film, directed by Lee Daniels, here are two performances by Andra Day, recorded in The Current studio in 2016.\n\nSONGS PERFORMED\n0:00 \"Rise Up\"\n5:26 \"Forever Mine\"\n\nPERSONNEL\nAndra Day – vocals\nDave Wood – guitar\n\nCREDITS\nVideo & Photo: Nate Ryan\nAudio: Michael DeMark, Sasha Druva\nProduction: Derrick Stevens\n\nFIND MORE:\n2016 studio session: https://www.thecurrent.org/feature/2016/01/29/set-for-a-big-year-ahead-andra-day-performs-at-the-current\n2021 \"The United States vs Billie Holiday\" film review: https://www.thecurrent.org/feature/2021/02/25/the-united-states-vs-billie-holiday-film-review\n\nSubscribe to our channel:\nhttp://www.youtube.com/user/893TheCurrent?sub_confirmation=1\nLike/Follow:\nhttps://www.facebook.com/TheCurrent/\nhttps://twitter.com/TheCurrent\nhttps://www.instagram.com/thecurrent/\n\n#andraday", "link": "https://www.youtube.com/watch?v=FUVr9n6XKGY", "date_published": "2021-02-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCAKcSON6PSG_JkTbXh2WdIg", "title": "Arlo Parks - Virtual Session", "description": "West London's Arlo Parks joins Jill Riley for a virtual session—she'll be playing songs from her debut record Collapsed In Sunbeams, and talking about taking refuge in writing, and using art to lift others up.\n\nSONGS PERFORMED\n00:48 Hope\n05:42 Hurt\n09:00 Green Eyes\n\nSubscribe to our channel:\nhttp://www.youtube.com/user/893TheCurrent\n\nLike/Follow:\nhttps://www.facebook.com/TheCurrent/​​​\nhttps://twitter.com/TheCurrent​​​\nhttps://www.instagram.com/thecurrent/", "link": "https://www.youtube.com/watch?v=-B39x97hVOU", "date_published": "2021-02-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]