[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Need for vaccine aspiration confirmed, why is this not being done", "description": "Oxford vaccine and blood clots\n\nhttps://www.dailymail.co.uk/news/article-10266585/AstraZeneca-uncovers-trigger-blood-clots-jab.html\n\nhttps://www.gov.uk/government/publications/covid-19-vaccination-blood-clotting-information-for-healthcare-professionals/information-for-healthcare-professionals-on-blood-clotting-following-covid-19-vaccination\n\nFrom 4 January to 4 August\n\nAZ vaccine administered across the UK\n\n24.8 million first doses\n\n23.9 million second doses\n\n412 suspected cases of CVST   (Cerebral Sinus Vein Thrombosis) have been reported across the UK\n\n(Only 43 suspected cases were after the second dose of AZ vaccine)\n\nOverall incidence of CVST\n\nAfter first dose, 14.9 per million\n\nAfter second dose, 1.8 per million\n\nCVST is a complication of COVID-19 infection\n\n42.8 per million\n\nMHRA as of 11 August, there were 73 fatal cases from the 411 events\n\nChAdOx1 interacts with CAR and PF4 with implications for thrombosis with thrombocytopenia syndrome\n\nhttps://www.science.org/doi/10.1126/sciadv.abl8213\n\nVaccines derived from chimpanzee adenovirus\n\nAs part of the largest vaccination campaign in history, \n\nUltra rare side effects not seen in phase 3 trials,\n\nincluding thrombosis with thrombocytopenia syndrome (TTS)\n\nAdenoviruses deployed as vaccination vectors versus SARS-CoV-2 bind to platelet factor 4 (PF4), \n\na protein implicated in the pathogenesis of HIT. \n\nheparin-induced thrombocytopenia \n\nComputational simulations to demonstrate an electrostatic interaction mechanism with PF4, \n\nwhich was confirmed experimentally by surface plasmon resonance. \n\nThese data confirm that PF4 is capable of forming stable complexes with clinically relevant adenoviruses, \n\nan important step in unravelling the mechanisms underlying TTS.\n\nPlatelet factor 4 (PF4)\n\nhttps://en.wikipedia.org/wiki/Platelet_factor_4\n\nhttps://www.nature.com/articles/s41420-019-0188-0\n\nhttps://www.sciencedirect.com/topics/neuroscience/platelet-factor-4\n\nThis chemokine is released from activated platelets during platelet aggregation, and promotes blood coagulation\n\nAlso has a role in inflammation and wound repair\n\nProf Alan Parker, Cardiff University\n\nThe adenovirus has an extremely negative surface, and platelet factor four is extremely positive and the two things fit together quite well\n \nWhat we have is the trigger, but there's a lot of steps that have to happen next\n\nRecent case reports show that most patients presenting with TTS\n\n( more than 90%) tested positive for PF4 antibodies\n\nA ChAdOx1/PF4 complex could induce anti-PF4 autoantibodies.\n\nIn this potential mechanism, small quantities of ChAdOx1 enter the blood through minor capillary injuries \n\ncaused by the intramuscular injection, as has previously been observed\n\nThis proposal goes some way toward explaining why TTS is observed so rarely, \n\nbecause it may require a series of low frequency stochastic interactions, \n\nfirst between small numbers of adenovirus particles entering the blood / lymph and then monocytes and / or B cells, \n\nwhich may only occur in individuals who are predisposed toward the generation of anti-PF4 antibodies.\n\nhttps://www.bbc.com/news/health-59418123", "link": "https://www.youtube.com/watch?v=D6hUoosMOuU", "date_published": "2021-12-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Omicron does reinfect after natural infection", "description": "Reinfections are probable, not good news actually\n\nHow likely somebody who has already had Covid to catch Omicron?\n\n(catching it twice or more) \n\nIncreased risk of SARS-CoV-2 reinfection associated with emergence of the Omicron variant in South Africa \n\nWhat is already known on this topic \n\nhttps://www.medrxiv.org/content/10.1101/2021.11.11.21266068v2.full.pdf\n\nPrior infection with SARS-CoV-2 is estimated to provide 84% reduction in infection risk\n \nWhat this study adds \n\nWe find no evidence of increased reinfection risk associated with circulation of Beta or Delta variants,\n\ncompared to the ancestral strain in routine epidemiological data from South Africa. \n\nIn contrast, we find clear, population-level evidence to suggest substantial immune evasion by the Omicron variant. \n\nOmicron selection advantage is at least partially driven by an increased ability to infect previously infected individuals. \n\nOmicron variant increases reinfection risk - Yes\n\nOmicron variant of SARS-CoV-2 demonstrates substantial population-level evidence for evasion of immunity from prior infection. \n\nRetrospective analysis of routine epidemiological surveillance data \n\n4th March 2020 to 27th November 2021\n\nSouth Africa’s National Notifiable Medical Conditions Surveillance System \n\nN = 2,796,982\n\nLaboratory-confirmed SARS-CoV-2\n\nResults\n\n35,670 suspected reinfections were identified \n\namong 2,796,982 individuals with laboratory-confirmed SARS-CoV-2,\n\nwho had a positive test result at least 90 days prior to 27th November 2021\n\n35,670 individuals with at least two infections\n\n332 individuals with third infections\n\n1 individual with four infection\n\nThe relative hazard ratio for wave 2 versus wave 1 was 0.75\n\nThe relative hazard ratio for wave 3 versus wave 1 was 0.71\n\nRelative hazard ratio for the period from 01 November 2021 to 27 November 2021\n\nThe relative hazard ratio for wave 4 versus wave 1 was 2.39\n\nIn the time of beta and delta\n\nIncreases in primary infections\n\nNo corresponding increase in reinfection hazard\n\nIn the time of omicron\n\nOmicron variant, decrease in the hazard for primary infection\n\nIncrease in reinfection hazard coefficient\n\nConclusion\n\nPopulation-level evidence suggests that the Omicron variant is associated with substantial ability to evade immunity from prior infection. \n\nIn contrast, there is no population-wide epidemiological evidence of immune escape associated with the Beta or Delta variants. \n\nThis finding has important implications for public health planning, \n\nparticularly in countries like South Africa with high rates of immunity from prior infection. \n\nUrgent questions remain regarding whether Omicron is also able to evade vaccine-induced immunity,\n\nand the potential implications on protection against severe disease and death. \n\nProf Paul Hunter\n\nThe implications of this paper are that Omicron will be able to overcome natural and probably vaccine-induced immunity to a significant degree.\n \nBut, the degree is still unclear - though it is doubtful that this will represent complete escape.\n\nProf Francois Balloux, University College London\n\nThe higher estimated re-infection ability of the Omicron variant to cause re-infection is not overly surprising\n\nand could be largely anticipated based on the large number of mutations in the spike protein carried by the omicron variant, \n\nwhich increase the Omicron variant's ability to bypass host immunity", "link": "https://www.youtube.com/watch?v=3ml9kYeOPeg", "date_published": "2021-12-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Australia omicron and vaccinations", "description": "Special report on omicron and vaccination in Australia. Thanks as always to Dr. Nigel Farrier", "link": "https://www.youtube.com/watch?v=XXJPPYwPNnY", "date_published": "2021-12-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Omicron in the US, increased transmissibility confirmed", "description": "Omicron now in 24 countries and California. Now clear it is highly transmissible.\n\nCases seem mild so far\n\nOmicron rapidly dominating in South Africa\n\nhttps://www.reuters.com/world/us-tightens-covid-19-travel-rules-countries-race-quell-omicron-threat-2021-12-01/\n\nOmicron is rapidly becoming the dominant in South Africa\n\nLess than four weeks in\n\nSouth Africa's National Institute for Communicable Diseases (NICD)\n\nhttps://www.nicd.ac.za\n\n74% of all genomes last month, omicron\n\nThe first Omicron detected in the U.S.\n\nhttps://www.nytimes.com/2021/12/01/health/omicron-first-us-case-california.html\n\nCalifornia Wednesday, 1st December\n\nCalifornia from South Africa on 22nd November\n\nMild symptoms started 25th November\n\nMild symptoms that are improving\n\nNot hospitalized\n\nIn isolation\n\nAggressive contact tracing is underway\n\nPerson fully vaccinated\n\nHad received two doses Moderna within the six-month window\n\nClose contacts have tested negative\n\nDr. Anthony S. Fauci\n\nWe have 60 million people in this country who are not vaccinated who are eligible to be vaccinated\n\nLet’s get them vaccinated. \n\nLet’s get the people vaccinated, boosted. \n\nLet’s get the children vaccinated.\n\nGet boosted now\n\nWe may not need a variant-specific boost.\n\n(EU, vaccine rollout for five-to-11-year-olds 13th December)\n\nDissent from Mike Ryan\n\nThere is no evidence that I'm aware of \n\nthat will suggest that boosting the entire population is going to necessarily provide any greater protection for otherwise healthy individuals\n\nagainst hospitalization or death\n\nWHO, coronavirus will keep producing new variants for as long as it is allowed to circulate freely in unvaccinated\n\n\nUS\n\nhttps://www.reuters.com/world/us-tightens-covid-19-travel-rules-countries-race-quell-omicron-threat-2021-12-01/\n\nMust have a negative test 24 hours prior to departure", "link": "https://www.youtube.com/watch?v=uXAJlwbny_g", "date_published": "2021-12-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Omicron, first case report from SA", "description": "Daryl is one of the first people in the world to be infected with the omicron variant, I am delighted he is currently doing well.", "link": "https://www.youtube.com/watch?v=GvrHLg53nBA", "date_published": "2021-12-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]