[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "History Of Call Of Duty WW2 Games", "description": "From Infinity Ward's original Call of Duty to Sledgehammer's latest, Call of Duty: Vanguard, we chart the history of the World War II Call of Duty games.\n\nFrom wars in the past, wars in the present, and even wars in the far-flung future, Call of Duty has been there. But the juggernaut franchise first made its mark with one of the biggest events of the 20th Century: WW2, an era it has revisited multiple times over the years since, including its latest entry, Call of Duty: Vanguard.\n\nIn the above video, we chronicle the Call of Duty games that explore World War II (from the first in the series, created by Infinity Ward), the introduction of the Zombies mode to those games, and how the latest WW2 CoD game, Vanguard, ties into the battle royale-focused Call of Duty: Warzone. \n\nFor more on Call of Duty, make sure to check out our latest episode of Firearms Expert Reacts, where Jonathan Ferguson breaks down the WW2 weapons in the game. Make sure to subscribe at youtube.com/gamespot so you don't miss an episode.\n\n00:25 - Call of Duty (2003)\n04:01 - Call of Duty: United Offensive (2004)\n05:11 - Call of Duty: Finest Honor (2004)\n06:41 - Call of Duty 2 (2005)\n09:38 - Call of Duty 2: Big Red One (2005)\n10:52 - Call of Duty 3 (2006)\n12:48 - Call of Duty: Roads to Victory (2007)\n13:38 - Call of Duty: World at War (2008)\n15:13 - Call of Duty: World at War Final Fronts (2008)\n16:03 - Call of Duty: WWII (2017)\n17:20 - Call of Duty: Vanguard 2021", "link": "https://www.youtube.com/watch?v=BIJagpuSlWg", "date_published": "2021-11-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "How BOTW's Most Complex Glitch Was Found", "description": "Memory Storage is one of The Legend of Zelda: Breath of the Wild's most complex glitches allowing you to get the Bow Of Light and start a new game with all of your equipment. But is it found by luck, skill, or knowledge? We explain how complicated glitches are discovered.\n\n#BreathoftheWild", "link": "https://www.youtube.com/watch?v=fixmBwon3jk", "date_published": "2021-11-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 Hazard Zone - 18 Things I Wish I Knew", "description": "Hazard Zone is Battlefield 2042’s competitive extraction style game mode and it can be very challenging. Here’s the best way to use guns, specialists, and tactics to get those data drives and get out alive.\n\nBattlefield 2042 has three main modes: All-Out Warfare, Portal, and Hazard Zone. Hazard Zone is an extraction mode that draws influence from hero shooters, popular battle royale titles, and games like Hunt: Showdown and Escape from Tarkov. In our 12-hour review event, we spent around four hours with the mode and learned a lot. Here’s what you should know. \n\nIn this video, we’re giving you 18 things we wish we knew before playing. These tips will help you earn more Dark Market credits, help you develop tactics, cover what kind of guns to purchase at the start of each round, help you survive the extraction process, and more. We’ll also cover how mechanics like the Call-In tablet, plus system, and some specialist abilities work in slightly different ways in this mode, as well as some tactical dos and don’ts. \n\nBattlefield 2042 is out now in early access with a general release on November 19. The game has cross-progression, cross-play, and cross-buy on PC, PlayStation 5, PS4, Xbox Series X/S, and Xbox One. It's worth noting, though, that matches sport aa lower player count on last-gen consoles. Head on over to YouTube.com/GameSpot for our review-in-progress, and more gameplay, like a video of a No Specialist Mode from Portal.", "link": "https://www.youtube.com/watch?v=8n5FFd4iMX8", "date_published": "2021-11-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Call Of Duty: Vanguard’s Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of Call Of Duty: Vanguard, including cursed versions of the M1 Garand, a ridiculously cutdown Thompson, and an MG42 without a stock.\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of Call Of Duty: Vanguard and compares them to their real-life counterparts.\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\nYou can subscribe to the Armax Journal that Jonathan Associate Edits here: https://www.armaxjournal.org/", "link": "https://www.youtube.com/watch?v=nVCQ4_mnyts", "date_published": "2021-11-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]