[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Debunking the BBC debunk of ivermectin", "description": "Ivermectin: How false science created a Covid 'miracle' drug\n\nhttps://www.bbc.co.uk/news/health-58170809\n\nBBC Reality Check\n\nBut the BBC can reveal there are serious errors in a number of key studies that the drug's promoters rely on.\n\nbut thousands of supporters, many of them anti-vaccine activists, have continued to vigorously campaign for its use.\n\nMembers of social media groups swap tips on getting hold of the drug, even advocating the versions used for animals\n\nhttps://www.nature.com/articles/s41591-021-01535-y\n\nLarge pro-ivermectin Facebook groups have turned into forums for people to find advice on where to buy it, including preparations meant for animals.\n\nThe BBC can reveal that more than a third of 26 major trials of the drug for use on Covid have serious errors or signs of potential fraud. \n\nThe group of independent scientists examined virtually every randomised controlled trial (RCT) on ivermectin and Covid \n\nSocial media group\n\nhttps://mobile.twitter.com/K_Sheldrick/status/1408651561228668931\n\nhttps://cosmosmagazine.com/health/covid/data-detectives-ivermectin-studies/\n\nThat’s how they all met on Twitter\n\nThey've been working together remotely on an informal and voluntary basis during the pandemic. \n\nReference please\n\nThe BBC can reveal that more than a third of 26 major trials of the drug for use on Covid have serious errors or signs of potential fraud. \n\nNone of the rest show convincing evidence of ivermectin's effectiveness. \n\nDr Kyle Sheldrick, one of the group investigating the studies, said they had not found \"a single clinical trial\" claiming to show that ivermectin prevented Covid deaths that did not contain \"either obvious signs of fabrication or errors so critical they invalidate the study\".\n\nOut of a total of 26 studies examined, there was evidence in five that the data may have been faked\n\nOn top of these flawed trials, there were 14 authors of studies who failed to send data back. \n\nThe independent scientists have flagged this as a possible indicator of fraud. \n\nThe sample of research papers examined by the independent group also contains some high-quality studies from around the world. \n\nA recent study in Lebanon was found to have blocks of details of 11 patients that had been copied and pasted repeatedly \n\nthey have submitted a retraction to the scientific journal which published it\n\nhttps://pubmed.ncbi.nlm.nih.gov/34073401/\n\nStudy from Iran\n\nAnother study from Iran seemed to show that ivermectin prevented people dying from Covid. \n\nhttps://www.researchsquare.com/article/rs-109670/v1\n\nThe records of how much iron was in patients' blood contained numbers in a sequence that was unlikely to come up naturally. \n\nDr Morteza Niaee, who led the Iran study, defended the results and the methodology and disagreed with problems pointed out to him, \n\nadding that it was \"very normal to see such randomisation\" when lots of different factors were considered\n\nIvermectin is generally considered a safe drug, though there have been some reports of side effects. \n\nBut indirect harm can come from giving people a false sense of security, especially if they choose ivermectin instead of seeking hospital treatment for Covid, or getting vaccinated in the first place.\n\nSome groups regularly contain posts about conspiracy theories of ivermectin cover-ups, as well as pushing anti-vaccine sentiment or encouraging patients to leave hospital if they aren't getting the drug. \n\nSouth African nurse dies\n\nInstead of consulting a doctor, she continued with the ivermectin and got home oxygen. \n\nWhat study are the BBC talking about?\n\nhttps://pubmed.ncbi.nlm.nih.gov/34552263/\n\nhttps://www.nature.com/articles/s41591-021-01535-y\n\nhttps://www.medicalbrief.co.za/ivermectin-papers-show-limitations-of-inherently-unreliable-summary-data/\n\nWe recommend that meta-analysts who study interventions for COVID-19 should request and personally review IPD (independent patient data) in all cases, \n\nIn a similar vein, all clinical trials published on COVID-19 should immediately follow best-practice guidelines and upload anonymised IPD so that this type of analysis can occur. \n\nhttps://ivmmeta.com\n\nhttp://jja-contents.wdc-jp.com/pdf/JJA74/74-1-open/74-1_44-95.pdf\n\nKitasato University, based on the judgment that it is necessary to examine the clinical effect of ivermectin to prevent the spread of uncertain COVID-19,\n\nasked Merck & Co., Inc. to conduct clinical trials of ivermectin for COVID-19 in Japan.\n \nThis company has priority to submit an application for an expansion of ivermectin’s indications, since the original approval for the manufacture and sale of ivermectin was conferred to it. \n\nHowever, the company said that it had no intention of conducting clinical trials.", "link": "https://www.youtube.com/watch?v=zy7c_FHiEac", "date_published": "2021-10-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Covid autoimmunity", "description": "Covid toe, caused by the immune response to the virus, not the virus itself\n\nhttps://covidskinsigns.com\n\nhttps://onlinelibrary.wiley.com/doi/full/10.1111/bjd.20707\n\nObjectives\n\nTo study skin and blood endothelial and immune system activation\n\nIn chilblain-like lesions (CLL),\n\nCLL in comparison with healthy controls and seasonal chilblains (SC)\n\n(cold-induced sporadic chilblains occurring during 2015 and 2019)\n\nMethods\n\nObservational study\n\nSaint-Louis Hospital, Paris, France\n\nN = 50\n\nCytokine assays\n\nAssessment of interferon-stimulated gene expression in whole blood\n\nSoluble markers of endothelial activation and/or angiogenesis\n\nHistological examinations\n\nLateral flow spike assay\n\nCirculating endothelial cell counting\n\nStatistical analysis\n\nResults\n\nHistological patterns were similar in CLL and SC groups\n\nTranscriptomic signatures overlapped in both the CLL and SC groups\n\nType I interferon\n\nCytotoxic–natural killer gene signature\n\nCLL were characterized by higher IgA tissue deposition\n\nMore complement and angiogenesis factors in CLL compared with SC\n\nAutoimmune vasculitis\n\nConfirmed endothelial dysfunction in CLL\n\nMicroangiopathy leading to clinical chilblains\n\nDisrupt the thrombo-protective state of endothelial cells\n\nLikely contributing to microvascular thrombosis\n\nSystemic endothelial activation?\n\nThe PT ratio and aPTT were normal in all patients\n\nOnly three patients (6%) had a moderate increase in D-dimer levels\n\nConclusions\n\nInflammation in the skin in CLL\n\nAssociated with endothelial alteration\n\nImmune infiltration of cytotoxic and type I IFN-leading to clinical manifestations\n\nhttps://www.bbc.co.uk/news/health-58801462\n\nUK podiatrist Dr Ivan Bristow\n\nlike the regular chilblains typically seen during cold spells and in people who have problems with circulation - the lesions usually go away on their own. \n\nBut some may need treatment with creams and other drugs.\n\nThe confirmation of the cause will help to develop new treatments to manage it more effectively\n\n\nDr Veronique Bataille, consultant dermatologist, British Skin Foundation\n\nCovid toe was seen very frequently during the early phase of the pandemic, but has been less common in the current Delta variant wave.\n\nThat might be down to more people being vaccinated or having some protection against Covid from past infections. \n\nPresentations after vaccination are much rarer\n\nDelayed presentation my mean link is missed\n\nFree download my two comprehensive but free educational text books (over 50,000 downloads so far) or make a donation to the campbellteaching project using this link: http://159.69.48.3", "link": "https://www.youtube.com/watch?v=wQH40UydmWM", "date_published": "2021-10-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]