[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Far Cry Games Ranked", "description": "Following the release of Far Cry 6 on October 7, we're taking a look back at the earlier entries in the series and letting you know which ones are must-plays and which ones are you-should-probably-still-plays.\n\nTIME STAMPS:\n00:00 - Intro\n00:33 - Far Cry 5\n01:26 - Far Cry Primal\n01:59 - Far Cry\n02:30 - Far Cry New Dawn\n03:00 - Far Cry 3 Blood Dragon\n03:47 - Far Cry 4\n04:22 - Far Cry 2\n05:03 - Far Cry 3\n\n#FarCry", "link": "https://www.youtube.com/watch?v=lqx1tUFN5tE", "date_published": "2021-10-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Far Cry 6’s Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of Far Cry 6, including the Exterminador, a backpack full of rockets, and the Discos Locos, a CD launcher that plays the Macarena.\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of Far Cry 6 and compares them to their real-life counterparts.\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can purchase Jonathan's book here - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020", "link": "https://www.youtube.com/watch?v=7ibM9QcqGxI", "date_published": "2021-10-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "GTA Trilogy Is Actually Happening | GameSpot News", "description": "In today’s GameSpot News, DeVante talks about the GTA Trilogy being officially confirmed, no rewards or achievements for solo campaigns in Back 4 Blood, and Assassin’s Creed producer Jade Raymond teasing a new game. \n\nFollowing weeks of rumor and speculation, Rockstar Games has officially announced a new Grand Theft Auto remaster package featuring GTA III, GTA: Vice City, and GTA: San Andreas.  The GTA Trilogy: The Definitive Edition comes with updated and improved versions of those three games. The bundle will be available on PS4, PS5, Xbox One, Xbox Series X|S, Nintendo Switch, and on PC through the Rockstar Games Launcher later this year.\n\nBack 4 Blood is a social game, and developer Turtle Rock Studios doesn't want players to forget that. While playing through a campaign match with others will let players earn supply points, which can be used to purchase cards and cosmetics, the game's solo mode totally cuts players off from all rewards. One upside of Solo Campaign is that players get to use any solo card decks they make, which have access to a wide variety of cards compared to regular campaign decks.\n\nAssassin's Creed producer Jade Raymond has teased the first game from her new studio, Haven, which has aligned itself exclusively with PlayStation. Haven's first game is a new IP that will seem to have an emphasis on social elements, self-expression, and remix concepts. Raymond said Haven's first game is going to be \"really ambitious\" and showcase what the PS5 is capable of and that the game's file size might be massive.\n\nTIMESTAMPS:\nIntro - 00:00\nGTA Trilogy - 00:20 \nBack 4 Blood - 01:48\nHaven - 02:57\nOutro - 04:36", "link": "https://www.youtube.com/watch?v=NF6z8fDrDsk", "date_published": "2021-10-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Overwatch 2 Play Test PvP Pro Gameplay", "description": "Get a glimpse of an early version of Overwatch 2 play tests on New York, Dorado, and Havana. Watch the new 5v5 PvP action with Overwatch Pro League Players from the San Francisco Shock and Dallas Fuel. You'll get to see gameplay with reworks for the heroes including Sombra, Winston, and more. \n\nTimestamps\nIntro 0:00 \nOverwatch 2 New York PvP Map 0:05 \nOverwatch 2 Dorado PvP Map 16:43\nOverwatch 2 Havana PvP Map 31:57", "link": "https://www.youtube.com/watch?v=D0Ya6s5VJ9s", "date_published": "2021-10-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Diablo 4 Sound Effects and Design (Quarterly Update)", "description": "Learn more about Diablo IV's sound effects and design for the upcoming game. Get some behind the scenes looks at how the audio for the gore is created and recorded, as well as the sound design being made for the Desert Field. \n\nListen in on a shortened version of the ambient sound effects of different Diablo 4 regions including: Dry Steppes, the Scosglen Coast, Scosglen Rain, and Fractured Peaks. Additionally, get a glimpse and listen to sound effects for the Wood Wraith monster, as well as different breakable interaction sound effects with a Sorceress.\n\n#Diablo4\n\nTimestamps:\nBreakable Objects Sound Effects - 0:00\nWood Wraith Monster Audio - 1:27\nSound Development Field Recording - 2:27\nSound Development BTS Studio Foley - 4:20\nDry Steppes Ambience Audio -5:33\nFractured Peaks Ambience Audio - 7:45\nScosglen Coast Ambience Audio - 10:05\nScosglen Rain Ambience Audio - 12:07\n\nFor the full video on each of the areas with ambient music see below\nDry Steppes https://www.youtube.com/watch?v=0RDwMOxZqsY\nFractured Peaks: https://www.youtube.com/watch?v=F0G4ECzssK8\nScosglen Coast: https://www.youtube.com/watch?v=wnez77GvFpU\nScosglen Rain: https://www.youtube.com/watch?v=JRdkkd4BdYg", "link": "https://www.youtube.com/watch?v=t4uNK17DxTE", "date_published": "2021-10-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Far Cry 6 Post-Credits Scene Explained", "description": "A post-credits scene in Far Cry 6 answers some questions about the possible return of Far Cry 3 villain Vaas, while raising a few more.\n\nFor a while now, fans have speculated that Far Cry 6 would bring back fan-favorite villain Vaas, one of the antagonists of Far Cry 3. Vaas is the guy who pretty much defined what has become the archetypal Far Cry villain. He's charismatic, scary, and ruthless, and he has some long and fun bad guy monologues. Hints that Vaas was returning have circulated for more than a year, with actor Michael Mando even suggesting he'd reprise the role, and that's fueled a lot of fan theories about the villain's role in Far Cry 6. \n\nUbisoft revealed earlier this year that Vaas, as well as Far Cry 4 villain Pagan Min and Far Cry 5 villain Joseph Seed, would be playable characters in a Far Cry 6 post-launch DLC expansion. But as it turns out, there's more to the Vaas story than whatever is going on in that expansion--which seems altogether dream-like and might possibly exist outside the realm of Far Cry 6's \"real world.\"", "link": "https://www.youtube.com/watch?v=k4K_cDtUo9U", "date_published": "2021-10-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Far Cry 6 Review", "description": "Though it can be really fun, especially when it descends into absolute chaos, Far Cry 6 is overstuffed and disjointed, with so many ideas that it's tough to focus.", "link": "https://www.youtube.com/watch?v=kc1LfTizxyo", "date_published": "2021-10-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]