[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "YEИDRY: Tiny Desk (Home) Concert", "description": "From Sept. 15 through Oct. 15, Tiny Desk is celebrating Hispanic Heritage Month with an \"El Tiny\" takeover of the (home) concert series, featuring J Balvin, Camila Cabello and several more musicians from all corners of Latinidad.\n\nStefanie Hernández | October 8, 2021\nFor a moment, it looks like YEИDRY is rising from the sea. She's barefoot and wearing yellow, like the roses on her side table tiny desk, Oshún's color. On the floor, below the seaside view, is a box of records displaying Celia & Johnny, the 1974 classic collaboration between Celia Cruz and Johnny Pacheco. To her right sits the 1979 album Cross Over by the Fania All Stars, of which Celia and Johnny were both starring members. From Soho Beach House in Miami, YEИDRY performs five songs, which make up most of her solo discography.\n\nShe opens with a song that's just as intimate as her space. \"Nena\" is a prayer sung from the perspective of her mother when she went to Italy in search of opportunity, while a young Yendry Fiorentino stayed with her grandmother in her hometown of Santo Domingo. After she turned 4, she joined her mother in Turin, where she grew up and started her music career.\n\nYEИDRY's songs radiate with a feminine strength of many lives lived, from the sobered reflection on a past relationship of \"Se Acabó\" to the self-sure \"Ya,\" a song \"about the fire ... and the courage that all of us have inside. And sometimes we struggle to get it out.\" Its first phrase, \"yo quiero to'\" (\"I want it all\"), is an invocation of remembering who you are. In \"You,\" her collaboration with Damian Marley, she inhabits the voices of both lovers with a seamless confidence. And in her closer, \"El Diablo,\" she adopts even the devil's power with a slow-burning flamenco that ignites into merengue as she repeats \"soy Dominicana / soy Italiana,\" honoring all her selves in the afternoon light.\n\nSET LIST\n • \"Nena\"\n • \"Se Acabó\"\n • \"YA\"\n • \"YOU\"\n • \"El Diablo\"\n\nMUSICIANS\n • YEИDRY: vocals\n • Danny Flores: keys\n • Jevenson Americain: bass\n • Anderson Quintero: drum pad\n • Daniel Berroa Sr.: percussion\n\nCREDITS\n • Video: Eliam Coro, Seba Creative, Richard Quintero\n • Audio: Danny Flores, Jesús Cantun\n\nTINY DESK TEAM\n • Producer: Anamaria Sayre\n • Video Producer: Kara Frame\n • Audio Mastering: Josh Rogosin\n • Alt.Latino 'El Tiny' Team: Felix Contreras, Reanna Cruz, Anaïs Laurent, Stefanie Fernandez\n • Tiny Production Team: Bob Boilen, Bobby Carter, Maia Stern, Sofie Hernandez-Simeonidis\n • Executive Producer: Keith Jenkins\n • Senior VP, Programming: Anya Grundmann\n\n#eltiny #tinydesk #yendry #eltiny", "link": "https://www.youtube.com/watch?v=h_a5zbizXCw", "date_published": "2021-10-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]