[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "Options to replace CentOS, Ubuntu takes risks in 21.04, and Google destroys Chromium - Linux News", "description": "Try KernelCare Enterprise for free: https://lp.kernelcare.com/kernelcare-enterprise-experiment \n\nThis time, we have various moves to replace CentOS, some big things happening for the next Ubuntu release, and Google trying to drive people away from Chromium.\n\nBecome a channel member to get access to a weekly patroncast and vote on the next topics I'll cover:\nhttps://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nSupport the channel on Patreon: \nhttps://www.patreon.com/thelinuxexperiment\n\nFollow me on Twitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\nFollow me on LBRY: https://lbry.tv/@TheLinuxExperiment:e\n\nJoin us on Discord: https://discord.gg/nN8wwZPpwr\n\nThe Linux Experiment merch: get your goodies there! https://teespring.com/en-GB/stores/the-linux-experiment\n\n00:00 Intro\n01:15 Linux News\n05:12 Open Source News\n07:16 Hardware News\n09:22 Gaming News\n\nWell it seems like Red Hat realized that this move wouldn't drive people to go and buy Red Hat Enterprise Linux licenses in droves, but would probably push more people away, as they decided to  make RHEL free for up to 16 servers. \nhttps://arstechnica.com/gadgets/2021/01/centos-is-gone-but-rhel-is-now-free-for-up-to-16-production-servers/\n\nSpeaking of replacements to CentOS, Alma Linux has its first beta out right now. Alma Linux is a distribution spearheaded by CloudLinux, which already has a lot of experience with CentOS, as they developed CloudLinux OS for 10 years, which already was a fork of Red Hat.\nhttps://blog.almalinux.org/almalinux-beta-release-update/\n\nUbuntu announced that their next release, Ubuntu 21.04, which should release before the end of April 2021, won't be using the GNOME 40. \nhttps://www.omgubuntu.co.uk/2021/01/why-ubuntu-21-04-wont-include-gnome-40-or-gtk4\n\nEven more surprising, Ubuntu 21.04 will also be the release in which Ubuntu moves to Wayland by default.\nhttps://www.omgubuntu.co.uk/2021/01/ubuntu-21-04-will-use-wayland-by-default\n\n\nKDE 5.21 is very, very close, as its first beta was released. I'll have a dedicated video a few days before the official release, but 5.21 is looking pretty good, with a lot of improvements. https://kde.org/announcements/plasma/5/5.20.90/\n\n\nGoogle is making moves to try and stem the tide of chromium based browsers that threaten the hegemony of Chrome on the internet. They decided to remove access to a number of Google Apis from chromium, that made the browser, and everything based on it, a lot more useful.\nhttps://www.omgubuntu.co.uk/2021/01/chromium-sync-google-api-removed\n\n\nSystem76 has yet another new laptop to offer: the Darter Pro. https://system76.com/laptops/darter\n\nTuxedo also has a new laptop out, and it's called the InfinityBook S 15. https://www.gamingonlinux.com/2021/01/tuxedo-announce-the-infinitybook-s-15-with-intel-xe\n\n\nDenuvo, a provider of DRM and anti cheat software for games running on Windows, announced that Denuvo will now be available as a steamworks library, to make it easier to include in various games. Gaming On Linux asked the developers what it meant for Linux gaming, and it turns out there might be good news here.\nhttps://www.gamingonlinux.com/2021/01/steamworks-gets-denuvo-anti-cheat-heres-what-irdeto-say-about-linux-support\n\n\nDo you have a few older games that run pretty badly with Wine or Proton? Well, if these games use an engine that has an open source reimplementation, you're in luck. A new tool, called Luxtorpeda, can now make sure that these older games run well byt automatically downloading and setting up these open source engines, and using them to run your game.\nhttps://www.gamingonlinux.com/2021/01/try-out-luxtorpeda-a-steam-play-tool-to-run-games-in-native-game-engines\n\nVKD3D-Proton, the directX 12 to Vulkan translation layer used by Valve in Proton to run Windows games on Linux, has begun the work needed to support Ray Tracing on Linux.\nhttps://www.gamingonlinux.com/2021/01/vkd3d-proton-begins-work-to-support-directx-raytracing-on-linux\n\n\nWine 6.1 was also released, with support for Arabic text shaping, the use of VKD3D 1.2 to handle DirextX 12 in Wine, and support for Rosetta 2's memory layout. This last point means that Wine 6.1 should work fine on M1 Macs, which is amazing for people using these devices.\nhttps://www.winehq.org/announce/6.1", "link": "https://www.youtube.com/watch?v=ti6GWcpZy8k", "date_published": "2021-02-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]