[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Tom Jones: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nBob Boilen | June 7, 2021\nWe're publishing this Tom Jones Tiny Desk (home) concert on his 81st birthday. It's a poignant moment in the life of a singer whose career spans 56 years and more than 100 million records sold; the passing of his wife, Linda, in 2016 after 59 years of marriage was devastating and resulted in the longest break between recordings of his career. But now Tom Jones is back with a new album, Surrounded By Time, and ready to share his deepest feelings, channeling songs by others with a voice still rich and muscular. It's a triumphant return to the Tiny Desk (his first visit was in 2009), and it's the first time he's performed these songs since recording them last year.\n\nThe songs on the album (and for this Tiny Desk) deal so eloquently with time and aging. Tom Jones sings Bob Dylan's \"One More Cup Of Coffee\" and going \"down to the valley below.\" Then, he takes on Malvina Reynolds' folk tune \"There's No Hole In My Head\" and turns it into a fierce statement about being yourself.\n\nWhen Tom Jones was 33, and after one of his infamous shows in Las Vegas, jazz composer Bobby Cole presented him with the song \"I'm Growing Old.\" With lyrics including \"I'm growing dimmer in the eyes / I'm growing fainter in my talk / I'm growing deeper in my sighs / I'm growing slower in my walk.\" Tom Jones didn't feel old enough to do it justice, but he held on to it. His performance here brought me to tears and is well worth the wait.\n\nSET LIST\n • \"One More Cup of Coffee\"\n • \"There's No Hole In My Head\"\n • \"I'm Getting Old\"\n\nMUSICIANS\n • Tom Jones: vocals\n • Ethan Johns: guitar\n • Nick Pini: bass\n • Stephanie Ward: keys\n • Jeremy Stacey: drums\n\nCREDITS\n • Video: Dan Shipton, Ross Nicholson\n • Audio: Dom Monks\n • Special thanks to Black Skull Creative\n\nTINY DESK TEAM\n • Producer: Bob Boilen\n • Video Producer: Maia Stern\n • Audio Mastering: Josh Rogosin\n • Associate Producer: Bobby Carter\n • Tiny Production Team: Kara Frame, Gabrielle Pierre\n • Executive Producer: Keith Jenkins\n • Senior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #tomjones", "link": "https://www.youtube.com/watch?v=3Qfw6pon9tA", "date_published": "2021-06-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]