[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCEBY1LNHPiJ6AE0B1wxfNHw", "title": "The Oakland, California Homeless Problem is Beyond Belief", "description": "Is this where America is headed? \n\nOakland California sure does have a homeless problem. Driving around town, there’s homeless encampments all over the place. They’re on the side of the roads in dirt lots. There’s long stretches of them on sidewalks. Some of em are tents, some are RVs, some are actual encampments with makeshift structures where hundreds of people gather in communities.\n \nIt’s estimated there’s around 5,000 homeless individuals throughout the city of Oakland, but no one really knows the exact number. And the number of people on the streets in Oakland has nearly doubled in the last two years alone. \n \nA lot of that has to do with the high cost of living in the Bay Area. Apartments that were once $1,000 a month now cost closer to $3,000 a month. A lot of the homeless are addicts. But there’s no real one reason homelessness is so high in Oakland. You ask 10 homeless people why they live on the streets and you’ll get 10 different answers. \n \nLook at this one in West Oakland. This one is sort of sanctioned by the city - meaning they don’t run them off. Sometimes, it’s easier to keep them in one place so they can monitor them and provide support. But this problem is impacting the community in a big way. \n \nLocal businesses complain about losing customers. I mean would you want to park near here to shop? Residents complain about homeless people stealing from them. Neighbors complain about loud noise and trash. Some say helping the homeless is backfiring.\n \nAnd the Oakland police are already stretched thin because of low numbers. There’s many reasons for that - you know, vaccine mandates, early retirements and being defunded. \n \nI spent two days driving around Oakland, looking at how run down this once proud city has become. And along the way, I recorded all the homeless camps I saw. But there was one particular homeless camp that I stumbled onto which put into perspective the state of homelessness here in Oakland, and actually changed my perspective on the homeless problem in general.\n\n#california #moving\n\nYou can buy my music here: \n\niTunes: https://music.apple.com/us/album/state-songs-an-album/1523790725\n\nMore places to get my music: \n-Google Play: https://play.google.com/store/music/album/Nick_Johnson_State_Songs_An_Album?id=Byfshzyrbjldelqferxc6vijljm&hl=en_US\n\n-Amazon Music: https://music.amazon.com/albums/B08D3G43VR\n\nThis channel is about America!\n\nThe best video on this topic!", "link": "https://www.youtube.com/watch?v=yRWmKh13b50", "date_published": "2021-11-07 00:00:00+00:00", "persistent": true, "user": "rumpel", "language": "en", "tags": ["america", "crisis", "homeless"]}]