[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCG2kQBVlgG7kOigXZTcKrQw", "title": "ŻUBRY. Jak wielkie są stada żubrów w Polsce?! 🐂 Znalazłem je za pomocą aplikacji!", "description": "Żubra chciałem zobaczyć już od baaaardzo dawna. Natomiast blisko 3 lata temu pojawił się w mojej głowie pomysł odwiedzenia Podlasia zimą celem poszukania żubrów i nagrania filmu z ciekawostkami dotyczącymi żubrów. Jako, że najlepszym okresem do obserwacji dziko żyjących żubrów jest zima, to też ciężko było mi się zebrać w sobie i pojechać na Podlasie w tym okresie. Sami rozumiecie - nie mam sań i reniferów żeby na Podlasie dojechać (eh te podlaskie żarciki :D). No ale przez deficyt podróży ostatnimi czasy w końcu się zmobilizowałem (było łatwiej po zrobieniu prawka :D ) no i pojechałem hen na daleką północ celem znalezienia Żubrów. Ale tych dzikich żubrów oczywiście! Żadne tam zagrody mnie nie interesują. No i po 2 tygodniach poszukiwań powstał taki oto właśnie film.\n\nMam nadzieję, że Wam się spodoba. Sporo poświęciłem na poszukiwanie informacji i ciekawostek o żubrach. Jeszcze więcej na znalezienie lokalizacji, gdzie można je namierzyć, gdzie żubry lubią przebywać, gdzie się je dokarmia i gdzie bywają najczęściej. Prawdę mówiąc 25% obszarów, gdzie żubry miały się znajdować, się potwierdziło, także jestem naprawdę bardzo zadowolony. Ale więcej już w samym filmie o żubrach. Zapraszam!\n\nZapis na listę kursową ►► https://bit.ly/3s9ctCQ \n\nZapraszam też na:\nFacebook: http://bit.ly/2flU84f\nInstagram: http://bit.ly/2eTrIMc\nBlog: http://kolemsietoczy.pl/\n\nMuzyka: Artlist oraz utwory Nevaeh\n\nSzczególne podziękowania dla:\nJakuba Rybickiego\n\nPiotra Kowalczuka za pomoc logistyczną i pomoc w szukaniu stada żubrów. Marcina Siekierko za udostępnienie ujęć dronowych z dużym stadem żubrów chodzących po Polach we wsi Kotówka k/Hajnówki . \nStrona Marcina: https://www.facebook.com/droneimagepl/\n\nSpis treści\n00:00 - 01:47 - Żubry w Polsce\n01:48 - 02:29 Ile jest Żubrów w Polsce?\n02:30 - 03:53 Puszcza Białowieska\n03:54 - 04:21 Kiedy można spotkać żubra?\n04:22 - 06:23 Historia Żubrów\n06:24 - 07:02 Żubrówka\n07:03 - 08:41 Ślady żubrów\n08:42 - 11:41 Puszcza Augustowska\n11:42 - 12:34 Dlaczego dokarmia się Żubry \n12:35 - 15:47 Jak liczy się Żubry?\n15:48 - 16:16 Puszcza Knyszyńska\n16:17 - 17:18 Czy żubry atakują ludzi?\n17:19 - Dziko żyjące żubry", "link": "https://www.youtube.com/watch?v=tBEIOI5aztM", "date_published": "2021-03-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]