[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "8 Minutes of Mortal Shell Enhanced Edition PS5 Gameplay", "description": "Mortal Shell's Enhanced Edition is now available so we fight our way through the opening area and even take on a mini boss Grisha. Take a look at the all new enhanced edition running on the PlayStation 5.\n\n0:00 Intro\n0:10 Opening Area\n03:25 Grisha Fight", "link": "https://www.youtube.com/watch?v=dyTF8eTQPNw", "date_published": "2021-03-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Guilty Gear Strive Gameplay - Anji and I-No Footage", "description": "Check out new Anji and I-No footage from Guilty Gear  -Strive-, releasing on June 11, 2021.", "link": "https://www.youtube.com/watch?v=wRFk5YPMRnY", "date_published": "2021-03-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Hitman 3 Devs Break Down Dartmoor Mission", "description": "IO Interactive level designers Toke Krainert and Victor Rasmussen break down Hitman 3's incredible Dartmoor mission, including the development of the enthralling murder mystery storyline.\n\nHitman 3's 'A Death in the Family' mission is a Hitman level like no other, allowing the player the opportunity to take on the role of a master detective, collect clues and alibis, and solve a locked room murder mystery with multiple possible outcomes. \n\nIn the video above, Hitman 3 level designers Toke Krainert and Victor Rasmussen  break down the development of the game's unforgettable Dartmoor mission and how they reworked familiar Hitman mechanics to allow players to catch a killer. \n\nFrom initial conception to their favourite secrets, Toke and Victor detail the challenges and opportunities that come with crafting a compelling murder mystery narrative, as well as how the foreboding Thornbridge Manor was designed.", "link": "https://www.youtube.com/watch?v=ww9uHdE_wks", "date_published": "2021-03-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Zombieland Headshot Fever - Official Announcement Trailer", "description": "Survive ferocious zombies and enjoy the dystopian humour of Zombieland as Tallahassee, Wichita, Columbus and Little Rock train you to run the fastest, most dangerous zombie-killing race course ever devised - the Zombieland Invitational! (Captured on Oculus Quest)", "link": "https://www.youtube.com/watch?v=H_35Kd7hUl0", "date_published": "2021-03-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "AMD Radeon RX 6000 Series Expands - Full Presentation", "description": "Watch the full AMD presentation discussing the new AMD Radeon RX 6000 Series graphics cards and how they perform compared to top graphic cards in the gaming space. AMD's new Radeon RX 6000 is AMD's direct competitor to the Nvidia RTX 3000 series graphics cards.", "link": "https://www.youtube.com/watch?v=TIjDDvLMI9s", "date_published": "2021-03-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Brian David Gilbert Answers 27 Questions", "description": "What's Brian David Gilbert's favorite nail polish? How tall is he? And most importantly, how does he like his eggs? BDG answers those and more in this special Q&A.\n\nBDG's channel: https://www.youtube.com/briandavidgilbert\n\nYou might know Brian David Gilbert as the host of Polygon's Unraveled. If you're not familiar with his work, he has taken on gargantuan tasks such as solving the Zelda timeline in 15 minutes. And by solving we mean taking everything that's canon and isn't and then putting it order.\n\nI think most would agree that it's a foolish endeavor. But foolish endeavors are exactly what internet sweetheart Brian David Gilbert is all about. He's also read 337 Skyrim books, ranked over 200 Mega Man robots, attempted to make sense of Kingdom Hearts, and tried to make all 78 food recipes from The Legend of Zelda: Breath of the Wild in one day.\n\nNaturally, it's all fantastic to watch and, as host and creator, Brian David Gilbert approaches each challenge with charm, humor, and a frankly alarming level of earnestness. But what makes him tick? Do we know the real Brian David Gilbert? Why is he the way he is? We decided to find out by sitting him down and interviewing him.\n\nSpecifically, we asked him 27 of the most important questions that'll help you truly get to know him. Like what is he doing now? What's his five-year plan? Favorite dance move? In fact, where did he even learn to dance?\n\nFind out more about Brian here: https://www.briandavidgilbert.com/ or follow him on Twitter @briamgilbert.", "link": "https://www.youtube.com/watch?v=2O0VVoPiHAo", "date_published": "2021-03-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]