[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCHnyfMqiRRG1u-2MsSQLbXA", "title": "A Physics Prof Bet Me $10,000 I'm Wrong", "description": "A UCLA Physics Professor bet me $10,000 that my video about going downwind faster than the wind was wrong. This video is sponsored by Brilliant. The first 200 people to sign up via https://brilliant.org/veritasium get 20% off a yearly subscription. \n\nFor more information about the Veritasium Science Communication Contest check out -- https://ve42.co/contest\n\n ▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀ \nThe wager agreement: https://ve42.co/wager\n\nProf. Kusenko's slides: https://ve42.co/Kusenko\n\nMy rebuttal: https://ve42.co/rebuttal\n ▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀ \nHuge thanks to Xyla Foxlin for building the model cart, and making the instructions so accessible to the public. Check out Xyla's video -- https://youtu.be/VUgajGv4Aok\n\nA massive thanks to Bill Nye, Neil DeGrasse Tyson, and Sean Carroll for witnessing the signing of the wager.\n\nA huge thanks to Prof. Alexander Kusenko for being a man of honour -- it's a difficult thing to change your mind, especially in a public forum.\n\nA huge thanks to Prof. Mark Drela for the interview and help making sure we got the physics right.\n\nA massive thanks to Rick Cavallaro for making Blackbird, all your insights, analysis, data, and general help with these videos -- it was so fun to work with you on this crazy project -- check out Rick's channel https://ve42.co/Rick\n\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀ \nReferences\nM. Drela. Dead-Downwind Faster Than The Wind (DDWFTTW)\nAnalysis (Jan 2009) -- https://ve42.co/Drela\n\n2013 AAPT United States Physics Olympiad Semifinal Exam -- https://ve42.co/AAPT2013\n\nRick's treadmill footage -- https://ve42.co/Treadmill\n\nRick's multiple explanations of how Blackbird works -- https://ve42.co/DDWFTTW\n\nBlackford, B. L. (1978). The physics of a push‐me pull‐you boat. American Journal of Physics, 46(10), 1004-1006. — https://ve42.co/Blackford1979\n\nRuina corrects errors in the above paper: http://ruina.tam.cornell.edu/research/topics/miscellaneous/push-me_pull-you.pdf\n\nForum discussions -- https://ve42.co/forum Blog -- https://ve42.co/blog1 and retraction https://ve42.co/BlogRetraction\n\nBauer, A. B. (1969, April). Faster than the Wind. In First AIAA Symposium on Sailing. -- https://ve42.co/Bauer1969\n\nBauer's Obituary -- https://ve42.co/BauerObituary\n\nGaunaa, M., Øye, S., & Mikkelsen, R. F. (2009). Theory and design of flow driven vehicles using rotors for energy conversion. In EWEC 2009 Proceedings online EWEC  \n\nMd. Sadak Ali Khan, Syed Ali Sufiyan, Jibu Thomas George, Md. Nizamuddin Ahmed. Analysis of Down-Wind Propeller Vehicle. International Journal of Scientific and Research Publications, 3, 4. (April 2013) ISSN 2250-3153.\n\nThe Manim Community Developers. (2021). Manim – Mathematical Animation Framework (Version v0.13.1) [Computer software]. https://www.manim.community/\n\n ▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀ \nSpecial thanks to Patreon supporters: Mike Tung, Evgeny Skvortsov, Meekay, Ismail Öncü Usta, Bill Linder, Paul Peijzel, Crated Comments, Anna, Mac Malkawi, Michael Schneider, Oleksii Leonov, Jim Osmun, Tyson McDowell, Ludovic Robillard, Jim Buckmaster, fanime96, Juan Benet, Ruslan Khroma, Robert Blum, Richard Sundvall, Lee Redden, Vincent, Marinus Kuivenhoven, Alfred Wallace, Arjun Chakroborty, Joar Wandborg, Clayton Greenwell, Pindex, Michael Krugman, Cy 'kkm' K'Nelson, Sam Lutfi, Ron Neal\n\n ▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\n\nWritten and Edited by Derek Muller\nAnimation by Mike Radjabov\nManim equations by Jonny Hyman\nFilmed by Emily Zhang and Raquel Nuno\nMusic from Epidemic Sound https://epidemicsound.com and by Jonny Hyman\nAdditional video supplied by Getty Images\nProduced by Emily Zhang, Petr Lebedev and Derek Muller", "link": "https://www.youtube.com/watch?v=yCsgoLc_fzI", "date_published": "2021-06-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]