[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "One Month with GNOME Web / Epiphany was NOT FUN", "description": "Download Safing's Portmaster for FREE, or subscribe to the SPN: https://safing.io\n\nGet your Linux desktop or laptop here: https://slimbook.es/en/\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nI also do a Gaming Podcast: https://www.youtube.com/channel/UCbRPZ11S1quJ4ESoj42A3ug\nJoin us on our new Discord server: https://discord.gg/xK7ukavWmQ\nTwitter : http://twitter.com/thelinuxEXP\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\nFollow me on ODYSEE: https://odysee.com/@TheLinuxExperiment:e\nOr join ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\n\n00:00 Intro\n00:27 Sponsor: this is better than a VPN\n01:21 The Good Stuff\n03:57 Website Compatibility\n06:13 Video Playback\n08:11 Password Management\n09:56 What will I use, then?\n\nFirst, Epiphany looks RIGHT. If you're using a GTK desktop, or even a Plasma desktop with a correct GTK theme set, it looks really nice.\n\nSecond, Epiphany just so happens to share Safari's rendering engine, and generally, when I identify a bug on Epiphany, it's also going to happen on Safari, so it's a nice way to debug for what my previous boss uses.\n\nThird, Epiphany syncs with my Firefox account.\n\nFourth, EPiphany, on a laptop, has 2 finger swieps to go back and forward, which is an amazing way to navigate using a touchpad, and **why are other browsers not doing it, seriously.**\n\nAnd, finally, Epiphany doesn't come with an overload of features.\n\nFirst, the website compatibility: Epiphany has issues on that front. It might use Safari's rendering engine, but it's surprisingly less capable. Here are a few examples I happened upon:\n\nEpiphany triggers A LOT of \"are you a bot\" dialogs. In the startpage search engine, especially, I get blocked all the time, because it seems to think I'm making suspiscious requests.\n\nOn top of that, EPiphany is heavier than Firefox, that I used before.\n\nNext issue, the video playback. Youtube on Epihany is basically a 50/50 thing. You can play any video you want, provided you're playing it from the start. If you're trying to resume a video you've watched but not finished? Won't work. If you're trying to move forwards in a video? Nope, doesn't work. If you try to go back to the beginning, it might resume playback, but not always.\n\nThis is probably the WORST problem I have with Epiphany, and keep in mind it happens both on my laptop and my dsktop, both with beefy CPUS, and with mesa drivers or with nvidia proprietary drivers.\n\nThe sync with Firefox isn't super reliable. I often get an issue telling me the sync secret is invalid, and realize nothing has been synced for a while. But that's manageable, I just re-login to the Firefox account, and sync starts again. Not perfect, but it's OK.\n\nNo, the real issue is taht Epiphany doesn't really fill login forms on a lot of websites. On my accounting software, it doesn't fill either of the fields, login, or password. On the website I work as a freelance product owner, it doesn't auto fill either, and while it offers a list of logins, selecting them with the mouse doesn't work, using the arrow keys doesn't select them in the right order, and doesn't have any visual feedback, and it won't fill the password field.", "link": "https://www.youtube.com/watch?v=VjQQhuVS26g", "date_published": "2021-12-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]