[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Olivia Rodrigo: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nSofie Hernandez-Simeonidis | December 7, 2021\nStepping into a DMV when you're about to take your first driver's test, while nerve wracking, is something of a milestone. And Olivia Rodrigo has been hitting milestones with frequency this year: her first album SOUR debuted at the top of the charts in May after the success of three previously released singles, most notably the viral \"drivers license\" (hence the DMV locale and its \"interesting vibes.\") Her pop stardom may seem sudden, but Rodrigo has been entranced by music and songwriting for the majority of her 18 years, as if she's been observing the right moves from the backseat of the car until it was time for her to get behind the wheel.\n\nRodrigo and her band take on the Tiny Desk mentality as they experiment with arrangements throughout this performance, embracing new sounds for her songs. The set begins with an acoustic version of the pop-punk-ish single \"good 4 u,\" and a similar setup continues with the addition of an echoey, electric guitar in \"traitor.\" \"drivers license\" features only Rodrigo and her keyboard, a shift from the recorded version well-known for Dan Nigro's production and the ever-present beeping of a car door sensor. \"deja vu\" starts softly with just an acoustic guitar until the chorus ramps up to a full band after she exclaims, \"Do you get deja vu, huh?\"\n\nSOUR tells the story of a first heartbreak, one that inspires an intense anguish most accessible when you're a teenager. That open wound, empty-chest feeling of a breakup, especially when you're as young as Rodrigo, is difficult to shake. The album allowed listeners to bask in Rodrigo's heartache as if it were their own, but as she dances around an empty DMV and laughs along to a song about betrayal, she proves that time heals all wounds.\n\nSET LIST\n\"good 4 u\"\n\"traitor\"\n\"drivers license\"\n\"deja vu\"\n\nMUSICIANS\nOlivia Rodrigo – vocals, guitar, keys\nHeather Baker - guitars\nHayley Brownell - drums, guitars\nArianna Powell - guitars\nMoa Munoz - bass, guitar\n\nCREDITS\nVideo: David Clair, Joe McGarry\nAudio: Paul Hager\nAP: Derek Griesbach\nDirector of Photography: Matthias Schubert\nCamera Operator: Stephen St. Peter\nGaffer: Joe Escandell\nColor: Henry Santos\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bobby Carter, Kara Frame, Sofie Hernandez-Simeonidis\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #oliviarodrigo", "link": "https://www.youtube.com/watch?v=KGczofguB0c", "date_published": "2021-12-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]