[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 - Top 16 Things We Had To Test", "description": "Battlefield 2042 specialists aren’t very popular, but that doesn’t mean we can’t push them to the limit. In this video, we’re testing unexpected physics, seeing if even more things can pierce Dozer’s shield, learning Ranger is no good boy, and messing with guns, rockets, and explosives.\n\nWelcome back to more Battlefield 2042 mythbusting. The latest game by DICE may have had a very rocky and buggy launch, but that’s an even better reason to test the limits of specialists, gadgets, and some wonky physics. While you’re waiting for some massive patches to come in with more than 150 fixes, join us as we have some fun with the game’s brokenness.\n\nIn this video, we’re going to see if you can be killed by a flying decapitated tank turret, if you can break your fall by grappling the ground, if anything can pierce Dozer’s shield, and what Irish’s grenade and rocket interceptor actually stops. We’re also going to show you how to stop those overpowered hovercraft, see if smoke can save you from Paik’s scan, try to revive through floors, and mess with some explosives. We’d love to do even more tests, so tell us what you would like us to try with specialists, gadgets, guns, or physics. \n\nBattlefield 2042 is out now on Xbox One, Xbox Series X/S, PlayStation 4, PS5, and PC. Make sure to head on over to GameSpot.com and stay here on youtube.com/gamespot for ongoing coverage, including Season 1 starting in 2022, the new Exposure map, and a recent DICE shakeup putting Titanfall/Apex Boss Vince Zampella in charge.", "link": "https://www.youtube.com/watch?v=anrVHH05qJQ", "date_published": "2021-12-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Destiny 2 Bungie 30th Anniversary Pack Livestream", "description": "We check out the Destiny 2 Anniversary Pack, an in-game celebration of 30 years of Bungie that includes a new dungeon, 6-person activity, gear, and the return of Gjallarhorn.", "link": "https://www.youtube.com/watch?v=5VYxzUc9wg0", "date_published": "2021-12-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Vanguard & Warzone - The Pacific Launch Trailer", "description": "Check out Call of Duty: Vanguard & Warzone's The Pacific launch trailer. See the different locales you'll visit and some of the action that takes place on the map.\n\n#CallofDuty #ThePacific", "link": "https://www.youtube.com/watch?v=WQAaw1I1N-g", "date_published": "2021-12-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Infinite Campaign Review", "description": "Halo Infinite transforms the series' two-decade-old formula for the better, giving protagonist Master Chief more characterization and implementing an open world.", "link": "https://www.youtube.com/watch?v=4w8MIolHveQ", "date_published": "2021-12-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Infinite Campaign: What Went Wrong In 2020 | GameSpot News", "description": "In this episode of GameSpot News, we talk about Halo Infinite Boss Explains What Went Wrong With The 2020 Campaign Demo, Halo Infinite Is Adding More Playlists Soon, But Slayer Isn't Ready Yet and details about Call of Duty Warzone’s Pacific map launch.  \n\nIn this video, DeVante talks about what went wrong with Halo Infinite’s 2020 demo. 343’s Bonnie Ross explained because developers were mostly working from home at the time due to the pandemic and not everyone working on the game saw the same picture quality for the demo.\n\nDeVante also talks about when Halo Infinite’s multiplayer will get additional playlists.  Fiesta, Tactical Slayer (SWAT), and Free-For-All are on the way, however they won't be in the game on December 8 when the campaign launches.  \n\nLater in the video, DeVante talks about Call of Duty: Warzone finally getting its long-awaited new Pacific-themed map this week and how players can get early access.", "link": "https://www.youtube.com/watch?v=6lDY_K5zw_M", "date_published": "2021-12-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Infinite First Full Mission Xbox Series X 4K Gameplay", "description": "Check out Halo Infinite's first campaign mission \"Warship Gbraakon\". Master Chief fights his way through various enemies, while learning to use some of his new equipment including the grappling hook.\n\n#Halo #HaloInfinite", "link": "https://www.youtube.com/watch?v=d3O1tSKx818", "date_published": "2021-12-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Infinite Multiplayer Mythbusting and Testing", "description": "Halo Infinite's multiplayer has already had its share of off-the-wall combat moments that have left us with more questions than answers. Check out our list of myths that need some verification or busting.\n\n#HALO", "link": "https://www.youtube.com/watch?v=Cf3hDw970l4", "date_published": "2021-12-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]