[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Good long term immunity", "description": "Duration of Antibody Responses after Severe Acute Respiratory Syndrome (2007)\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC2851497/\n\nn = 176\n\nSARS-specific antibodies were maintained for an average of 2 years\n\nSignificant reduction of immunoglobulin G in the third year\n\nCovid-19: Do many people have pre-existing immunity?\n\nhttps://www.bmj.com/content/370/bmj.m3563\n\nBut T cell studies allow for a substantially different, more optimistic, interpretation.\n\nSARS-CoV-2-specific T cell immunity in cases of COVID-19 and SARS, and uninfected controls (Nature, 2020)\n\nhttps://pubmed.ncbi.nlm.nih.gov/32668444/\n\nn = 36\n\nIn all of these individuals, we found CD4 and CD8 T cells that recognized multiple regions of the N protein\n\nCoronavirus nucleocapsid (N), structural protein that forms complexes with genomic RNA\n\nPatients (n = 23) who recovered from SARS (SARS-CoV-1 infection)\n\nPossess long-lasting memory T cells, reactive, 17 years after 2003\n\nThese T cells displayed robust cross-reactivity to the N protein of SARS-CoV-2\n\nEpitope characterization of specific T cells showed the recognition of protein fragments that are conserved among animal betacoronaviruses\n\nPersistent Cellular Immunity to SARS-CoV-2 Infection\n\nhttps://www.biorxiv.org/content/10.1101/2020.12.08.416636v1\n\nIntroduction\n\nCellular and humoral immune responses to infection\n\nAntibody responses include most of the structural proteins expressed\nby the virus\n\nNeutralizing antibodies directed primarily to the receptor binding domain of the\nspike\n\nLymphopenia is a prominent feature of severe infection\n\nDuring acute infection, T cells displayed a highly activated cytotoxic phenotype\n\nConvalescent patients harbored polyfunctional SARS-CoV-2-specific T cells,\n\nthat display a stem like memory phenotype\n\nCross-reactivity with seasonal/common cold coronaviruses\n\nMay be associated with a milder clinical course\n\nCoronaviruses, levels of persistent Immunity\n\nFour seasonal coronaviruses, immunity 6 to 12 months\n\nImmune response in recovered individuals, measured T cell responses\n\nPaired samples, average of 1.3 months and 6.1 months after infection\n\nN = 41 individuals\n\n63.4% male and 36.6% female\n\n24-73 years old\n\nVarious disease severity, skewed to mild\n\nRecovered individuals show persistent polyfunctional SARS-CoV-2 antigen specific memory\n\nCould contribute to rapid recall responses\n\nRecovered individuals\n\nEnduring immune alterations and numbers\n\nCD4+   T cells (helpers)\n\nCD8+ T cells (cytotoxic)\n\nSummary\n\nBroadly reactive and highly functional memory T cell responses\n\nPersist 6 months after infection\n\nEnduring immune alterations in CD4+ and CD8+ T cells compartments.\n\nSpecific circulating T cell numbers goes down over 6 months\n\nSARS-CoV-2 infection induces long-lived bone marrow plasma cells in humans\n\nhttps://www.nature.com/articles/s41586-021-03647-4\n\nLong lived bone marrow plasma memory cells\n\nConvalescent individuals have a significantly lower risk of reinfection\n\nPatients who experienced mild infections (n=77)\n\nSpike (S) antibodies decline rapidly in the first 4 months after infection\n\nThen more gradually over the following 7 months\n\nRemaining detectable at least 11 months after infection\n\nBone marrow aspirates, S-specific BMPCs\n\n18 SARS-CoV-2 convalescent patients 7 to 8 months after infection\n\n7 to 8 months after infection\n\n5 patients 11 months after infection\n\n7 to 8 months no S-specific plasma blasts\n\n11 healthy subjects with no history of SARS-CoV-2 infection\n\nWe demonstrate that S-binding BMPCs are quiescent, indicating that they are part of a long-lived compartment. \n\nOverall, we show that SARS-CoV-2 infection induces a robust antigen-specific, long-lived humoral immune response in humans.\n\nImmunity may persist\n\nhttps://www.nytimes.com/2021/05/26/health/coronavirus-immunity-vaccines.html\n\nScott Hensley, immunologist, University of Pennsylvania\n\nThe papers are consistent with the growing body of literature that suggests that immunity elicited by infection and vaccination for SARS-CoV-2 appears to be long-lived\n\nThe reason we get infected with common coronaviruses repetitively throughout life might have much more to do with variation of these viruses rather than immunity \n\nMichel Nussenzweig, immunologist, Rockefeller University, New York\n\nPeople who were infected and get vaccinated really have a terrific response, a terrific set of antibodies, because they continue to evolve their antibodies\n\nI expect that they will last for a long time\n\nBoosters doses?\n\nProbably for those only vaccinated\n\nThat’s the kind of thing that we will know very, very soon", "link": "https://www.youtube.com/watch?v=mzOf6Cj3T-8", "date_published": "2021-05-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]