[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCAKcSON6PSG_JkTbXh2WdIg", "title": "Moby - two songs at The Current (2009)", "description": "On May 28, 2021, Moby releases \"Reprise,\" his 19th studio album. In recognition of that, we look back to this session Moby performed in our studio back in 2009, when he was touring in support of \"Wait for Me,\" his album from that year — and his ninth studio release to that date, ten albums ago! \n\nSONGS PERFORMED\n0:00 \"Walk With Me\"\n3:27 \"Pale Horses\"\n\nPERSONNEL\nMoby – guitar, vocals\nInyang Bassey - vocals\nClaudia Chopek – violin\nKelli Scarr – vocals\n\nCREDITS\nVideo & Photo: Chuck Olsen\nAudio: Michael DeMark\nProduction: Derrick Stevens\n\nFIND MORE:\n2009 studio session: https://www.thecurrent.org/feature/2009/10/02/moby\n2013 interview: https://www.thecurrent.org/feature/2013/11/22/interview-with-moby\n\nSubscribe to our channel:\nhttp://www.youtube.com/user/893TheCurrent?sub_confirmation=1\nLike/Follow:\nhttps://www.facebook.com/TheCurrent/\nhttps://twitter.com/TheCurrent\nhttps://www.instagram.com/thecurrent/\n\n#thecurrent #moby", "link": "https://www.youtube.com/watch?v=64_MI7wSywk", "date_published": "2021-05-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCAKcSON6PSG_JkTbXh2WdIg", "title": "Rock The Cradle Play Along: Episode 3", "description": "In episode 3 of Rock The Cradle Play Along, Elena Moon Park introduces us to some of her musical friends, and she shares a Taiwanese train song. MacPhail Center for Music's Cari Gregerson helps us create a rain stick. We continue to build our break-dancing skills with House of Dance. We get sparkly with Koo Koo Kanga Roo. Plus, we explore a really cool collection of instruments with the Sumunar Gamelan Ensemble and Minneapolis Institute of Art! Watch the video in the window above.\n\nEPISODE 3 CONTENTS\nIntro with Jade 00:00\nElena Moon Park, \"Brilliant New Idea\" 01:44\nSumunar Gamelan Performance 06:08\nElena Moon Park, \"Diu Diu Deng\" (Taiwanese Train Song) 10:17\nLittle Moments Count: Babies Love a Good Beat 15:57\nMacPhail Center for Music: Make a Rainstick 16:51\nHouse of Dance: Break Dancing Lesson 19:25\nKoo Koo Kanga Roo, \"Glitter\" 23:59\n\nBig thanks to our Rock the Cradle Play Along sponsors: Minneapolis Institute of Art, Bell Museum, Pizza Lucé, Little Moments Count, MacPhail Center for Music, Sala Architects and Park Dental. Enjoy these special offers from our sponsors: https://files.apmcdn.org/production/44a599df4cf8938bde128245edfa495c.pdf\n\nYou can also find this on our website: https://www.thecurrent.org/feature/2021/05/15/rock-the-cradle-2021-a-saturday-morning-video-series\n\nABOUT THE PERFORMERS\n\nElena Moon Park is a musician and educator living in Brooklyn, N.Y. She is a co-Artistic Director of the Brooklyn-based organization Found Sound Nation, which uses collaborative music creation to connect people across cultural divides, and is an active freelance multi-instrumentalist in New York City, specializing in family music and contemporary classical music. In 2012, Elena released \"Rabbit Days and Dumplings,\" her debut album for families featuring folk and children's music from East Asia. She performs and tours with all-ages musicians Sonia De Los Santos and Dan Zanes, and leads her own all-ages folk rock band, Elena Moon Park and Friends. She released a second album, \"Unhurried Journey,\" in summer 2020.\n\nHouse of Dance Twin Cities — Established in 2014, House of Dance Twin Cities is Minnesota's first and premier dance studio dedicated to teaching breakdancing, popping & locking and hip hop dance classes to people of all ages and experience levels. The instructors humbly maintain that they are students themselves, dedicated to improving their dance so that they can share more with others. They take their art and their jobs very seriously and appreciate everyone who entrusts their learning with them.\n\nKoo Koo Kanga Roo — Koo Koo Kanga Roo is a dance party of the senses. For the last 12 years, lifelong friends and collaborators Bryan and Neil have toured the globe delighting fans with their high-energy music, infectious positivity, and interactive live show. Of course, the global pandemic of 2020 threatened to put an end to the carefree fun that had come to define the band, but instead of putting the group on pause or looking for office jobs, Bryan and Neil doubled down and created their most triumphant and expansive album yet.\n\nSubscribe to our channel:\nhttp://www.youtube.com/user/893TheCurrent?sub_confirmation=1\nLike/Follow:\nhttps://www.facebook.com/TheCurrent/\nhttps://twitter.com/TheCurrent\nhttps://www.instagram.com/thecurrent/\n\n#thecurrent #rockthecradle", "link": "https://www.youtube.com/watch?v=ektRJWcHRRs", "date_published": "2021-05-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]