[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "The Hold Steady: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nLyndsey McKenna | June 3, 2021\nIf you’ve ever seen a Hold Steady show, then you know it’s an experience, complete with communal singalongs and confetti. But for its first-ever full-band Tiny Desk appearance, the group squeezed behind a cramped backstage corner of the Brooklyn Bowl, COVID mask protocol in place (“Unusual times, unusual measures,” Craig Finn explains). \n\nIlluminated by string lights, the band ran through tracks from its latest album, Open Door Policy, kicking off with “Heavy Covenant” as a swell of clarinets and trumpets round out the sound (“The Horn Steady,” as Finn tells it). Though the lineup consisted of its current supersized iteration – featuring both Steve Selvidge on guitar and multi-instrumentalist Franz Nicolay back on accordion – the band scaled back its swagger for the space. Here, the recurring “Woos!” on the recorded version of “Unpleasant Breakfast” become softer and more subtle; the surf sounds of “Riptown” still rolick, but with restraint that suits the setting.\n\nEven after eight studio albums and nearly two decades, it’s surreal to think that any band can still have the capacity to surprise. But to this fan’s ears, Open Door Policy upends expectations and redefines what The Hold Steady sound can be. And even in a compact – and crowdless – setting, there’s still so much joy to be found in what The Hold Steady has built for almost 20 summers. \n\nSET LIST\n\"Heavy Covenant\"\n\"Unpleasant Breakfast\"\n\"Riptown\"\n\"Parade Days\"\n\nMUSICIANS\nBobby Drake: drums\nCraig Finn: vocals\nTad Kubler: guitar, vocals\nFranz Nicolay: keyboards, accordion, vocals\nGalen Polivka: bass\nStephen Selvidge: guitar, vocals\nStuart Bogie: clarinet\nPeter Hess: clarinet\nJordan McLean: trumpet\n\nCREDITS\nVideo: Jonathan Healey, Clint Tuccio\nAudio: Scott Adamson, Jonathan Silverman\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Kara Frame, Gabrielle Pierre\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #theholdsteady", "link": "https://www.youtube.com/watch?v=U0S-FysDePE", "date_published": "2021-06-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Buzzy Lee: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nBob Boilen | June 2, 2021\nThere's a comfort to be found singing in a bathroom; we all sound better with our voices bouncing off the tiles. For Sasha Spielberg, a.k.a. Buzzy Lee, she took it a step further, recording her Tiny Desk (home) concert in her childhood bathroom, which her parents decorated with images of fairytales.\n\nSasha Spielberg tells me there's \"Cinderella and her fairy godmother, the Seven Dwarfs and the Three Wise Men of Gotham, which is part of Mother Goose, apparently.\" She continues, \"This bathroom is where I would go to sing. I would make up songs about each of the fairytales on the tiles, and I could sing as loud as I wanted, and it felt as if I had enough privacy. It was my escape. I'd spend hours on end in here dreaming of singing in front of people. It's also where I wrote my first song, age 5, 'You're Just Like Pie Crust.' It was a pop song. Huge hit.\"\n\nBuzzy Lee captured my heart with her 2021 album Spoiled Love, an album produced with Nicolas Jaar. With musicians Adam Gunther sitting in the tub playing modular synths and Jorge Balbi Castellano seated on the 'throne' playing drum pads, we hear songs and tales with different themes: obsession, love, attachment, and self-doubt, all filled with playful wordplay and her passionate voice.\n\nSET LIST\n • \"Strange Town\"\n • \"Coolhand\"\n • \"Spoiled Love\"\n • \"What Has A Man Done\"\n\nMUSICIANS\n • Sasha Spielberg: keys, vocals\n • Adam Gunther: modular synth, modular bass\n • Jorge Balbi Castellano: drums\n\nCREDITS\n • Video: Harry McNally\n • Audio: Adam Gunther\n\nTINY DESK TEAM\n • Producer: Bob Boilen\n • Video Producer: Kara Frame\n • Audio Mastering: Josh Rogosin\n • Associate Producer: Bobby Carter\n • Tiny Production Team: Maia Stern, Gabrielle Pierre\n • Executive Producer: Keith Jenkins\n • Senior VP, Programming: Anya Grundmann\n\n#buzzylee #tinydesk #nprmusic", "link": "https://www.youtube.com/watch?v=cRUvdNsOdVY", "date_published": "2021-06-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]