[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "Is the U.S. Leaving Afghanistan on the Brink of Civil War? | Leaving Afghanistan | FRONTLINE", "description": "Najibullah Quraishi reports from Afghanistan, finding that as the U.S. withdraws, the Taliban is resurgent; fears of civil war are rising; and a new threat is emerging — Iran’s growing influence. An excerpt from \"Leaving Afghanistan.\"\n\nSubscribe on YouTube: http://bit.ly/1BycsJW \n\n“I grew up in the war,” Quraishi says in the film. “I have seen everything with my own eyes, but this time is more and more dangerous than the past.”\n\nIn this excerpt, Quraishi explores what's happening to the Hazara Shia minority living in Afghanistan as the U.S. withdraws, the Sunni Taliban advances, and the Shia power Iran works to extend its influence. \n\nFor the full story, watch \"Leaving Afghanistan\" July 20 on FRONTLINE: https://to.pbs.org/3eEYxwd\n\nFind FRONTLINE on the PBS Video App, where there are more than 300 FRONTLINE documentaries available for you to watch any time: https://to.pbs.org/FLVideoApp   \n\nSubscribe on YouTube: http://bit.ly/1BycsJW \nInstagram: https://www.instagram.com/frontlinepbs \nTwitter: https://twitter.com/frontlinepbs \nFacebook: https://www.facebook.com/frontline \n\nFRONTLINE is produced at GBH in Boston and is broadcast nationwide on PBS. Funding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Major funding for FRONTLINE is provided by the Ford Foundation. Additional funding is provided by the Abrams Foundation; the John D. and Catherine T. MacArthur Foundation; Park Foundation; and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation and additional support from Koo and Patricia Yuen.", "link": "https://www.youtube.com/watch?v=6_vRJFSGMSQ", "date_published": "2021-07-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]