[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "First Omicron science", "description": "Viral replication is reduced in the lung tissue, but increased in the bronchi. This could indicate increased transmissibility but reduced pathogenicity.\n\nLink for free download of John's two text books, http://159.69.48.3/\n\nCampbell's Pathophysiology Notes, Amazon orders for the UK, https://www.amazon.co.uk/dp/B012HWC8SU/ref=cm_sw_em_r_mt_dp_AYC5Q7G3H2B3T4BCHQY0\nCampbell's Physiology Notes \nhttps://www.amazon.co.uk/dp/0955379725/ref=cm_sw_em_r_mt_dp_K0MXMAP26Y77TY4J90FB\n\nFirst video on my series on the respiratory system, https://www.youtube.com/watch?v=TB2lA9sFCD0\n\nHKUMed finds Omicron SARS-CoV-2\ncan infect faster and better than Delta \nin human bronchus\n\nhttps://researchnews.cc/news/10606/HKUMed-finds-Omicron-SARS-CoV-2-can-infect-faster-and-better-than-Delta-in-human-bronchus#.Yb8Nai-l2QV\n\nFirst information on how Omicron SARS-CoV-2 infect human respiratory tract. \n\nOmicron infects and multiplies 70 times faster than the Delta in human bronchus, \n\nwhich may explain why Omicron may transmit faster\n\nOmicron infection in the lung is significantly lower than the original SARS-CoV-2, \n\nwhich may be an indicator of lower disease severity. \n\nThis research is currently under peer review for publication. \n\nPioneered the use of ex vivo cultures of the respiratory tract,\n\nfor investigating many emerging virus infections since 2007\n\nLung tissue removed for treatment of the lung\n\nDr Chan and his team successfully isolated the Omicron SARS-CoV-2,\n\nand used this experimental to compare infection with the original and Delta variants\n\n24 hours after infection\n\nOmicron variant replicated around 70 times higher than the Delta variant and the original SARS-CoV-2 virus. \n\nIn contrast, the Omicron variant replicated less efficiently (more than 10 times lower) in the human lung tissue than the original SARS-CoV-2 virus, \n\nwhich may suggest lower severity of disease.\n \nDr Chan\n\nIt is important to note that the severity of disease in humans is not determined only by virus replication but also by the host immune response to the infection,\n\nwhich may lead to dysregulation of the innate immune system, i.e. “cytokine storm”\n\nIt is also noted that, by infecting many more people, \n\na very infectious virus may cause more severe disease and death even though the virus itself may be less pathogenic. \n\nTherefore, taken together with our recent studies showing that the Omicron variant can partially escape immunity from vaccines and past infection, \n\nthe overall threat from Omicron variant is likely to be very significant.\n\nKoch's postulates \nThe microorganism must be found in abundance in all organisms suffering from the disease but should not be found in healthy organisms.\n\nThe microorganism must be isolated from a diseased organism and grown in pure culture.\n\nThe cultured microorganism should cause disease when introduced into a healthy organism.\n\nThe microorganism must be reisolated from the inoculated, diseased experimental host and identified as being identical to the original specific causative agent.", "link": "https://www.youtube.com/watch?v=84XMFVcLScw", "date_published": "2021-12-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Omicron hits Europe", "description": "Thanks to Rebecca at DW News. Omicron cases will rise in Europe over the next few weeks. This will mean tens of millions of people will have the infection all at the same time. However, South Africa has had this variant for a month, and hospital admissions remain low.", "link": "https://www.youtube.com/watch?v=xyzN3V1BpbE", "date_published": "2021-12-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Time to prepare for omicron exposure", "description": "Thanks to Eddie and DW news. Omicron is coming so we need to get our immune system into the best possible condition.", "link": "https://www.youtube.com/watch?v=4BbJWx_t7AA", "date_published": "2021-12-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "DW Omicron interview", "description": "Thanks to Marianna and DW. This would have been a better answer to the question I messed up:\nTwo-dose Pfizer-BioNTech vaccination provides some protection against symptomatic infection with omicron, but significant protection against hospitalisation (South Africa data)\n\n33% protection against infection with omicron, relative to the unvaccinated\n\n(down from 80% protection against infection with delta)\n\n70% protection against hospital admission in omicron infection, relative to the unvaccinated\n\n(down from 93% protection with delta)", "link": "https://www.youtube.com/watch?v=yzwsB6eHeb4", "date_published": "2021-12-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Omicron, Common cold symptoms", "description": "the medical people I interact with at the hospital are far more optimistic than I've seen them since this all began in April last year\n\nhttps://www.nicd.ac.za/diseases-a-z-index/disease-index-covid-19/surveillance-reports/daily-hospital-surveillance-datcov-report/\n\nNobody want's to tempt fate or speak to loudly just yet ,,,its like walking on egg shells at the moment – \n\nBut there are open beds and they're not filling up just yet  - in fact there are 2 more beds now than last weekend.\n\nKind regards,\nClaire\n\nDr. Anthony Fauci\nhttps://www.reuters.com/business/healthcare-pharmaceuticals/omicron-five-times-more-likely-reinfect-than-delta-study-says-2021-12-17/\n\nWhen you have a larger number of people getting infected, the total amount of hospitalizations is going to be more. That's just simple math \n\n\n\n\n\nOmicron and cold-like symptoms rapidly taking over in London\n\nhttps://covid.joinzoe.com/post/omicron-and-cold-like-symptoms-rapidly-taking-over-in-london\n\nData up to 11th December 2021\n\nhttps://covid.joinzoe.com/post/omicron-and-cold-like-symptoms-rapidly-taking-over-in-london\n\nIn people with at least two doses in the UK\n\nCurrently 27,000 new daily symptomatic cases \n\nAn increase of 6% from 25,411 new daily cases last week\n \nLondon is currently seeing a rapid rise in positive cases\n\nDriven by omicron\n\nPrevalence in the UK\n\nOne in 57 currently have symptomatic COVID\n\nZOE’s predicted Long COVID incidence rate\n\n1,418 people a day will go on to experience symptoms for longer than 12 weeks \n\nOmicron symptoms\n\nInitial analysis of symptom data from positive cases in London\n\nTo compare Delta and Omicron symptoms\n\nLondon data was selected from a week in October\n\nWith the most recent week ending 10th December\n\nThis initial analysis found no clear differences in the early symptoms (3 days after test) between Delta and Omicron. \n\nThe top five symptoms reported in the ZOE app\n\nrunny nose\n\nheadache\n\nfatigue (either mild or severe)\n\nsneezing\n\nsore throat\n\nSA Patients presentations\n\nBlocked or runny nose\n\nHeadache\n\nTiredness\n\nScratchy or sore throat\n\nBody aches\n\n\nNHS official symptoms\n\nhttps://www.nhs.uk/conditions/coronavirus-covid-19/symptoms/main-symptoms/\n\nThe main symptoms of coronavirus (COVID-19) are:\n\na high temperature \n\na new, continuous cough \n\na loss or change to your sense of smell or taste\n\nProfessor Tim Spector\n\nOmicron is set to be the dominant strain in the UK by Christmas, \n\nand in the New Year cases could hit a peak higher than anything we’ve ever seen before. \n\nHopefully people now recognise the cold-like symptoms which appear to be the predominant feature of Omicron. \n\nAhead of Christmas, if people want to get together and keep vulnerable family members safe,\n\nI’d recommend limiting social contact in the run up to Christmas,\n\nand doing a few Lateral Flow Tests just before the big family gathering.", "link": "https://www.youtube.com/watch?v=y1nqQOn6Rbc", "date_published": "2021-12-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]