[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "I switched to Fedora and Vanilla GNOME, here's how it went", "description": "Extend the life of your CentOS 8 servers after it goes End Of Life: https://tuxcare.org/extended-lifecycle-support-centos8\n\nGet your Linux desktop or laptop here: https://slimbook.es/en/\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nI also do a Gaming Podcast: https://www.youtube.com/channel/UCbRPZ11S1quJ4ESoj42A3ug\n\nJoin us on our new Discord server: https://discord.gg/xK7ukavWmQ\n\nTwitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\n\n00:00 Intro\n00:33 Sponsor: Extend the life of your CentOS8 servers\n01:30 Why move from Manjaro KDE to Fedora GNOME?\n02:35 My Experience with Vanilla GNOME\n07:38 Switching to GNOME Apps\n09:38 My Experience with Fedora\n14:15 Will I stick to Fedora?\n\n\nThis GNOME here didn't come with any extensions. Coming from my \"mac-like\" layout with global menu and dock, it took me a very short time to adapt.\n\nAll it took to be proficient was re-wiring my brain to use the top left as a hot corner instead of the top right. I added an extension, the app indicators one. I also added a second extension, letting me switch from dark theme to light theme.\nOn GNOME, my apps don't have menubars, and so a global menu isn't needed.\n\nNow, in terms of workflow, the workspaces, I now use a lot more, thanks to the easy access through the activities view. On KDE, I tended to only use one workspace, but 2 activities, one for work, and one for play.\n\nBasically, I really like the simplicity of GNOME, and the default workflow suits me really well.\n\nThe default Adwaita look is really bland to me. It's all really, really grey, and the rare blue accents don't make it a less glacial experience. The icon theme is really nice, apart from files and folders. These manilla beige folders are not pretty, and the file mimetypes lack a lot of constrast.\n\nThe dark adwaita theme is much better. \n\nAnother issue, is the lack of integration of Nextcloud.\n\nI also find the system menu pretty lackluster, especially for sound.\n\nI moved from Kmail to Geary, which was a fantastic transition: just setting up an account is night and day. In Geary, it takes 2 minutes, in Kmail, I had to fumble through the enormous settings to even get my folders to show up.\n\nGNOME Calendar is much simpler and nicer looking than Korganizer, although Kalendar, with a \"K\" seems like a more than worthy replacement, with its nextcloud tasks integration.\n\nThe GNOME software app blows Discover out of the water in the looks department, and in the legibility of the information it displays. It also handles updates better, in my opinion, with more detail and a nicer interface.\n\nThe rest of my app roster is mainly made out of elementary OS Apps, which,, unfortunately, don't look too good on GNOME: they don't use the elementary OS icon theme, or the elementary OS GTK theme, which makes them look quite ugly and weird.\n\nThe GNOME apps themselves, though, I really like. Some people might find them too limiting, and that's fine, but I don't have super complex needs in my graphical apps, and I prefer the simple look and feel combined with the features I need.\n\nNow, let's talk about my experience with Fedora. The installer is still a horribly designed piece of software.\n\nSure, it does its job, but in terms of UX? It's bad. really bad.\nI needed DNF once, to install my Nvidia drivers.\n\nI also quite enjoyed the way Fedora handles updates: you install them from GNOME Software, and while app updates apply automatically, system updates will install at the next reboot.\n\nNow, for the issues, because there were some.\n\nFirst, Fedora 35 comes with Pipewire for audio, and while that system has a lot of promise, it has issues, especially with apps depending on ALSA.\n\nI had no audio playback in Audacity, and Davinci resolve had super stuttery audio that made it unusable\n\nThe main, big unsolved issue, though, is bluetooth. I could NOT get it to work right on Fedora. I use an MX Master 3 and a bluetooth keyboard, and these keep going to sleep, even while in use, and sometimes fail to reconnect.", "link": "https://www.youtube.com/watch?v=k9ixZ35P7ng", "date_published": "2021-12-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]