[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "20 PS5 & Xbox Series X/S Upgrades We NEED to See", "description": "The biggest improvements and features we want to see come to the next-generation consoles in 2021.\n\n2021 will be the first full year of the newest generation of consoles as more people get their hands on PS5s and Xbox Series X/S, and more games start to come out. Both had solid launches, despite issues of supply shortage, but there’s a lot more we want to see out of these systems.\n\nIn this video, Jean-Luc Seipke breaks down our wish list of tweaks and improvements for these systems. From simple requests like more controller colors to larger, more ambitious demands, like PS3 games made backwards compatible on the PS5, there are a ton of things we’d like to see.\n\nLet us know what you’d like to see from the Xbox Series X|S and PS5 in 2021! If you’re excited for more new generation games, why not check out our videos detailing the hottest games coming out this year. We got ones for both Xbox Series X|S and the PlayStation 5.\n\nGiuseppe Spinelli’s PlayStation 5 Black Edition: PlayStation 5 Black Edition - YouTube\n\n00:00 - Intro\n00:44 - UI Customization\n01:57 - New Hardware Models and Colors\n03:00 - A Better Xbox Series Controller\n04:34 - System-level Cross-play Integration\n05:49 - More Backwards Compatibility\n08:28 - Quick Resume Improvements\n09:44 - Storage Space On PS5\n10:31 - Rapid Fire", "link": "https://www.youtube.com/watch?v=KOh1jxx7RSw", "date_published": "2021-01-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Apex Legends Season 8 – Mayhem Launch Trailer", "description": "Check out the new Mayhem launch trailer for Apex Legends Season 8!", "link": "https://www.youtube.com/watch?v=zRMgmRTJFmE", "date_published": "2021-01-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Gaming's Most Terrifying Moments: Resident Evil, Dead Space 2 And More", "description": "From Dead Space 2’s eye gouging, to P.T.’s beauty queen Lisa, Kurt breaks down 8 of gaming’s most terrifying moments you wish you forgot.\n\nWith Resident Evil Village right around the corner, Kurt Indovina thought it’d be a good time to go over some horrifying moments in games that most of us wish we could unsee. \n\nUnlike movies, horror in games just hit different. Whether it’s tip-toeing around Jack Baker in Resident Evil 7 or scrambling to look away from Lisa in P.T., spooky moments in games are escalated by having a controller in your hands. Some games are a bit more psychological about it, like Eternal Darkness, which draws its horror from toying with a gamer's deepest paranoias. Or in the case of Amnesia: The Dark Descent, it's in showing less is actually a whole lot more terrifying.\n\nSo join Kurt as he details the 8 scariest moments in games that made us squirm, screech, and flail in fright.", "link": "https://www.youtube.com/watch?v=XV9SBK1vzu4", "date_published": "2021-01-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil 8 Village Showcase Live (January Edition)", "description": "Get the world-first look at Resident Evil Village gameplay and a brand new trailer, plus much more Resident Evil news in this live showcase on January 21, 2pm PT. Tune in after the stream to hear more thoughts from the GameSpot team.", "link": "https://www.youtube.com/watch?v=lt5y4AGr39o", "date_published": "2021-01-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil Re:Verse - Teaser Trailer", "description": "Check out the all new Resident Evil Re:Verse Teaser Trailer unveiled at the Resident Evil Showcase, January 21, 2021.", "link": "https://www.youtube.com/watch?v=_98Lwr_XQqU", "date_published": "2021-01-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil Village - Official 3rd Trailer", "description": "Check out the 3rd Trailer for Resident Evil Village released on January 21, 2021!", "link": "https://www.youtube.com/watch?v=taglcFwAAwA", "date_published": "2021-01-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil Village - Official Gameplay Reveal Trailer", "description": "We get our first look at gameplay in Resident Evil 8: Village and some of the people we are going to encounter on your journey through the castle, the tall, frightening Lady Dimitrescu included.", "link": "https://www.youtube.com/watch?v=Udnu2LBPdRc", "date_published": "2021-01-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]