[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "PUP: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nLyndsey McKenna | January 21, 2021\nSincerest apologies to Stefan Babcock's neighbors: For PUP's Tiny Desk (home) concert, the Toronto group refused to dial down the volume, filling Babcock's neatly-furnished living room – complete with an Ontario pennant – and just maybe making a few enemies down the street in the process.\n\n\"My neighbors hate us, and I don't blame them,\" Babcock said. Volume complaints aside, that admission feels like a perfect summary of the band's penchant for spinning stories of chaos into catchy-as-hell, shout-along songs. With bandmates Nestor Chumak, Zack Mykula and Steve Sladkowski masked to adhere to COVID safety protocol, PUP wastes no time here, immediately setting the tone with \"Rot\" from the group's aptly-titled 2020 EP, This Place Sucks A**. From there, the set spans the band's discography, spotlighting two cuts (\"Kids\" and \"Scorpion Hill\") from 2019's Morbid Stuff and \"Reservoir,\" a track off the group's debut.\n\nAnd to NPR officemates who think you've escaped an earsplitting in-office set with this (home) concert, let the handmade \"Ceci n'est pas une Tiny Desk\" (\"This is not a Tiny Desk\") sign serve as a warning: When the Tiny Desk returns to NPR HQ and the U.S.-Canada border reopens, prepare to have your workday interrupted.\n\nSET LIST\n\"Rot\"\n\"Kids\"\n\"Reservoir\"\n\"Scorpion Hill\"\n\nMUSICIANS\nStefan Babcock: vocals, guitar\nNestor Chumak: bass, vocals\nZack Mykula - drums, vocals\nSteven Sladkowski: guitar, vocals\n\nCREDITS\nVideo: Amanda Fotes\nAudio: Nestor Chumak\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Kara Frame, Morgan Noelle Smith\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann", "link": "https://www.youtube.com/watch?v=yzvMnB4wfww", "date_published": "2021-01-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]