[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Black Coffee: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nAbby O'Neill | March 11, 2021\nBlack Coffee, a figurehead of the global South African dance movement, is known for his undeniable DJ sets and AfroHouse anthems that (under normal circumstances) light up dancefloors around the world. He brings that same feeling to his Tiny Desk (home) concert, but with a unique configuration: live instrumentation. \n\nBorn in Durban and raised in the Eastern Cape in Mthatha, Black Coffee’s subculture of soulful house transports me to an elevated state. If you ask me, this is the pure embodiment of feel-good music. That shouldn’t be a surprise, because house music has always been about love. It’s a form of sonic escapism that provides a sanctuary for all beings, regardless of race, age, or gender. Therefore, it’s only fitting that Black Coffee rocks a tee embossed with “I Heart You” across his chest. \n\nShot in the auditorium at the National School of Arts in Johannesburg, Black Coffee tapped students to assist with production as part of their internship. Kicking off the set is “You Rock My World” featuring Soulstar, a classic dance joint from his Africa Rising album whose convergence of pulsating percussion, a calming melody, and the sultry vibes of Soulstar’s voice feels like a spiritual palette cleanser. He follows that up with \"Flava\" and \"Wish You Were Here,” two tracks from his new LP, Subconsciously, whose litany of special guests -- including Diplo and Pharrell -- is a coronation of Black Coffee’s meteoric rise.\n\nSET LIST\n\"You Rock My World\" (feat. Soulstar)\n\"Flava\" (feat. Una Rams and Tellaman)\n\"Wish You Were Here\" (feat. Msaki)\n\nMUSICIANS\nBlack Coffee: DJ\nSoulstar: vocals\nUna Rams - vocals\nTellaman - vocals\nMsaki - vocals\nPansula: percussion\nNduduzo: keys\nGodfrey Mntambo: saxophonist\nMusa Nhlapho: vocals\nSandisiwe Sishuba: vocals\nBonokuhle Nkala-Mtsweni: vocals\n\nCREDITS\nVideo: Julian von Plato, Yolanda Hlakula, Siphe Maphumulo, Lindo Langa Aden McCarthy, Mark Wilson, Bevan Godden, Sims Phakisi, Nick Vetter, DIGMU\nAudio: Steven Grenfell, Icons Shop, Wild & Marr, Julian von Plato\nLighting Technicians: Trisdan Evans, Khaya Radebe\nRunners: Dylan von Plato, Stephen Shrimpton, Langa Gumbi\n\nTINY DESK TEAM\nProducer: Abby O'Neill\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Bob Boilen, Kara Frame, Morgan Noelle Smith\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann\n\n#blackcoffee #tinydesk #nprmusic #afrobeats #housemusic", "link": "https://www.youtube.com/watch?v=npORmybcPdk", "date_published": "2021-03-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Coming 2 America — Sounds of Zamunda: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nBobby Carter | March 10, 2021\nOver the years, African musicians have elevated expectations at the Tiny Desk. The distinctive vibrations left by artists like Burna Boy, KOKOKO! and the Soweto Gospel Choir have lead to some of the most unforgettable moments in our rich history. This (home) concert feels like the culmination of all of those moments.\n\nTo celebrate the new compilation Rhythms of Zamunda: Music Inspired By Coming 2 America, six artists representing four countries in Africa perform a megamix of selections from the project. Each performance from the pan-African project bridges the distance between the countries and cultures, and gets more exhilarating by the minute.\n\nSouth Africa's Nasty C — who's arguably the biggest rapper on the continent — opens the set and trades verses with Tiny Desk alumni Ari Lennox on \"Black and White.\" He then sends us over to Cameroon for some Afrobeats flavor, courtesy of Locko and his stripped-down version of \"Magnet.\" We then circle back around to South Africa to hear from R&B newcomer Ricky Tyler. From there, we head north to Nigeria to do the \"Jiggy Bop\" with Alpha P before we take one last trip to South Africa for award-winning dance DJ and producer Prince Kaybee's \"Fetch Your Life,\" featuring Msaki. Finally, Togo duo Toofan dares us not to dance to \"Yé Mama.\"\n\nIn addition to the sweeping range of the showings, the look of each set is stunning: vibrant, opulent colors; meticulous Tiny Desk shelf recreations; gorgeous African artifacts; and a few nuggets dedicated to King Akeem of Coming 2 America. This cultural clash is the biggest amplification of African voices we've ever had the pleasure of presenting.\n\nSET LIST\nNasty C (feat. Ari Lennox): \"Black and White\"\nLocko: \"Magnet\"\nRicky Tyler: \"Everything\"\nAlpha P: \"Jiggy Bop\"\nPrince Kaybee (feat. Msaki): \"Fetch Your Life\"\nToofan: \"Ye Mama\"\n\nMUSICIANS\n\"Black and White\"\nNasty C: vocals\nAri Lennox: vocals\nFundile \"FD\" Dlamini: drums\nChrister Kobedi: keys\nVaughan Fourie: keys\n\n\"Magnet\"\nLocko: vocals\nJoel Parfait Ondigui: bass\nBenjamin Mouangue Bossamo: guitar\nBrice Essomba: keys\nMarc Nzana: drums\nMartien Oyono: violin\n\n\"Everything\"\nRicky Tyler: vocals\nZādok: keys\nTino \"Beatboy\" Damba: drums\nTendai \"Shoxx\" Shoko: bass\nInnocent Mzizi: guitar\n\n\"Jiggy Bop\"\nAlpha P: vocals\nDavid Osang: vocals\nAgu Chinyere Gift: vocals\nTosin \"SDK\" Tade: vocals\nFemi Jacobs: vocals\nOlabiyi Julius: keys\nAyodele Agbabiaka Oluwasegun: bass\nBest Amakhian: guitar\nEbenezer Olayinka: drums\n\n\"Fetch Your Life\"\nMsaki: vocals\nPrince Kaybee: DJ\nZādok: guitar\nKatleho Motlatla: bass\nFundile \"FD\" Dlamini: keys\n\n\"Ye Mama\"\nBarabas: vocals\nMasta Just: vocals\nPaul Akakpo: keys\nTherence Egue: drums\nMartin Lawson: bass\nLionel Adjovi: guitar\nSylvie Akpedjo: vocals\nLamabara Paul: vocals\n\nCREDITS\nNasty C and Ari, Ricky Tyler and Prince Kaybee\nVideo: Molotovcocktail.tv, Nic Roux, Daniel Tshimowa, Tumelo Mofokeng, Brain Bvumbe, Kyana White, Tyshawn 'Creedlife' Smith, Tony Nava, Jonathan Lora, Emmanuel Nkolo, Tommy4K, Josh Binyard\nAudio: Ebenezer Maxwell, Itumeleng Maponyane, Robin Kohl (Jazzworx), Cliff Machingaifa, Caleb James\n\nLocko\nVideo: Director Chuzih\nAudio: One Style One Nation Films\n\nAlpha P\nVideo: Adetola Films, Mario Vera-Cruz, Clout, Femi Aribisala, Pheabian Miller\nAudio: Laughter Oyemada\n\nToofan\nVideo: Director Barabas\nAudio: Masta Just\n\nTINY DESK TEAM\nProducer: Bobby Carter\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Kara Frame, Morgan Noelle Smith\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #coming2america #nprmusic #nastyc #arilennox #locko #alphap #rickytyler #princekaybee #msaki #toofan", "link": "https://www.youtube.com/watch?v=8NqSBqTQIq4", "date_published": "2021-03-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]