[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "Last Days of Solitary (full documentary) | FRONTLINE", "description": "In this 2017 documentary, FRONTLINE goes inside one state’s ambitious attempt to decrease its use of solitary and takes a look at what happens when prisoners who have spent considerable time in isolation try to integrate back into society.\n\nThis journalism is made possible by viewers like you. Support your local PBS station here: http://www.pbs.org/donate​.\n\nFilmed over three years by producers Dan Edge and Lauren Mucciolo, with unprecedented access to the solitary unit at Maine State Prison, “Last Days of Solitary” portrays the psychological toll and the challenges the prison faces handling men considered the most dangerous and difficult in the state. It’s a haunting portrait of life in solitary, and a unique document of a risky reform experiment.\n\nLove FRONTLINE? Find us on the PBS Video App where there are more than 300 FRONTLINE documentaries available for you to watch any time: https://to.pbs.org/FLVideoApp​ \n\n#Documentary​ #LastDaysofSolitary\n\nSubscribe on YouTube: http://bit.ly/1BycsJW​\nInstagram: https://www.instagram.com/frontlinepbs​\nTwitter: https://twitter.com/frontlinepbs​\nFacebook: https://www.facebook.com/frontline\n\nFunding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Major funding for FRONTLINE is provided by the John D. and Catherine T. MacArthur Foundation and the Ford Foundation. Additional funding is provided by the Abrams Foundation, Park Foundation, the Heising-Simons Foundation, and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation.", "link": "https://www.youtube.com/watch?v=_6ngYr6su90", "date_published": "2021-03-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]