[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Vaccine side effects", "description": "EMA recommends COVID-19 Vaccine Janssen for authorisation in the EU\n\nhttps://www.ema.europa.eu/en/news/ema-recommends-covid-19-vaccine-janssen-authorisation-eu\n\nJanssen should start delivering vaccines by April, and significant amounts by May\n\nhttps://nos.nl/artikel/2372206-vierde-coronavaccin-goedgekeurd-voor-eu-janssen-krijgt-positief-oordeel.html\n\nRecommended conditional marketing authorisation, 18 years +\n\nConcluded by consensus that the data on the vaccine were robust and met the criteria for efficacy, safety and quality\n\n4th vaccine now for EU, first single dose\n\nPhase 3\n\nN = over 44,000\n\nRCT\n\nHalf and half\n\n67% reduction in the number of symptomatic cases after 2 weeks\n\nUS efficacy data\n\n72% effective in preventing moderate illness\n\n85% effective at protecting against severe cases \n\n100% effective in preventing hospitalization and death after one month\n\nSide effects\n\nUsually mild or moderate\n\nCleared within a couple of days\n\nPain at the injection site, headache, tiredness, muscle pain and nausea\n\nPharmacovigilance will continue\n\nUK\n\nOrdered 30 million J and J\n\nDenmark \n\n14 day halt in use of the Oxford-AstraZeneca vaccine\n\nBlood clots, and one death\n\nHealth Minister Magnus Heunicke\n\nprecautionary measure\n\nwe must respond in a timely and careful manner\n\nAustria\n\nOne woman (49) died 10 days after vaccination\n\nEstonia, Latvia, Lithuania, Luxemburg have also stopped using the batch\n\nEMA\n\nProbably 3 cases and one death\n\nOne million doses in batch\n\nSafety committee was reviewing the Austrian case\n\nthere is currently no indication that vaccination has caused these conditions, which are not listed as side effects with this vaccine\n\nthromboembolic events in vaccinated people is no higher than that seen in the general population\n\n22 cases of thromboembolic events, three million people vaccinated with AstraZeneca vaccine in the European Economic Area\n\nAuthorised 29th January\n\nEpidemiology of venous thromboembolism\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC4624298/\n\nIncidence rate\n\nMen, 130 per 100,000 per year\n\nWomen, 110 per 100,000 per year\n\nThat’s 10 per month per 100,000\n\nThat’s 120 per million per month\n\nTherefore for 3 million of the population 360 thromboembolic events expected per month\n\nCzech Republic\n\nSent first patients to Poland\n\nHungary\n\nCases higher than in December\n\nPoland\n\nCases highest since late November\n\nincreased looseness among Poles towards anti-Covid measures\n\nBrazil\n\nPopulation 214 million\n\nhttps://www.bbc.co.uk/news/world-latin-america-56355861\n\nCases, 79,876\n\nDeaths, + 2,000 = 270,656\n\nSecond highest death numbers\n\nMargareth Dalcolmo, doctor and researcher at Fiocruz\n\nthe worst moment of the pandemic in Brazil\n\noverload and even collapse of health systems\n\nDr Pedro Hallal, Epidemiologist\n\nIf we do not start vaccinating the population here very soon, it will become a massive tragedy\n\nIt took a long time for the politicians to act\n\nP.1\n\nCould be up to twice as transmittable as the original virus\n\nChance of reinfection, 25% to 60%\n\nBrazil, natural laboratory, when coronavirus goes relatively unchecked\n\nBreeding ground for new variants, several VOCs circulating\n\nRapid vaccination and NPIs required\n\nVaccines remains efficacious, but probably slight reductions", "link": "https://www.youtube.com/watch?v=7rMvPe_FsDg", "date_published": "2021-03-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Possible UK surge", "description": "Alaska, immunization available to anyone 16 and older who lives or works in the state\n\nUS, past 7 days, 2.15 million doses per day\n\nFists dose, 61 million\n\nSecond dose, 32 million\n\nCases and deaths, CDC data\n\nhttps://covid.cdc.gov/covid-data-tracker/#trends_dailytrendscases\n\nPossible UK surge\n\nhttps://www.bbc.co.uk/news/health-56334902\n\nProf Chris Whitty\n\nUnlocking too quickly, substantial surge while a lot of people are not protected\n\nA lot of people may think this is all over. \n\nIt is very easy to forget how quickly things can turn bad\n\nThree weeks to build up immunity\n\nSo only the first four priority groups - the over-70s, health and care staff and the extremely clinical vulnerable\n\nNearly half of hospital admissions have been seen in the under-70s\n\nMost transmission driven by younger people\n\nTherefore, UK strategy will not impact spread for a while yet\n\nUK, now\n\nCases, +5,766 (+ 40,600)\nDown 24.5%\n\nDeaths, + 231(+1,329)\nDown 33.2%\n\nAdmitted, + 590 (+5,154)\nDown 29.8%\n\nHospitalised, 9,418 (first time below 10,000 since 25th October)\n\nVaccinated\n\nFirst dose, 22,592,528\n\nSecond dose, 1,181,431\n\nUK is not using a one dose strategy\n\nhttps://coronavirus.data.gov.uk/details/vaccinations\n\nHow do the Pfizer and Oxford AstraZeneca COVID-19 vaccines compare? And how do they affect different people?\n\nhttps://covid.joinzoe.com/post/vaccines-webinar-immune-variation\n\nMarch 8, 2021\n\nN = 700,000\n\nInjections, daily health reports\n\nPfizer vaccine first now, Oxford AstraZeneca as well\n\nBoth vaccines cause the body cells to produce the required antigen\n\nBoth vaccines induce really high levels of antibodies and T cells\n\nConsistent with phase 3 data\n\nTim Spector\n\nWe see around a 70% reduction in mild disease after the vaccine, which is what we would expect. It’s really good news\n\nSystemic side effects\n\nTiredness, headache, chills\n\nFirst dose, Oxford AstraZeneca vaccine, 30%\n\nPfizer vaccine, 10%\n\nPfizer systemic effects worse if people have had CoViD infection\n\nPfizer side effects worse after second dose\n\nAfter effects seem less than phase 3 data\n\nCan’t associate measured immune responses with protection, eg. antibodies may be low, but protection good\n\nFemales, younger people, people who had a previous COVID infection, more likely to report after-effects from either vaccine\n\nNot related to level of immunity generated\n\nFDA\n\nhttps://www.fda.gov/consumers/consumer-updates/why-you-should-not-use-ivermectin-treat-or-prevent-covid-19?utm_medium=email&utm_source=govdelivery\n\nThe FDA has received multiple reports of patients who have required medical support and been hospitalized after self-medicating with ivermectin intended for horses.\n\nIvermectin is not an anti-viral (a drug for treating viruses). \n\nhttps://www.nature.com/articles/s41429-020-0336-z\n \nIvermectin: a systematic review from antiviral effects to COVID-19 complementary regimen\n\nIvermectin proposes many potentials effects to treat a range of diseases\n\nantimicrobial, antiviral, and anti-cancer properties\n\nIt is highly effective against many microorganisms including some viruses\n\nIn this comprehensive systematic review, antiviral effects of ivermectin are summarized including in vitro and in vivo studies over the past 50 years\n\nSeveral studies reported antiviral effects of ivermectin on RNA viruses such as Zika, dengue, yellow fever, West Nile, Hendra, Newcastle, Venezuelan equine encephalitis, chikungunya, Semliki Forest, Sindbis, Avian influenza A, Porcine Reproductive and Respiratory Syndrome, Human immunodeficiency virus type 1, and severe acute respiratory syndrome coronavirus 2\n\nFurthermore, there are some studies showing antiviral effects of ivermectin against DNA viruses such as Equine herpes type 1, BK polyomavirus, pseudorabies, porcine circovirus 2, and bovine herpesvirus 1\n\nIn vivo studies of animal models revealed a broad range of antiviral effects of ivermectin\n\nCrump A, Ōmura S. Ivermectin, ‘wonder drug’ from Japan: the human use perspective. Proc Jpn Acad Ser B Phys Biol Sci. 2011;87:13–28. https://doi.org/10.2183/pjab.87.13.\n\nKircik LH, Del Rosso JQ, Layton AM, Schauber J. Over 25 years of clinical experience with ivermectin: an overview of safety for an increasing number of indications. J Drugs Dermatol. 2016;15:325–32.\n\nGonzalez Canga A, Sahagun Prieto AM, Diez Liebana MJ, Fernandez Martinez N, Sierra Vega M, Garcia Vieitez JJ. The pharmacokinetics and interactions of ivermectin in humans–a mini-review. AAPS J. 2008;10:42–6. https://doi.org/10.1208/s12248-007-9000-9.\n\nGermany\n\nhttps://www.washingtonpost.com/nation/2021/03/10/coronavirus-covid-live-updates-us/\n\nFamily doctors will be allowed to administer vaccine from April\n\n3% currently fully vaccinated, since late December\nAZ now used in over 65s\n\nThomas Mertens, Vaccination committee\n\nSupport for the Sputnik V\n\n(European Union officials warn against) \n\nRolling review, Czech Republic, Hungary and Slovakia.", "link": "https://www.youtube.com/watch?v=mnF2GRs2Llk", "date_published": "2021-03-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]