[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCFQMnBA3CS502aghlcr0_aw", "title": "Professor Explains the Fake Entrepreneur Epidemic", "description": "Dr. Hartmann is an Associate Professor Of Management at the Copenhagen Business School. His paper, Towards an Untrepreneurial Economy? The Entrepreneurship Industry and the Rise of the Veblenian Entrepreneur is available on SSRN: https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3479042\n\nOther papers mentioned or referenced:\n\nAzoulay, P., Jones, B. F., Kim, J. D., Miranda, J. 2020. Age and high-growth entrepreneurship. American economic review: Insights.\n\nCamuffo, A., Cordova, A., Gambardella, A., Spina, C. 2020. A scientific approach to entrepreneurial decision making: Evidence from a randomized control trial. Management Science.\n\nDecker, R. A., Haltiwanger, J. Jarmin, R. S., Miranda, J. 2016. Where has all the skewness gone? The decline in high-growth (young) firms in the U.S. European Economic Review.\n\nHamilton, B. H. 2000. Does entrepreneurship pay? An empirical analysis of the returns to self-employment. Journal of Political Economy.\n\nHunt, R. A., Kiefer, K. 2017. The entrepreneurship Industry: influences of the goods and services marketed to entrepreneurs. Journal of small business management.\n\nReid, S. W., Patel, P. C., Wolfe, M. T. 2018. The struggle is real: Self-employment and short-term psychological stress.\n\nSorenson, O., Dahl, M. S., Canalas, R., Burton, M. D. 2021. Do start-up employees earn more in the long run? Organization Science.\n\nUcbasaran, D., Shepherd, D. A., Lockett, A., Lyon, S. J. 2012. Life after Business Failure: The Process and Consequences of Business Failure for Entrepreneurs. Journal of Management.\n\n \n\nEntrepreneurial strategy textbook by Joshua Gans, Erin Scott and Scott Stern is available online here:\n\nhttps://www.entrepreneurial-strategy.net/\n► Twitter: https://twitter.com/coffeebreak_YT\n► Instagram: https://www.instagram.com/coffeebreak_yt/\n🎶 Music: https://www.youtube.com/watch?v=nMSQ1yoPT2c&list=PL4qw3AkxFDSNhEgawXD1j6r0iN1072XIB&index=1\nThis video is an opinion and in no way should be construed as statements of fact. Scams, bad business opportunities, and fake gurus are subjective terms that mean different things to different people. I think someone who promises $100K/month for an upfront fee of $2K is a scam. Others would call it a Napolean Hill pitch.", "link": "https://www.youtube.com/watch?v=xngjQlVwdmg", "date_published": "2021-04-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCFQMnBA3CS502aghlcr0_aw", "title": "PONZI SCHEME CEO WAS AN ACTOR", "description": "► Twitter: https://twitter.com/coffeebreak_YT\n► Instagram: https://www.instagram.com/coffeebreak_yt/\n🎶 Music: https://www.youtube.com/watch?v=nMSQ1yoPT2c&list=PL4qw3AkxFDSNhEgawXD1j6r0iN1072XIB&index=1\nThis video is an opinion and in no way should be construed as statements of fact. Scams, bad business opportunities, and fake gurus are subjective terms that mean different things to different people. I think someone who promises $100K/month for an upfront fee of $2K is a scam. Others would call it a Napolean Hill pitch.", "link": "https://www.youtube.com/watch?v=26trvLsG8kI", "date_published": "2021-04-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]