[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 6's Murder Robot Rumor And Warzones Endgame", "description": "Battlefield 6 rumors include robots, Osprey aircraft, and a desert island map reveal while Call Of Duty keeps adding fantasy content to Warzone and we look at if it could wind up like Call Of Duty: Mobile\n\nBattlefield 6 leaks continue to drop, each one sounding better than the next. This week Richie Bracamonte and Aaron Sampson discuss the latest near-future BF6 rumors as well as the state of Warzone, which might be headed the way of COD Mobile. They’ve also rounded up some good news and some user comments submitted by you!\n\nWith Battlefield 6 fast approaching, Aaron discusses how it appears to be shaping up. Fans have come up with concept art based on leaks and rumors. These include osprey aircrafts, Boston Dynamics robots and more near-future tech that classic fans are sure to love. It’s also this kind of tech and gameplay that attracted millions to 2019’s Modern Warfare reboot.\n\nSpeaking of Call of Duty, Warzone continues its slow-paced Zombie event that’s leading to something bigger. Richie and Aaron discuss the lull of the current event and how it’s been handled much better in previous events such as the “Know Your History” and “Haunting of Verdansk” events and modes. The upside being the recent date announced to kick off season 3 and possibly end our time with the Verdansk map as we know it. \n\n00:00 - Intro\n00:16 - Battlefield 6 Rumors\n03:30 - Can WZ become COD Mobile? \n09:04 - Bad News, Good News, & Comments", "link": "https://www.youtube.com/watch?v=V1S-Z-rxPHU", "date_published": "2021-04-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Mass Effect Lore: The First Contact War", "description": "This week in our Mass Effect lore series, Jordan delves into The First Contact War between humans and Turians. It may happen before the events of the Mass Effect trilogy, but it's a key event that sets the stage for humanity's place in the galaxy in Mass Effect 1.", "link": "https://www.youtube.com/watch?v=athBV4PjiGg", "date_published": "2021-04-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil Village Demo Gameplay (PS5)", "description": "Get a glimpse of 27 minutes of gameplay from the Resident Evil Village Demo, which showcases combat, crafting, exploration and more in the Village area. We fight off lycans and make our way through the village in the latest demo on the PlayStation 5. The next demo on April 24th, will allow you to check out the castle area. Here you'll most likely run into Lady Dimitrescu and her three daughters. You'll have from 5pm PDT to 1am PDT to try out the demo.", "link": "https://www.youtube.com/watch?v=uvfii6Zb_8E", "date_published": "2021-04-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Resident Evil 7’s Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of Resident Evil 7, including the iconic Remington 870 shotgun, and the PP-19 Bizon-2 submachine gun, alongside some of the Baker family’s more unique contraptions.\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of Resident Evil 7 and compares them to their real-life counterparts.\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can purchase Jonathan's book here - https://www.headstamppublishing.com/bullpup-rifle-book", "link": "https://www.youtube.com/watch?v=yBccvP-WyCY", "date_published": "2021-04-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]