[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCQDhxkSxZA6lxdeXE19aoRA", "title": "\"Tech Clean Out\" Giveaway + New Online Store [INACTIVE]", "description": "The two most requested things in one video. Enjoy!\n--------------------------------------Socials-------------------------------------\nWebsite: https://www.hughjeffreys.com\nStore: https://www.hughjeffreys.com/store\nInstagram: http://instagram.com/hughjeffreys\n---------------------------------Contest Rules--------------------------------\nNO PURCHASE NECESSARY.\n\n1. Eligibility: The Tech Clean Out Giveaway (the “Giveaway”) is open only to legal residents who are at least 13 years of age at time of entry (“Entrant\"(s)). Void where prohibited. The Giveaway is sponsored by Hugh Jeffreys and iFixit (“Sponsor”).\n\n2. Prize: The Giveaway allows Entrants to enter, as described below, on the Hugh Jeffreys Website (the “Website”) for a chance at one of the prizes; Used MacBook Air, New Galaxy Buds Live, Used Google Pixel 3 (“Prize”). The average retail value (“ARV”) of the Prize is $200. The total ARV of all Prizes is $1000. THE ODDS OF WINNING THE PRIZE DEPENDS ON THE TOTAL NUMBER OF ELIGIBLE ENTRIES RECEIVED.\n\nNo Prize substitution or cash alternative is allowed except at the sole discretion of Sponsor. If a Prize cannot be awarded due to circumstances beyond the control of Sponsor, a substitute prize of equal or greater retail value may be awarded. The Winner will be solely responsible for all federal, state and/or local taxes, and for any other fees or costs associated with the Prize received.\n\n3. Giveaway Period: The Giveaway shall begin at 09:00 Australian Eastern Standard Time (\"AEST\") on 18th April 2021 and shall end at 00:00 AEST on 30th April 2021 (\"Giveaway Period\"). \n\n4. How to Enter: To enter the Giveaway you must (a) place a comment (“Comment”) on the Video and (b) Complete the entry form on website hughjeffreys.com/giveaways (together the “Entry”). Entries must be received during the Giveaway Period. ONLY ONE ENTRY IS PERMITTED PER PERSON.\n\n5. Winning:  The winner of the Giveaway (“Winner”) shall be chosen by the channel based on Sponsor’s personal affinity for the entry The Winner shall be chosen within 7 days of the end of the Giveaway Period.\n\n6. Prize Claim: The Winner will be notified within 7 days of the drawing via email. The Winner may be required to execute an Affidavit of Eligibility, a Liability Release, and (where legal) a Publicity Release (collectively, “Prize Claim Documents”) within 2 days of notification, or as directed by the Sponsor. The failure to respond timely, to the notifications and the failure to provide the Prize Claim Documents will result in forfeiture of the Prize and, in such case, the Sponsor may declare an alternate winner, based on another random drawing. If a Prize goes unclaimed or is forfeited by the Winner, the Prize may not be re-awarded, in Sponsor’ sole discretion. The Winner may be required to provide Sponsor with a valid social security number before the Prize will be awarded for tax reporting purposes. Other restrictions may apply.\n\n6. Rights of Sponsor: Sponsor, shall have the right, at its sole and absolute discretion to refuse any Entry whatsoever made by Entrants which it finds to be in violation of these Official Rules or which it finds in its sole discretion to be otherwise objectionable for any reason.\n\n7. YouTube Policies\n- Your participation in and entry into this giveaway must be in compliance with YouTube’s own Community Guidelines. Entries which don’t comply with YouTube’s Community Guidelines will be disqualified.\n\n- YouTube is not a sponsor of this Giveaway. By entering this Giveaway, you release YouTube from any and all liability related to this Giveaway\n\n​\n8. Privacy Policy: All information provided is collected and stored for the sole use of this giveaway. Any information you provide may not be deleted.\n\n---------------------------------------Links---------------------------------------\nHugh Jeffreys Store: https://www.hughjeffreys.com/store\nTools I Use: https://www.hughjeffreys.com/tools\n\nGoogle Pixel 3 Restoration Video: https://youtu.be/KqGxcNjakLo\nS21 Teardown Video: https://youtu.be/jc1MVKh67VQ\nMacBook Air LOT Video: https://youtu.be/EATdYG7h9IQ\n\nGet parts, tools, and thousands of free repair guides from iFixit at: \n                               https://iFixit.com/hughjeffreys\nAustralian Store: https://ifix.gd/2FPxhKy\n---------------------------------------------------------------------------------------\n\n\n(DISCLAIMER: This description contains affiliate links, which means that if you click on one of the product links, l will receive a small commission.)", "link": "https://www.youtube.com/watch?v=I11HSqjSKBc", "date_published": "2021-04-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]