[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "'Louder Than A Riot' Remixed: The State of Rhyme & Punishment", "description": "Season one of Louder Than A Riot—NPR Music's podcast tracing the interconnected rise of hip-hop and mass-incarceration—has ended, but the conversation is just getting started. Join hosts Sidney Madden and Rodney Carmichael for Louder Than A Riot Remixed: The State of Rhyme and Punishment. It's a discussion about topics touched on in the podcast—hip-hop music, fame, racism, and injustice—but also the current state of affairs, and the bigger picture they reveal.\n\nA conversation as big as this one couldn't happen with just two people, so Sidney and Rodney tapped a few special guests to join them: platinum-selling rapper Maino, award-winning artist Isis Tha Saviour, co-host of the Justice in America podcast Josie Duffy Rice, and music journalist Lawrence Burney.", "link": "https://www.youtube.com/watch?v=k4O0NfwHmK4", "date_published": "2021-02-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Rae Khalil: Tiny Desk (Home) Concert", "description": "NPR Music's Tiny Desk series will celebrate Black History Month by featuring four weeks of Tiny Desk (home) concerts and playlists by Black artists spanning different genres and generations each week. The lineup includes both emerging and established artists who will be performing a Tiny Desk concert for the first time. This celebration highlights the beautiful cornucopia of Black music and our special way of presenting it. We hope you enjoy.\n\nBobby Carter | February 18, 2021\n\"Tiny Desk! Happy Black History Month!,\" rapper, singer and songwriter Rae Khalil exclaims before gliding into \"FATHER,\" from her LP Fortheworld. From the confines of Harun Coffee in the historic Leimert Park neighborhood of South Los Angeles comes one of the most exhilarating Tiny Desk home concerts I've ever seen. Khalil's set is a colorful explosion of talent, perfectly complimenting the funky patchwork and textures of her attire.\n\nShe hit our radar and was featured on All Songs Considered last year, but gained national attention as a contestant on Netflix's music competition show, Rhythm + Flow. As an emcee, she enunciates and bends her words unlike anyone in the game and if the bars don't hook you, her expansive vocal range most certainly will. The Torrance, Calif., native's musical theater background shines through here; she exudes an array of emotions in a span of minutes on tracks like \"UP LATE\" and \"MARIA,\" making it impossible to look away. The orchestration, courtesy of her band (whom she calls \"The ill\"), reflects the recorded sessions almost to a tee and features a special guest on bass and guitar: Tiny Desk alum Kelsey Gonzalez of The Free Nationals.\n\nSticking to the \"inspiration\" theme of our Black History Month celebration, she recites an excerpt from Langston Hughes's \"Let America Be America Again.\" The 86-year-old words still read painfully relevant for many Black people in this country today.\n\nSET LIST\n\"Way Down\"\n\"FATHER\"\n\"UP LATE\"\n\"MARIA\"\n\nMUSICIANS\nRae Khalil: vocals\nKelsey González: bass, guitar\nNico Vasquez: drums\nTakoda Barraza: guitar\nDominick Cruz: bass, guitar\nElyzr: piano\n\nCREDITS\nAudio: Arley Cervantes, Tom Kendall, Lucas Palmieri\nVideo: Riley Lattanza, Mike Bugaoan, Brianna Nakatani, Steve Grise\nProduction Manager: Nathan Rebolledo\nProducers: Van Caraviello & SOS Production\nSpecial Thanks: United Masters, Harun Coffee, Harun Intl.\n\nTINY DESK TEAM\nProducer: Bobby Carter\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nArt Director: CJ Riculan\nTiny Production Team: Bob Boilen, Kara Frame, Morgan Noelle Smith\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann", "link": "https://www.youtube.com/watch?v=vDZBjxj-QAU", "date_published": "2021-02-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]