[{"source": "https://www.theguardian.com/rss", "title": "20 photographs of the week", "description": "<p>The inauguration of President Joe Biden, the Epiphany, Alexei Navalny’s return to Russia and the enduring impact of Covid-19: the most striking images from around the world this week</p> <a href=\"https://www.theguardian.com/artanddesign/gallery/2021/jan/22/20-photographs-of-the-week\">Continue reading...</a>", "link": "https://www.theguardian.com/artanddesign/gallery/2021/jan/22/20-photographs-of-the-week", "date_published": "2021-01-22 20:02:52+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Home learning: a headteacher and child psychologist share their advice", "description": "<p>During this third lockdown, many parents are once again feeling the pressure of home learning. Here’s how to make life a little easier for yourself and your children </p><p>With schools shut for the foreseeable future to all except the children of critical workers and vulnerable children as the government tries to help stop the spread of Covid-19, you may find yourself struggling to know how best to support your child’s learning from home. Many of us are feeling completely overwhelmed by having to educate our children remotely again, nearly 11 months into the pandemic, often while juggling our own work commitments.</p><p>As a parent, it’s only natural to worry about the impact of such disruption on a child’s educational progress and wellbeing. With children of all ages currently out of school with no definitive return date, it is difficult to know what they “should” be achieving on a day-to-day basis and how you can help them get the most out of this unpredictable time. So we spoke to Emma Marshall – a senior school headteacher, and clinical child psychologist Dr Kate Mason, to find out the real impact of this continuing situation on children and their top five tips on how we can really help them.</p> <a href=\"https://www.theguardian.com/all-in-all-together/2021/jan/22/home-learning-a-headteacher-and-child-psychologist-share-their-advice\">Continue reading...</a>", "link": "https://www.theguardian.com/all-in-all-together/2021/jan/22/home-learning-a-headteacher-and-child-psychologist-share-their-advice", "date_published": "2021-01-22 16:29:05+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "‘Prioritise beauty sleep’: five tips to help boost skin hydration", "description": "<p>Even mild dehydration can leave skin looking dry and lacklustre, energy levels depleted and our mood low. Luckily, it’s easy to boost your hydration levels with these quick fixes</p><p>Along with temperatures sneaking to frosty lows and an optimistic to-do list for the months ahead, January tends to arrive with a clutch of familiar niggles; dull, dehydrated skin, sporadic breakouts and flaky patches, not to mention a general lethargy that can seep from the brain to the body. Sound familiar?</p><p>Since <a href=\"https://www.usgs.gov/special-topic/water-science-school/science/water-you-water-and-human-body?qt-science_center_objects=0#qt-science_center_objects\" rel=\"nofollow\">our bodies are made up of around 60% water</a>, it’ll come as no surprise that boosting your overall hydration can be key to nipping myriad niggles in the bud. “Cold weather, indoor heating and hot showers can all wreak havoc on our skin and cause it to lose moisture and become dry and flaky,” says dermatology registrar Dr Cristina Psomadakis. “It is really important to be proactive and try to protect our skin before it suffers from seasonal assaults. This usually means swapping to a richer moisturiser (or using more moisturiser).”</p> <a href=\"https://www.theguardian.com/healthy-happy-and-hydrated-skin/2021/jan/22/prioritise-beauty-sleep-five-tips-to-help-boost-skin-hydration\">Continue reading...</a>", "link": "https://www.theguardian.com/healthy-happy-and-hydrated-skin/2021/jan/22/prioritise-beauty-sleep-five-tips-to-help-boost-skin-hydration", "date_published": "2021-01-22 15:51:43+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "‘Dry patches, tightness and redness’: signs your skin is dehydrated and how to fix it", "description": "<p>Dehydration can leave your skin looking dull and lifeless – but luckily it’s totally fixable. Here’s expert advice on how to get glowing skin no matter what time of year it is</p><p>When skin suddenly feels tight and looks dull, with fine lines and wrinkles more apparent than ever, it’s easy to panic. But, while it might be easy to assume that the stress of the past year has irredeemably accelerated the ageing process, it’s far more likely that such skin issues are simply down to dehydration. And while that’s not ideal, the good news is that it can be put right.</p><p>Unlike dry skin, which tends to be a long-term issue caused by your skin not producing enough oil, dehydrated skin is down to lack of water and is usually temporary.</p> <a href=\"https://www.theguardian.com/healthy-happy-and-hydrated-skin/2021/jan/22/dry-patches-tightness-and-redness-signs-your-skin-is-dehydrated-and-how-to-fix-it\">Continue reading...</a>", "link": "https://www.theguardian.com/healthy-happy-and-hydrated-skin/2021/jan/22/dry-patches-tightness-and-redness-signs-your-skin-is-dehydrated-and-how-to-fix-it", "date_published": "2021-01-22 15:50:12+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Me and my water bottle: my journey to drinking eight glasses a day", "description": "<p>Drinking the recommended amount may seem like an easy target, but many of us find ourselves consuming less water than we should. Writer Anna Fielding describes how she met her hydration goals</p><p>This is by no means a heroic journey, I’m aware of that. Hydration shouldn’t be hard: eight glasses of water a day – sounds pretty simple, right? It comes out of the tap, ready to drink, right there in your kitchen. You don’t even have to leave the house for it.</p><p>It should feel miraculous, if you think about it in a historical and global context – all this available water, but its abundance works against it. After all, when choosing what to drink, the taste of water doesn’t quite compare with the bite of a short, sharp coffee, or the sugary funk of pineapple juice.</p> <a href=\"https://www.theguardian.com/healthy-happy-and-hydrated-skin/2021/jan/22/me-and-my-water-bottle-my-journey-to-drinking-eight-glasses-a-day\">Continue reading...</a>", "link": "https://www.theguardian.com/healthy-happy-and-hydrated-skin/2021/jan/22/me-and-my-water-bottle-my-journey-to-drinking-eight-glasses-a-day", "date_published": "2021-01-22 15:48:35+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Caffeine dehydrates you … and other common hydration myths – busted", "description": "<p>We all know that a healthy intake of water is crucial for our health, but there is still a lack of clarity around how we give our body the fluid it needs</p><p>Water and hydration are the very source of life, it’s what our bodies are made of. Up to <a href=\"https://www.weightlosslatvia.com/blog/2020/05/27/water-in-human-body/#:~:text=According%20to%20H.H.%20Mitchell%2C%20Journal,are%20watery%3A%2031%25.%E2%80%9D\" rel=\"nofollow\">60% of the human body</a> is water – from our hearts (73% water), to our bones (31%) and our skin (64%). It has even been linked to better moods. But though it might seem simple, with many people holding on to the golden rule of drinking eight glasses of water a day, there are still many myths and misunderstandings around hydration. Is caffeine really dehydrating? Should you drink a glass of water for every cup of coffee? Can you drink too much water? Do people with oily skin really need more hydration? How do topical solutions work? And is hyaluronic acid really as good as everyone says it is?</p> <a href=\"https://www.theguardian.com/healthy-happy-and-hydrated-skin/2021/jan/22/caffeine-dehydrates-you-and-other-common-hydration-myths-busted\">Continue reading...</a>", "link": "https://www.theguardian.com/healthy-happy-and-hydrated-skin/2021/jan/22/caffeine-dehydrates-you-and-other-common-hydration-myths-busted", "date_published": "2021-01-22 15:46:54+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Insurrection and inauguration: Joe Biden's new political era - video", "description": "<p>Following the US Capitol riot, Oliver Laughland and Tom Silverstone travel to Washington DC for the week of Joe Biden’s inauguration to find a downtown area under what is essentially military occupation and a city coming to terms with the trauma of Donald Trump’s final days in office.&nbsp;</p><p>They speak to lifelong residents in the outer suburbs as well the US congresswoman Ilhan Omar, who tells of her harrowing experience of the 6 January riot. Trump’s former national security adviser John Bolton rails against criticisms of the Republican administration’s handling of the domestic terrorism threat</p><ul><li><a href=\"https://www.theguardian.com/us-news/2021/jan/22/ilhan-omar-capitol-attack-congress-trump\">'I didn’t know if I would make it out that day': Ilhan Omar on the terror of the Capitol attack</a></li></ul> <a href=\"https://www.theguardian.com/us-news/video/2021/jan/22/insurrection-and-inauguration-joe-bidens-new-political-era-video\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/video/2021/jan/22/insurrection-and-inauguration-joe-bidens-new-political-era-video", "date_published": "2021-01-22 12:00:47+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "The teenage taekwondo trainer fighting child marriage in Zimbabwe – photo essay", "description": "<p>Natsiraishe Maritsa saw so many friends being forced into marriage that she started a campaign to drive out the practice.</p><p>It is 11am on a Sunday and Natsiraishe Maritsa, 17, is running through some workout drills with a group of sweating teenage girls from her neighbourhood in Epworth, a poor township nine miles (15km) south-east of the capital, Harare.</p><p>On a normal Sunday, Maritsa and her friends would be attending church, but the strict 30-day lockdown imposed by the government earlier this month has banned religious gatherings – so it’s time to catch up on a taekwondo training session.</p> <a href=\"https://www.theguardian.com/global-development/2021/jan/22/the-teenage-taekwondo-trainer-fighting-child-marriage-in-zimbabwe-photo-essay\">Continue reading...</a>", "link": "https://www.theguardian.com/global-development/2021/jan/22/the-teenage-taekwondo-trainer-fighting-child-marriage-in-zimbabwe-photo-essay", "date_published": "2021-01-22 07:45:41+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Surviving cardiac arrest: what it's like to come back to life – podcast", "description": "<p>Last year the Guardian’s Jonathan Watts underwent a lifesaving operation following a cardiac arrest. He tells Anushka Asthana what it taught him about life and death </p><p>When the Guardian’s global environment editor, <strong>Jonathan Watts,</strong> collapsed during a game of football in a London park last year, he thought he was dying. He felt his body shutting down as medics rushed him to hospital, where he was given emergency defibrillator treatment to shock his heart back to life.</p><p>He describes the experience to <strong>Anushka Asthana, </strong>not in terms of terror but with a sense of calmness and wonder. Now in recovery, he recalls the extraordinary care he received from those who treated him in the midst of a pandemic. Five months on, Watts is philosophical about the episode and its impact on his own life and those who love him. As a newly married man, he resolves to rebalance his priorities and work on what it means to live a good life<br /></p> <a href=\"https://www.theguardian.com/news/audio/2021/jan/22/surviving-cardiac-arrest-what-its-like-to-come-back-to-life-podcast\">Continue reading...</a>", "link": "https://www.theguardian.com/news/audio/2021/jan/22/surviving-cardiac-arrest-what-its-like-to-come-back-to-life-podcast", "date_published": "2021-01-22 03:00:36+00:00", "persistent": false, "user": null, "language": "en-UK"}]