[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCyl5V3-J_Bsy3x-EBCJwepg", "title": "The Bee Reads LOTR Episode 4: Three’s Company", "description": "From the heart of the Shire, through the depths of Moria, to the ends of Middle-Earth, it’s The Babylon Bee Reads The Lord Of The Rings! In this episode of The Babylon Bee Reads, Kyle and Dan are joined by Jonathan Watson, creator alongside his two friends of http://TheOneRing.Com. Kyle, Dan, and Jon continue their fellowship in reading through The Fellowship of the Ring, this time in Chapter 3 Three’s Company, where three hobbits encounter black riders and elves in their very own Shire.", "link": "https://www.youtube.com/watch?v=qHUuUQ7f4PY", "date_published": "2021-01-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCyl5V3-J_Bsy3x-EBCJwepg", "title": "Not My President And Skynet Can Do Whatever It Wants", "description": "Today on The Babylon Bee Podcast, Kyle and Ethan talk about the week’s biggest stories like Skynet being a private company so their Terminator robots can do whatever they want to you, Democratic states are suddenly following the science on lockdowns, and how the right is learning from the left’s past four years on how to cope when they feel like the president is not their president. There’s weird news, glorious hate mail, and Kyle can’t say the word “dang.”\n\nWatch The Babylon Bee animation on our animation playlist: https://bit.ly/BeeAnimation  \n\nSubscribe on iTunes: https://podcasts.apple.com/us/podcast/the-babylon-bee/id1468715531\n\nSubmit Your Own Headlines: https://babylonbee.com/plans\n\nThe Official The Babylon Bee Store: https://shop.babylonbee.com\n\nFollow The Babylon Bee:\nWebsite: https://babylonbee.com\nTwitter: http://twitter.com/thebabylonbee\nFacebook: http://facebook.com/thebabylonbee\nInstagram: http://instagram.com/thebabylonbee", "link": "https://www.youtube.com/watch?v=_b7D7odPQds", "date_published": "2021-01-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]