[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Rod Wave: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nMano Sundaresan | April 29, 2021\nThe first song Rod Wave performs in his Tiny Desk concert comes with a bit of a wink. The St. Petersburg, Fla., rapper interpolates Drake's \"Over My Dead Body,\" the delicate intro to Take Care. Like Drake, Rod Wave makes sad, melodic rap music. But his feels removed from the Canadian superstar's lineage. His cadences are more in step with the full-bodied crooning of Southern rap giants like Kevin Gates and Lil Boosie. It's been said that Rod Wave could be an R&B or blues singer in another era. With this Tiny Desk concert, anchored by the interplay of flute, piano, bass and drums, he seems to suggest: Why not this one?\n\nCast against a leafy, luxurious backdrop, Rod and his band deliver fiery renditions of three songs off his new album SoulFly, as well as his 2020 hit record \"Rags2Riches.\" When he sings — about coming out of the trenches, about being away from his loved one, about perceptions of his artistry — you can feel the weight of those thoughts pouring out of every line. You can see it, too, in the way he shuts his eyes, grips the mic, sways back and forth. In light of his massive success — he's quite clearly one of the biggest rappers in the country right now — he could've treated this Tiny Desk like a victory lap, but instead, he brings the same heart and earnestness that's made him so beloved.\n\nSET LIST\n • \"OMDB\"\n • \"Rags2Riches\"\n • \"Street Runner\" (featuring Ruth B.)\n • \"Don't Forget\"\n\nMUSICIANS\n • Rod Wave: vocals\n • Gil Smith: piano\n • Hosny Franck: drums\n • Tomoka Nomura-Jarvis: flute, saxophone\n • Franckelson Brunot: bass guitar, upright bass\n\nCREDITS\n • Video: Tyler Benz, Justin Staple, Albert Lago, Christian Cashmir, Tom Jordan, Tim Buttner, Andrew Ortoski\n • Audio: Maceo Price for Skyballer Productions\n • All The Smoke & Litewave Media\n\nTINY DESK TEAM\n • Producers: Bobby Carter, Mano Sundaresan\n • Video Producer: Maia Stern\n • Audio Mastering: Josh Rogosin\n • Tiny Production Team: Kara Frame, Bob Boilen\n • Executive Producer: Lauren Onkey\n • Senior VP, Programming: Anya Grundmann\n\n#rodwave #tinydesk #nprmusic", "link": "https://www.youtube.com/watch?v=sR7JdLO_y5s", "date_published": "2021-04-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]