[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "How Rico Nasty And Kenny Beats Became The Loudest Duo In Rap | The Formula, S2E1", "description": "Rico Nasty and Kenny Beats make one of the unlikeliest duos in rap. It started with one impromptu studio session and one primal scream.\n\nRodney Carmichael | October 29, 2021\nIn April 2019, Rico Nasty and producer Kenny Beats released the joint mixtape Anger Management. Concocted to sound like a temper tantrum from start to finish, it was the culmination of a nearly two-year run in which they'd effectively become the loudest, unlikeliest duo in rap.\n\nIn this week's episode of The Formula, the first of a new season that digs into the collaboration between rappers and producers, we sit down with each of them in their respective cities — Rico at a performance space she frequents in the DMV; Kenny at his home studio in L.A. — to talk about their genre-bending discography and how it remade Rico into rap's raging queen of scream. They lay the groundwork by recalling the making of their signature anthem, \"Smack A B****,\" a song recorded in their first impromptu studio session when Rico was still in the process of finding her voice in an industry brewing with frenemies and rival beefs. From there, they dissect \"Sellout,\" the vulnerable, penultimate track from Anger Management, an album inspired in part by psychologist Arthur Janov's classic therapy tome, \"The Primal Scream.\"\n\nThe sound they achieved would become synonymous with the emerging image of Rico Nasty as a sonic rebel while simultaneously making a lane for the outcasts and weirdos who saw themselves reflected in Rico's punk stance. Beyond Kenny's essential beats, Rico credits him for being the kind of producer who valued her voice, figuratively and quite literally. That trust has enabled her to grow into an artist who controls her studio sessions with confidence today, even in a game where the men in power constantly feel obliged to tell the women what to do.\n\nTogether, they're a reminder that even the wildest experimentalists rely on collaborators they trust to let it all flow.\n\nCREDITS\nHost/Series Producer: Rodney Carmichael; Producers: Tsering Bista, Nickolai Hammar; Editor: Annabel Edwards; Art Director/Animator: CJ Riculan; Animators: Jackie Lay, Alicia Zheng; Director of Photography: Nickolai Hammar; Audio Engineer: Josh Rogosin; Videographers: Bronson Arcuri, Jack Corbett, Nickolai Hammar, CJ Riculan, Alicia Zheng; Production Assistants: Amna Ijaz, Trisha Pickelhaupt; Project Coordinator: Erin Register; Legal Adviser: Kimberly Sullivan; Consulting Editors: Jacob Ganz, Sidney Madden; Supervising Producer, Nick Michael; Senior Producer: Abby O'Neill; Managing Editor: Becky Lettenberger; Executive Producers: Anya Grundmann, Keith Jenkins\n\nMUSIC\n\"Smack A B****,\" Rico Nasty (2018); \"Sell Out,\" Rico Nasty, Anger Management (2019); \"Rose Water\" by DJ Face\n\n#nprmusic #theformula #riconasty #kennybeats", "link": "https://www.youtube.com/watch?v=cZ2Ng9KOntY", "date_published": "2021-10-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]