[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCyl5V3-J_Bsy3x-EBCJwepg", "title": "Paw Patrol To Face Their Greatest Foe Yet: Dr. Fauci", "description": "Dr. Anthony Fauci will guest star in an upcoming episode of Paw Patrol! Will the pups survive his sandfly torture? Chase is on the case!\n\nBecome a premium subscriber:  https://babylonbee.com/plans\n\nThe Official The Babylon Bee Store:  https://shop.babylonbee.com/\n\nFollow The Babylon Bee:\nWebsite: https://babylonbee.com/\nTwitter: https://twitter.com/thebabylonbee\nFacebook: https://www.facebook.com/TheBabylonBee\nInstagram: http://instagram.com/thebabylonbee", "link": "https://www.youtube.com/watch?v=I0ktCwOY_Aw", "date_published": "2021-10-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCyl5V3-J_Bsy3x-EBCJwepg", "title": "THE BEE WEEKLY: A G.K. Chesterton Special With Dale Ahlquist and Cheese", "description": "It's Chestermania 2021 at The Babylon Bee and Kyle and Ethan are joined by the President of the Society of G.K. Chesterton, Dale Ahlquist. Dale has been called the greatest living authority on the life and work of G.K. Chesterton and has authored five books on Chesterton, including Common Sense 101: Lessons from Chesterton and G.K. Chesterton: Apostle of Common Sense. Why should people start reading Chesterton and where should they begin? What are some of Chesterton's big concepts that help to unlock an understanding of his writings? What would Chesterton say about Cheetos?\n\nBe sure to check out The Society of Gilbert Keith Chesterton at: https://www.chesterton.org/\n\nKyle, Ethan, and Dale, accompanied by Adam Yenser, play a special edition of Real or Fake where the headlines are all supposedly weird news headlines from a hundred years ago. They discuss how prophetic Chesterton was and talk about his prominent books and essays that you must read to not waste your life. Then in the subscriber portion, they discuss cheese and Chesterton’s big concepts that he returned to again and again throughout his life’s work. Dale answers subscriber-submitted G.K. Questertons and is subjected to The Ten Questions! Click Join on YouTube to watch the whole episode!\n\nBecome a premium subscriber:  https://babylonbee.com/plans\n\nThe Official The Babylon Bee Store:  https://shop.babylonbee.com/\n\nFollow The Babylon Bee:\nWebsite: https://babylonbee.com/\nTwitter: https://twitter.com/thebabylonbee\nFacebook: https://www.facebook.com/TheBabylonBee\nInstagram: http://instagram.com/thebabylonbee", "link": "https://www.youtube.com/watch?v=lmekyic4pmo", "date_published": "2021-10-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]