[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCsXVk37bltHxD1rDPwtNM8Q", "title": "The Largest Black Hole in the Universe - Size Comparison", "description": "The Black Hole story continues with our Black Hole merch, spanning the whole range from somewhat bonkers to more serious. Check it out here: https://kgs.link/shop-146\n\nSources & further reading:\nhttps://sites.google.com/view/sources-largest-black-hole/\n\nThe largest things in the universe are black holes. In contrast to things like planets or stars they have no physical size limit, and can literally grow endlessly. Although in reality specific things need to happen to create different kinds of black holes, from really tiny ones to the largest single things in the universe. So how do black holes grow and how large is the largest of them all? \n\nOUR CHANNELS\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nGerman Channel: https://kgs.link/youtubeDE \nSpanish Channel: https://kgs.link/youtubeES \n\n\nHOW CAN YOU SUPPORT US?\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nThis is how we make our living and it would be a pleasure if you support us!\n\nGet Merch designed with ❤ https://kgs.link/shop-146  \nJoin the Patreon Bird Army 🐧  https://kgs.link/patreon  \n\n\nDISCUSSIONS & SOCIAL MEDIA\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nReddit:            https://kgs.link/reddit\nInstagram:     https://kgs.link/instagram\nTwitter:           https://kgs.link/twitter\nFacebook:      https://kgs.link/facebook\nDiscord:          https://kgs.link/discord\nNewsletter:    https://kgs.link/newsletter\n\n\nOUR VOICE\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nThe Kurzgesagt voice is from \nSteve Taylor:  https://kgs.link/youtube-voice\n\n\nOUR MUSIC ♬♪\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\n700+ minutes of Kurzgesagt Soundtracks by Epic Mountain:\n\nSpotify:            https://kgs.link/music-spotify\nSoundcloud:   https://kgs.link/music-soundcloud\nBandcamp:     https://kgs.link/music-bandcamp\nYoutube:          https://kgs.link/music-youtube\nFacebook:       https://kgs.link/music-facebook\n\nThe Soundtrack of this video:\n\nSoundcloud:   https://bit.ly/3yaqWSr\nBandcamp:     https://bit.ly/2TEHjb9\n\nIf you want to help us caption this video, please send subtitles to subtitle@kurzgesagt.org\nYou can find info on what subtitle files work on YouTube here:\nhttps://support.google.com/youtube/answer/2734698?hl=en-GB&ref_topic=7296214\nThank you!\n\n🐦🐧🐤 PATREON BIRD ARMY 🐤🐧🐦\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nMany Thanks to our wonderful Patreons (from http://kgs.link/patreon) who support us every month and made this video possible:\nBBumbrazz, Sir Harry Farr, Abigail von Kelsch, Szabolcs Dombi, Conner Wilson, Enoch, Moody Bastard, Diego Marcheselli, Paxton LaRiviere, Richard Hagen, Robin Harn, Izzy Crow, Kristy Evangelista, Michael Baker, Tuna The Fish, @charlievankamp, Calvin Black, Justin Fisher, Jan Hübler, Anshul Choudhry, garshtoshteles, Mark Moses, Mau Magaña, seasar2000, Toda, newline, Matt, schubadu, Slumperd, Cracker, Josh Carpenter, Benedikt S., Jeti, Kevin Williams, Enrique Mejia, Juan Carlos Coto Sanchez, Paulmega, Jasmeet Singh, Austin Daily, Andrew Bourgeois, Andrew Dawson, Fin Brewin, Graesha Lizardo, Hagen, Diogo Moreno, Madeline McKinnon, akshay niranjan, The Entity, sontino catalano, Aubrey Temple, Terone, Oleksandr Bolgarov, Jacob Bell, Kyle Harmse, Henry Angulo, Luka Dulčić, mors741, Billyboots75, Joe Bedell, Merasmus 2.0, jimmy davies, PBYuki-Onna, Billy Z Duke", "link": "https://www.youtube.com/watch?v=0FH9cgRhQ-k", "date_published": "2021-08-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]