[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCoOjH8D2XAgjzQlneM2W0EQ", "title": "What did you think was gonna happen in China, Elon???", "description": "Sign up to Morning Brew for free today: https://bit.ly/mbjaketran\n\n😈 Watch exclusive 40+ minute documentaries that are too controversial to ever be released to the public: https://jake.yt/join \nUpdated refund policy: Email us within your first month of joining and we'll refund you for your first month. There is no refund if you cancel at a later time.\n\n📹 Take a peak at all the private documentaries here: https://jake.yt/hidden-vids\n\n🎥 Business is complicated. Subscribe to curiosity: http://bit.ly/jt-sub\n✨ Follow us on TikTok: https://jake.yt/tiktok\n🎙️ Subscribe to the 2nd channel, Intellectual Dropouts: https://jake.yt/id\n✉ Be the first to watch new videos with email notifications: http://bit.ly/jt-inbox\n📸 Follow me on IG:@jaketran // http://bit.ly/jt-ig\n💬 Join the community Discord: http://discord.gg/BmK8EnQ\n\n💻 𝗟𝗮𝗽𝘁𝗼𝗽 𝗟𝗶𝗳𝗲𝘀𝘁𝘆𝗹𝗲 𝗔𝗰𝗮𝗱𝗲𝗺𝘆: Learn exactly how I landed my $40/hr work from home job ($83k/yr) at 19 years old: https://jake.yt/LLAd\n📜 The exact resume I used to get my $40/hr remote web dev job + a lot of bonuses: https://jake.yt/DRBd\n🎵 Get unlimited royalty-free music for your videos with Epidemic Sound! ➡️ https://share.epidemicsound.com/jaketran \n\n✉️ Email me: jake@jaketran.io\n\n📰 Sources & visuals: https://bit.ly/3ywj4La\n\n-----------------------\nAs soon as you’ve sucked out all the blood you can from them, as soon as they’re no longer useful to you, as soon as your priorities change, that’s where the switch comes in: the favors suddenly come to a halt, you’re no longer at their beck and call, you turn a cold shoulder, you stop answering their phone calls And that’s exactly what Elon Musk and Tesla is experiencing right now with the Chinese Government.\n\nChina is the world’s biggest market for electric vehicles. So it’s not surprising that Tesla saw the chance of dominating the Chinese EV market as a no-brainer. Tesla entering the Chinese market was good for the Chinese government as well. A couple months later, Tesla and the Shanghai government sealed the deal for a Tesla gigafactory able to produce up to half a million EVs a year. And the good times just kept rolling. \n\nElon Musk had become the Chinese president’s favorite capitalist. Which raises the question, what did China really want out of it? Tesla did in fact raise the bar for local EV manufacturers like Nio and Xpeng: their tech was getting better, and their sales had been on the rise. All of a sudden, Tesla wasn’t so useful to the Chinese government anymore, their priorities changed.\n\nTesla quickly started running into problems. Suddenly, Tesla executives were being summoned by China Regulators to “discuss” safety issues in their cars, including reports of random acceleration and battery fires. Tesla really started feeling the change in the government's favor, when some of its cars were banned from military complexes over fears that they could be sending their camera data back to the US government. China dealt another blow to the company, stating that all smart cars would need to store their data in-country. Things just kept getting worse. Local governments started reviewing Tesla ownership among their employees, and then came the last straw. \n\nAfter claiming Tesla EVs’ autopilot system could be activated automatically and possibly lead to crashes, Beijing ordered pretty much all of the nearly 300k Tesla cars sold in China to be recalled, and their software upgraded for free to fix the safety issue. Tesla had to apologize. Again. \n\nTesla is still doing well overall.\n-----------------------\nSwuM - Self Luv https://chll.to/69f5481a\nNo Spirit - Slightly Improvised https://chll.to/6347930b\n\nAll materials in these videos are used for educational purposes and fall within the guidelines of fair use. No copyright infringement intended. If you are or represent the copyright owner of materials used in this video and have a problem with the use of said material, please send me an email, jake@jaketran.io, and we can sort it out.\n\nCopyright © 2021 Transcend Visuals, LLC. All rights reserved.\n\nDISCLAIMER:\n\nThis video does not provide investment or economic advice and is not professional advice (legal, accounting, tax).  The owner of this content is not an investment advisor.  Discussion of any securities, trading, or markets is incidental and solely for entertainment purposes.  Nothing herein shall constitute a recommendation, investment advice, or an opinion on suitability.  The information in this video is provided as of the date of its initial release.  The owner of this video expressly disclaims all representations or warranties of accuracy.  The owner of this video claims all intellectual property rights, including copyrights, of and related to, this video.\n\nAFFILIATE DISCLOSURE: Some of the links in this video's description are affiliate links, meaning, at no additional cost to you, the owner may earn a commission if you click through, make a purchase, and/or opt-in.", "link": "https://www.youtube.com/watch?v=WEHyzffPSMU", "date_published": "2021-08-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]