[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Dinosaur Jr.: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nStephen Thompson | Aug. 3, 2021\nIn the year-plus that we’ve been recording Tiny Desk (home) concerts, artists have worked hard to reproduce the Tiny Desk vibe through special effects ranging from Phoebe Bridgers’ Oval Office backdrop to clipping.’s tininess-enhancing miniature set. For Dinosaur Jr., the spirit of the Tiny Desk can be found in an under-appreciated facet of the series: the ever-evolving array of tchotchkes, promo pieces and other bits of pop-cultural detritus that line the shelves behind Bob Boilen’s desk.\n\nDinosaur Jr.’s own home concert — “home” in this case being the stage of an empty Shea Theater in Turners Falls, Mass. — is set amid its own enviable assortment of oddities, from stuffed animals to a Mork action figure to a copy of the album A Christmas Together by John Denver & The Muppets. And you don’t stick around as a band for all or part of five decades without knowing a little something about product placement: Dinosaur Jr.’s terrific new album, Sweep It Into Space, is prominently located near the wee plastic desk that sits front and center onstage.\n\nNaturally, that album dominates this five-song set, which finds the trio of singer-guitarist J Mascis, singer-bassist Lou Barlow and drummer Murph sounding as fluid and forceful and gnarly as ever. Mascis gets to unleash a few shredding solos, Barlow gets to take the lead in “Garden” and Murph gets to do his thing in close proximity to a pair of large dinosaur-shaped balloons. Plus, longtime fans get treated to two towering classics from earlier in Dinosaur Jr.’s excellent career: “Feel the Pain,” from 1994’s Without a Sound, and “Freak Scene,” which opens 1988’s Bug.\n\nSET LIST\n\"I Ain't\"\n\"Garden\"\n\"Feel the Pain\"\n\"I Ran Away\"\n\"Freak Scene\"\n\nMUSICIANS\nJ Mascis: vocals, guitar, bass\nLou Barlow: vocals, bass, guitar\nMurph: drums\n\nCREDITS\nDirector: Joe Salinas\n1st AD: John William Moloney\nCamera Operators: Chris Hillen, Robert Thomas, John Moloney, Joe Salinas\nEditor/Colorist: Joe Salinas\nAssistant Editor: Chris Hillen, Justin Pizzoferrato\nArt Director/Set Design: John William Moloney\nSound Mixer/Sound Design: Justin Pizzoferrato\nLighting Technician: Wyatt Andrews\nProduction Assistant: Marc Seedorf\nExecutive Producers: Amy Abrams, Brian Schwartz\nProducer: John William Moloney\nFilmed at the Shea Theater in Turner Falls, MA\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Maia Stern\nAudio Mastering: Alex Drewenskus\nAssociate Producer: Bobby Carter\nTiny Production Team: Kara Frame, Josh Rogosin, Gabrielle Pierre\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #nprmusic #dinosaurjr", "link": "https://www.youtube.com/watch?v=MxbGf_JyvVs", "date_published": "2021-08-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]