[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Merry Clayton: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nLauren Onkey  | June 9, 2021\nMerry Clayton's Tiny Desk concert begins with the essentials. After a brief piano intro, she begins to sing \"Beautiful Scars\" — the title track of her new album — in a powerful and knowing voice. That simple pairing commands attention: \"I've been on the battlefield of life. / I've been through it. / But I just had to go through that to get to this.\" She sings in dialogue with five superb singers, all with serious gospel chops — including members of The Waters and Take 6 — and a band of seasoned pros. \"Stand up and be proud of your scars,\" she sings. The vibe is relaxed, but purposeful.\n\nThis performance is an inspiring comeback for Clayton, who has been making great music for almost 60 years. Clayton is one of rock's most important backup singers (for starters, see The Rolling Stones' \"Gimme Shelter,\" Lynyrd Skynyrd's \"Sweet Home Alabama\" and Carole King's Tapestry). She recorded several excellent solo albums that never broke big, but eventually received the recognition she deserved in the 2013 documentary 20 Feet From Stardom. In 2014, she was in a serious car accident that required months in the hospital and extensive rehabilitation. With encouragement from her longtime friend and producer Lou Adler — who's watching this performance off-camera — she decided to record a new album.\n\nAll the songs in this Tiny Desk performance testify to the power of faith and friendship. \"Oh What a Friend,\" written by Terry Young, features soaring call-and-response vocals between Clayton and the vocalists. They conclude with a stirring and joyous version of Sam Cooke's 1956 classic \"Touch the Hem of His Garment.\"\n\nSET LIST\n • \"Beautiful Scars\"\n • \"Oh What a Friend\"\n • \"Touch The Hem Of His Garment\"\n\nMUSICIANS\n • Merry Clayton: vocals\n • Terry Young: piano\n • Charles Fearing: guitar\n • Nathan East: bass\n • Harvey Mason: drums\n • Maxine Waters: vocals\n • Julie Waters: vocals\n • Oren Waters: vocals\n • Alvin Chea: vocals\n • Alfie Siles: vocals\n\nCREDITS\n • Video: Lou Adler, Vincent Adam Paul\n • Audio: Jill Tengan\n\nTINY DESK TEAM\n • Producer: Lauren Onkey\n • Video Producer: Kara Frame\n • Audio Mastering: Josh Rogosin\n • Associate Producer: Bobby Carter\n • Tiny Production Team: Bob Boilen, Maia Stern, Gabrielle Pierre\n • Executive Producer: Keith Jenkins\n • Senior VP, Programming: Anya Grundmann\n\n#merryclayton #tinydesk #nprmusic", "link": "https://www.youtube.com/watch?v=eHod4ZPzfLc", "date_published": "2021-06-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Rostam: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nRobin Hilton | June 8, 2021\nMy great-grandmother always used to say, \"Life is a train. People get on. People get off.\" And it just keeps going. Watching Rostam's Tiny Desk performance, it's easy to imagine you're on that life-train, traveling around and around, catching glimpses of instruments and faces as they pass by, before coming back where you started. It's a clever, if sometimes dizzying nod to the overarching themes of Rostam's Changephobia, a collection of songs that simultaneously look to the past and the future.\n\nRostam and a group of backing musicians play two cuts from that album: the relatively breezy, escapist ballad \"4Runner\" and the reflective \"These Kids We Knew.\" The group closes with \"In a River,\" a one-off single from 2018 that sits perfectly alongside the newer songs as he recalls a warm night skinny dipping with a friend.\n\nSET LIST\n\"4Runner\"\n\"These Kids We Knew\"\n\"In a River\"\n\nMUSICIANS\nRostam Batmanglij: vocals, guitar, harmonica\nJulian McClanahan Calvert: guitar, mandolin, harmonies\nLogan Kane: bass\nHenry Solomon: saxophone, congas, harmonica, 808 sample pad\nBenji Lysaght: guitar\nConor Malloy: drums, percussion\n\nCREDITS\nVideo: Jason Lester, Laura Burhenn\nAudio: Joey Messina-Doerning\nSpecial thanks to Our Secret Handshake\n\nTINY DESK TEAM\nProducer: Robin Hilton\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Bob Boilen, Kara Frame, Gabrielle Pierre\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #rostam", "link": "https://www.youtube.com/watch?v=X8LTs6EZF-Y", "date_published": "2021-06-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]