[{"source": "https://lukesmith.xyz/rss.xml", "title": "Why It's Bad to Have High GDP", "description": "<h2 id=\"to-put-it-in-other-words\">To put it in other words...</h2>\n<p>The common way of looking at Gross Domestic Product (GDP) is that it's\na metric of economic success: more GDP is more wealth. Wealth is good.\n&quot;Poverty&quot; (meaning low <em>per capita</em> GDP) is bad. Nowadays, pretty much\neveryone talks about &quot;economics&quot; like this as if this truism was\nscribbled on the back walls of the cosmos.</p>\n<p>This is just looking at one side of the ledger in a kind of global\ndouble-entry accounting book. A logically equivalent way of looking at\nit is that <strong>GDP is a metric of economic exchange required for survival\nin society as it exists</strong>. You can say that some area &quot;produced&quot; $1\nbillion of output (sounds good), but you can just as easily say that $1\nbillion was required for that area to sustain itself (sounds bad). These\ntwo are simply logically equivalent.</p>\n<h2 id=\"living-on-1-a-day\">Living on $1 a day</h2>\n\n<figure class=\"resright\"><a href=\"https://lukesmith.xyz/pix/ivanov01.jpg\"><img src=\"https://lukesmith.xyz/pix/ivanov01s.jpg\" title=\"(((They))) don't want you to know about this.\" /></a><figcaption>Antediluvian Hyperborea. GDP: $0 per year.</figcaption></figure>\n\n<p>Let's dive into the Gestalt: when you hear that a family of eight lives\non less than a dollar per day (PPP adjusted), you might wonder how they\nmanage! To <em>actually</em> do such a thing would require buying large bags of\nrice for the whole family, eat only that and live in free cardboard\nboxes.</p>\n<p>The reality is that that often uttered phrase means that they use less\nthan $1 a day in the general economy, while the rest of their\nlivelihood is &quot;off-the-grid&quot; or self-sufficient. They may grow food in\na family farm, hunt for food, and most of their daily needs from cooking\noils, to plates, to pottery, to soap are often made at home as well.</p>\n<p>There is still &quot;an economy&quot; but often one that is barter based or\n<em>socialist</em> in the real pre-socialist sense of the word: mediated by\ndirect face-to-face social tit-for-tat between neighbors and friends,\nnone of this mediated by currency being exchanged, thus it is not part\nof the GDP.</p>\n<p>If you read about some Bangladeshi village where the only product is\n&quot;textiles&quot;, that doesn't mean that everyone there makes textiles all\nday and, without a textile company, everyone would've starved to death.\nIt means that the only on-paper, measurable global industry practiced\nthere is textile manufacturing. Other villagers might farm, hunt, even\ndo some kind of gathering in some places. They will produce the arts and\ncrafts and live the way people live when you leave them alone. If your\nview of the world is mediated by GDP, you're only seeing the extremely\nsmall sliver that pops into existence when people exchange something\ninvolving legal tender.</p>\n<p>This is extremely difficult for us modern bugpeople to understand\nbecause to be a bugman in a large city is to produce absolutely nothing\non one's own and buy literally everything you need from the store. To\nus non-productive people, GDP means income which means survival. But the\nfurther out of Bugmanville you go, the clearer the vacuousness of GDP\nbecomes. When you realize that most of human wealth is unmeasured by\nGDP, you realize that Whig History and Steven Pinkerism is based on\nshaky foundations.</p>\n<h2 id=\"example\">Example</h2>\n<p>A minor example. We had a large Thanksgiving feast near my uncle's\nhouse in very rural Florida. As it got cold in the night, we had a fire\nin a repurposed old sugar cane cooking vat artfully standing on used\nsymmetrical cinderblock pieces. A bugman hipster might pay two hundred\ndollars or more for a similar looking &quot;authentic&quot; piece of equipment.\nThose $200 would be counted in the GDP. A bugman hipster might have\nalso bought or rented chairs for the event, &quot;contributing&quot; more to the\nGDP, but my uncle, as part of the local wholesome church community,\nsimply borrowed some from the church. Thus our event produced basically\nno GDP output in goods or services, despite being functionally\nequivalent to some similar but expensive and ergo &quot;productive&quot;\n&quot;Friendsgiving&quot; practiced by urbanites. In reality <em>we</em> are richer\nthan the bugmen hipsters who blew hundreds of dollars on a faux-folksy\nparty. In this case, we owned the firepit and had easy access and\npermission to the chairs, thus we are more economically flexible than\nthey are. That GDP that they produced/expended is evidence of deeper\nreliance on the economic system. That GDP output is a marker of\n<em>fragility</em>, reliance on the conditions of the outside economy in the\nsame way that a village of Bangladeshis who abandon their traditional\nway of lives to work on textiles are more fragile, despite being able to\nsave up for iPhones.</p>\n<h2 id=\"what-gdp-really-measures\">What GDP really measures</h2>\n<p><strong>Most of the increase in GDP across the world is simply the movement\nfrom local partially-social partially-under-the-table economies to\neconomies mediated by taxable currency.</strong> An economically\nself-sufficient village with close social relationships and a barter\neconomy has 0 GDP. A township of entrepreneurs and artisans you\npartially barter and partially use currency which they don't report has\n0 GDP. All of these people are &quot;in poverty&quot; and &quot;earn less than a\ndollar a day&quot;. And if you want to be truly self-sufficient, that means\nhaving a personal GDP of zero.</p>\n<p>More than that, pretty much everywhere, GDP is a strong indicator of\nsocial upheaval. If you think that GDP is some eternal goodness,\nremember that <em>everything &quot;good&quot; about industrialization shows up in\nthe GDP</em>, while at the same time, <em>everything bad about it will not show\nup</em>. Or, sometimes bad things are registered as positive economic\ngrowth: urbanization has caused mass-disease, and if that means a market\nfor new medical services and pharmaceuticals, great! The GDP just went\nup! The Ganges is polluted due to the textile plant? That just means\nmore opportunities for local entrepreneurs to sell bottled water! The\nGDP just went up! Are people being pushed out of fishing or other\nsubsistence occupations because of it? Even better! Now they have no\nchoice but to contribute to the GDP! With every passing year, in fact,\nmore and more of the GDP is produced by dealing with the problems that\nour higher level of GDP have caused.</p>\n<p>At the end of the day, <strong>GDP is only a measurement of how reliant a\nplace or country is on the global economy</strong>. Self-sufficiency has a GDP\nof 0. Wasteful consooomerism has an extremely large GDP.</p>\n<h2 id=\"planned-obsolescence\">Planned obsolescence</h2>\n<p>I have one of my great grandfather's early electric circular saws. It\nhas a bunch of gunk in it, but it still works (although I recently took\nit apart to replace some old screws and springs and other little parts\nto be careful). They literally do not make circular saws like it; it's\nall metal, while even the fancy modern stuff is mostly plastic.</p>\n<p>The &quot;unfortunate&quot; thing about it and other durable tools is that it's\n&quot;bad for the economy,&quot; especially the GDP. Since that thing has been\naround since maybe the 50's or 60's, that's as long as 70 years the\neconomy has gone without the &quot;stimulation&quot; of us having to buy another\nsaw.</p>\n<p>Viewers of my technology videos: Which would be better for the world, if\neveryone used the material equivalent of a classic American-made IBM\nThinkPad, or some Apple Laptops that are unfixable computers made of\nmostly batteries designed to conk out right before the new version comes\nout? Regardless, the Apple Macs that cost thousands a piece are much\nbetter for the &quot;economy.&quot;</p>\n<p>That's what I mean. If you have quality tools and do not need to\nconstantly throw money at the system to buy things, fix things and\notherwise waste money, you are going to be having a lower GDP. That's\njust how it is.</p>\n<h2 id=\"the-propagandistic-role-of-gdp\">The propagandistic role of GDP</h2>\n<p>When you don't think things through like this, GDP is supposed to\nappear as an objective measure of economic goodness. You're supposed to\nbe looking at those GDP charts and saying, &quot;Wow, my life might be\nterrible, I am not free, I am subject to forces out of my control, and I\nam told I have to participate in mass-consumerism to survive, but these\ncharts are the facts[!], and the facts say that things are better now,\nso I believe them!&quot;</p>\n<p>It's legitimately surprising to me how big of a boon the idea of\nincreasing GDP is for Whig history and NPCs of many different\nideologies. People of the Left and Right will matter-of-factly tell me\nthat a plastic based economy taking over the world is still good because\nthe line is going up. I've heard it as a justification for everything:</p>\n<ul>\n<li>Don't like globalization?\n<ul>\n<li>You're wrong, the GDP is going up.</li>\n</ul>\n</li>\n<li>Don't trust state-funded institutionalized science?\n<ul>\n<li>You're wrong, the GDP is going up.</li>\n</ul>\n</li>\n<li>Don't want child drag queens?\n<ul>\n<li>You're wrong, the GDP is going up.</li>\n</ul>\n</li>\n<li>Don't want everything to be made of plastics and other petrochemicals?\n<ul>\n<li>You're wrong, the GDP is going up.</li>\n</ul>\n</li>\n<li>Don't want mass pornography?\n<ul>\n<li>You're wrong, the GDP is going up.</li>\n</ul>\n</li>\n<li>Don't want free sugary drinks since infancy?\n<ul>\n<li>You're wrong, the GDP is going up.</li>\n</ul>\n</li>\n</ul>\n<p>When you abandon the illusion of GDP, you are suddenly able to ask\nwhether massive technological &quot;progress&quot; has <em>actually</em> been good for\nreal human life and human pychology.</p>", "link": "https://lukesmith.xyz/articles/why-its-bad-to-have-high-gdp/", "date_published": "2021-01-22 00:00:00+00:00", "persistent": true, "user": null, "language": "en-US"}]