[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Best Nintendo Direct Trailers (September 2021)", "description": "Nintendo Direct for September 2021 has wrapped up, and in this video we're taking a look at the best trailers from the event. We got to see a brand new reveal for Kirby and the Forgotten Land, a gameplay trailer for Bayonetta 3, another look at Splatoon 3, and much more. \n\nCheck out the video for a look at all of the most exciting reveals.\n\n00:00 - Kirby and the Forgotten Land\n02:17 - Bayonetta 3\n06:03 - Chocobo GP\n07:00 - Monster Hunter Rise: Sunbreak\n08:03 - Actraiser Renaissance\n10:43 - Splatoon 3\n12:44 - Metroid Dread\n15:17 - Disco Elysium - The Final Cut - Switch Edition\n\n#nintendodirect2021", "link": "https://www.youtube.com/watch?v=ZAfsxYPSZbU", "date_published": "2021-09-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Vanguard Beta vs Modern Warfare", "description": "Call of Duty: Vanguard feels like a hybrid between Modern Warfare 2019 and Call of Duty: WW2. It has many of Modern Warfare’s advances like gun customization and adds some flavor to maps by way of limited destruction. But Vanguard also falls behind Modern Warfare in a few key areas. Let’s talk about where Vanguard stacks up to recent Call Of Duty games and how it might compete this year with other AAA shooters like Battlefield. \n\nCall of Duty: Vanguard, being developed by Sledgehammer Games, is the next title following Black Ops - Cold War. Unlike Cold War, Vanguard runs on a modified engine used for Modern Warfare 2019. As we played through the recent Vanguard beta, we couldn't help but notice the major similarities, and important differences, between Vanguard and Modern Warfare. \n\nIn this video, we’re going to take a look at the Vanguard Beta from a Modern Warfare perspective and analyze how, in some cases, Vanguard feels like a reskinned version of 2019's title. For many fans, Modern Warfare took the COD franchise in a completely new direction, with its porous open maps, tactically inspired weapon handling, and heavy gun customization. Modern Warfare also introduced the now free-to-play battle royale game Warzone. Vanguard appears to expand on Modern Warfare's Gunsmith menu and adds some new features like limited environmental destruction, movable objectives, a reworked minimap, and the ability to choose the \"combat pacing\" which varies the number of players and the kinds of matches you play with others. However, Vanguard takes steps back toward classic Call of Duty map design with smaller three-lane layouts, easier-to-handle weapons, and familiar killstreaks. \n\nWe don’t know much yet about the new Warzone map coming with the launch of Vanguard, but we do know the transition between multiplayer and battle royale will be much smoother than in past series entries, with Vanguard sporting many of the same mechanics as Modern Warfare. Call Of Duty: Vanguard is set to launch on November 5, now two weeks before the delayed Battlefield 2042.\n\n#cod #callofduty #codvanguard", "link": "https://www.youtube.com/watch?v=7gFCxiQV_K8", "date_published": "2021-09-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Infinite Technical Preview Round Two Livestream", "description": "Join Persia for the second round of the Halo Infinite Multiplayer Technical Preview. This weekend features 4v4 Arena matches.\n\n#halo #haloinfinite", "link": "https://www.youtube.com/watch?v=ivbp-F-Eez4", "date_published": "2021-09-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "N64 & Sega Genesis Games Coming To Nintendo Switch Online | GameSpot News", "description": "Nintendo’s September Direct features the . Halo Infinite’s multiplayer beta was almost delayed due to \"late-breaking issues\".  And Respawn hints at a if there could be a new Titanfall in the future. \n\nIn this video, DeVante goes over the highlights from Nintendo September Direct. Some key moments include: the announcement of N64 and Sega Genesis games coming to Nintendo Switch Online, Bayonetta 3 gameplay, a new Kirby game and the reveal of the Mario movie cast. \n\nLater, DeVante explains how Halo Infinite’s multiplayer beta was almost delayed due to \"late-breaking issues\" and how Titanfall may have a future with Respawn.\n\n#n64segagenesis #segagenesis", "link": "https://www.youtube.com/watch?v=60_BN7YIgC0", "date_published": "2021-09-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "11 Things To Know Before Playing Diablo 2: Resurrected", "description": "Diablo 2 is back with Diablo 2: Resurrected! While the Remaster isn’t all that different from the original game - with its primary differences being a visual overhaul and quality-of-life improvements - it still does contain some mechanics that can be worth discussing for new players and even veteran Diablo 3 players. So here are 11 tips you should know before playing Diablo 2: Resurrected!\n\nFor the latest on what’s happening at Activision Blizzard with regard to the ongoing legal action taken by the California Department of Fair Employment and Housing, take a look at our timeline of events: https://www.gamespot.com/articles/activision-blizzard-lawsuits-and-investigations-timeline-of-events/1100-6494785/ \n\nTimestamps\nStarter Class - 0:30\nSkill Tree - 1:39\nStamina - 2:30\nDeath - 3:01\nPrioritize Targets - 4:03\nTomes of Town Portal + Identification - 4:31\nKnow your Loot - 5:19\nThe Grind  - 6:07\nMercenaries - 6:44\nSocketed Items - 7:27\nHoradric Cube - 8:40\n\n#diablo #diablo2", "link": "https://www.youtube.com/watch?v=OzxAXC6eHDg", "date_published": "2021-09-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Bayonetta 3 Gameplay Trailer | Nintendo Direct September 2021", "description": "Bayonetta is back, with a brand new trailer of Bayonetta beating up on a giant Kaiju. In this trailer, we see Bayonetta 3's action gameplay as she dodges and utilizes Witch Time to rack up major combos on her enemies.  Bayonetta 3 releases sometime in 2022.\n\n#bayonetta3 #nintendodirect2021", "link": "https://www.youtube.com/watch?v=XPU7HOmU8uU", "date_published": "2021-09-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Death Stranding Director’s Cut - PS4 Pro vs PS5 Graphics Comparison", "description": "See the difference between the PS4 Pro and PS5 versions of Death Stranding.\n\n#deathstranding", "link": "https://www.youtube.com/watch?v=KdoHcdptMlg", "date_published": "2021-09-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Diablo 2 Resurrection Launch Day Livestream", "description": "Diablo II Resurrection has finally arrived, so we head in to check out some of the things that the alpha and betas didn't have including the Assassin Class and possibly the Necromancer. We also explore the Jungles of Kurast, fight through hell, and make our way to the Worldstone Keep to find and destroy Baal. We might even head into the secret cow level.\n\nCome join us as we try to find the best loot, level up, and chat.\n\n#diablo2", "link": "https://www.youtube.com/watch?v=68Bera_1ZUI", "date_published": "2021-09-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Diablo 2 vs Diablo 2 Resurrected All Cinematics Side by Side Comparison", "description": "With Diablo II: Resurrected, Blizzard is giving the original action RPG a major overhaul with new visuals and music, offering a more definitive take on the dark-fantasy adventure. With the game releasing we take a look at every Act's cinematics, and we figured it's worth comparing them to the original. Here's a side-by-side look at how the new 2021 cutscenes stack up to the cutscenes from the year 2000. \n\nPlayers will be able to get their hands on Diablo II: Resurrected beginning on September 23rd at 8am PT on PC, PS4, PS5 Xbox One, Xbox Series X, and Nintendo Switch. \n\nTimestamp\nIntro Cinematic 0:00\nAct 2 Intro Cinematic - Desert Journey 06:55 \nAct 3 Intro Cinematic - Mephisto's Jungle 10:05 \nAct 4 Intro Cinematic - Enter Hell 14:26 \nEpilogue - Terrors End 17:57 \nAct 5 Intro Cinematic - Search for Baal 21:00 \nAct 5 End Cinematic - Destruction's End 25:00 \n\n#diabloII #diablo2", "link": "https://www.youtube.com/watch?v=P_cKbNNhYkA", "date_published": "2021-09-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Kirby and the Forgotten Land Trailer | Nintendo Direct September 2021", "description": "Kirby is finally back with a brand new game of his own, Kirby and the Forgotten Land. Kirby and the Forgotten Land is a 3D platform aciton game set in dystopian world with overgrown vegetation, that's overrun with all kinds of animals. Kirby and the Forgotten Land releases Spring 2022.\n\n#nintendodirect #kirbyandtheforgottenland #forgottenland", "link": "https://www.youtube.com/watch?v=Auzjb2iz3Xw", "date_published": "2021-09-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Metroid Dread Launch Trailer | Nintendo Direct September 2021", "description": "Metroid Dread gets an all new trailer, showing off new abilities, and menacing foes. Additionally, the trailer gives a glimpse of its many environments, its biomes, and distinct creatures. The game is expected to launch October 8.\n\n#nintendodirect #metroiddread", "link": "https://www.youtube.com/watch?v=PUXZyqhrWoc", "date_published": "2021-09-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Monster Hunter Rise: Sunbreak Teaser | Nintendo Direct September 2021", "description": "Monster Hunter Rise returns to the Nintendo Switch with a major update, Monster Hunter Rise: Sunbreak. Sunbreak is a massive update, and will bring new monsters and quests, with a paid DLC that releases Summer 2022.\n\n#nintendodirect #monsterhunterrise", "link": "https://www.youtube.com/watch?v=hGX23r7JnsU", "date_published": "2021-09-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Nintendo Direct Full Showcase September 2021", "description": "Bayonetta 3, Splatoon3, and Metroid Dread. Nintendo released a slew of updates and trailers on many of their anticipated title in September's Nintendo Direct. Classics were announced to be coming to the Nintendo Switch console, including N64 and Sega Genesis emulation, along with remasters of classics like the Castlevania Advance series as well as Actraiser. Meanwhile, Nintendo released a trailer showcasing a brand new game for Kirby. Smash Brothers and Animal Crossing will have news this upcoming October.\n\n#nintendodirect2021", "link": "https://www.youtube.com/watch?v=k_fq60rPNMU", "date_published": "2021-09-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Nintendo Direct Livestream (9.23.21)", "description": "Check out the Nintendo Direct on September 23rd, at 3pm PT to learn more about the winter line up and more coming to Nintendo Switch. We hope to see more on Metroid Dread, Advance Wars, Pokémon, Shin Megami Tensei V, Mario Party Superstars, Zelda, and more. This Nintendo Direct is sure to be packed with the latest updates and what you can expect to come out this holiday season for Nintendo Switch. \n\n#nintendo #nintendodirect #nintendoswitch", "link": "https://www.youtube.com/watch?v=5sS-CTqxKqo", "date_published": "2021-09-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Nintendo Direct September 2021: What To Expect | GameSpot News", "description": "A September Nintendo Direct is announced for September 23, 2021. Beta codes for Battlefield 2042’s beta have been released early according to people with Amazon preorders. A new PS4 update can save the console from CMOS battery issues. And Xbox releases an update to allow the use of Xbox 360 avatars on current hardware. \n\nIn this video, DeVante breaks down what you can expect from September 23’s Nintendo Direct, which airs at 3 PM PT / 6 PM ET. The event will feature about 40 minutes of new information that focuses mainly on Switch games launching this winter.\n\nBeta codes for the Battlefield 2024 beta have been released to holders of Amazon preorders despite no official announcement of the beta’s new date. \n\nLater in the video, DeVante talks about the PS4’s latest update that saves the console from future CMOS battery issues and Xbox updates its newer consoles to allow the use of Xbox 360 avatars\n\n#nintendo #nintendodirect", "link": "https://www.youtube.com/watch?v=E74LXtYeyAY", "date_published": "2021-09-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Nintendo Switch Online Update | Nintendo Direct September 2021", "description": "A new membership plan is being added to Nintendo Switch Online. This new membership will include an N64 collection, similar to what we saw with the NES & SNES. Additionally, a Sega Genesis collection will be added as well. Wireless N64 and Sega Genesis controllers will also be available for purchase. The new membership plan lanches later October 2021, and but no pricing has been announced.\n\n#nintendodirect2021 #switchonline", "link": "https://www.youtube.com/watch?v=FBqPXd3ZW8M", "date_published": "2021-09-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Splatoon 3 Trailer | Nintendo Direct September 2021", "description": "Splatoon 3 brings all new abilities, weapons, and an expansive campaign mode. The trailer gives a glimpse on its over-stylized world, signature erratic soundtrack, and an icy look at the campaign to come. The game is expected to launch in 2022.\n\n#splatoon3 #nintendodirect2021", "link": "https://www.youtube.com/watch?v=hsAMgShwbko", "date_published": "2021-09-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]