[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "Easy Anti Cheat WORKS on LINUX - Epic's Epic Announcement", "description": "Download Safing's Portmaster for FREE and take control of your network traffic: https://safing.io/portmaster\n\n\n\nGet your Linux desktop or laptop here: https://slimbook.es/en/\n\n\nEpic Games has officially announced that their Easy Anti Cheat system will be coming to Linux. There are a few caveats though, so let's see how that's going to work.\n\n#linuxgaming #epicgames #anticheatonlinux\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nJoin us on our new Discord server: https://discord.gg/xK7ukavWmQ\nTwitter : http://twitter.com/thelinuxEXP\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\nFollow me on ODYSEE: https://odysee.com/@TheLinuxExperiment:e\nOr join ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\n00:00 Intro\n\n01:24 The Anti-cheat problem\n03:01 Valve to the rescue\n04:51 Epic's Announcement\n07:36 Thoughts\n\n\n## Easy Anti Cheat\n\nSo, if you're a gamer, you know that Linux gaming has come a long way, but that it's still hamstrung for a lot of online games by the lack of support for certain anti-cheat systems. While a lot of them actually offer a Linux version of their tools, like Easy Anti Cheat, or EAC, or even BattleEye, these only work if the game itself has been built for Linux.\n\nThis means that ultra popular games, like Fortnite or Apex legends just couldn't work under Linux, even though Wine and Proton have been able to run them for a while.\n\nThis has  been a thorn in the side of plenty of Linux gamers, as a lot of online multiplayer games tend to use EAC.\n\n## Valve to the rescue\n\nNow, fortunately, we have a strong ally in the form of Valve. While they're responsible for bringing us Proton, and integrating it really well inside of Steam, they've also been working with Epic Games and other anti-cheat system providers to bring this stuff to Linux.\n\nIt's been an uphill battle, as Proton has been available since August 2018, more than 3 years ago, and we had NOT been able to make anti cheat systems work since then.\n\nGOL Announcement: https://www.gamingonlinux.com/articles/valve-officially-confirm-a-new-version-of-steam-play-which-includes-a-modified-version-of-wine.12400\n\n\nValve has, however, been working on the steam deck, their own handheld PC, \n\nAnd this has much more mass market appeal than a regular Linux PC with steam running on it.\n\nThis company can sell stuff, and the Steam Deck might very well be a huge success. Unofficial numbers indicate that there were at least 110 000 preorders, not counting the cheaper model in the first day: https://www.thegamer.com/steam-deck-preorder-numbers/\n\nIt means that Valve has a strong position to try and bring stuff to their platform. And since their platform is based on linux.\n\n## The results are there\n\nIt could have been a kernel-level anti-cheat, in the form of a proprietary module. It could have been licensed exclusively to SteamOS, and locked out all other distributions to ensure a controlled environment.\n\nThankfully, in the case of EAC, it seems it won't be the case: Epic has published a statement announcing:\n\"To make it easy for developers to ship their games across PC platforms, support for the Wine and Proton compatibility layers on Linux is included. Starting with the latest SDK release, developers can activate anti-cheat support for Linux via Wine or Proton with just a few clicks in the Epic Online Services Developer Portal.\"\n\nSo, it seems that the support for EAC won't require a kernel module, or even anything specific to install: it seems the support for Proton, will be enabled at the SDK level, and as such will ship with every game.\n\nNow, there's still an issue here: developers have to ENABLE that support, it's not enabled out of the box. This means that all games won't magically be open to be played on Linux. These game studios will have to either willingly accept players using Proton, or be strong armed by the community into doing it.\n\nWhat's certain is that with this available, I'd be surprised if BattleEye, the other major anti cheat provider that doesn't support Proton, decided not to support Linux as well", "link": "https://www.youtube.com/watch?v=aZ9SKS4tAvw", "date_published": "2021-09-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]