[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Desks Of The 2021 Tiny Desk Contest", "description": "The first rule of the Tiny Desk Contest: Each entry video must include a desk. If they didn’t, how would we know the artists are ready to perform behind Bob Boilen's Tiny Desk? Here are some of the many notable desks from the 2021 Tiny Desk Contest — the tiny, the huge and the in-between — in one celebratory video. \n\nWatch all the entries and learn more about the Tiny Desk Contest: https://npr.org/tinydeskcontest. \n\nSong: \"Love Me\" by Los Wizzards\n\n#tinydesk #tinydeskcontest", "link": "https://www.youtube.com/watch?v=D7bUdMDK310", "date_published": "2021-06-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Joseph Keckler: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nMarissa Lorusso | June 14, 2021\n\"My love called me many names,\" Joseph Keckler sings in \"GPS Song,\" which opens his Tiny Desk (home) concert. He proceeds to list them: \"Baby animal. Little baby animal. Big baby animal. Black chicken.\" (It goes on like this for some time.)\n\n\"GPS Song\" — which is sung partly in a made-up language and evolves to feature the titular navigation system droning in the background of a breakup — is one of Keckler's hallmark absurdist arias, which he performs with a commanding presence and a winking, deadpan delivery. While their content is quirky (another features the narrator's relapse into a teenage goth identity), it's not quite right to call them strictly funny; they're infused with a kind of intimate, observational detail that makes them simultaneously comedic and affecting. (\"It was the most heartbreaking moment of my life,\" Keckler once said of the situation that inspired \"GPS Song,\" \"yet it was also so ridiculous to have this disrupting automaton, breaking our silence to misdirect us at every moment.\" This performance captures that ridiculousness and heartbreak equally.)\n\nA classically trained singer, performance artist and writer whose work spans styles and genres, Keckler turns his Tiny Desk (home) concert, shot in Brooklyn, into a showcase of his dynamism as a performer. Here, he also performs two other original songs — \"City\" and \"Appearances\" — that, while less absurd, are no less striking, displaying the incredible range and expressiveness of his powerful voice.\n\nSET LIST\n\"GPS Song\"\n\"City\"\n\"Goth Song\"\n\"Appearances\"\n\nMUSICIANS\nJoseph Keckler: vocals, piano\nMichael Hanf: guitar, synth, percussion\nLavinia Pavlish: violin\nMatthew Dean Marsh: piano, vocals\n\nCREDITS\nVideo: M. Sharkey, Mitch Blummer, Ghitta Larsen, Stephen Lehman, Lee Eaton\nAudio: Will Tendy\n\nTINY DESK TEAM\nProducer: Marissa Lorusso\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Bob Boilen, Kara Frame, Gabrielle Pierre\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #josephkeckler", "link": "https://www.youtube.com/watch?v=HObS9FWpTNI", "date_published": "2021-06-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]