[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCAKcSON6PSG_JkTbXh2WdIg", "title": "Ásgeir - two performances for The Current (2014, 2017)", "description": "Seven years ago today — on June 14, 2014 — Ásgeir performed in The Current studio. The Icelandic artist, whose full name is Ásgeir Trausti Einarsson, olds the record for the highest-charting debut album in Icelandic history, where 1 in 10 people own a copy. He's been called the Icelandic Jeff Buckley, the Icelandic Bon Iver, yet the easygoing singer-songwriter remains bemused by all the accolades. While he was on tour in support of his album \"In the Silence\" in 2014, Ásgeir and his band visited The Current studio for a session hosted by Bill DeVille.\n\nWe reconnected with Ásgeir three years later, at Iceland Airwaves 2017, when he visited the Götubarinn pub in Akureyri, the second city of the Iceland Airwaves Music Festival, where Mark Wheat welcomed him for a live session. The second song you'll see above, \"Stardust,\" an original by Ásgeir, comes from that performance.\n\nSONGS PERFORMED\n0:00 \"King and Cross\" (2014)\n3:32 \"Stardust\" (2017)\n\nCREDITS\nVideo & Photo: Leah Garaas; Nate Ryan\nAudio: Michael DeMark; Wesley Berger; Erik Stromstad\nProduction: Derrick Stevens; Jim McGuinn\n\nFIND MORE:\n2014 studio session: https://www.thecurrent.org/feature/2014/06/14/asgeir-performs-in-the-current-studios\n2017 Iceland Airwaves session: https://www.thecurrent.org/feature/2017/11/03/watch-asgeir-performing-at-iceland-airwaves\n2018 Iceland Airwaves session:\nhttps://www.thecurrent.org/feature/2018/11/09/asgeir-performs-two-new-songs-at-iceland-airwaves\n\nSubscribe to our channel:\nhttp://www.youtube.com/user/893TheCurrent?sub_confirmation=1\nLike/Follow:\nhttps://www.facebook.com/TheCurrent/\nhttps://twitter.com/TheCurrent\nhttps://www.instagram.com/thecurrent/\n\n#asgeir #thecurrent #iceland", "link": "https://www.youtube.com/watch?v=_tyAfA7xtBo", "date_published": "2021-06-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCAKcSON6PSG_JkTbXh2WdIg", "title": "Answer to Looch for June 14, 2021: What newsworthy musical event took place the year you were born?", "description": "This week, Mary Lucia asked, \"What newsworthy musical event took place the year you were born?\" and you responded with great enthusiasm. Listen to Mary Lucia as she read your responses on the air just after 5 p.m. CDT on Monday, June 14, 2021.\n\nYOUR ANSWERS:\nPat on Twitter:\nSun Records was founded, the NME published the first U.K. singles chart.  (1952)\n\nCraig on Facebook:\nEddie Van Halen was born! (1955)\n\nBrian on Facebook:\nI was born in the year when the music died, 1959. On February 3, 1959,Buddy Holly, Ritchie Valens and The Big Bopper aka J.P.Richardson died in a plane crash near Clear Lake, Iowa.\n\nDon on Twitter:\nSadly, Buddy Holly died the year I was born, 1959. \n\nMN Geller on Twitter:\nThe Shadows released Apache (1960)\n\nMarion on Twitter:\nFrank Sinatra formed Reprise Records. Mick Jagger and Keith Richards met at a London train station. The Beach Boys and the Zombies became bands. On a tragic note, Bob Seger also started his career. (1960)\n\nGlasses Braces Dorko on Twitter:\nThe Beatles receive MBE medals from Queen Elizabeth, and Sonny & Cher have their first No. 1 hit, \"I Got You Babe\" (1965)\n\nLiz on Twitter:\nBob Dylan was booed at the Newport Folk Festival for using an electric guitar. He made a quick decision to play electric and the fans wanted folk. (1965)\n\nRick on Facebook:\n1966 was a monumental year for music on television, with the premieres of Batman, Star Trek, and The Monkees bringing in three of the most iconic TV theme songs of all time, along with one of the first boy bands ever created. In addition, it was the year that Dr. Seuss's \"How The Grinch Stole Christmas\" first aired, which gave us Thurl Ravenscroft singing \"You're a Mean One, Mr. Grinch.\"\n\nL.K. on Twitter:\nJim Morrison was arrested onstage in Connecticut for \"disturbing the peace\"; also, the Monterey Pop Festival took place, marking the start of the Summer of Love.  (1967)\n\nJimmy on Twitter:\n1968: David Gilmour joins Pink Floyd. There were no big festivals like Woodstock a year later, but Gilmour joining Pink Floyd is kind of a big deal.\n\nBrian on Facebook:\nTwo weeks after I was born, The Beatles started recording “The White Album,” and released it later that year. About a month after that was Elvis’s televised “Comeback Special.” (1968)\n\nSean on Facebook:\nJohnny Cash: Live At Folsom Prison was recorded (1968)\n\nBrent on Facebook:\n1969: So, obviously Woodstock, and also the Altamont Free Concert later that year\n\nDan on Twitter:\nJim Morrison died five weeks after I was born. (1971)\n\nDaniel on Facebook:\n1973 - The Who released Quadrophenia.\n\nSheryl on Facebook:\nCBGB opened! (1973)\n\nAmy on Facebook:\nApparently 1974 was considered the worst year of music. John Denver had the No. 1 album, Kiss debuted their first album. Meh...\n\nJay on Twitter:\nCaptain & Tennille became omnipresent on the radio dial, pledging that love would keep them together. (1975)\n\nJD on Twitter:\nFeedback, which would become U2, was formed a few weeks after I was born. (1976)\n\nRenae on Facebook:\nI was born in 1979, the year Disco died.\n\nHeidi on Facebook:\nThe Chicago White Sox hosted \"Disco Demolition Night\" at Comiskey Park. Sponsored by a local radio station, the event invited fans to bring their disco records to the stadium so that they could be destroyed in a ceremony between the games of a doubleheader. When the crate of records was blown up between games, fans began throwing records onto the field like Frisbees, and several thousand people charged onto the field, leaving it in such bad shape that the White Sox were forced to forfeit the second game of the doubleheader. (1979)\n\nSarah on Facebook:\n1979: Pink Floyd premiered their live version of \"The Wall,\" The Cure released their debut album \"Three Imaginary Boys\", and of course The Knack released their catchy tune \"My Sharona.\" And then there was the epic Sid Vicious: his arrest for murder and his overdose death.\n\nJust Josh on Twitter:\nJohn Lennon was shot and killed in December 1980. I'm glad that I was able to share the earth with him for a few months at least.\n\nJeremy on Twitter:\nAll born in the same year as me: Beyoncé, Justin Timberlake, Britney Spears, Alicia Keys, Pitbull, Johnny Lang, Brandi Carlile, Josh Groban, Jennifer Hudson, Natasha Bedingfield, Christina Milian, Amy Lee, Kelly Rowland, Brandon Flowers of the Killers, Keyshia Cole — all born in 1981.\n\nJill on Twitter:\nOzzie Osbourne bit the head off a bat! (1982)\n\nMaggie on Twitter:\nPrince canceled the original release of The Black Album (1987)\n\nElliott on Facebook:\n1991: Birth of Lollapalooza and death of Freddie Mercury — not exactly a fair trade.\n\n\nSubscribe to our channel:\nhttp://www.youtube.com/user/893TheCurrent?sub_confirmation=1\nLike/Follow:\nhttps://www.facebook.com/TheCurrent/\nhttps://twitter.com/TheCurrent\nhttps://www.instagram.com/thecurrent/\n\n#answertolooch #musichistory #marylucia", "link": "https://www.youtube.com/watch?v=7-1WENynzcI", "date_published": "2021-06-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]