[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UChnxLLvzviaR5NeKOevB8iQ", "title": "Ned Rush RMR Jeremy Blake Set Music Stuff Ok", "description": "A set for Ned Rush's \"More Kicks Than Friends\". Watch the stream here: https://youtu.be/rP4oFbIXNZA\nSubscribe to Ned Rush for awesome music tutorials: https://www.youtube.com/c/NedRush/featured\n\nHere are the patch notes: \n\nSynthstrom Deluge is the main clock and is doing all drums and samples. It's also sending chord midi to the Voicelive 3 vocal pedal underneath it so I can get harmonies and autotune. The Voicelive is being used to process my voice and to add reverb and delay when I want it.\n\nThe Deluge is sending an analog clock to Pamela's New Workout in the modular system and a midi clock to Hermod and Octatrack. \n\nThe Octatrack gets a feed of the modular system and the Voicelive. It passes them through using a Thru machine and adds a bit of compression and sidechain via an Octatrack LFO. It is set to record from the two Thru Machines into two Flex machines, which are chopped and remixed live by the Octatrack. \n\nEach pattern on the Octatrack has audio triggers for the Flex machines slicing and remixing, and MIDI events on the first 4 MIDI tracks. These MIDI tracks are sent to the Squarp Hermod which translates them to gates and sends them out as my note-on events in the modular system.\n\nThe modular voices are the Noise Engineering Manis Iteritas, Qu-Bit Surface, Mutable Instruments Braids. Each one is running through an effect: Tip Top z-5000 for Manis, Mutable Instruments Blades + Make Noise Mimeophone for Surface, and Qu-Bit Data Bender + Happy Nerding FX Aid for Braids. \n\nThe DROID system is providing pitches using a mini-Sinfonion app designed by Mattias Kettner. \n\nFinally, modulation is provided by an Abstract Data ADE-32 Octacontroller into a 4MD Quad Atten, which is fed to Manis and Braids. \n\nThis system gives me an incredible amount of flexibility to perform in a variety of styles.\n\nFind these modules at Perfect Circuit: \n\nAbstract Devices ADE-32:  https://bit.ly/3zhnGFl\nALM Pamela's New Workout:  https://bit.ly/2QRxnZO\nHappy Nerding FX Aid XL:  http://www.happynerding.com/category/fx-aid/\nIntellijel Quad VCA:  http://bit.ly/pc_quadvca\nMake Noise Mimeophon:  https://bit.ly/3yYFyW5\nMutable Instrument Blades:  https://bit.ly/3xw9nMT\nMutable Instruments Braids:  https://bit.ly/3sLwL5o\nNoise Engineering Manis Iteritas:  https://bit.ly/3rMioz0\nQu-Bit Data Bender:  http://bit.ly/pc_data_bender\nQu-Bit Surface:  http://bit.ly/pc_surface\nSquarp Hermod:  http://bit.ly/pc_hermod\nTip-Top Z5000:  http://bit.ly/pc_z5000\n------------------------------------\nPatreon:  http://bit.ly/rmrpatreon\n\nMy Music: \nBandcamp: http://bit.ly/2Kq617o\nSoundcloud: http://bit.ly/2NOH9Is\nSpotify: https://spoti.fi/2N40SoX\nGoogle Play: http://bit.ly/33M9aG5\niTunes: https://apple.co/2pqh3SK\nAmazon Music: https://amzn.to/2O9q1fe\n\nMerch: http://bit.ly/rmrshirts\n\nConnect:\nTwitter: http://bit.ly/rmrtwitters\nWebsite: http://bit.ly/rmrmedia", "link": "https://www.youtube.com/watch?v=Ogsr8nSsLV0", "date_published": "2021-09-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]