[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Diamante Eléctrico: Tiny Desk (Home) Concert", "description": "From Sept. 15 through Oct. 15, Tiny Desk is celebrating Hispanic Heritage Month with an \"El Tiny\" takeover of the (home) concert series, featuring J Balvin, Camila Cabello and several more musicians from all corners of Latinidad. \n\nReanna Cruz | September 17, 2021\nSix hands, holding pencils as drumsticks, tap out a simple percussive beat on a Wurlitzer and two desks. Zooming out, the camera reveals the members of Diamante Eléctrico, accompanied by a colorful 10-piece backing ensemble in their home country's capital, Bogotá.\n\nDiamante Eléctrico's brand of Colombian indie rock can be described in three words: funky, inventive and necessary. The Latin Grammy-winning band's music emphasizes community and place — two things that are displayed front and center as the band takes the stage in the second \"El Tiny\" performance of Hispanic Heritage Month.\n\n\"NO MIEDO!!!\" (no fear) and \"VERDAD\" (truth) adorn the worn-down desks as the collective powers through a politically-charged four-song set. Opening with 2018's \"Rotos,\" they breathe champeta life into their songs through horns and instruments like the guacharaca, played by singer Juan Galeano's brother Mario. They follow with \"Suéltame Bogotá,\" an upbeat plea to escape a suffocating home, and feature a spirited guest performance by Nicolai Fella of LosPetitFellas. \"Amalia\" leads into a genuine expression of thanks and solidarity, as Galeano gives gratitude to those protesting on \"primeras línea y segunda línea,\" shouting out the students and farmers challenging the government before finishing the set with \"A Veces.\"\n\nIt's why Diamante Eléctrico has made themselves so crucial, not only in the Latin indie rock scene, but in music at large: the band's tether to its home country is substantial, no matter how fraught it may seem. Through both its music and stage presence, Diamante Eléctrico curates a shared sense of Latin roots and family, expanding outward from its home of Colombia and resonating across Latinidad, from Puerto Rico to Panama.\n\nSET LIST\n\"Rotos\"\n\"Suéltame, Bogotá\"\n\"Amalia\"\n\"A Veces\"\n\nMUSICIANS\nJuan Galeano: vocals\nDaniel Álvarez Mejía: guitar, vocals\nAndrés Kenguan: wurlitzer\nMario Galeano: loops, guacharaca, delay, cymbals\nMarco Fajardo: saxophone\nSebastián Rozo [EufoX]: euphonium\nDaniel Rincón Ucros: tuba, sousaphone\nJorge \"El León\" Pardo: trumpet\nPedro Ojeda: percussion\nRoberta Leono: tambor alegre\nAlejandro Cifuentes: bombo\nLafer Angova: vocals\nKaren Castiblanco: vocals\nNicolai Fella: vocals\n\nCREDITS\nVideo: Andrés Kenguan, Santiago Cortés, Gustavo Martínez\nAudio: Juan Galeano, Mario Galeano\nArrangements: Mario Galeano\nGeneral Production: Ximena Vargas Rocha\nAudio Capture: Pablo Mateus, Fredy Ardila\nCameras: Sebastián Chocontá, Nicolás Melo, Camilo Báez, Felipe Ramírez\nGaffer: Victor Serje\nDirector of Photography: Santiago Cortés, Gustavo Martínez\nArt Direction: Pigmento Arte, Nathalie Bayona, Carolina Cardona\nProduction Manager: Carla Vásquez\nColor: Jorge Román Herrera - Crayola Films\nManagement: Criteria Entertainment, M3 Music\n\nTINY DESK TEAM\nProducer: Anamaria Sayre\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nAlt.Latino 'El Tiny' Team: Felix Contreras, Reanna Cruz, Anaïs Laurent, Stefanie Fernandez\nTiny Production Team: Bob Boilen, Bobby Carter, Kara Frame, Sofie Hernandez-Simeonidis\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #eltiny #diamanteelectrico", "link": "https://www.youtube.com/watch?v=4J5zTLnIqMY", "date_published": "2021-09-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Meet NPR Music's 2021 Tiny Desk Contest Winner", "description": "On Friday, Sept. 17, NPR Music's Bob Boilen interviewed the winner of the 2021 Tiny Desk Contest: Neffy!  \n\nNeffy is a singer-songwriter from Arlington, Va., with a stunning, singular voice whose songs combine influences from folk, soul and R&B. Her entry video for “Wait Up,” which reflects on the healing power of nature, is a testament to her honest, emotional songwriting. Since teaching herself guitar as a teenager, Neffy has played hundreds of shows in New York and Washington, D.C., and says she considers live performances as the best part of her creative process.\n\nHer winning song, \"Wait Up,\" was chosen by a panel of judges out of thousands of entries from across the country.\n\nLearn more about the Tiny Desk Contest: https://npr.org/tinydeskcontest.\n\n#tinydesk #tinydeskcontest", "link": "https://www.youtube.com/watch?v=RNJYRN5UNZY", "date_published": "2021-09-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]