[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCmFeOdJI3IXgTBDzqBLD8qg", "title": "Stop Watching TikTok's Cringe Videos Because TikTok Is Destroying Society", "description": "Tiktok is the worst app to have ever been created and it's made Tiktok a lot of money\n\nTiktok culture is breeding a new age of Tiktok cringe. However Tiktok isn't just cringe, Tiktok is ruining society. Tiktoker's such as Charli D'Amelio and Bella Poarch are promoted because the Titok algorithm rewards hedonism. However, Tikok's design is also ruining generation z's attention span and destroying their short-term memory. But as Tiktok culture distracts you with Tiktok' cringe videos, you'll be to consumed to read Tiktok's privacy page which admits to sending all your data back to China's government, too notice. This is why Tiktok is cancer. Tiktok is a psychological weapon and we have to stop watching Tiktok videos/memes.Because Tiktok is destroying education. This video details how tiktok makes money. \n\n\nVIDEO INSPIRED BY PAUL JOSEPH WATSON\n\n ******\n►  Become a Patron:  https://www.patreon.com/MoonReal\n\n📹𝗠𝘆 𝗘𝗾𝘂𝗶𝗽𝗺𝗲𝗻𝘁:\n► Microphone: https://www.amazon.co.uk/gp/product/B07DV2WK77/ref=as_li_tl?ie=UTF8&camp=1634&creative=6738&creativeASIN=B07DV2WK77&linkCode=as2&tag=moonreal-21&linkId=1e984828cb3122716d17530c662a0776\n\n💊*Blackpill on China*\n►https://www.amazon.co.uk/gp/product/0099507374/ref=as_li_tl?ie=UTF8&camp=1634&creative=6738&creativeASIN=0099507374&linkCode=as2&tag=moonreal-21&linkId=296f051e6483a68d0d1fff2e5e074a86\n\n🎶 𝐌𝐮𝐬𝐢𝐜 𝐔𝐬𝐞𝐝:\n►Epidemic Sounds - https://www.epidemicsound.com/referral/w1vpsh/\n\n\n******\nAFFILIATE DISCLOSURE: there may be a few links in this description that, at no cost to you, will earn me a commission if you choose to click them and make a purchase. I only ever promote things that have genuinely helped me.\n\nThank you for watching!\n\n\nDonate here: https://www.patreon.com/MoonReal", "link": "https://www.youtube.com/watch?v=iLt-ymXNf-w", "date_published": "2021-04-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]