[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Butcher Brown: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nNikki Birch | April 21, 2021\nButcher Brown takes to a restaurant's rooftop terrace in the band's hometown of Richmond, Va., for a home concert and sizzles from the first note. The band opens with \"Sticky July,\" a tune every bit as catchy as its name implies; think rollerskating with a popsicle under a cloudless sky of blue. When you think you've figured it out, keyboardist DJ Harrison switches it up, launching into a solo so funky you wonder if it's a new song, that is until Marcus \"Tennishu\" Tenney brings us back home with some sweet trumpet.\n\nThat's the thing about Butcher Brown: are they playing jazz ... or funk ... or soul? They scoff at the limitations of adjacent genres with the expertise of master musicians who've played together so long that they flow from one vibe to the next without missing a beat. This is clear as they slide into \"Camden Square,\" but not before Tennishu introduces the band, thanks their parents, and shouts out Ann Paciulli, who provided the old-school desk seen in the video. Viewers of a certain vintage may recall interminable afternoons spent sitting in a tiny desk just like that one. Fortunately, boredom is the last thing that happens when Butcher Brown hits. \"#KingButch\" is next, a stank-face hip-hop head-bobber that once again proves they can do it all. (And yes, not only does Tennishu rap, he also plays sax and trumpet, which is no minor feat.) They close with \"Tidal Wave\": smooth, delightful, classic.\n\nSET LIST\n\"Sticky July\"\n\"Camden Square\"\n\"#KingButch\"\n\"Tidal Wave\"\n\nMUSICIANS\nDJ Harrison: keys\nCorey Fonville: drums\nAndrew Jay Randazzo: bass\nTennishu: trumpet, saxophone, vocals\nMorgan Burrs: guitar\n\nCREDITS\nVideo: Joey Wharton, R. Anthony Harris, WhartonMajor\nAudio: Zach Fichter\nSpecial Thanks: Peter Cerrito, Pete LeBlanc and Jason Moore\n\nTINY DESK TEAM\nProducer: Nikki Birch\nVideo Producer: Kara Frame\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Maia Stern, Bob Boilen\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann\n\n#butcherbrown #tinydesk #nprmusic", "link": "https://www.youtube.com/watch?v=ZfqmSZ-6Cgo", "date_published": "2021-04-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "C. Tangana: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nAnamaria Sayre | April 20, 2021\nC. Tangana's extended family basking in the warmth of sobremesa with easy smiles and effortless baile looks otherworldly after more than 13 months amid a global pandemic. But considering the Spanish rapper's past year back home in Madrid, the simplicity feels fiercely authentic. (Check his mama and tía vibing in the corner.)\n\nThis first live performance of his latest album, El Madrileño (including a global premiere of a fresh single, \"Me Maten\") buzzes with communal energy, spotlighting talent from across Latin landscapes. From Mexican Regional to Spanish flamenco, C. Tangana is simultaneously coming home and reaching out to bridge Latin music boundaries. He's building a community of cross-cultural collaboration, rooted in a unifying love of language and tradition, making it clear he's intent on giving everyone a seat at the table.\n\nThe entirety of the show, from impromptu harmony to string octet, hums along with a distinctly Spanish cadence, paying homage to the flamenco-infused streets the global superstar came up in. The concert's star-studded cast of Spanish collaborators, including long-time friends (producers Alizzz and Victor Martínez) and new contributors (rumba legend Kiko Veneno and flamenco-pop icon La Húngara), are each spotlighted for their contributions to the record.\n\nAll these parts compound in a room full of people with a shared desire to connect and create juntos, manifesting an authentic joy we've seen again and again at the real Tiny Desk. And at the helm is C. Tangana, humming a melody and bringing the room to life: hands, harmonies, heartbeats, perfectly in sync.\n\nSET LIST\nC. Tangana and Antonio Carmona, \"Me Maten\"\nC. Tangana and Kiko Veneno, \"Los Tontos\"\nC. Tangana, \"Demasiadas Mujeres\" (contains replayed elements of “Campanera”)\nC. Tangana, La Húngara and Niño De Elche, \"Tú Me Dejaste De Querer\"\n\nMUSICIANS\nC. Tangana: vocals\nAlizzz: vocoder, keys\nVictor Martínez : guitar, percussion\nAntonio Carmona: vocals, percussion\nKiko Veneno: vocals, guitar\nLa Hungara: vocals\nNiño De Elche: vocals, guitar\nJuan Carmona: guitar\nHuberto Morales: percussion\nLucia Fernada Carmona: vocals\nPilar Cerezo: vocals\nMarina Carmona: vocals\nÁfrica Heredia: vocals\nMaría Rubio: vocals\nMariola Orellana: vocals\nPatri Alfaro: vocals\nMari Estrada: vocals\n\nSTRING OCTET\nPablo Quintanilla\nPaula Sanz\nFranciso Palazón\nMarina Arrufat\nPaloma Cueto-Felgueroso\nAdrián Vázquez\nIrma Bau\nDaniel Acebes\n\nCREDITS\nVideo: Little Spain, Santos Bacana, Maria Rubio, Cris Trenas\nAudio: Jorge Rodriguez, Sergio Jiménez, Pablo Kohler, Harto Rodriguez, El Madrileño, Alex Cappa\nDirector of Photography: Nauzet Gaspar\nArt Director: Mariola Viejo\nCostume Designer: Alex Turrión\nHair and Makeup: Miky Vallés\n1st AD: Joel Marquez\nEditor: Maia de Zan Hatch\nColor: Marti Somoza\nProduction Manager: Yago López Abril\nRecording Engineers: Jorge Rodriguez, Sergio Jiménez, Pablo Kohler\nMixed: Harto Rodriguez, El Madrileño at Metropol Studios\nMastering Engineer: Alex Cappa at Metropol Studios\n\nTINY DESK TEAM\nProducer: Bobby Carter\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nTiny Production Team: Kara Frame, Bob Boilen\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann\n\n#ctangana #tinydesk #nprmusic", "link": "https://www.youtube.com/watch?v=SW6L_lTrIFg", "date_published": "2021-04-20 00:00:00+00:00", "persistent": false, "user": "rumpel", "language": "en-US"}]