[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Silvana Estrada: Tiny Desk (Home) Concert", "description": "From Sept. 15 through Oct. 15, Tiny Desk is celebrating Hispanic Heritage Month with an \"El Tiny\" takeover of the (home) concert series, featuring J Balvin, Camila Cabello and several more musicians from all corners of Latinidad.\n\nAnamaria Sayre | September 27, 2021\nSilvana Estrada's angelic first note strikes, and for a moment her family's instrument workshop in Veracruz, Mexico, feels like a window to the heavens themselves.\n\nAdorned in a white dress and a radiant smile, the singer-songwriter and multi-instrumentalist invites us to participate in a rich and varied expression of familial love and musical brilliance. She wastes no time entrancing her audience, using a stripped-down performance of \"Un Día Cualquiera\" — accompanied by nothing but soft claps and subtle harmonies — to showcase her impeccable vocal precision and range.\n\nAfter a sweet \"Bienvenidos,\" Estrada picks up the Venezuelan cuatro — her most beloved magic-making tool — and jumps into a sublimely arranged, effortlessly enchanting rendition of \"Tristeza.\" Then, halfway through \"Te Guardo,\" something extraordinary happens: the sound of stringed instruments comes out of nowhere, and as Estrada steps away from her microphone, the camera follows, exposing a string quartet set up just off screen. After that moving reveal, Estrada takes a seat and begins to perform \"Marchita,\" where strings, cuatro, and voice marry in indiscernible harmony.\n\nShifting scenes once again, Estrada moves outside and we meet her papa, armed with a double bass. Father and daughter conjure a musical manifestation of pure love with a stunning performance of \"Tonada De Ordeño [El Ordeñador].\" Though the traditional Venezuelan tune is a longtime favorite, this performance is different. A butterfly takes a seat on Silvana's mic and the camera zooms out to reveal the other instrumentalists in the workshop looking on in knowing admiration. Silvana's voice reverberates across the Veracruz hillside and the world exhales, basking in a fleeting moment of divinity on earth.\n\nSET LIST\n\"Un día cualquiera\"\n\"Tristeza\"\n\"Te Guardo\"\n\"Marchita\"\n\"Tonada De Ordeño [El Ordeñador]\" written by Antonio Estévez\n\nMUSICIANS\nSilvana Estrada: vocals, cuatro venezolano\nGustavo Guerrero: vocals, percussion\nLaura Itandehui: vocals\nCristina Raquel Arista Estévez: cello\nCarlos Roberto Gandara García: violin\nLeonelys Sanchez Camacho: violin\nAnna Arnal Ferrer: viola\nDavid Estrada: vocals, double bass\n\nCREDITS\nVideo: Julio Llorente, Jorge Tirado\nAudio: Daniel Bitrán Arizpe, Leonel Carmona\nArrangements: Juanma Trujillo\nCamera: Nicolas Grill\nArt Direction: Jimena Estíbaliz, Laura Adan\nColor: Esteban Robles\nManagement: Edwin Erazo\n\nTINY DESK TEAM\nProducers: Anamaria Sayre, Bobby Carter\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nAlt.Latino 'El Tiny' Team: Felix Contreras, Reanna Cruz, Anaïs Laurent, Stefanie Fernandez\nTiny Production Team: Bob Boilen, Kara Frame, Sofie Hernandez-Simeonidis\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #eltiny #silvanaestrada", "link": "https://www.youtube.com/watch?v=S52_XxBwbJg", "date_published": "2021-09-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Natalia Lafourcade: Una Conversación Con Alt.Latino [ENG SUBS]", "description": "En Junio, Félix Contreras presentó una conversación especial en vivo con una de las cantantes más exitosas de América Latina: la cantautora mexicana Natalia Lafourcade. Juntos hablaron sobre el lanzamiento de su nuevo álbum Un Canto por México Vol. 2, la muy esperada secuela de Un Canto por México Vol. 1 — aclamado por la crítica y ganador de un Grammy el año pasado.\n\nIn June, Felix Contreras hosted a special live conversation with one of the most successful singers in Latin America: Mexican singer-songwriter Natalia Lafourcade. Together they discussed the release of her newest album Un Canto por México, Vol. 2, the much-anticipated sequel to last year's critically-acclaimed and Grammy award-winning Un Canto por México, Vol. 1.\n\n#altlatino #eltiny #natalialafourcade", "link": "https://www.youtube.com/watch?v=fhLyK0h06Og", "date_published": "2021-09-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]