[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 - Top 11 Things We Had To Test", "description": "Want to know if healing darts can kill, if you can drop a supply crate on an enemy, if Dozer’s shield can eat a rocket, or if there’s backblast in Battlefield 2042? Join us for the top things we had to test, some of it might surprise you.", "link": "https://www.youtube.com/watch?v=NLQf4IxKU7o", "date_published": "2021-11-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "13 Tips To Make You A Better Spartan In Halo Infinite's Multiplayer", "description": "Whether you're new to Halo or a returning veteran, there's plenty to learn in Halo Infinite's Multiplayer.\n\n00:00 - Intro\n00:35 - Enroll In The Academy\n01:48 - Keep An Eye Out For Weapon Racks\n02:41 - Use The Right Grenade For The Job\n04:13 - Seek Out And Use Equipment\n05:39 - Rely On Your AI Scanner\n06:21 - Ping To Help Your Team\n06:58 - Vehicles Will Help You Dominate\n08:03 - Use Lightning Guns To Take Down Vehicles\n09:20 - Grapple Everything\n10:19 - Stay Off The Radar\n11:32 - Stronghold Strategies\n12:50 - Start Capturing A Zone To Stop Opponents From Scoring\n14:05 - Mute In-Game Chat In The Settings Menu\n\n#HALO", "link": "https://www.youtube.com/watch?v=MopeVb4xmGU", "date_published": "2021-11-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "14 Things I Wish I Knew Before Starting Pokémon Brilliant Diamond & Shining Pearl", "description": "If you're picking up Pokémon's latest adventures, Brilliant Diamond and Shining Pearl, here are 14 essential tips to help you become the very best like no one ever was\n\nPokémon Brilliant Diamond & Shining Pearl are remakes of the Gen-4 Pokemon games, with some modern quality-of-life tweaks and enhancements. That means they're a unique mixture of new and old, so if you're an old-school Pokemon trainer or you cut your teeth on Sword and Shield, you may be surprised by some of the mechanics and conventions present in these remakes.\n\nPokemon Brilliant Diamond and Shining Pearl are available now on Nintendo Switch. The games are available separately as well as in a double pack. If you purchase the game before February 21, 2022 you can claim the Pokemon Platinum style outfit for your character as well as a Manaphy Egg through the Mystery Gift function. \n\nIf you’re looking for more Brilliant Diamond and Shining Pearl videos, we’ve got you covered here on GameSpot: \n\nReview-In-Progress: https://youtu.be/tsyXsJvjArM \nDS vs. Switch Graphics Comparison: https://youtu.be/ZQwOMVwRJws \nFirst 24 Minutes Of Shining Pearl Gameplay: https://youtu.be/8jAXbh-05kI", "link": "https://www.youtube.com/watch?v=5v2AJzD_Ok4", "date_published": "2021-11-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Battlefield 2042’s Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of Battlefield 2042, including the FN SCAR assault rifle, the PP-19 Bizon and a Marlin Model 1895.\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of Battlefield 2042 and compares them to their real-life counterparts.\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\nYou can subscribe to the Armax Journal that Jonathan Associate Edited here: https://www.armaxjournal.org/", "link": "https://www.youtube.com/watch?v=pYMGBstR_os", "date_published": "2021-11-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Grand Theft Auto: The Trilogy--Definitive Edition Review", "description": "Rockstar's remastered GTA trilogy is, appropriately, an absolute car wreck of creative neglect. Is the Grand Theft Auto: Definitive Edition an ideal way to experience the trilogy? Hell no. \n\nGrand Theft Auto: The Trilogy—Definitive Edition is now available on PC, PS5, PS4, Xbox One and Series X, and Switch. \n\nYou can read the full written GTA: The Trilogy review by Justin Clark on GameSpot. https://www.gamespot.com/reviews/grand-theft-auto-the-trilogy-definitive-edition-review-wasted/1900-6417791/", "link": "https://www.youtube.com/watch?v=Ul55KpKO7b8", "date_published": "2021-11-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]