[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "How Resident Evil Village Captures 25 Years Of The Franchise", "description": "Resident Evil Village manages to encapsulate everything the franchise has attempted over its 25 years, from its highest points to lowest, in this one game.\n\nResident Evil has transformed, molded, and redefined itself over and over again. From its genre defining breakthrough in 1996, to the co-op Hollywood action packed Resident Evil 6, the franchise has attempted a lot of different things over the years -- some more successful than others.\n\nOver its 25 years, Resident Evil cemented the survival horror genre, revolutionized the third person shooters with Resident Evil 4’s influential perspective, and managed to bring survival horror back into the mainstream once again with Resident Evil 7. Village encapsulates all of that, and more, pushing the franchise into new heights while doubling down on everything from the series’ past.\n\nIn the above video, Kurt Indovina ties every element back to where it was previously introduced in the franchise. From Lady Dimitrescu to Resident Evil 3’s iconic Nemesis replicated with Lady Dimitrescu, to its convoluted lore with Mother Miranda, and its similarities to CODE: Veronica. While there’s plenty of similarities to Resident Evil 4, some aren’t as apparent as others, like the ghost dolls from House Beneviento, and its direct inspiration from RE4’s unreleased prototype codenamed the “Hallucination” version, which featured creepy porcelain dolls that protagonist Leon Kennedy had to fight.\n\nWatch the video to hear how Resident Evil Village managed to staple together 25 years of Resident Evil.\n\nCheck out our other Resident Evil content!\nResident Evil Village Ending Explained: https://youtu.be/uQ-zJhZczZk\nThe Complete Resident Evil Timeline Explained: https://youtu.be/QkPgowr-T9g \nResident Evil Village Lore - The Lords: https://youtu.be/EL3nDFpCSyI", "link": "https://www.youtube.com/watch?v=-phrMMEqXkI", "date_published": "2021-05-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Mass Effect Lore: Reapers (feat. Indoctrination)", "description": "This week on our Mass Effect lore series, we dive into the backstory of the Reapers, a mysterious group of ancient machines that travel to the Milky Way galaxy every 50,000 years to kill all sentient life.\n\nMass Effect is a series that grapples with existentialism--the idea that, with free will, a person can use the ability to think, feel, and act to determine their own fate. Interestingly, however, it does this on a scale so overwhelming that it often challenges the philosophy by diminishing the impact you think you can have. Its narrative drives home the idea that you are a single drop of water in a vast ocean, or--more appropriately--a dwindling star in a universe of hundred thousand million of them. That feeling of insignificance is best reinforced by the series' primary antagonist: the Reapers.", "link": "https://www.youtube.com/watch?v=L_-ba9tLcMo", "date_published": "2021-05-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil Village Lore - The Lords", "description": "Resident Evil Village has fascinating villains who will attempt to rip Ethan's face off. Dave explores what we know and the lore behind Alvina Dimitrescu, Donna Beneviento and Angie, Salvatore Moreau, Karl Heisenberg, and of course, Mother Miranda. It's time for some Resident Evil Village Lore.\n\nEarly on in Resident Evil: Village, Ethan is thrown into the wolf’s den, and you get a glimpse of the Lords who await you. I was immediately intrigued by their design and wanted to know more - especially after waking up with a creepy doll in my face. So, here is the lore of Resident Evil: Village’s main villains.\n\nIt’s important to start with Miranda and the Cadou, as her tale will help explain the rest of the four lords.\n\nAlcina Dimitrescu was the 181st subject who Miranda experimented on, and as Miranda herself notes, her Cadou Affinity was “Most favorable.”", "link": "https://www.youtube.com/watch?v=EL3nDFpCSyI", "date_published": "2021-05-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]