[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "Audacity backs down on telemetry, System76's mechanical keyboard, elementary OS 6 beta - Linux News", "description": "Get your free proof of concept for TuxCare: https://www.tuxcare.com\n\nThis time, we have the releae of elementary OS 6 public beta, a new mechanical keyboard from System76, Audacity getting some big backlash after annlouncing the introduction of telemetry, and some new information about the JingPad A1 , linux powered tablet\n\nBecome a channel member to get access to a weekly patroncast and vote on the next topics I'll cover:\nhttps://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nSupport the channel on Patreon: \nhttps://www.patreon.com/thelinuxexperiment\n\nFollow me on Twitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\nFollow me on ODYSEE: https://odysee.com/@TheLinuxExperiment:e\nOr join ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\nThe Linux Experiment merch: get your goodies there! https://teespring.com/en-GB/stores/the-linux-experiment\n\n\n00:00 Intro\n01:37 Linux News\n03:59 Hardware News\n08:42 Gaming News\n10:36 Application News\n\n\nSomething that just didn't make the cut for the previous new video: the elementary OS 6 beta is now available.\nhttps://blog.elementary.io/elementary-os-6-odin-beta/\n\nLinus Torvalds continued his interview with tag1consulting about open source and its commercial uses and practices, and, as the first part, it's a very interesting read. \n\nhttps://www.tag1consulting.com/blog/interview-linus-torvalds-open-source-and-beyond-part-2\n\nStarLabs, which, if you haven't heard of the yet, is a Linux computer manufacturer, introduced their new Starbook Mark V. \nhttps://www.gamingonlinux.com/2021/05/star-labs-have-now-revealed-the-slick-14q-starbook-mk-v-linux-laptop\n\nA new video demoed the JingPad A1 hardware. It shows the design, very clearly inspired by the iPad Air and iPad Pro, and it looks like a very solid device.\nhttps://www.omgubuntu.co.uk/2021/05/jingpad-tablet-hands-on-video\n\nHuawei launched a new Linux and ARM powered laptop.\nhttps://www.omgubuntu.co.uk/2021/05/huawei-new-laptop-runs-linux-os\n\nSystem76 opened their new keyboard for pre-orders. It's called \"Launch\", and it's a mechanical, customisable usb keyboard, with fully open source specs: the design itself, and the firmware are 100% open and available for anyone to pick up on.\nhttps://system76.com/accessories/launch\n\nProton 6.4-3 was released, and it's mainly composed of fixes that were previously in Proton experimental. \nhttps://github.com/ValveSoftware/Proton/releases\n\nWine 6.8 was released, this version installs libraries in architecture specific sub-folders, which I guess will help in tidying stuff up, the secur32 library has been converted to the PE executable format, and it also fixes 35 bugs.\nhttps://www.gamingonlinux.com/2021/05/time-for-a-brewed-awakening-with-the-wine-68-release-out-now\n\nSpotify's is rolling out a redesign of its client, including for Linux. It's a server-side change, so you'll have to wait for it to update, but the new design is a lot more coherent with the mobile app, and looks a bit more modern than the older desktop client did.\nhttps://www.omgubuntu.co.uk/2021/05/spotify-desktop-app-redesign-2021\n\nAudacity pondered using telemetry to tray and gain more knowledge about how people use this venerable tool. \nhttps://www.zdnet.com/article/audacity-reverses-course-on-plans-to-add-opt-in-telemetry-after-outcry/\n\nKDE Connect's Android app got a nice makeover, removing the dated orange slabs of color that were in its menu. The update really makes the app look more modern, although it's a big black and white now and could use a bit more graphical elements, maybe presenting the various features in a grid of icons instead of a list.\nhttps://www.omgubuntu.co.uk/2021/05/kde-connect-android-redesign-rolling-out", "link": "https://www.youtube.com/watch?v=Egp8el2fTdc", "date_published": "2021-05-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]