[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "8 Minutes of Demon Slayer: The Hinokami Chronicles Spider-Demon Boss Fights Gameplay", "description": "Check 8 minutes of action in Demon Slayer: The Hinokami Chronicles story mode gameplay in the Spider Forest. Here we take on the Spider-Demon Elder Brother as Zenitsu. Then we take on the Spider-Demon Father as Inosuke, and finally we take on Rui the head of the Spider Family as Tanjiro. Rui is one of the Twelve Kizuki and is the most feared member of his family, as well as the strongest. See how we fair against all these different bosses and mini bosses as Zenitsu, Inosuke and Tanjiro in Demon Slayer Kimetsu no Yaiba The Hinokami Chronicles. \n\nTimeStamps:\n0:00 Intro\n0:05 Zenitsu takes on Spider-Demon Elder Brother\n3:40 Inosuke takes on Spider-Demon Father\n5:56 Tanjiro takes on Rui\n\n#DemonSlayer", "link": "https://www.youtube.com/watch?v=0BXUbDyCusI", "date_published": "2021-10-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "9 Things I Wish I Knew Before Starting Back 4 Blood", "description": "Back 4 Blood, the co-op zombie survival game, and spiritual successor to Left 4 Dead, is now available for everyone and we've got a few tricks and other things of note that will improve your experience in the fight against the ridden hordes.\n\nBack 4 Blood is now available on PC, PS4, PS5, Xbox One, and Xbox Series Consoles. Game Pass owners get access to the game on both PC, Xbox, and the cloud. The game also has crossplay support, but please make sure your DualSense mics are turned off PlayStation 5 players.\n\n#Back4Blood", "link": "https://www.youtube.com/watch?v=Rj8XT_R3BJw", "date_published": "2021-10-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Final Fantasy XIV Endwalker Reaper & Sage Hands-On Preview", "description": "Ben Janca got hands on time with the new Reaper and Sage jobs coming in Final Fantasy XIV's latest expansion Endwalker.\n\nFinal Fantasy 14’s latest expansion, Endwalker, is almost here! Releasing on November 23rd (or the 19th if you are a fan of early access) it is set to finish up a massive storyline spanning over 10 years and is the game’s 4th expansion after it was reworked for A Realm Reborn. Ben Janca got invited to a preview event being held to get some early hands-on time with the new Reaper and Sage jobs. Of course, it is important to note that everything here is based on an in-development build of the Final Fantasy XIV: Endwalker, and any content is subject to change before we all get our hands on the final version of the expansion.", "link": "https://www.youtube.com/watch?v=H9YvKzKeMK0", "date_published": "2021-10-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Last Chance To Get The Original GTA Trilogy | GameSpot News", "description": "In this episode of GameSpot News, we talk about the original GTA trilogy being unlisted from digital stores, Fortnite handling returns in a new way as well as teasing a collab with Among Us, and Riot Games removing All chat from League Of Legends. \n\nIn this video, DeVante talks about the original GTA trilogy being delisted from digital stores following the announcement of the GTA Trilogy: The Definitive Edition. This new bundle comes with updated and improved versions of GTA III, Vice City or San Andreas and will be available on PS4, PS5, Xbox One, Xbox Series X|S, Nintendo Switch, and PC.\n\nDeVante also talks about Fortnite teasing an upcoming collab with Among Us. The tease came in the form of a Twitter exchange after Fortnite released it’s update 18.20 patch notes. The update also includes a new return system for unwanted cosmetic purchases. \n\nLater in the video, League Of Legends All Chat is removed from the game after reported of abuse over the past year. \n\nTIMESTAMPS:\n00:00 - Intro\n00:15 - Original GTA Trilogy Being Removed\n01:02 - Fortnite teases Among Us collab \n01:58 - Fortnite refund changes\n02:41 - League of Legends removes All Chat\n03:37 - Try Riders Republic on PC today only \n03:55 - Outro", "link": "https://www.youtube.com/watch?v=qnIMcER_DkI", "date_published": "2021-10-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Brilliant Diamond and Shining Pearl Look To Evolve Upon The Originals' Mechanics", "description": "The remakes for Pokémon Generation IV seem to be aimed at addressing Diamond/Pearl's most obvious shortcomings.\n\nAhead of the release for Pokemon Brilliant Diamond/Shining Pearl, developer ILCA and publisher Nintendo have marketed the two remakes as faithful adaptations of the original Generation IV games. I recently attended a preview event for the duo where I got to see B. Diamond in action, and although these remakes look faithful to the original games, I'm not so sure that they'll feel as faithful. If anything, the changes made in these remakes seem to make for a far more approachable experience--I think players are going to find these games to be a lot easier to get through than the original Diamond/Pearl.\n\nIn terms of overall structure and presentation, yes, B. Diamond/S. Pearl are faithful adaptations of the original Diamond/Pearl. Unlike Sword/Shield with its over-the-shoulder perspective, realistically proportioned characters, and occasional free camera moments, B. Diamond/S. Pearl is presented in Pokemon's traditional top-down isometric perspective with a more chibi-like visual style and no free camera.", "link": "https://www.youtube.com/watch?v=0mePFpBEa4w", "date_published": "2021-10-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Dark Souls: Biggest Mysteries Explained", "description": "In this episode of Gaming Mysteries, Dave goes over some of Dark Souls best known secrets. Who is Gwyn's Firstborn Son, What does the Pendant Do, What is the Skull at Ash Lake, and Who is the Narrator? Dive into some of Dark Souls Mysteries and find out which are solved and which remain unsolved!\n\nThanks to its unique world and deep lore, Dark Souls fans have dove into every aspect of the game. We've found cut content showcasing the Witch of Izalith's original boss fight, questioned if Manus is the Furtive Pygmy, and even had some of our questions answered in Dark Souls 3. But, there are still many burning Dark Souls questions and mysteries.\n\nAt this point, some of these mysteries are solved, but there still remain many that we don't know the answers to, and many still theorize about. How is Velka related to the overall plot of the game? Where did Gwynevere flee to? And, many questions this video tackles, such as who is Gwyn's Firstborn son, and is this related to Solaire or Andre of Astora? Does the pendant actually do anything, or is it more of Hidetaka Miyazaki's trickery? Soulsborne is full of these mysteries, and today we focus on Dark Souls 1.\n\n#DarkSouls", "link": "https://www.youtube.com/watch?v=wgzAZRXy8Uo", "date_published": "2021-10-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Forza Horizon 5 Hands On Preview", "description": "We recently took part in a hands-on preview event for Forza Horizon 5 where we got to play the racing game's opening prologue and sample a few story missions before being set free to roam the open world of Mexico. \nCredits: Eddie Makuch, Richard li, kurt indovina\n\nThe demo also let us try a series of races involving different types of cars in a variety of settings. All of these were impressive with their attention to detail and core driving mechanics, but our favorite part of our limited time with Forza Horizon 5 was exploring the open road and experiencing the world at my own pace.\n\n#ForzaHorizon5", "link": "https://www.youtube.com/watch?v=RQayYIgziRc", "date_published": "2021-10-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokemon Legends: Arceus Is Not Fully Open World | GS News", "description": "In this video, Persia talks about how the not-so-open world will work in Pokemon Legends: Arceus, a possible Fortnite movie, and persistent Diablo 2 Resurrection server issues.\n\nWhile many fans have compared Pokemon Legends: Arceus to the Legend of Zelda: Breath of the Wild, the world may not work the way players may think. Instead, the world will operate similarly to the Monster Hunter series. In a statement to Kotaku, The Pokemon Company states that players set out from a central hub village, before accepting missions and venturing forth into different \"open areas\" of the Hisui region.\n\nFortnite may currently be unavailable on iOS and Google Play stores, but Epic Games is now considering a Fortnite movie as a trio of former LucasFilm employees have joined the company. There have already been discussions about a Fortnite movie according to a report by The Information.\n\nDiablo II: Resurrected launched over two weeks ago and is still suffering from many of the same login issues, with the game even going offline for multiple hours over the weekend for emergency maintenance. As of this afternoon, Blizzard said on Twitter that players should begin to see improvements.\n\nFor more information on all of our topics, please visit gamespot.com.", "link": "https://www.youtube.com/watch?v=tfWnVGua1oM", "date_published": "2021-10-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "SAINTS ROW The Districts of Santo Ileso Trailer", "description": "This is the biggest Saints Row city yet, and it’s packed with things to do. Santo Ileso is filled with crime. In this trailer you'll see varied districts, points of interest and inhabitants just living their best (or worst) lives. Your job is to build a new criminal empire to take control of these districts from Marshall, Los Panteros and The Idols. The key territories are Rancho Provedencia, Lakeshore, and Monte Vista.\n \n#SaintsRow", "link": "https://www.youtube.com/watch?v=MQXXXWd3Fwo", "date_published": "2021-10-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]