[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCsXVk37bltHxD1rDPwtNM8Q", "title": "What Dinosaurs ACTUALLY Looked Like?", "description": "The 12,022 Calendar is sold out check out more scienc-y products created with love here: https://kgs.link/shop-151\n\nSources & further reading:\nhttps://sites.google.com/view/sources-mysteries-of-the-past/\n\nThe past is a vast and mysterious land that begins at the big bang and ends in the present, expanding with each passing moment. It is the home of everything that came before, the key to understanding our present. Here we find the most amazing creatures to ever roam our planet, hundreds of millions of species so diverse that our imagination cannot do them justice. Unfortunately the past carefully guards its secrets.\n\n\nOUR CHANNELS\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nGerman Channel: https://kgs.link/youtubeDE \nSpanish Channel: https://kgs.link/youtubeES \n\n\nHOW CAN YOU SUPPORT US?\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nThis is how we make our living and it would be a pleasure if you support us!\n\nGet Merch designed with ❤ https://kgs.link/shop-151  \nJoin the Patreon Bird Army 🐧  https://kgs.link/patreon  \n\n\nDISCUSSIONS & SOCIAL MEDIA\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nReddit:            https://kgs.link/reddit\nInstagram:     https://kgs.link/instagram\nTwitter:           https://kgs.link/twitter\nFacebook:      https://kgs.link/facebook\nDiscord:          https://kgs.link/discord\nNewsletter:    https://kgs.link/newsletter\n\n\nOUR VOICE\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nThe Kurzgesagt voice is from \nSteve Taylor:  https://kgs.link/youtube-voice\n\n\nOUR MUSIC ♬♪\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\n700+ minutes of Kurzgesagt Soundtracks by Epic Mountain:\n\nSpotify:            https://kgs.link/music-spotify\nSoundcloud:   https://kgs.link/music-soundcloud\nBandcamp:     https://kgs.link/music-bandcamp\nYoutube:          https://kgs.link/music-youtube\nFacebook:       https://kgs.link/music-facebook\n\nThe Soundtrack of this video:\nSoundcloud: https://bit.ly/2YDoQha\nBandcamp: https://bit.ly/3mLPwoj\n\nIf you want to help us caption this video, please send subtitles to subtitle@kurzgesagt.org\nYou can find info on what subtitle files work on YouTube here:\nhttps://support.google.com/youtube/answer/2734698?hl=en-GB&ref_topic=7296214\nThank you!\n\n🐦🐧🐤 PATREON BIRD ARMY 🐤🐧🐦\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nMany Thanks to our wonderful Patreons (from http://kgs.link/patreon) who support us every month and made this video possible:\nHex5ter 99, Sheeran, Shaun Loh, Umo Jami, Claudio Catarinella, Noah Costello, Dylan West, Kyla de Villa, Alex Graham, Larry Apolonio, The Pixel Life, Douglas Steel, Bernhard Wiedemann, Ryantsang, Michael Enrico, JV, Mark Goldberg, Patryk Borkowski, Pilar Amador Cortés, Rafi Khan, Val, Egidijus Grygolaitis, Kageetai, Yasmin Muryadi, Elyse Endlich, Liam Sheppard, Henrique Borsatto de Campos, Corheu, PicaHud, ATTILA VONDORKOVICS, Jessica Abood, Kim Martin Jensen, Christian Larmann, Gentatsu Sakakibara, Red Ryan, Jazz, Iain Cuthbertson, Ben Price, Kyle T David, Shia Labeouf, Fizzonaut, Leopold Kamp, Vaccineman, Shuder, Chio Verastegui, Buff Skeleton, Steven Drovie, Elric Zhang, Petru Cotarcea, Van Nels Dantas, Marvin Heintze, Dwayne Sinclair, Jesus Torres, ApocryphalDNR, jdf, Lex Lehmann, Peyton Drouhard, Exordin, Eduardo Gonzalez, Energy Transformation with Sierra Reed, Elías Natán Jiménez Alvarado, Alex AM, Erebus GAME, Rahul Chandra, Ass Hat, Chris Lihosit, Hero Luu, Matthew Evans, Isaac Griess, Flynn, Hans, Eduard S, Yorick Terweijden, Alexander Ottinger, Maxley Fraser, Anna Parfenova, Fame and fortune guaranteed in the state of Tintucky, Kevin Meyers, Travis Agaman, Pablo Corredor, Umberto Badalin, Marton Csikos, AquisM", "link": "https://www.youtube.com/watch?v=xaQJbozY_Is", "date_published": "2021-10-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]