[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Battlefield 1’s Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of Battlefield 1, including the tiny Kolibri pistol, the Borchardt C-93 semi-automatic pistol, and the Villar Perosa M1915 automatic firearm.\n\nBattlefield 1 takes the long-running shooter franchise into the First World War, and as a result, it includes a range of period weaponry such as the M1915 Hellriegel machine gun, the Bergman MP18 submachine gun, and the Burton 1917 light machine rifle.\n\nIn the above video, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of Battlefield 1 and compares them to their real-world counterparts.\n\nIf you're interested in seeing more of Jonathan, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get membership here. - https://royalarmouries.org/support-us/membership/", "link": "https://www.youtube.com/watch?v=J-2OICqG3Ig", "date_published": "2021-01-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "47 Ways To Hit Men In Hitman 3", "description": "We round up 47 of the best ways to take down your targets (as well as anyone else who gets in your way) in Hitman 3.\n\nHitman 3 is out now, bringing IO’s World of Assassination trilogy to a close. So to celebrate we’ve rounded up 47 of our favourite ways for Agent 47 to take down his targets.\n\nLet us know your favourites in the comments below!", "link": "https://www.youtube.com/watch?v=c7UizHVauaQ", "date_published": "2021-01-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Nobody Is Happy With Call Of Duty Right Now", "description": "How a great idea to merge Call Of Duty: Black Ops Cold War, Warzone, and Modern Warfare lead to confusing purchases, overpowered guns, and challenges that didn’t please either audience.\n\nCall Of Duty recently merged progression, a season pass, and some guns across Cold War, Warzone, and Modern Warfare. In theory, it was a great idea that would allow any Call Of Duty player to engage in any mode and carry progress across games. In reality Call Of Duty: Black Ops Cold War is a more traditional Call Of Duty title with a different audience from the mil-sim inspired Modern Warfare, so the merger has resulted in Warzone challenges that don’t appeal to Cold War players, erased or made meaningless progress for Modern Warfare players, overpowered guns like the Mac-10 and DMR 14 in Warzone, and created unlocks that some players can’t use unless they purchased the other title. \n\nIn this video, we talk about what we feel Activision was trying to achieve, why it’s a good idea in theory, why it isn’t working yet, and what they can focus on next. Call Of Duty titles published by Activision are developed by multiple studios including Infinity Ward, Treyarch, Raven Software, and Sledgehammer Games. This is the first time progress has been linked across two separate games and a standalone free-to-play battle-royale. We have yet to see if this shared ecosystem will be used moving forward for all Call Of Duty titles, but there are lessons to be learned either way.", "link": "https://www.youtube.com/watch?v=VZKZ6EGMqbY", "date_published": "2021-01-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "What The Heck Is Going On With GameStop", "description": "GameStop's stock value has been all over the place the past few days. On this week's episode of GameSpot After Dark, the crew tries to make sense of it.", "link": "https://www.youtube.com/watch?v=-drUMk9btFs", "date_published": "2021-01-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]