[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCFLwN7vRu8M057qJF8TsBaA", "title": "Cyberpunk 2077 Is An Absolute Nightmare – This Is Why", "description": "The first 1000 people to use this link will get a free trial of Skillshare Premium Membership: https://skl.sh/upisnotjump01211\n\nAh, Cyberpunk 2077, the worlds least controversial video game. In the making for nearly a decade it is finally here and oh boy, is it an absolute nightmare. In this video I talk at length about CD Projekt Red, The Witcher 3, triple A gaming as a whole, and of course Cyberpunk 2077 at length.\n\nGenerally I think of Cyberpunk 2077 pretty positively, as a video game it tries to do too much and some areas fall flat, but generally I can ignore this stuff and focus on the games main story, which is where I think CD Projekt Red did their game proud.\n\nAlthough I liked Cyberpunk 2077 I ended up focusing mostly on it’s negatives in this video, the series is called “absolute nightmare” after all. This wasn’t entirely intentional, it’s just Cyberpunk 2077 is such a big game that was rushed out there is a lot of issues to find. \n\nThe Cyberpunk 2077 style mask I wear was made by my friend Sam Hoile. It fits the games mood perfectly so I hope you all liked it! All the Cyberpunk 2077 glitch style editing was just done by me using stock footage and jumpcuts.\n\nMy stream will be on the 6th of Febuary, 11am UK time. Current invited guests are RT Game, NerdCubed, Caddicarus, HBomberGuy, ManyATrueNerd, TheSpiffingBrit. Some are still to confirm!\n\nAll my music and sound is from here: https://www.epidemicsound.com/referral/8pficg\n\nPatreon: https://www.patreon.com/UpIsNotJump​ \nMerch: https://www.pixelempire.com/products/​... \nTwittz: https://twitter.com/UpIsNotJump​\n\nEdit Workflow by Milo at Speedwagon Productions www.speedwagon.me\nBig thanks to Emma Hollaway from www.elhvisual.com for the incredible 'side-effects' artwork!\n\nSuper special thanks to my members!\nGreenCoatGaming", "link": "https://www.youtube.com/watch?v=4Sxf8i5LmDI", "date_published": "2021-01-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]