[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Wet Leg: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nBob Boilen | December 1, 2021\nNo other band has brought me more joy in 2021 than Wet Leg, and I truly needed joy in 2021. When \"Chaise Longue,\" came out in June, it felt like a gift. It's rare to hear a band's very first song sound as perfect as this one did, but that's part of the magic that Wet Leg exudes. Two dear friends – Rhian Teasdale and Hester Chambers — making music to make each other smile, then watching that smile spread as audiences catch on.\n\nThat song has a few deadpan lines lifted from the film Mean Girls: \"Is your muffin buttered? Would you like us to assign someone to butter your muffin?\" There's a golden moment in this Tiny Desk (home) concert when Rhian turns to Hester with the line, \"Excuse me,\" while Hester responds dryly, \"What?\" Setting off a knowing smile back and forth made me love the band even more. They were gathered together at The Ventnor Exchange, a creative arts space/record shop/bar/venue on the Isle of Wight, their home turf. And their band – Henry Holmes on drums, Ellis Durand on bass and Josh Mobaraki on guitar and synth – amplify the rock and droll sound Rhian and Hester personify.\n\nThey've just announced the April 8 release date for their debut album, more tour dates, and shared two new songs, which you'll also hear them perform here. The new songs don't stray far from the two they'd previously released, which bookend this Tiny Desk (home) concert. Part of the footage was filmed on VHS tape, a bit of a wink toward their sound, which has roots in the '70s. It's not nostalgic, but it is playfully wistful.\n\nSET LIST\n\"Chaise Longue\"\n\"Too Late Now\"\n\"Oh No\"\n\"Wet Dream\"\n\nMUSICIANS\nHester Chambers: vocals, guitar\nRhian Teasdale: guitar, backup vocals\nHenry Holmes: drums\nEllis Durand: bass\nJosh Mobaraki: guitar, synth\n\nCREDITS\nVideo: Joey Julliard, Oliver Bury, Josh Mobaraki\nAudio: Patrick Lee, Josh Mobaraki\nSpecial thanks: The Ventnor Exchange, Ventnor, Isle of Wight\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bobby Carter, Kara Frame, Sofie Hernandez-Simeonidis\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #wetleg", "link": "https://www.youtube.com/watch?v=bJUUnXZVIfY", "date_published": "2021-12-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]