[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Ash Ketchum's Biggest Ls In The Pokemon Anime", "description": "This year marks the 25th anniversary of Pokémon. Throughout the years, Ash Ketchum has held many Ls in the Pokémon League. Join Persia as she takes a look back at some of Ash's biggest losses before perseverance finally prevailed.\n\nThe world of Pokemon is vast, and accessible in so many different ways. Whether it's putting yourselves in the shoes of a trainer by battling in the trading card game in the real world; building your own squad of virtual Pokemon through the video games; or watching the adventures unfold in the TV shows, everyone has their own personal Pokemon legend and journey. However, one figure in the world of Pokemon stands head and shoulders above them all: Ash Ketchum.\n\nThis is somewhat surprising considering he has more publicly witnessed Ls than perhaps any other trainer in history. Yes, Ash Ketchum is the most well-known Pokemon trainer of all time, but he isn't necessarily the best, which makes the whole \"I wanna be, the very best\" theme song kinda ironic. Failure has been a constant in Ash's career and, more often than not, his rise to top of the ranks is cut short by another smarter trainer and their more powerful Pokemon. Sorry, Ash, you might be kinda washed.\n\nIn this video, to mark the 25th anniversary of Pokemon, we're recounting some of Ash Ketchum's biggest losses. Of course, we're not just dunking on him for fun, there's a lesson to be learned: Trying your best can be as rewarding as winning. Also maybe train your Pokemon better than this loser.", "link": "https://www.youtube.com/watch?v=gvwj4zy6ZyY", "date_published": "2021-02-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "VPN Gaming: How It Works", "description": "Express VPN: https://bit.ly/3dUBlut\nIPVanish: https://bit.ly/3b1D2Eu\nNordVPN: http://bit.ly/3r5F3Fm\n\nVPN services are becoming increasingly popular, but how can they be used for gaming?\n\nIf you're a regular YouTube video and Twitch stream viewer or podcast listener, you've likely heard the term \"VPN\" a few times--ExpressVPN is a popular sponsor. But what exactly is a VPN, and what are they for?\n\nIn the video above, Jean-Luc Seipke discusses the ins and outs of a VPN, as well as why you might want to pay for one. Standing for virtual private network, a VPN is designed to both secure and encrypt a connection between two networks. That opens up personal benefits for their users, especially when it comes to video streaming.\n\nIn terms of gaming, a VPN's usefulness will fluctuate case to case. It won't improve your internet connection beyond what you currently pay for, but a VPN can be especially helpful if you're playing online video games that rely on a peer to peer connection. With a VPN, you can protect yourself from DDoS attacks, which you really only need to care about in online games that rely on a peer to peer connection.\n\nYou'll have to watch the full video for a breakdown on VPNs in generation. If you do decide that a VPN is right for you, we recommend ExpressVPN, NordVPN, or IPVanish if you're a gamer.", "link": "https://www.youtube.com/watch?v=PK9sBosJ5pM", "date_published": "2021-02-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "FF7 Remake PS5 Upgrade Reaction, and Xbox Cloud Plans", "description": "In this week's packed episode of Console Crew, Lucy, Tam, and Jordan discuss PSVR2, as well as react to the PlayStation State of Play and the new content coming to Final Fantasy 7 Remake on PS5. They talk about Xbox's plans for the Cloud and the upcoming Smash Direct.", "link": "https://www.youtube.com/watch?v=URmlQblN4EQ", "date_published": "2021-02-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Hunt: Showdown’s Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of Hunt: Showdown, including the Sharps Derringer pistol, the Spencer 1882 pump-action shotgun, and a very unique single-barrelled shotgun.\n\nHunt: Showdown is a supernatural take on the Wild West complete with an arsenal of period weaponry that includes interesting takes on the Colt Single Action Army revolver, the LeMat revolver, and the Winchester Model 1873 rifle.\n\nJonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of Hunt: Showdown and compares them to their real-world counterparts.\n\nIf you're interested in seeing more of Jonathan, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. -https://royalarmouries.org/support-us/membership/\n\nYou can purchase Jonathan's book here - https://www.headstamppublishing.com/bullpup-rifle-book", "link": "https://www.youtube.com/watch?v=dLE31drHO0Y", "date_published": "2021-02-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokemon Brilliant Diamond & Shining Pearl Trailer Comparison - Switch vs DS", "description": "Pokemon Brilliant Diamond & Shining Pearl have officially been revealed! To celebrate we go back and compare the newly revealed footage in the trailers to the original Diamond & Pearl gameplay in this side by side comparison video!\n\nPokemon Diamond and Pearl are almost 15 years old, having originally launched for Nintendo DS in September 2006 in Japan. The games were released four years after the previous entry, Pokemon Ruby & Sapphire, and we wouldn’t get the next generation, Pokemon Black and White, for another four years. Instead, we indulged in some Pokemon nostalgia with games like Pokemon HeartGold & Soulsilver--so it wasn’t completely empty.\n\nNow, Nintendo and The Pokemon Company are inviting us to take a trip down memory lane again with Pokemon Brilliant Diamond and Shining Pearl, which are remakes of the classic DS titles. This gives us the perfect excuse to put both versions of the two games side-by-side to see just how far we've come.\n\nAs you might have guessed the DS and Switch versions don’t look similar at all. The Switch version went with a chibi art-style the harcons back to the little sprites on the DS, but otherwise everything is shiny and new including the battles between Pokemon.\n\nPokemon Brilliant Diamond & Shining Pearl will be released in Late 2021 on Nintendo Switch. The Pokemon Company also revealed Pokemon Legends: Arceus, a brand new open-world Pokemon title that seems to have some similarities to The Legend of Zelda: Breath of the Wild. Pokemon Legends: Arceus will be released in Early 2022 for the Nintendo Switch.", "link": "https://www.youtube.com/watch?v=XyhG7H3keXU", "date_published": "2021-02-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Valheim: How To Find Scrap Iron And Make Iron Gear", "description": "You need to get to specific places to find Iron in Valheim, which requires you to take down a boss and find the right items. Here's what you need.", "link": "https://www.youtube.com/watch?v=bAiB3U0LDlY", "date_published": "2021-02-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]