[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCsXVk37bltHxD1rDPwtNM8Q", "title": "What Are You Doing With Your Life? The Tail End", "description": "Gain a new perspective on your life with our \"Calendar & Timeline of Your Life Posters\":\nhttps://kgs.link/shop-143\n\nSources & further reading:\nhttps://sites.google.com/view/sources-tailend/\n\nWrapping your mind around your life is pretty hard, because you are up to your neck in it. It's like trying to understand the ocean while learning how to swim. On most days you are busy just keeping your head above water. So it is not easy to figure out what to do with your life and how to spend your time.\n\nThere are a million distractions. Your family, friends and romantic partners, boring work, and exciting projects. Video games to play and books to read. And then there is your couch that somebody needs to lie on. It’s easy to get lost. So let us take a step back and take a look at your life from the outside. \n\nOUR CHANNELS\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nGerman Channel: https://kgs.link/youtubeDE \nSpanish Channel: https://kgs.link/youtubeES \n\n\nHOW CAN YOU SUPPORT US?\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nThis is how we make our living and it would be a pleasure if you support us!\n\nGet Merch designed with ❤ https://kgs.link/shop-143  \nJoin the Patreon Bird Army 🐧  https://kgs.link/patreon  \n\n\nDISCUSSIONS & SOCIAL MEDIA\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nReddit:            https://kgs.link/reddit\nInstagram:     https://kgs.link/instagram\nTwitter:           https://kgs.link/twitter\nFacebook:      https://kgs.link/facebook\nDiscord:          https://kgs.link/discord\nNewsletter:    https://kgs.link/newsletter\n\n\nOUR VOICE\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nThe Kurzgesagt voice is from \nSteve Taylor:  https://kgs.link/youtube-voice\n\n\nOUR MUSIC ♬♪\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\n700+ minutes of Kurzgesagt Soundtracks by Epic Mountain:\n\nSpotify:            https://kgs.link/music-spotify\nSoundcloud:   https://kgs.link/music-soundcloud\nBandcamp:     https://kgs.link/music-bandcamp\nYoutube:          http://kgs.link/music-youtube\nFacebook:       https://kgs.link/music-facebook\n\nThe Soundtrack of this video:\n\nSoundcloud:   https://bit.ly/3f3a9tv\nBandcamp:     https://bit.ly/3hJaLWU\n\n\n🐦🐧🐤 PATREON BIRD ARMY 🐤🐧🐦\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nMany Thanks to our wonderful Patreons (from http://kgs.link/patreon) who support us every month and made this video possible:\nDenrage, Hugo Novotny, Bombibom, Bryant & Angel, Matthew, Ngoc B Khuong, Zormoe, Caoimhe Gilbert, Brandon James, Adrith Nayak, Zachary Kern, Eric Downes, Marcuss, Anthony Adkins, tomworkshere, Michael Tedder, DeepWaters, Greg Powell, fresh crystal mangos, Finalpenguin 726, Kareto Phase, Vincent Guerra, Michelle Sichting, Martin Hlaváč, Zwackelmann0, RottingMyBrain, meldanor, sprung, Pedro Antunes, supermeme, Guillaume Hellin, Carl Schanz, Drago Draco, Stephen Barker, Rors, Paco Avila, Ro-ni-n, Pol Duran Casademont, Courtney Hill, Sharbel Zarzour, Vicky, Carsten Guhr, Gary Gilbody, Jacob Geeo, Nathan Schroeder, Mark Frelih, Cédric Lothe, Joshua Valji, Thea Ilona, Jonathan Geaney, Arber, Matt Woodham, Dominic Juarez, Nelson Gollop, Дмитрий Киселёв, Adam Ellum, Lucy B, ghostman, dibidave, Dan Morris, lindryd aldar, Alberto Simonazzi, Jakub Kotucha, Hannes Burner, Mike Koss, henrythasler, Ryan McPartlan, Denis Leonte, Kai Fic, Jeremy Krall, Thomas Adamick, Andreas, Richard j, Eroviaa Hunter, PaddyO‘Lantern, Vishrut Joshi, Gwendolyn Jones, Nazar Beknazarov, Eric Rowland, José Castillo Fallas, Eben Alguire, Jesse, Greg Belote, AlphaTaco, Craig, Ryan G. Hornberger, Christien Lomax, SURGE, Ben Udris", "link": "https://www.youtube.com/watch?v=JXeJANDKwDc", "date_published": "2021-05-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]