[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCoOjH8D2XAgjzQlneM2W0EQ", "title": "How to Destroy 10% of Global Trade in 7 Minutes | Suez Canal Blocked by Ever Given", "description": "Get your first seven days right now for just ONE dollar. Go to ➡️ http://trends.co/jaketran for your $1 seven-day trial! 🔥\n\n😈 Watch exclusive 40+ minute documentaries that are too controversial to ever be released to the public: https://jake.yt/join \n\n📹 Take a peak at all the private documentaries here: https://jake.yt/hidden-vids\n\nCheck out the All-In Podcast: https://jake.yt/all-in \n\n🎥 Business is complicated. Subscribe to curiosity: http://bit.ly/jt-sub\n🎙️ Subscribe to the 2nd channel, Intellectual Dropouts: https://jake.yt/id\n✉ Be the first to watch new videos with email notifications: http://bit.ly/jt-inbox\n📸 Follow me on IG:@jaketran // http://bit.ly/jt-ig\n👨👦👦 Join the Tran Mafia Family here: https://bit.ly/patreon-jt\n💬 Join the community Discord: http://discord.gg/BmK8EnQ\n\nSupport this channel monetarily:\n💻 𝗟𝗮𝗽𝘁𝗼𝗽 𝗟𝗶𝗳𝗲𝘀𝘁𝘆𝗹𝗲 𝗔𝗰𝗮𝗱𝗲𝗺𝘆: Learn exactly how I landed my $40/hr work from home job ($83k/yr) at 19 years old: https://jake.yt/LLAd\n🖥️ Website platform I use: https://jake.yt/kd\n📈 Get up to $250 in free Bitcoin at http://blockfi.com/jake \n💽 Editing software I've used for 7+ years: https://jake.yt/ccd\n📒 Online bookkeeping software I use: https://jake.yt/benchd \n📜 The exact resume I used to get my $40/hr remote web dev job + a lot of bonuses: https://jake.yt/DRBd\n🎥 My video gear, setup, tech, books: https://jake.yt/stored\n\n✉️ Email me: jake@jaketran.io\n\nSubscribe to the backup channel on LBRY, use reward code \"jake-cast\" for free coin: https://bit.ly/LBRY-jt\n\n📰 Sources & visuals: https://bit.ly/3wetvm6\n\n-----------------------\nA giant container ship named the Ever Given left the port of Ningbo, China, which is just south of Shanghai. The Ever Given flies under the flag of Panama, but it’s owned by the Evergreen Marine Corporation, a huge taiwanese container transportation and shipping company.\n\nThe Ever Given would go down the Asian continent. From there, it would start its 10 day journey out at sea all the way to the Gulf of Aden at the horn of Africa, up the Red Sea, all the way to the Suez Port at the south end of the Suez Canal. The Suez Canal is the connecting link between two giant economies: Europe and Asia, that allows ships to not have to sail all the way around Africa, which can add two weeks to the trip.\n\nBut in the span of 7 minutes, one of the most important trade routes is shut down, 12% of global trade grinds to a halt, at the cost of $400 million dollars every. Hour.\n\nInitially, they estimated that it would take around a week to get the ship out, but that estimation quickly grew to a few weeks. So the natural question is -what made the ship crash? At first, the crash was blamed on the bad weather. People also started to say that there was a power outage on the ship. The balance of the world can flip within minutes.\n\nShipping used to be very complicated and expensive. But by the 1970’s - the 20 foot shipping container became the standard. And from that point on, the world economy was forever changed. Or in other words, shipping containers have become part of the lifeblood of the modern economy. \n\nSince the Suez Canal mainly connects Europe and Asia, initially, there were a lot of fears that it would disrupt the global economy and supply chain. But what you should worry about is just how fragile our delicate world really is.\n\nSince the start of the industrial revolution, everything in society has only gotten more concentrated, more centralized. Which leads us to today, where we’ve optimized everything to be the lowest cost possible, but at the expense of any robustness in our global economy.\n\n-----------------------\n\ninvention_ - ebb//flo https://chll.to/bc168060 \n\nAll materials in these videos are used for educational purposes and fall within the guidelines of fair use. No copyright infringement intended. If you are or represent the copyright owner of materials used in this video and have a problem with the use of said material, please send me an email, jake@jaketran.io, and we can sort it out.\n\nCopyright © 2021 Transcend Visuals, LLC. All rights reserved.\n\nDISCLAIMER:\n\nThis video does not provide investment or economic advice and is not professional advice (legal, accounting, tax).  The owner of this content is not an investment advisor.  Discussion of any securities, trading, or markets is incidental and solely for entertainment purposes.  Nothing herein shall constitute a recommendation, investment advice, or an opinion on suitability.  The information in this video is provided as of the date of its initial release.  The owner of this video expressly disclaims all representations or warranties of accuracy.  The owner of this video claims all intellectual property rights, including copyrights, of and related to, this video.\n\nAFFILIATE DISCLOSURE: Some of the links in this video's description are affiliate links, meaning, at no additional cost to you, the owner may earn a commission if you click through, make a purchase, and/or opt-in.", "link": "https://www.youtube.com/watch?v=5jFssY1qV7g", "date_published": "2021-03-31 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]