[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCHnyfMqiRRG1u-2MsSQLbXA", "title": "The Surprising Secret of Synchronization", "description": "How does order spontaneously arise out of chaos? This video is sponsored by Kiwico — go to https://www.kiwico.com/Veritasium50 for 50% off your first month of any crate.\n\nAn enormous thanks to Prof. Steven Strogatz — this video would not have been possible without him. Much of the script-writing was inspired and informed by his wonderful book Sync, and his 2004 TED talk. He is a giant in this field, and has literally written the book on chaos, complexity, and synchronization. It was hard to find a paper in this field that Steven (or one of his students) didn't contribute to. His Podcast \"The Joy of X\" is wonderful — please listen and subscribe wherever you get your podcasts https://www.quantamagazine.org/tag/the-joy-of-x\n\nNicky Case's Amazing Firefly Interactive — https://ncase.me/fireflies\n\nGreat Kuramoto Model Interactive — https://www.complexity-explorables.org/explorables/ride-my-kuramotocycle\n\nReferences: \n\nStrogatz, S. H. (2012). Sync: How order emerges from chaos in the universe, nature, and daily life. Hachette UK. — https://ve42.co/Sync\n\nStrogatz, S. H. (2000). From Kuramoto to Crawford: exploring the onset of synchronization in populations of coupled oscillators. Physica D: Nonlinear Phenomena, 143(1-4), 1-20. — https://ve42.co/Strogatz2000\n\nGoldsztein, G. H., Nadeau, A. N., & Strogatz, S. H. (2021). Synchronization of clocks and metronomes: A perturbation analysis based on multiple timescales. Chaos: An Interdisciplinary Journal of Nonlinear Science, 31(2), 023109. — https://ve42.co/Goldsztein\n\nThe Broughton Suspension Bridge and the Resonance Disaster — https://ve42.co/Broughton\n\nBennett, M., Schatz, M. F., Rockwood, H., & Wiesenfeld, K. (2002). Huygens's clocks. Proceedings of the Royal Society of London. Series A: Mathematical, Physical and Engineering Sciences, 458(2019), 563-579. — https://ve42.co/Bennett2002\n\nPantaleone, J. (2002). Synchronization of metronomes. American Journal of Physics, 70(10), 992-1000. — https://ve42.co/Pantaleone2002\n\nKuramoto, Y. (1975). Self-entrainment of a population of coupled non-linear oscillators. In International symposium on mathematical problems in theoretical physics (pp. 420-422). Springer, Berlin, Heidelberg. -- https://ve42.co/Kuramoto1975\n\nGreat video by Minute Earth about Tidal Locking and the Moon — https://ve42.co/MinuteEarth\n\nStrogatz, S. H., Abrams, D. M., McRobie, A., Eckhardt, B., & Ott, E. (2005). Crowd synchrony on the Millennium Bridge. Nature, 438(7064), 43-44. — https://ve42.co/Strogatz2005\n\nZhabotinsky, A. M. (2007). Belousov-zhabotinsky reaction. Scholarpedia, 2(9), 1435. — https://ve42.co/Zhabotinsky2007\n\nFlavio H Fenton et al. (2008) Cardiac arrhythmia. Scholarpedia, 3(7):1665. — https://ve42.co/Cardiac\n\nCherry, E. M., & Fenton, F. H. (2008). Visualization of spiral and scroll waves in simulated and experimental cardiac tissue. New Journal of Physics, 10(12), 125016. — https://ve42.co/Cherry2008\n\nTyson, J. J. (1994). What everyone should know about the Belousov-Zhabotinsky reaction. In Frontiers in mathematical biology (pp. 569-587). Springer, Berlin, Heidelberg. — https://ve42.co/Tyson1994\n\nWinfree, A. T. (2001). The geometry of biological time (Vol. 12). Springer Science & Business Media. — https://ve42.co/Winfree2001\n\nThe Manim Community Developers. (2021). Manim – Mathematical Animation Framework (Version v0.13.1) [Computer software]. https://www.manim.community/\n\nSpecial thanks to Patreon supporters: Mac Malkawi, Oleksii Leonov, Michael Schneider, Jim Osmun, Tyson McDowell, Ludovic Robillard, jim buckmaster, fanime96, Juan Benet, Ruslan Khroma, Robert Blum, Richard Sundvall, Lee Redden, Vincent, Lyvann Ferrusca, Alfred Wallace, Arjun Chakroborty, Joar Wandborg, Clayton Greenwell, Pindex, Michael Krugman, Cy 'kkm' K'Nelson, Sam Lutfi, Ron Neal\n\nWritten by Derek Muller and Petr Lebedev\nAnimation by Fabio Albertelli and Jakub Misiek\nSimulations and 3D Animation by Jonny Hyman\nFilmed by Derek Muller and Raquel Nuno\nEdited by Derek Muller\nAdditional video supplied by Getty Images\nThumbnail by Ignat Berbeci\n\nMore footage from NASA's Scientific Visualization Studio\n\n100 metronome video from https://www.youtube.com/watch?v=suxu1bmPm2g\n\nIntro animation by Jorge Cham\n\nThanks for the BZ footage from SteinbockGroup: https://www.youtube.com/watch?v=IJn1ssZEyns and \nNileRed https://youtu.be/LL3kVtc-4vY\n\nAnimation of waves in the heart from The Virtual Heart/ EM Cherry/ FH Fenton — https://ve42.co/Cardiac and https://ve42.co/Cherry2008\n\nChemical materials and protocol provided by Mike Morris and the UCI Chemistry Outreach Program https://www.chem.uci.edu/~jsnowick/outreach/UCI_Outreach/index.html\n\nThanks to Alie Ward for title/thumbnail consultation\nThanks to Dr Juliette Becker and Dr James O'Donoghue for the planetary science help\n\nMusic from Jonny Hyman, Epidemic Sound https://epidemicsound.com \"Seaweed\" \"Deeper Than The Ocean\" \"Ripple Effect\"\nMusic also from Artlist https://artlist.com \"Children of Mystery\"\n\nThumbnail by Ignat Berbeci", "link": "https://www.youtube.com/watch?v=t-_VPRCtiUg", "date_published": "2021-03-31 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]