[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Mass Effect Lore: Geth And The Quarians", "description": "This week our Mass Effect lore series takes a look at the Geth, once a subservient race of AI, forced to rebel, and their creators, the nomadic Quarians. \n\nMass Effect: Legendary Edition is tantalisingly close, and whether it's your first time with the trilogy or you're a diehard fan, there's a lot of lore to digest. We've put together a series to catch you up to speed on the biggest and most important stories in the Mass Effect universe that happen before the first game, so you can jump into the Legendary Edition knowing all the whos, whats, and wheres in the Milky Way.\n\nIn the video above, Lucy takes you through the conflict between the Geth and the Quarians. At the start of Mass Effect, the Quarians are a nomadic tribe living on board a flotilla of ships, drifting from one place to the next, with no home. The Geth are threatening the peace of the galaxy, and are formidable foes for Shepard and their squad. But it wasn't always that way. What lead the Geth to turn on their creators, and what outcome does the Geth War have on the galaxy? Lucy delves into all this and more.\n\nWe have weekly Mass Effect lore videos up on the channel right now, so subscribe at youtube.com/GameSpot to get up to speed. Mass Effect: Legendary Edition launches on May 14 on PC, PS4, and Xbox One.", "link": "https://www.youtube.com/watch?v=S93giD0zGNw", "date_published": "2021-05-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil Village's Ending Explained", "description": "There’s a lot to digest during the final hours of Resident Evil Village. So let’s get into the nitty gritty of all this, and explain exactly what went down, and the ripple effect it has on the rest of the series.\n\nResident Evil Village opens a huge can of moldy worms in its final hours that recontextualizes the entire franchise. It's also an ending that leaves many cliffhangers to explore in the future.\n\nEthan Winters has been through a lot since his trek through the bayou in Resident Evil 7, rescuing his missing wife Mia from the Baker household. As it turned out, Mia was working for a crime syndicate known as The Connections, which were responsible for looking after the bioweapon known as Eveline. It was Mia's job to be a caretaker for Eveline. Once Ethan and Mia escape the grasps of Eveline in the end of RE7, with the help of Chris Redfield, they're put into hiding in a European village so The Connections cannot find them, and during that time, Ethan and Mia start a family with their daughter Rose. All was well, that is until Chris Redfield shows up and murders Mia, and kidnaps Rose. But that's only the beginning of what this ending begins to explain.\n\nIn the above video, we dissect the motives behind Chris Redfield, and most importantly, the game's antagonist Mother Miranda, and the impact she has on the game's lore (which is very deep). We'll also piece together how Umbrella Corporations fits into Village, and the ripple effect that has on its other games, as well as future ones. Also, is Lady Dimitrescu actually a vampire? Watch the video to find out.\n\nThe Complete Resident Evil Timeline Explained: https://youtu.be/QkPgowr-T9g\nOur review: https://youtu.be/Kmkm-LQbcDo", "link": "https://www.youtube.com/watch?v=uQ-zJhZczZk", "date_published": "2021-05-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Rising Storm 2: Vietnam’s Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of Rising Storm 2: Vietnam, including the M79 grenade launcher, the M9A1 flamethrower, and the M60 light machine gun.\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of Rising Storm 2: Vietnam and compares them to their real-life counterparts.\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can purchase Jonathan's book here - https://www.headstamppublishing.com/bullpup-rifle-book", "link": "https://www.youtube.com/watch?v=o0m9NLPEncc", "date_published": "2021-05-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]