[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Black Coffee: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nAbby O'Neill | March 11, 2021\nBlack Coffee, a figurehead of the global South African dance movement, is known for his undeniable DJ sets and AfroHouse anthems that (under normal circumstances) light up dancefloors around the world. He brings that same feeling to his Tiny Desk (home) concert, but with a unique configuration: live instrumentation. \n\nBorn in Durban and raised in the Eastern Cape in Mthatha, Black Coffee’s subculture of soulful house transports me to an elevated state. If you ask me, this is the pure embodiment of feel-good music. That shouldn’t be a surprise, because house music has always been about love. It’s a form of sonic escapism that provides a sanctuary for all beings, regardless of race, age, or gender. Therefore, it’s only fitting that Black Coffee rocks a tee embossed with “I Heart You” across his chest. \n\nShot in the auditorium at the National School of Arts in Johannesburg, Black Coffee tapped students to assist with production as part of their internship. Kicking off the set is “You Rock My World” featuring Soulstar, a classic dance joint from his Africa Rising album whose convergence of pulsating percussion, a calming melody, and the sultry vibes of Soulstar’s voice feels like a spiritual palette cleanser. He follows that up with \"Flava\" and \"Wish You Were Here,” two tracks from his new LP, Subconsciously, whose litany of special guests -- including Diplo and Pharrell -- is a coronation of Black Coffee’s meteoric rise.\n\nSET LIST\n\"You Rock My World\" (feat. Soulstar)\n\"Flava\" (feat. Una Rams and Tellaman)\n\"Wish You Were Here\" (feat. Msaki)\n\nMUSICIANS\nBlack Coffee: DJ\nSoulstar: vocals\nUna Rams - vocals\nTellaman - vocals\nMsaki - vocals\nPansula: percussion\nNduduzo: keys\nGodfrey Mntambo: saxophonist\nMusa Nhlapho: vocals\nSandisiwe Sishuba: vocals\nBonokuhle Nkala-Mtsweni: vocals\n\nCREDITS\nVideo: Julian von Plato, Yolanda Hlakula, Siphe Maphumulo, Lindo Langa Aden McCarthy, Mark Wilson, Bevan Godden, Sims Phakisi, Nick Vetter, DIGMU\nAudio: Steven Grenfell, Icons Shop, Wild & Marr, Julian von Plato\nLighting Technicians: Trisdan Evans, Khaya Radebe\nRunners: Dylan von Plato, Stephen Shrimpton, Langa Gumbi\n\nTINY DESK TEAM\nProducer: Abby O'Neill\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Bob Boilen, Kara Frame, Morgan Noelle Smith\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann\n\n#blackcoffee #tinydesk #nprmusic #afrobeats #housemusic", "link": "https://www.youtube.com/watch?v=npORmybcPdk", "date_published": "2021-03-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]