[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCHnyfMqiRRG1u-2MsSQLbXA", "title": "How An Infinite Hotel Ran Out Of Room", "description": "If there's a hotel with infinite rooms, could it ever be completely full? Could you run out of space to put everyone? The surprising answer is yes -- this is important to know if you're the manager of the Hilbert Hotel. \n\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀ \n\nReferences: Ewald, W., & Sieg, W. (2013). David Hilbert's Lectures on the Foundations of Arithmetic and Logic 1917-1933. Springer Berlin Heidelberg. -- https://ve42.co/Ewald2013\n\nGamow, G. (1988). One, two, three--infinity: facts and speculations of science. Courier Corporation. -- https://ve42.co/Gamow1947\n\n ▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀ \n\nSpecial thanks to Patreon supporters: Paul Peijzel, Crated Comments, Anna, Mac Malkawi, Michael Schneider, Oleksii Leonov, Jim Osmun, Tyson McDowell, Ludovic Robillard, jim buckmaster, fanime96, Juan Benet, Ruslan Khroma, Robert Blum, Richard Sundvall, Lee Redden, Vincent, Marinus Kuivenhoven, Alfred Wallace, Arjun Chakroborty, Joar Wandborg, Clayton Greenwell, Pindex, Michael Krugman, Cy 'kkm' K'Nelson, Sam Lutfi, Ron Neal \n\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀ \n\nAnimation by JD Pounds and Jonny Hyman\nThumbnail by Ivy Tello\nMusic by Jonny Hyman and from Epidemic Sound and E's Jammy Jams (Hotel Lavish - Radio Nights, Steps in Time - Golden Age Radio, What Now - Golden Age Radio, Book Bag - E's Jammy Jams, Arabian Sand - E's Jammy Jams, Firefly in a Fairytale - Gareth Coker)\nWritten By Derek Muller and Alex Kontorovich\nSound Design by Jonny Hyman\n\n ▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀", "link": "https://www.youtube.com/watch?v=OxGsU8oIWjY", "date_published": "2021-05-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]