[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Vaccine trial whistle blower", "description": "Covid-19: Researcher blows the whistle on data integrity issues in Pfizer’s vaccine trial, \nRevelations of poor practices at a contract research company\nhttps://www.bmj.com/content/375/bmj.n2635\n\nPfizer’s pivotal covid-19 vaccine trial, \n\nraise questions about data integrity and regulatory oversight\n\nThis was the original paper\n\nhttps://www.nejm.org/doi/full/10.1056/nejmoa2034577\n\n Autumn 2020\n\nPfizer’s chairman and chief executive, Albert Bourla\n\nAs I’ve said before, we are operating at the speed of science\n\nVentavia Research Group\n\nhttps://www.ventaviaresearch.com\n\nResearchers were testing Pfizer’s vaccine at several sites in Texas\n\nA regional director, Brook Jackson has told The BMJ that the company\n\nfalsified data\n\nunblinded patients\n\nemployed inadequately trained vaccinators\n\nwas slow to follow up on adverse events reported in Pfizer’s pivotal phase III trial\n\nStaff who conducted quality control checks were overwhelmed by the volume of problems they were finding. \n\nUS Food and Drug Administration (FDA) were informed\n\nVentavia fired her later the same day. \n\nThe BMJ has been provided with dozens of internal company documents, photos, audio recordings, and emails.\n\nShe repeatedly informed her superiors\n\npoor laboratory management\n\npatient safety concerns\n\ndata integrity issues\n\nthat drug assignment confirmation printouts were being left in participants’ charts, accessible to blinded personnel (later corrected)\n\ncompany wasn’t able to quantify the types and number of errors they were finding when examining the trial paperwork for quality control\n\nICON, the contract research organisation\n\nhttps://www.iconplc.com/services/clinical-research-services/data-management/?creative=528047015643&keyword=small%20clinical%20research%20organizations&matchtype=b&network=g&device=c&campaignid=6471798703&adgroupid=124362508020&feeditemid=54055202224&adposition=&gclid=CjwKCAjwz5iMBhAEEiwAMEAwGB-tlgJ18Rir0V_YfW6YdQNvt33JmuRwwwZiAkL22Zh99BWJbYLb2xoCWKUQAvD_BwE\n\nICON then highlighted over 100 outstanding queries older than three days\n\nWorries over FDA inspection\n\nConcerns raised\n\nParticipants placed in a hallway after injection and not being monitored by clinical staff\n\nLack of timely follow-up of patients who experienced adverse events\n\nProtocol deviations not being reported\n\nVaccines not being stored at proper temperatures\n\nMislabelled laboratory specimens\n\nTargeting of Ventavia staff for reporting these types of problems.\n\nFDA advisory committee meeting held on 10 December 2020\n\nProblems at Ventavia not mentioned\n\nThe next day the FDA issued the authorisation of the vaccine\n \nIn August this year, after full FDA approval of Pfizer’s vaccine\n\nFDA published that 9 of the trials 153 sites were inspected\n\nFDA, full trial swabs were not taken from 477 people with suspected cases of symptomatic covid-19\n\nOther employees’ accounts\n\neverything that you complained about was spot on\n\nTwo former Ventavia employees spoke to The BMJ anonymously for fear of reprisal and loss of job prospects in the tightly knit research community\n\nI don’t think it was good clean data\n\nIt’s a crazy mess\n\nPfizer has hired Ventavia as a research subcontractor on four other vaccine clinical trials\n\ncovid-19 vaccine in children and young adults\n\npregnant women\n\na booster dose\n\nan RSV vaccine trial\n\nNCT04816643,  NCT04754594,  NCT04955626,  NCT05035212).", "link": "https://www.youtube.com/watch?v=THv33zWykJc", "date_published": "2021-11-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Africa, better than US and UK", "description": "The news is looking good\n\nWefwafwa medical videos channel \nhttps://www.youtube.com/channel/UCzsLklGgOttU3Se-WGLp7ow\n\nThis content on Ws channel\nhttps://www.youtube.com/watch?v=vcmmol4oPUU\n\nNew music\nhttps://www.youtube.com/watch?v=Q5Cma56ixcI", "link": "https://www.youtube.com/watch?v=F37KsLA4CPI", "date_published": "2021-11-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Giving injections wrongly", "description": "Basically, we need to change the vaccine administration guidelines to include precautionary aspiration, prior to pushing in the vaccine. This will prevent cases of inadvertent intravascular administration of vaccine.\n\nHere is some discussion to suggest inadvertent intravascular vaccine administration is a variable in the aetiology of complications after adenoviral vector vaccine administration and after mRNA vaccines.\n\nThese adverse events, although rare have reduced public confidence in covid vaccination, especially amongst the young, where vaccine rates are lowest.\n\nIt has long been known that intravenous injection of adenovirus leads to TTS in mice\n\nhttps://ashpublications.org/blood/article/109/7/2832/125650/Adenovirus-induced-thrombocytopenia-the-role-of\n\nNow, new covid vaccine specific work agrees with this previous work\n\nThrombocytopenia and splenic platelet directed immune responses after intravenous ChAdOx1 nCov-19 administration (29th June 2021)\n\nhttps://www.biorxiv.org/content/10.1101/2021.06.29.450356v1\n\nThe authors conclude, ‘Our work contributes to the understanding of TTS and highlights accidental intravenous injection as potential mechanism for post-vaccination TTS.’ \n\n‘We show that intravenous but not intramuscular injection of ChAdOx1 triggers platelet-adenovirus aggregate formation and platelet activation.’ \n\n‘Hence, safe intramuscular injection, with aspiration prior to injection, could be a potential preventive measure when administering adenovirus-based vaccines.’\n\nAlso after giving mRNA vaccines\n\nA new study finds that giving mice intravenous mRNA vaccine also causes heart inflammation in mice. \n\nIntravenous Injection of Coronavirus Disease 2019 (COVID-19) mRNA Vaccine Can Induce Acute Myopericarditis in Mouse Model (August 2021)\n\nhttps://academic.oup.com/cid/advance-article/doi/10.1093/cid/ciab707/6353927\n\n‘Our study indicates that IV injection of vaccines might partially contribute to this clinical phenotype, thus warranting a reconsideration of the practice of IM injection without aspiration, which carries the risk of inadvertent IV injection.’ \n\nAgreement from ‘fact check’ from Leo Nicolai, Cardiology Fellow, Ludwig Maximilian University of Munich:\n\n(German Centre for Cardiovascular Research)\n\nhttps://healthfeedback.org/claimreview/incorrect-vaccine-administration-is-a-potential-cause-of-post-vaccine-adverse-effects-but-more-research-is-still-needed-to-confirm-or-reject-this-hypothesis/?fbclid=IwAR0nBbM6v0V2WPFn4LxIdfR4FNAvIzLGKhzFPdQPG8mu_FR1InB8OzYQgMc\n\n‘Indeed, there is peer-reviewed work showing in mice that possibly intravenous injection of mRNA vaccine leads to myocardial inflammation.’\n\n‘that intravenous injection of adenoviral vector based vaccine (AZ1222, ChAdOx1) leads to thrombocytopenia and platelet-directed immune responses, offering a possible explanation for vaccine-induced thrombosis/thrombocytopenia’\n\n‘these data might indicate a simple measure to lower the incidence of vaccine-induced side effects,’\n\n‘There is a lack of data on frequency and effects of IV injection in humans.’\n\nDenmark has changed their national guidelines\n\nhttps://en.ssi.dk/news/epi-news/2021/no-19-21---2021\n\nBased on a precautionary principle, we recommend aspiration before injection.\n\nhttps://www.youtube.com/watch?v=H7inaTiDKaU\n\nEvidence from Dr. Peter Gaillard (microparticulate pharmacologist)\n\nhttps://www.linkedin.com/pulse/astrazeneca-vaccine-pull-back-push-through-pieter-j-gaillard/?trk=pulse-article_more-articles_related-content-card \n\nCase study evidence\n\nMetallic taste in the mouth seconds after ‘intramuscular’ mRNA vaccine administration, (in the absence of an allergic reaction)\n\nhttps://www.youtube.com/watch?v=hbjuWs99CrE\n\nOther video-based discussions\n\n26th September 2021\n\nhttps://www.youtube.com/watch?v=nBaIRm4610o\n\n30th September 2021\n\nhttps://www.youtube.com/watch?v=KgVsd6qoyU4", "link": "https://www.youtube.com/watch?v=HsACTX0_ihs", "date_published": "2021-11-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]