[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Elden Ring Gameplay Preview Breakdown", "description": "Just a week to go before Elden Ring's Network Test, Bandai Namco and Fromsoftware released a major gameplay preview for Elden Ring. The Elden Ring Gameplay Preview included all new footage of Godrick the Golden, ruler of Stormveil. Footage of the Limgrave Region was also revealed, with NPCs like Alexander the Iron Fist, Melina, and Rogier shown. With so much shown, Dave Klein (DaveControl breaks down the Elden Ring Gameplay Preview.\n\nWhile the Elden Ring Gameplay Preview was filled with footage of the Limgrave Region and Stormveil Castle, we also saw many mechanics finally shown. The Open World of Elden Ring was further explained, we got a glimpse into Elden Ring's Map and how that would work, as well as a look at an Elden Ring dungeon and legacy dungeon. Elden Ring Co-Op was also finally shown, and Elden Ring PvP was confirmed.\n\n#EldenRing", "link": "https://www.youtube.com/watch?v=2Pcg6bgm9xk", "date_published": "2021-11-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To GTA 5’s Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of Grand Theft Auto 5, including a pink Rocket Launcher, an uncharacteristically quiet Desert Eagle, and a blinged out AK47.\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of GTA 5 and compares them to their real-life counterparts.\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020", "link": "https://www.youtube.com/watch?v=pIZBBxW4m-g", "date_published": "2021-11-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Animal Crossing New Horizon 2.0 Update - How To Unlock Everything ASAP", "description": "Animal Crossing: New Horizon's free update adds a ton to the game and you’ll want make sure you take care of a few things right away if you want access to all the new content as soon as possible.\n\nFirst thing you’ll want to do is head over to resident services and spend a lot of time over at the ABD. Hope you’ve been saving up those nook Miles cause you have a lot to purchase. Right away you’ll want to buy all the upgrades you can unlock instantly. That would be the Island Life 101 Service, Be a Chef! DIY Recipes+, Pro Camera App, Custom Designs Patterns+, Pro Decorating License, Custom Fencing in a Flash, New Reactions Notebook, and Top 4 Rad Hairstyles. There are also a few new recipes; if you’re lucky, one or both of the two daily fence recipes will be one of the nine new fences available. Additionally, there is a recipe for a wooden storage shed, which will allow you to access home storage from anywhere on your island. Lastly, there’s a donation box recipe which can act as a tip jar for visitors - only the island owner can collect donations from the donation box.\n\n#AnimalCrossing #NewHorizon", "link": "https://www.youtube.com/watch?v=ibhYFPhpYVI", "date_published": "2021-11-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Vanguard - Full Campaign & Story Cinematics", "description": "MAJOR SPOILERS AHEAD! \n\nCall of Duty: Vanguard's story of Task Force One is told through a mix of in-game narrative and pre-rendered CG cutscenes. In this video, we bring you the complete story of Vanguard and the rise of the first special forces group led by Arthur Kingsley.\n\nTimestamps:\n00:00 - Phoenix\n04:56 - \"Captured\"\n10:10 - Operation Tonga\n18:07 - \"The Lion's Den\"\n26:05 - Stalingrad\n37:14 - \"Just A Tourist\"\n43:08 - The Battle of Midway\n44:33 - \"Tested\"\n48:52 - Numa Numa Trail\n01:00:27 - \"Setting the Stage\"\n01:02:01 - Lady Nightingale\n01:10:04 - \"The Intelligent Thing\"\n01:13:44 - The Rats of Tobruk\n01:20:11 - \"The Yarn\"\n01:20:55 - The Battle of El Alamein\n01:25:53 - \"Plan B\"\n01:30:52 - The Fourth Reich\n01:36:41 - \"Vanguard\"\n\nCheck out our round up of Call of Duty: Vanguard's entire campaign as told by in-game cutscenes and cinematics. Major spoilers ahead- this video features the story of Vanguard from the opening cutscene to the game's final moments.\n\nCall of Duty: Vanguard tells a heroic tale of Task Force One; A team of the best soldiers from military branches around the world. The first of its kind, this special forces group's mission is to track down information about \"Project Phoenix\"- classified intel from the German Army with plans to shift the balance of WWII in their favor.\n\nStay tuned to GameSpot for our review of Call of Duty: Vanguard, as well as continued coverage on Warzone's latest Pacific map Caldera. Look out for livestreams, gameplay videos and more coming soon.", "link": "https://www.youtube.com/watch?v=1B4IS0tfInc", "date_published": "2021-11-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Vanguard Remastered Maps From World at War", "description": "Call of Duty: Vanguard launches with 20 multiplayer maps, three of which are actually remakes from 2008's Call of Duty: World at War. Let's take a look at how the maps have changed with this side-by-side comparison.\n\nTimestamps:\n00:00 - Intro\n00:16 - Castle Map\n02:17 - Dome Map\n03:27 - Sub Pens Map\n\nCall of Duty: Vanguard launched on November 5th with the most multiplayer maps to date. Within these 20 maps lie a few remakes from Call of Duty's past, specifically from 2008's Call of Duty World at War. In this video we'll be taking a look back at the original maps and see how they compare to their remade counterparts 13 years later.\n\nWe begin with the fan-favorite \"Castle\" map. The medium sized battlefield was remembered for its few key elevation spots, as well as multiple routes that cut through the center as well as it's hectic west area where its stone stairs were a memorable hotspot. Next is the wildly popular \"Dome\". This small map was the \"Nuketown\" before the release of Black Ops 1. Its imamate, square design made battles here a cluster, no matter the player count. Lastly, the Sub Pens made was remade for both multiplayer as well as campaign. Featured early on in the \"Phoenix\" mission, this map has seen the most changes in it's redesign.\n\nCall of Duty Vanguard is finally here! Stay tuned to GameSpot for continued coverage on this year's COD including gameplay, livestreams, and updates on Warzone's new Pacific map Caldera coming soon.", "link": "https://www.youtube.com/watch?v=R1OXUWkEpCE", "date_published": "2021-11-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Vanguard Review", "description": "Tweaks in multiplayer and Zombies advance the Call of Duty franchise overall, and an emphasis on distinct characters makes Vanguard's story fun, but it doesn't always mix well with the series' gameplay.", "link": "https://www.youtube.com/watch?v=_hrSnVfch1s", "date_published": "2021-11-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "EA's Plan After Battlefield 2042 | GameSpot News", "description": "In this episode of GameSpot News, we talk about how a Battlefield free-to-play could happen someday, Nintendo reiterating a plan to launch a new console before 2100, New World’s 1.0.5 patch, and 30-Series GPUs being stolen off a truck. \n\nIn this video, we talk about how a Battlefield free-to-play could happen someday. EA CEO Andrew Wilson said it \"probably makes sense\" for the Battlefield series to have a free-to-play component some day in the future.  \n\nDeVante also talks about Nintendo sharing a slide related to its \"future outlook,\" and this included mention of an \"integrated hardware-software next gaming system\" that will arrive by the end of 2099.\n\nLater in the video, New World patch 1.0.5 cracks down on gold sellers, addresses gold duplication exploits and EVGA 30-Series GPUs being stolen off a truck.", "link": "https://www.youtube.com/watch?v=iO894scMaU8", "date_published": "2021-11-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]