[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "Is elementary OS REALLY user friendly?", "description": "Download Safing's Portmaster for FREE and take control of your network traffic: https://safing.io/portmaster\n\n\n\nGet your Linux desktop or laptop here: https://slimbook.es/en/\n\n\n\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nI also do a Gaming Podcast: https://www.youtube.com/channel/UCbRPZ11S1quJ4ESoj42A3ug\nJoin us on our new Discord server: https://discord.gg/xK7ukavWmQ\nTwitter : http://twitter.com/thelinuxEXP\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\nFollow me on ODYSEE: https://odysee.com/@TheLinuxExperiment:e\nOr join ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\n\n\n00:00 Intro\n00:34 Sponsor: Safing\n01:32 Complete Beginner POV\n07:12 Windows User POV\n10:36 macOS User POV\n13:57 Linux User POV\n15:11 Parting Thoughts\n\n\nLet's start with the POV of someone who has very rarely used any kind of computer or OS. On that front, elementary OS offers a very approachable experience on the surface.\n\nYou get a simple experience: the top panel clearly states what it does, with an applications link and a search icon, easy to understand, the date and time, and a few system indicators, including the familiar power button glyph.\n\nThe application design is also very simple. The close button and maximize button are relatively easy to understand, and the lack of minimize button won't disturb someone who isn't used to computers, as they won't have picked up that habit using something else.\n\nThe settings won't scare away computer beginners either.\n\nInstalling applications is pretty easy on elementary OS as well, but the AppCenter is barren out of the box, only listing elementary OS applications that have been submitted to its flatpak remote.\n\nThis basically means that elementary OS, while it has many quality apps, is completely unsuitable for a complete beginner, new to computers.\n\nelementary OS, interface-wise, is probably one of the easiest systems to use, even easier than GNOME, IMO. But the lack of graphically installable applications out of the box just makes it really hard to recommend to a complete beginner, unless you're there to add flathub for them before you give them their device.\n\n\nFor someone used to Windows, elementary won't hold much appeal out of the box.\n\nInstead of a taskbar, you get a panel and a dock, and the functionality is basically spread out between multiple places. The application style, while easy to grasp and understand, will also be a big departure from what Windows 10 and 11 do.\n\nThe button position, on the other hand, will definitely confuse windows users.\n\nGoing into the settings, Windows users will get a Control Panel like experience, with a grid of icons, and a few options inside of each. Of course, there are a lot less options here than on Windows, so a power user will definitely feel that this is lacking.\n\nAnd we come to the app installation thing again. The same problem applies here: without any prior knowledge of Linux, there is NO WAY a user will be satisfied with the elementary OS app situation.\n\n\nFor Windows users, I'd say elementary OS is just not well suited.\n\n\n\n\n\nOn the surface, Mac OS users will have a nice time with elementary OS. They'll find most of their habits undisturbed. One point of contention will be the lack of application indicators. On mac OS, apps can fit their icons in the top panel, on elementary OS, they can't.\n\nelementary OS uses the same shortcut out of the box to open the applications menu, than what mac uses for spotlight, so there's at least a point of similarity here.\n\nThe design style of applications is really close to what mac OS users expect, with a dark and light theme, accent colors, and headerbars, it's virtually identical.\n\nThe close button is in the same place, but the maximize button isn't, and doesn't work in the same way as it does on mac oS.\n\nIn terms of settings, I'd say elementary's settings are virtually identical to macOS's.\n\nAnd again, we come to the disappointing application situation. The TLDR is the same here as for windows users.", "link": "https://www.youtube.com/watch?v=NYUIKdIY7Y8", "date_published": "2021-11-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]