[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCFLwN7vRu8M057qJF8TsBaA", "title": "Climate Change Is An Absolute Nightmare - School Friendly Version!", "description": "Welcome to my School Friendly Climate Change Video!\n\nSo. What is Climate Change? Do you know the facts? No?\n\nWell I personally had no idea. One day it just hit me, I knew very little about climate change. Even with a useless degree in chemistry, climate change is a confusing mess of strange and difficult to understand information.\n\nI made this video to gather all the facts I could find about climate change, in a fun way, and without any bias on my part. I wanted anyone who watched this video (and myself too!) to understand all the important facts relating to climate change. Non-scientists welcome. \n\nScience is exciting! It’s just school and most of our education systems aren’t…\n\nIn a few months this video will be uploaded as to remove any language or scenes not suitable for schools, so it can be used to teach about climate change in schools. \n\nGames used to make the space visuals\nSpaceEngine: https://store.steampowered.com/app/314650/SpaceEngine/\nUniverse Sandbox: https://store.steampowered.com/app/230290/Universe_Sandbox/\n\nDr. Simon Clark provided much of the climate change graphics at the end, subscribe!: https://www.youtube.com/user/SimonOxfPhys\n\nReferences (in order):\nEast India trading company measuring climate: https://cp.copernicus.org/articles/8/1551/2012/cp-8-1551-2012.html\n\nEarth temperature last 100 years graph: https://ourworldindata.org/co2-and-other-greenhouse-gas-emissions\n\nSun’s solar activity and amount of radiance hitting the Earth: https://climate.nasa.gov/faq/14/is-the-sun-causing-global-warming/\n\nEarth’s temperature over the last 800,000 years: https://earthobservatory.nasa.gov/features/GlobalWarming/page3.php\n\nIce core records used to measure the Earth’s temperature and CO2 levels going back:\nhttps://earthobservatory.nasa.gov/features/GlobalWarming/page3.php\n\nEarth’s temperature over the last 400,000 years: https://saylordotorg.github.io/text_general-chemistry-principles-patterns-and-applications-v1.0/s09-05-energy-sources-and-the-environ.html\n\nGlacial periods, mainly the most recent one: https://en.wikipedia.org/wiki/Last_Glacial_Period\n\nGlacial and interglacial cycles: https://www.ncdc.noaa.gov/abrupt-climate-change/Glacial-Interglacial%20Cycles\n\nMilankovitch cycles and Obliquity: https://climate.nasa.gov/news/2948/milankovitch-orbital-cycles-and-their-\nrole-in-earths-climate/\n\nRate of Earth’s temperature changes in the past: https://earthobservatory.nasa.gov/features/GlobalWarming/page3.php\n\nGreenhouse gasses and how they work: https://www.epa.gov/ghgemissions/overview-greenhouse-gases\n\nEarth’s CO2 concentration over the last 800,000 years: https://www.epa.gov/ghgemissions/overview-greenhouse-gases\n\nMeasuring Earth’s CO2 levels in ice cores: https://www.bas.ac.uk/data/our-data/publication/ice-cores-and-climate-change/\n\nEarth’s temperature VS CO2 concentration during the last glacial period (references below video): https://www.youtube.com/watch?time_continue=166&amp;v=dHozjOYHQdE&amp;feature=emb_title\n\nThe Earth’s temperature changes, then it’s CO2 concentration follows: https://skepticalscience.com/co2-lags-temperature.htm\n\nGasses absorb different amounts as the temperature changes: https://antoine.frostburg.edu/chem/senese/101/solutions/faq/temperature-gas-solubility.shtml\n\nMilankovitch cycles may cause the Earth to release CO2, which drives temperature change:\nhttps://skepticalscience.com/co2-lags-temperature-intermediate.htm\n\nBloomberg graphs of how different things affect the Earth’s temperature: https://www.bloomberg.com/graphics/2015-whats-warming-the-world/\n\nChanges to Carbon-13 and Carbon-14 levels in Earth’s atmosphere: https://www.skepticalscience.com/co2-increase-is-natural-not-human-caused.htm\n\nHow the Earth’s temperature will change based on the amount of CO2 we are currently producing: https://climateactiontracker.org/global/temperatures/\n\nBreakdown of all human produced CO2: https://www.youtube.com/watch?v=GkbuV_a-rvs&amp;t=\n\nInformation used to make the graphs from the above video, subsidy amounts for fossil fuels and renewable energy: https://www.ren21.net/wp-content/uploads/2019/08/Full-Report-2018.pdf\n\nRenewable energy and it’s growth: https://www.c2es.org/content/renewable-energy/\n\nBreakdown of CO2 produced by food manufacture, references below video: https://www.youtube.com/watch?v=mmNcOCwtFeg&amp;t=137s", "link": "https://www.youtube.com/watch?v=6_5PyOreBbo", "date_published": "2021-04-16 20:00:01+00:00", "persistent": false, "user": null, "language": "en-US"}]