[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Prince Royce: Tiny Desk (Home) Concert", "description": "From Sept. 15 through Oct. 15, Tiny Desk is celebrating Hispanic Heritage Month with an \"El Tiny\" takeover of the (home) concert series, featuring J Balvin, Camila Cabello and several more musicians from all corners of Latinidad.\n\nAnamaria Sayre | October 6, 2021\nAfter years spent working the global stage, Prince Royce returns home to claim his rightful throne in this Tiny Desk (home) concert. Performing his entire \"El Tiny\" set live from an unassuming barbershop chair in The Bronx, the Dominican-American superstar dazzles in this homecoming performance with the unguarded swagger characteristic of a true rey de la gente.\n\nPrince Royce instantly grips ears and hearts with a stunning performance of \"Corazón Sin Cara.\" Leading with buttery vocals and easy electric guitar riffs, he serves smooth verses with the kind of suave appeal that would leave any viewer wanting to be a bachata princess. Transitioning between tracks with a sweet note about representing la cultura, he dives straight in with more traditional bachata beats in a performance of his recent release \"Carita de Inocente.\"\n\nThe barbershop is where the prince discovered the building blocks to create an empire in the image of a people and culture that feel like home. In an intimate moment between songs, Prince Royce shares that it was where he would go to hear what people were listening to in the streets — bachata, merengue, mambo. His New York Dominican sound feels natural in the space.\n\"Porque me recuerda a mis inicios (because it reminds me of my beginnings),\" he says of his choice in stage.\n\nFrom there he delivers \"Lao o Lao,\" an impassioned song about willingly giving up lavish objects for love. He closes out the show with a performance of a tropical, legacy pick \"Darte un Beso.\"\nPrince Royce's \"El Tiny\" concert makes it easy to imagine a curly-haired kid sitting in that same, too-big-for-him silla, dreaming of a day when the chair would fit just right and he could come back to his barrio and own the seat as royalty.\n\nSET LIST\n • \"Corazón Sin Cara\"\n • \"Carita de Inocente\"\n • \"Lao' a Lao'\"\n • \"Darte Un Beso\"\n\nMUSICIANS\n • Prince Royce: vocals\n • Christopher Mercedes: bass\n • Gio Williams: guitar\n • Johan Beltre: keyboard\n • Otoniel Vargas: drums\n • Christopher Vegazo: güira\n • Wellington Flores: bongos\n • Brisila Barros: vocals\n\nCREDITS\n • Video: Javier Cañizales, Daniel Eguren\n • Audio: Jose \"Sapo\" Gonzalez, Javier Delgado, Joe Lizano\n • Musical Director: Christopher Mercedes\n • Executive Producers: Mayte Calzacorta, Gaby Herrera\n • Production Manager: William Cortes\n • Assistant Director: Rafael Yanez\n • Art Department: Natacha Casafus\n • Creative Direction: Daniel Eguren, Gaby Herrera\n • Post Supervision: Pimpi Castro\n\nTINY DESK TEAM\n • Producers: Anamaria Sayre, Bobby Carter\n • Video Producer: Maia Stern\n • Audio Mastering: Josh Rogosin\n • Alt.Latino 'El Tiny' Team: Felix Contreras, Reanna Cruz, Anaïs Laurent, Stefanie Fernandez\n • Tiny Production Team: Bob Boilen, Kara Frame, Sofie Hernandez-Simeonidis\n • Executive Producer: Keith Jenkins\n • Senior VP, Programming: Anya Grundmann\n\n#princeroyce #eltiny #nprmusic #tinydesk", "link": "https://www.youtube.com/watch?v=-jLebs9xraI", "date_published": "2021-10-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]