[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "KDE Plasma 5.23 (25th anniversary edition) - New Breeze theme, accent colors, and Wayland", "description": "The first 1,000 people to use this link will get a 1 month free trial of Skillshare: https://skl.sh/thelinuxexperiment10211\n\nGet your Linux desktop or laptop here: https://slimbook.es/en/\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nJoin us on our new Discord server: https://discord.gg/xK7ukavWmQ\nTwitter : http://twitter.com/thelinuxEXP\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\nFollow me on ODYSEE: https://odysee.com/@TheLinuxExperiment:e\nOr join ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\n00:00 Intro\n01:29 Desktop\n05:58 System Settings\n07:04 Wayland\n\n\nThe new theme had been long in the making. Everything has a more polished edge to it, less flat, with more gradients and shadows. The highlights and depth are more pronounced and the elements feel more\" tactile\", like they're ready to be interacted with and not just painted on a sheet of paper.\n\nScrollbars have been made a bit bigger to make them easier to interact with, there's a new spinning gear when you're waiting for something to happen, and when you open a widget that touches the panel's edge, you'll see a highlight effect as well. Widgets also will use a blurred background instead of being either opaque or transparent.\n\nThe right click menu now uses a nicer highlight for elements on hover, not just a solid color, which looks pretty good. Unfortunately, that style isn't re-used in source views like Dolphin's sidebar, or the system settings.\n\nThe changes also affect Breeze dark, and I feel they give this dark variant a lot more contrast and depth as well. \n\nOn top of that theme, KDE 5.23 introduces accent colors. You get  a nice selection row in the colors tab, with predefined colors, but you can also use a color picker or set up your own.\n\nThe Kickoff menu has also received a lot of improvements. First, you can view apps in a grid or a list, in the favorites AND all categories of the menu. You can also pin the menu to the screen if you want to have it always up, in that case, pressing the super key will dismiss the menu.\nYou can also configure the power and session action buttons and decide to show the captions or not.\n\nNow there are a lot of smaller desktop changes as well:\n\nWhen a notification pops-up, you can use control + C to copy its contents to the clipboard, and this clipboard now remembers 20 items, and has an option to only keep what you explicitly copy and not keep the selected text that you could paste using the middle mouse click.\n\nThe Global menu is supposed to have a more menu like appearance, but I can't say I found it looked very different, especially since the menu header doesn't use the new highlight style from Breeze.\n\nYou can disable IPv6 in the connection settings if you want to, and plasma now shows you more information about the network you're connected to, including the speed, and the audio volume applet will now differentiate between apps that are playing audio, and apps that are recording audio.\n\nIn terms of the system settings, there also have been a lot of smaller improvements.\n\nThe Feedback page now shows a history of what you chose to send, so you can know what you sent exactly. When changing your display settings, you'll now get a timer to let you revert the changes if they don't fit.\n\nIf you prefer only enabling bluetooth when you need it, you can change its default status on login.\n\nOn the Night Color page, you now get a small privacy warning, telling you that it uses geolocation using a 3rd party service.\n\nThe most important change, though, is in the search feature of the settings. They added a lot of keywords to make that search more useful. \n\nNow, Discover, the app store for KDE is now faster to load. It will also show you the source you'll use to install an application, directly in the install button.\n\nAs with every new release of Plasma, we also get improvements to Wayland support0\nThe system tray will tell you if something is recording the screen, and will let you cancel it if it's undesired.", "link": "https://www.youtube.com/watch?v=6kzggGR2OHo", "date_published": "2021-10-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]