[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "The Racist Roots Of Rap On Trial | Louder Than A Riot | NPR Music", "description": "Mac the Camouflage Assassin. Boosie Badazz. Drakeo the Ruler. Mayhem Mal. Since the 1990s, police and prosecutors have used lyrics to build and try criminal cases against rap artists. It’s weak evidence and lazy prosecution that blurs the distinction between entertainment and criminal confession. And it’s only happening in hip-hop.\n\nFrom the U.S. government’s policing of jazz and blues to rap lyrics on trial, NPR Music’s Rodney Carmichael and Sidney Madden trace Black music’s criminalized history and lay out the racist implications behind prosecuting hip-hop. \n\nWHAT'S LOUDER THAN A RIOT?\nRhyme and punishment go hand in hand in America. Louder Than A Riot reveals the interconnected rise of hip-hop and mass incarceration. From Bobby Shmurda to Nipsey Hussle, each episode explores an artist's story to examine a different aspect of the criminal justice system that disproportionately impacts Black America. Hosted by NPR Music's Rodney Carmichael and Sidney Madden, this podcast is invested in power from all angles — the power the music industry wields over artists, the power of institutional forces that marginalize communities of color, the power of the prison industrial complex and the power dynamics deep-rooted in the rap game.\n\nLISTEN to more episodes of Louder Than A Riot on: \nNPR One - https://rpb3r.app.goo.gl/louderthanariot\nApple Podcasts - https://apple.co/3ecRD1P\nSpotify - https://spoti.fi/3kVVAt5\n\nFOLLOW Louder Than A Riot:\nTwitter - https://twitter.com/LouderThanARiot​\n\nFOLLOW Louder Than A Riot hosts:\nRodney Carmichael - https://twitter.com/rodneyology​\nSidney Madden - https://twitter.com/Sid_Madden\n\n#louderthanariot #hiphop #massincarceration #lyricsontrial", "link": "https://www.youtube.com/watch?v=PSONFPl4Qvc", "date_published": "2021-03-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Xavier Omär: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nBobby Carter | March 15, 2021\nXavier Omär decided to turn his Tiny Desk home concert into a whole Texas affair. Initially, Omär wanted to recreate the look of the Desk: \"I wanted to kind of bring the feeling of Tiny Desk back, so I had booked a library,\" he said. Ultimately the library didn't work out, but Rosella Coffee and Wine in his home base of San Antonio proved to be a great match for his sound--spacious and airy.\n\nOmär's career began in Christian music under the moniker SPZRKT, before he moved into secular R&B and hip-hop. Through his first couple of projects and work with Seattle DJ and producer, Sango, the 27-year-old singer's heart-on-sleeve approach quickly created a buzz. His latest album, if You Feel, was high on my favorite albums list of 2020.\n\nThe Alamo City resident and his cohorts orchestrated a charismatic and vocally rich show. The set list perfectly depicts the emotional arch of if You Feel. For good measure, he plays the song that put him on the map, 2016's \"Blind Man.\" This is undoubtedly Xavier Omär's best live performance on record. He's on a clear path to greatness in R&B music.\n\nSET LIST\n\"Like I Feel\"\n\"Blind Man\"\n\"SURF\"\n\"So Much More\"\n\nMUSICIANS\nXavier Omär: vocals\nTalyce Hays: vocals\nJay Wile: vocals\nAlana Holmes: vocals\nBilly Ray Blunt Jr.: guitar\nJustin Crawford: keys\nKorey Davison: bass\nJosh Greene: drums\nKevin Davison: saxophone\n\nCREDITS\nVideo: Screenville Films\nAudio: David Gaumé, Alfredo De la Garza, Josef Rodriguez\n\nTINY DESK TEAM\nProducer: Bobby Carter\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Kara Frame\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann\n\n#xavieromar #tinydesk #nprmusic #rnb", "link": "https://www.youtube.com/watch?v=zD9hyjbTuF0", "date_published": "2021-03-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]