[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Liz Phair: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nRobin Hilton | June 23, 2021\nLiz Phair's music was always meant to fill arenas. After a clever sleight-of-hand at the top of this Tiny Desk (home) performance, where it briefly seems we've returned to in-person sets behind Bob Boilen's desk, Phair and her backing band do their best to recreate the kind of set you'd see in a much larger space; everyone plugs-in, turns it up and rocks with an impressive light show.\n\nPhair highlights three tracks from Soberish, her first new album in more than a decade, and the most reflective and beautiful record she's made. She starts with \"Spanish Doors,\" a heartbreaking but hooky portrait of a marriage nearing its end. She follows with a song against loneliness called \"In There,\" followed by \"The Game,\" a meditation on the mind games that sabotage troubled relationships.\n\nNearly 30 years after her stunning debut, Exile In Guyville, Liz Phair's sound shines and shakes as much as it ever did – the ringing guitars, her deadpan delivery, the tight harmonies. But the themes have evolved from youthful defiance and indiscretions to wiser ruminations on the complications of growing older.\n\nBut Phair still finds joy and a playful sense of humor in her earliest work, closing her Tiny Desk with a generous version of \"Never Said,\" from Exile. \"Put your way-way-back hat on,\" she says as the band kicks in. When it's all over she asks for \"tiny clapping for the Tiny Desk... ...We enjoyed almost being there.\"\n\nSET LIST\n\"Spanish Doors\"\n\"In There\"\n\"The Game\"\n\"Never Said\"\n\nMUSICIANS\nLiz Phair: vocals, guitar\nBen Sturley: bass\nCody Perrin: guitar\nNeal Daniels: drums\nConnor Sullivan: guitar\n\nCREDITS\nVideo: Chris Huber\nAudio: Mark Woodcock\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Kara Frame, Gabrielle Pierre\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #lizphair", "link": "https://www.youtube.com/watch?v=NOG49BTdJLQ", "date_published": "2021-06-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "NPR Music Listening Party: Joni Mitchell's 'Blue' At 50", "description": "For its 50th anniversary, join us in an online listening party for Joni Mitchell's 'Blue.' NPR Music's Ann Powers will be joined by singer-songwriter Brandi Carlile, who performed her own tribute to 'Blue' in 2019, for a live conversation about this monumental album.\n\nRSVP https://jonimitchelllisteningparty.nprpresents.org  \n\n'Blue' was originally recorded and released in 1971, mostly featuring acoustic guitar, piano and Appalachian dulcimer played by Mitchell herself, with contributions by James Taylor and Stephen Stills. Among its many accolades, 'Blue' was chosen as NPR Music's greatest album of all time made by a woman: \"'Blue' remains the clearest and most animated musical map to the new world that women traced, sometimes invisibly, within their daily lives in the aftermath of the utopian, dream-crushing 1960s,\" Ann Powers wrote in the Turning the Tables feature, praising its melodies and lyrics as \"simple, but so radical.\" A remastered version of 'Blue' will be part of a box set that collects Joni Mitchell's first four albums.\n\n#jonimitchell #blue #brandicarlile", "link": "https://www.youtube.com/watch?v=R6RNq3XKIQw", "date_published": "2021-06-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]