[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "Minimalist, open source, encrypted Google Photos & Google Docs alternative? We'll see about that!", "description": "Today, we're going to take a look at a service that ticks a lot of my boxes for online storage: privacy-focused, encrypted, open source, and very, very minimalist. Let's take a look at Cryptee!\n\nCreate your free Cryptee account: https://crypt.ee/signup\n\nImport your photos into Cryptee:\nFrom Google Photos: \nhttps://crypt.ee/help?article=migrate-from-google-photos\n\nFrom iCloud:\nhttps://crypt.ee/help?article=migrate-from-icloud-photos\n\nFrom anywhere else:\nhttps://crypt.ee/help?article=how-can-i-bulk-import-my-photos-into-cryptee\n\nSupport the channel on Patreon: \nhttps://www.patreon.com/thelinuxexperiment\n\nBecome a channel member to get access to a weekly patroncast and vote on the next topics I'll cover:\nhttps://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nFollow me on Twitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\nFollow me on ODYSEE: https://odysee.com/@TheLinuxExperiment:e\nOr join ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\n## Photos\n\nOk, now let's take a look at what this thing can do, and let's start with the photos. \n\nIt hides a lot of power under the hood. Once you've uploaded some photos, you can add tags to them, in natural language. For example here, I have added a bunch of pictures of a trip I made to Guadeloupe a while ago. I can type \"This is my lame attempt in #Guadeloupe to try and not look like a #tourist\", and these hashtags will be intelligently recognized and used in my future searches.\n\nAll the tags and the photos you add are encrypted on your device, so Cryptee can't access them at all. This also explains why thumbnails can take a bit to appear if you scroll around like a madman: they're generated on your device as well.\n\nAnd then, you can search using natural language again, like for example, \"pictures I took in guadeloupe in the mornings\", and Cryptee will find just that, based on the EXIF tags of the pictures. You can also add hashtags to your search to narrow it down. It's pretty cool.\n\n## Files\n\nThe second pillar of Cryptee is the document storage. Once again, it's a very minimalistic experience, with beautiful layout, typography and generally amazing presentation.\n\nIf we take a look at the documents, everything is handled through a sidebar on the left: your recent documents, folder navigation, and the ability to create a new document.\n\nUploading files is just a drag and drop operation that will take a bit of time, as everything has to be encrypted. Encryption happens on your device directly, and the contents and the filenames are both encrypted, so the team at Cryptee can't access any of it.\n\nOnce you get some stuff in there, you can browse through your folders and documents, use search to find something specific, and interact with each file and folder, with renaming, deleting, duplicating, or just moving stuff around.\n\nCryptee can preview some file formats, like images or PDFs, and the viewer itself actually has a lot of features in terms of navigation, text selection, rotation or zoom.\n\nSimple text files can also be edited in markdown, and with a pretty complete editor: you get most features you might want.\n\nYou can also spell check, and the editor will generate a table of contents for you as you add headings. And you can get a handy panel with a lot of hotkeys and shortcuts to add that markdown formatting onto your document.\n\nThere are also options to export your document into PDF, markdown, HTMLL, or even docx.\n\n## Ghost albums\n\nNow, another feature of Cryptee, for documents and photos, is the ability to create \"ghost\" folders. There are folders that don't show up in the normal browsing on Cryptee. They only show up if you type their exact name.\n\n## Limitations\n\nNow, there are some limitations to what Cryptee can do.\nFirst, Cryptee doesn't have \"apps\": you can't install Cryptee on your computer or your smartphone, you only use it through your web browser.\n\nWell, you can still install their progressive web app, depending on your web browser and OS, and that gets you offline use, automatic updates, and an icon in your applications menu. It's pretty cool.\n\nBut it also means that you won't get \"local sync\" like you could with Nextcloud, or automatic photo upload from your phone.\n\nThe second point that might raise a few eyebrows is the pricing. Out of the box, Cryptee only gives you 100MB of storage for free. That's enough to try it out, but not really to use it daily.\n\nPricing starts at 3€ per month, for 10Gb, and then you can get 400GB for 9€ per month, and 2TB for 27 € per month.\n\nThis video is sponsored by Cryptee.", "link": "https://www.youtube.com/watch?v=_WPwmqawzF4", "date_published": "2021-06-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]