[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "JAMBINAI: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nBob Boilen | July 9, 2021\nI don't think I've ever used the word \"fierce\" to describe a Tiny Desk, but that's precisely what JAMBINAI has created in this (home) concert. The show begins in front of a massive recreation of my desk and what happens next ... well, no spoilers here. Filmed in an immersive media art museum created by an organization known as d'strict on Jeju Island, this Korean band contains multitudes. At its heart, JAMBINAI's music mixes elements of metal, noise and Korean tradition. There's full-on distorted guitar, bass and drums, but also a haegeum (a fiddle-like instrument), a piri (a type of flute), a taepyeongso (a reed instrument) and a most appropriately named instrument, a geomungo (a giant Korean zither). We also hear some delicate vocals in the mix.\n\nThe two pieces performed here include 2015's \"Time of Extinction\" and the more recent and epic \"ONDA.\" I last saw JAMBINAI on two consecutive nights at SXSW in 2014 and then again at the 2021 virtual festival. It reminded me of their intensity and originality, and I look forward to the day when they come and play a more modest, tinier desk and, perhaps, shake the shelves.\n\nSET LIST\n\"Time Of Extinction\"\n\"ONDA\"\n\nMUSICIANS\nIlwoo Lee: guitar, piri, taepyeongso, saenghwang, vocals\nBomi Kim: haegeum, vocals\nEunyong Sim: geomungo, vocals\nByeongkoo Yu: bass, chorus\nJaehyuk Choi: drums, chorus\n\nCREDITS\nDirector: Jinho Park\nProducer: Hyunggun Kim (The Tell-Tale Heart)\nVideo Production: DEEPCUT\nD.O.P: Hanhee Cho\nProduction Assistant: Younggyun Lee\nAudio Recording: Minjae Lee (ssplworkz)\nAudio Mixed and Mastered: Sanghyun Cho (M.O.L STUDIOS)\nMedia Art Installation: d'strict\nSpecial thanks to Stella Heesun Suh (KOCCA), Victor Eun Suk Choe (d'strict), Yunjung Yeum (d'strict), Sangwoo Lee (d'strict)\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Maia Stern\nAudio Mastering: Andy Huether\nAssociate Producer: Bobby Carter\nTiny Production Team: Kara Frame, Josh Rogosin, Gabrielle Pierre\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #jambinai", "link": "https://www.youtube.com/watch?v=wEk0YlYEJAE", "date_published": "2021-07-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]