[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCAKcSON6PSG_JkTbXh2WdIg", "title": "LineCheck - Minnesota's Music Activists (full video)", "description": "Songwriters and artists have often used their art to influence social change. As unrest broke out in the city of Minneapolis in the wake of George Floyd's murder, Minnesota musicians turned to their creative outlets as agents of change.\n\nIn this fourth installment of our LineCheck conversation series, Anastasia Ellis asked Maria Isa, Muja Messiah, and Nur-D about their activism, music, and where we go from here. Performances by Layce Dreamz and Melissa Belfry of Sounds of Blackness bookended the conversation.", "link": "https://www.youtube.com/watch?v=KVkYSRQ_NJc", "date_published": "2021-07-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCAKcSON6PSG_JkTbXh2WdIg", "title": "Dave Simonett - The High Road (live MN Session for The Current)", "description": "For The Current's Minnesota Sessions, Dave Simonett brings acoustic tunes to the Wolf Ridge Environmental Learning Center. You know Dave as the frontman of Duluth-based bluegrass act Trampled by Turtles as well as his work under the moniker Dead Man Winter, and he's developed a legacy as an endearing and thoughtful songwriter. Watch Dave play \"The High Road\" from his 2021 solo EP, Orion.\n\nMinnesota Sessions are presented by Lovin' Lake County. \n\nSubscribe to our channel:\nhttp://www.youtube.com/user/893TheCurrent\n\nLike/Follow:\nhttps://www.facebook.com/TheCurrent/​​​​\nhttps://twitter.com/TheCurrent​​​​\nhttps://www.instagram.com/thecurrent/\n\nThe Current encourages all music fans to support their local artists and the continued longevity of their craft. As part of this effort, The Current will be compensating artists for their performances in Minnesota Sessions through the Legacy Amendment Arts and Cultural Fund.", "link": "https://www.youtube.com/watch?v=EvN9gIFIAPo", "date_published": "2021-07-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]