[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "ProtonMail, Calendar and Drive - A privacy focused alternative to Google?", "description": "#sponsored #ProtonMail #Privacy\n\nCreate your free ProtonMail account here: https://go.getproton.me/SHNu\n\nThis video is sponsored by ProtonMail.\n\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nJoin us on our new Discord server: https://discord.gg/xK7ukavWmQ\nTwitter : http://twitter.com/thelinuxEXP\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\nFollow me on ODYSEE: https://odysee.com/@TheLinuxExperiment:e\nOr join ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\n\n\n00:00 Intro\n00:45 What is ProtonMail\n02:07 Webmail vs Desktop Client\n03:22 Webmail\n05:51 Contacts\n06:22 Calendar\n07:44 Drive\n08:17 Parting Thoughts\n\nAs you might have guessed, it's an email service, and an encrypted one at that. The company and its servers are located in Switzerland, their code is open source, they don't display any ads in your webmail, and they use end to end encryption.\n\nProtonMail is free to use, but your free account will limit you to 500Mb of storage and 150 emails per day, which might not be enough for some of you.\nTheir paid tier is 4€ per month, and that will net you 5 GB of storage, up to 1000 messages per day, labels and folders to sort your emails, setting up custom filters, the use of your own email domain name, and up to 5 email aliases.\n\nBeing an encrypted service, ProtonMail is better used in a webmail: you can't just type your credentials into any desktop email client, because these don't know how to encrypt or decrypt your emails. \n\nYou can still add your ProtonMail account to other clients on Linux, mac os, or windows, through the ProtonMail bridge. It's a simple app you can install on any OS, that will give you the credentials you need to enter in any client that support SMTP and IMAP. I tested it with Kmail, and it works perfectly fine, even though they only advertise support for Thunderbird on Linux.\n\nThe webmail is pretty simple to use, it doesn't try to revolutionize the way you handle email. You get your sidebar with folders on the left, your email list in the middle, and your message pane on the right. You can change this layout in the settings if you want, though, getting rid of the message panel, choosing to display more emails with a denser layout, and choosing between a small compose window, Gmail style, or a full screen composer. \n\nYou can select between 6 different themes. You can enable 2 factor authentication on your account.\n\nIf ProtonMail.com is too tedious for you to type when you give your email address to other people, you can also use a shortened version, which is just pm.me.\n\nIn terms of more company oriented-features, ProtonMail supports email signatures, including pasting HTML signatures if you want to do that, or setting up an auto reply, if you're out of office.\n\nProtonMail also has an import assistant to get all your emails from Gmail, Yahoo mail, or another provider. I tried it with my own email address that's hosted by my domain name provider, and it worked beautifully.\n\n\n\nProtonMail also gives you access to Contacts, so you can get this nice auto-fill when writing an email. It will automatically create contacts from people you've sent emails to.\n\nYou can also create contact groups, and use them to send email to all the addresses in that group.\n\nYou can also batch import your contacts with a .csv file or through vcard. Contacts are encrypted as well, and can be exported, after they've been decrypted.\n\nProtonMail also has a calendar, accessible to all ProtonMail users. It can import events from ICS files, and you can create multiple calendars as you like.\n\nThey can also be shared outside of Proton, with 2 settings: limited view, or full view.\n\nThe calendar itself is pretty simple: drag across a time period to create an event, and fill in the details, including start and end date and time, name, location, the calendar you want to attach it to, and a description. You can mark events as taking the whole day, and it supports recurring events, if you click on the \"More options\" button, which will also let you add participants, and set reminders.\n\nIt's got a day, week and month view, and there's the nice touch of being able to see your calendar with another time zone.\n\n## Drive\n\nNow, for the paid users, there is also Proton Drive, which is a file storage service. It's still in beta, so I won't review it here fully, but let's just look at the features it already has.\n\nIt shares your storage space with the email account, and you can just drag and drop files to upload them. It's also fully end to end encrypted, and you can send fully encrypted links for any file you like.", "link": "https://www.youtube.com/watch?v=SlX0BaQNxJg", "date_published": "2021-10-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]