[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UChnxLLvzviaR5NeKOevB8iQ", "title": "Out of Control (Music Performance Video)", "description": "This video contains flashing lights and may not be appropriate for photosensitive viewers.\n\nThis was a simple modular performance that kept wanting lyrics. It started with a patch featuring Qu-Bit Scanned wavetable oscillator into Mutable Instrument Blades filter (one of my favorite combos), Intellijel Plonk into [redacted], and Dixie 2+ into the Polaris filter (another favorite pairing). Qu-Bit Surface is alternating between a hihat and tonal lines. The drums were from the VPME QD but I didn't like the way they sounded so I replaced them with some drum loops in Ableton. Vocals were recorded through the Voicelive 3 in a few takes. Wanted to go for a Chemical Brothers/DFA vibe. Full module list after lyrics. \n\nLyrics: \n\nI’ve got a feeling that it’s gonna be a good one \nI’ve got a feeling that is welling up in me\nI’ve got blood and all the tubes I need to use it\nIs this love or is it just anxiety\n\nWell the sun is shining\nAnd my heart is pumping\nAnd my head is telling me ok ok\nYou should cross your fingers\nYou should hold it back now\nCos from here it’s only one step away\n\nI'm out of control\n   \nI’ve got restlessness that I cannot contain\nIt's a sickness that gets into everything I do\nI’ve got thoughts that will not keep to themselves\nSo tell me, what the hell am I supposed to do\n\nWell the sun is beating\nOn this pregnant feeling\nAnd I’m worried that my head just might explode\n\nI’ve tried to explain it\nNothing can constrain it\nMaybe I would be much better off alone\n\nI’m a cannonball\nI’m a sinking ship\nI’m a neutron that refuses to decay\n\nI am telling you\nNo, I am begging you\nPlease, just get out of my way\n\nI'm out of control\n\nModules used (affiliate links through Perfect Circuit):\nMutable Instrument Blades: https://bit.ly/3xw9nMT\nQu-Bit Scanned: https://bit.ly/3xuf0uZ\nQu-Bit Surface: http://bit.ly/pc_surface\nNoise Engineering Imitor Versio: http://bit.ly/pc_imitor\nAfter Later Monsoon: http://bit.ly/pc_after_later\nVPME QD: http://bit.ly/pc_VPME_QD\nVarigate 8+: http://bit.ly/pc_varigate\nIntellijel Quadrax: http://bit.ly/pc_quadrax\nIntellijel Quad VCA: http://bit.ly/pc_quadvca\nInellijel Dixie 2+: http://bit.ly/pc_dixie\nPamela's New Workout: https://bit.ly/2QRxnZO\n------------------------------------\nThank you for watching. My name is Jeremy, and this is Red Means Recording. I've been making music for a few decades now, and this channel is a place to make music and to talk about the tools and techniques to make music with. We'll use synths, drum machines, modular gear, and software. \n\nIf you'd like to support the channel, I have a Patreon:  http://bit.ly/rmrpatreon\n\nI have music as \"Jeremy Blake\" on all the major services: \nBandcamp: http://bit.ly/2Kq617o\nSoundcloud: http://bit.ly/2NOH9Is\nSpotify: https://spoti.fi/2N40SoX\nGoogle Play: http://bit.ly/33M9aG5\niTunes: https://apple.co/2pqh3SK\nAmazon Music: https://amzn.to/2O9q1fe\n\nI have some merch here: http://bit.ly/rmrshirts\n\nAnd you can connect with me here: \nTwitter: http://bit.ly/rmrtwitters\nWebsite: http://bit.ly/rmrmedia", "link": "https://www.youtube.com/watch?v=VPdKohIuGqI", "date_published": "2021-05-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]