[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCsXVk37bltHxD1rDPwtNM8Q", "title": "TRUE Limits Of Humanity – The Final Border We Will Never Cross", "description": "If you want to support kurzgesagt and get something beautiful in return check our shop:\nhttps://kgs.link/shop-142\n\nSources & further reading:\nhttps://sites.google.com/view/sources-truelimitsofhumanity/\n\nThe original Limits of Humanity: https://www.youtube.com/watch?v=ZL4yYHdDSWs\n\nIs there a border we will never cross? Are there places we will never reach, no matter how hard we try? It turns out, there are. Even with sci-fi technology, we are trapped in a limited pocket of the Universe and the finite stuff within it. How much universe is there for us and how far can we go?\n\nOUR CHANNELS\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nGerman Channel: https://kgs.link/youtubeDE \nSpanish Channel: https://kgs.link/youtubeES \n\n\nHOW CAN YOU SUPPORT US?\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nThis is how we make our living and it would be a pleasure if you support us!\n\nGet Merch designed with ❤ https://kgs.link/shop-142  \nJoin the Patreon Bird Army 🐧  https://kgs.link/patreon  \n\n\nDISCUSSIONS & SOCIAL MEDIA\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nReddit:            https://kgs.link/reddit\nInstagram:     https://kgs.link/instagram\nTwitter:           https://kgs.link/twitter\nFacebook:      https://kgs.link/facebook\nDiscord:          https://kgs.link/discord\nNewsletter:    https://kgs.link/newsletter\n\n\nOUR VOICE\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nThe Kurzgesagt voice is from \nSteve Taylor:  https://kgs.link/youtube-voice\n\n\nOUR MUSIC ♬♪\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\n700+ minutes of Kurzgesagt Soundtracks by Epic Mountain:\n\nSpotify:            https://kgs.link/music-spotify\nSoundcloud:   https://kgs.link/music-soundcloud\nBandcamp:     https://kgs.link/music-bandcamp\nYoutube:          http://kgs.link/music-youtube2021\nFacebook:       https://kgs.link/music-facebook\n\nThe Soundtrack of this video:\n\nSoundcloud:   https://bit.ly/2RJq6M4\nBandcamp:     https://bit.ly/2SFUPdG\n\n\n🐦🐧🐤 PATREON BIRD ARMY 🐤🐧🐦\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nMany Thanks to our wonderful Patreons (from http://kgs.link/patreon) who support us every month and made this video possible:\nDenrage, Hugo Novotny, Bombibom, Bryant & Angel, Matthew, Ngoc B Khuong, Zormoe, Caoimhe Gilbert, Brandon James, Adrith Nayak, Zachary Kern, Eric Downes, Marcuss, Anthony Adkins, tomworkshere, Michael Tedder, DeepWaters, Greg Powell, fresh crystal mangos, Finalpenguin 726, Kareto Phase, Vincent Guerra, Michelle Sichting, Martin Hlaváč, Zwackelmann0, RottingMyBrain, meldanor, sprung, Pedro Antunes, supermeme, Guillaume Hellin, Carl Schanz, Drago Draco, Stephen Barker, Rors, Paco Avila, Ro-ni-n, Pol Duran Casademont, Courtney Hill, Sharbel Zarzour, Vicky, Carsten Guhr, Gary Gilbody, Jacob Geeo, Nathan Schroeder, Mark Frelih, Cédric Lothe, Joshua Valji, Thea Ilona, Jonathan Geaney, Arber, Matt Woodham, Dominic Juarez, Nelson Gollop, Дмитрий Киселёв, Adam Ellum, Lucy B, ghostman, dibidave, Dan Morris, lindryd aldar, Alberto Simonazzi, Jakub Kotucha, Hannes Burner, Mike Koss, henrythasler, Ryan McPartlan, Denis Leonte, Kai Fic, Jeremy Krall, Thomas Adamick, Andreas, Richard j, Eroviaa Hunter, PaddyO‘Lantern, Vishrut Joshi, Gwendolyn Jones, Nazar Beknazarov, Eric Rowland, José Castillo Fallas, Eben Alguire, Jesse, Greg Belote, AlphaTaco, Craig, Ryan G. Hornberger, Christien Lomax, SURGE, Ben Udris", "link": "https://www.youtube.com/watch?v=uzkD5SeuwzM", "date_published": "2021-05-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]