[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Announcing The 2021 Tiny Desk Contest", "description": "Got big dreams to play a Tiny Desk concert? NPR Music wants to hear from you. For the seventh year in a row, we’re inviting unsigned musicians to enter the Tiny Desk Contest, supported by State Farm. Send us a YouTube video of you or your band performing an original song, and you could perform at NPR headquarters in Washington, D.C. The Contest is open for entries between May 11 and June 7, 2021.\n\nFor more details, visit https://tinydeskcontest.npr.org/\nOfficial rules here: http://tinydeskcontest.npr.org/rules\n\n#tinydeskcontest #nprmusic #tinydesk #tinydeskconcert #npr", "link": "https://www.youtube.com/watch?v=OEYey-h-4is", "date_published": "2021-05-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Tiny Desk Contest Family Hour", "description": "Over the past six years, nearly 30,000 musicians have entered NPR's Tiny Desk Contest in the hopes of being chosen to perform as part of NPR Music's signature music discovery series. Now, we're once again calling for bands and musicians to submit a video of themselves performing an original song at a desk of their choice.\n\nAnd, for the first time ever, we brought together all six of our previous winners for an epic Contest kick-off event: Tiny Desk Contest Family Hour. Watch performances from each winner, including three-time Grammy winner Fantastic Negrito and 2019 Best New Artist Grammy nominee Tank and the Bangas. The video also includes advice from Tiny Desk series creator and Contest judge Bob Boilen.\n\nThe Tiny Desk Contest Family Hour is supported by @statefarm.\n\nLINEUP:\n2:26 -- Fantastic Negrito (2015) performs \"“Chocolate Samuri” and “Lost In A Crowd”\n12:17 -- Gaelynn Lea (2016) performs “This Hunger Won’t Leave” and “Someday We’ll Linger In The Sun”\n23:56 --  Tank and the Bangas (2017) performs “Feelings” and “Quick”\n33:36 -- Bob Boilen interviews Gaelynn Lea and Tarriona \"Tank\" Ball \n47:10 -- Naia Izumi (2018) performs “Soft Spoken” and “Voodoo”\n56:46 -- Quinn Christopherson (2019) performs \"Simple\" and \"Erase Me\"\n1:06:29 -- Linda Diaz (2020) performs \"Blessed\" and \"Green Tea Ice Cream\" \n\nLearn more about the Tiny Desk Contest: https://npr.org/tinydeskcontest\n\n#tinydesk #tinydeskcontest #tinydeskfamilyhour", "link": "https://www.youtube.com/watch?v=yon4fKby21Y", "date_published": "2021-05-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]