[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Bravely Default 2 Review", "description": "Bravely Default 2 brings the throwback RPG series to Nintendo Switch, but the loss of modern quality-of-life features make this a decidedly grindy experience.", "link": "https://www.youtube.com/watch?v=4nJN93jGO7c", "date_published": "2021-02-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Deathloop PS5 Trailer | PlayStation State of Play", "description": "Arkane's new loop shooter oozes with 60's spy funk influence in this all new stylized trailer with a James Bond-style song to match. Filled with Arkane's stamp of style, the trailer shows off super powers, over-the-top guns desgins, and sharp art design.", "link": "https://www.youtube.com/watch?v=7IvnbebkT7Y", "date_published": "2021-02-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Early Outbreak Mode Gameplay In Black Ops Cold War Season 2", "description": "Call Of Duty: Black Ops Cold War Season 2’s newest Zombies mode Outbreak is available to play (offline) a little ahead of schedule. Here's how escort and high-value target objectives work.\n\nCall of Duty: Black Ops Cold War and Warzone are entering Season 2 with a new battle pass that focuses on zombies. Based on recent trailers, zombies are expected to invade both the Dirty Bomb maps and Warzone. Currently, in Warzone, the developers are building unanswered mysteries such as a dark ship approaching the shore, and an inactive Trail Computer from Zombies has been found. \n\nIn this video, we’re going to take on the newly released Outbreak mode which involves fighting the undead on a much larger scale than previous maps Die Maschine and Firebase Z. The new experience places squads of four in free-roam environments where they will take part in objective-based modes such as defend, escort, retrieve, eliminate, and holdout. Even though the maps are open to explore, players will still be able to extract or continue after each phase. Familiar staples such as the Crafting Table, support items, armor, and weapon upgrade machines, Pack-a-Punch, and Perk vending machines will all be present. Rewards for Outbreak include the new Refined and Flawless Aetherium Crystals, allowing players to upgrade skills to tier four and five. The previous cap was three. Zombies modes also typically involve secret areas, mysteries to solve, and Wonder Weapons. Over on Call Of Duty’s battle royale map, we still don’t know what is going to happen with the season pass listing Warzone’s event as “A dark wave approaches Verdansk.” Join us to find out.\n\nCall Of Duty: Black Ops Cold War and free-to-play Warzone are available for PS4 4, PS5, Xbox One, Xbox Series X/S, and PC. Cold War Season 2 releases on February 25th.", "link": "https://www.youtube.com/watch?v=4Gn162sto0o", "date_published": "2021-02-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Escape From Tarkov Complete Raid Series", "description": "Find all your links and connections for Escape From Tarkov and Battlestate Games here! \nTwitter: https://twitter.com/bstategames \nTwitch: https://www.twitch.tv/battlestategames \nYouTube: https://www.youtube.com/channel/UC5QGploHhl9_XaxDiHZKamg \nGame Information and Store: https://www.escapefromtarkov.com \n\nBattlestate games officially dropped the final episode of their Raid Cinematic series. Take a look back at the full Raid series and immerse yourself in the world of Escape From Tarkov.", "link": "https://www.youtube.com/watch?v=xtKygZImnWA", "date_published": "2021-02-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Escape From Tarkov Raid Series Finale", "description": "Find all your links and connections for Escape From Tarkov and Battlestate Games here! \n\nTwitter: https://twitter.com/bstategames \nTwitch: https://www.twitch.tv/battlestategames \nYouTube: https://www.youtube.com/channel/UC5QGploHhl9_XaxDiHZKamg \nGame Information and Store: https://www.escapefromtarkov.com \n\nBattlestate games officially dropped the final episode of their Raid Cinematic series. Take a look at the series finale in episode 5 of Raid!", "link": "https://www.youtube.com/watch?v=NUTTE298oYw", "date_published": "2021-02-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Final Fantasy 7 Remake: Intergrade PS5 FULL PRESENTATION | PlayStation State of Play", "description": "Looks like the Final Fantasy 7 Timeline is about to get even weirder! Take control of Yuffie and her Shuriken when the Final Fantasy 7 Remake hits the PS5 with updated graphical effects, new quality of life changes, photo mode, and more when it launches in June.", "link": "https://www.youtube.com/watch?v=jhCoXjGmUz8", "date_published": "2021-02-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Final Fantasy 7 Remake: Intergrade PS5 Reveal Trailer | PlayStation State of Play", "description": "Final Fantasy 7 is coming to the PS5 with all new features an enhancements. The game is also receiving excluisve story DLC featuring Yuffie and her Shuriken, launching in June 2021.", "link": "https://www.youtube.com/watch?v=0s9F0v3dl6s", "date_published": "2021-02-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Final Fantasy Battle Royale: FF7 The First Soldier Teaser Trailer", "description": "Can you become history’s first SOLDIER? FINAL FANTASY VII THE FIRST SOLIDER coming to iOS and Android in 2021.\n\nCheck out the Final Fantasy Battle Royale Teaser Trailer for FF7 The First Soldier!", "link": "https://www.youtube.com/watch?v=4ZD6_UkiORY", "date_published": "2021-02-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Final Fantasy VII Ever Crisis Teaser Trailer", "description": "FINAL FANTASY VII EVER CRISIS coming to iOS and Android in 2022.", "link": "https://www.youtube.com/watch?v=sOkpCjBGK3g", "date_published": "2021-02-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Five Nights at Freddy's: Security Breach Reveal Trailer | PlayStation State of Play", "description": "The breakout horror sensation is finally getting it's first mainline console entry on PS5. The party is just getting started in this trailer shown at the PlayStation State of Play event!", "link": "https://www.youtube.com/watch?v=fxeRn4sVVM0", "date_published": "2021-02-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Kena: Bridge of Spirits Gameplay Trailer | PlayStation State of Play", "description": "Explore Ember Lab Studio's magical world in this brand new trailer for Kena: Bridge of Spirits coming to PS5 and PS4 later this year in this first gameplay footage shown off at the PlayStation State of Play event!", "link": "https://www.youtube.com/watch?v=LZdHkv2PMpE", "date_published": "2021-02-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Oddworld: Soulstorm Trailer | PlayStation State of Play", "description": "The accidental hero Abe is back in this all new entry in the cult-loved Oddworld series. Oddworld: Soulstorm is a return to its 2D, platforming, puzzle routes, while taking continuing its satarical and humorous charm. Coming April 6, 2021. Coming to PS4, with a free PS5 upgrade to PS Plus members.", "link": "https://www.youtube.com/watch?v=3wvwVBeMSQE", "date_published": "2021-02-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "PlayStation State of Play February 2021 Livestream", "description": "Tune into PlayStation's first State of Play of 2021 to learn more about 10 games coming to PS4 and PS5. The broadcast will include new game announcements and updates on some of the third-party and indie titles from June's PS5 broadcast. The show will run for about 30 minutes.", "link": "https://www.youtube.com/watch?v=zS3gXssxWcA", "date_published": "2021-02-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "SIFU Reveal Trailer| PlayStation State of Play", "description": "Sloclap Studios introduced this martial arts inspired brawler, SIFU during the PlayStation State of Play. With awesome combos, destructible environments, and more, you're not going to want to miss this trailer!", "link": "https://www.youtube.com/watch?v=HhatIpbRYu4", "date_published": "2021-02-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Black Ops Cold War Season Two - Studio Broadcast", "description": "The members of the Treyarch and Raven teams give an inside look at everything coming to Warzone, Multiplayer, and Zombies. Season Two arrives Feb. 25 in Black Ops Cold War and Warzone.", "link": "https://www.youtube.com/watch?v=T4YVxrSzusA", "date_published": "2021-02-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Martial Arts Expert Reacts To Yakuza Kiwami's Fight Scenes", "description": "Martial artist expert Emon Rashid, head Tang Soo Do instructor at Quest Martial Arts, reacts and breaks down the ridiculous and over-the-top climatic fight scene of Yakuza Kiwami.\n\nYakuza Kiwami’s fights are bombastic displays of flashy martial arts, so what does an actual martial artist think of them? Emon closely examines the bone breaking fight between Kazuma Kiryu and Akira Nishikiyama, and explains whether the moves are legal in professional fighting such as UFC, Kickboxing, and MMA. \n\nEmon also details the practicality of moves like leg locks, palm heel strikes, and the real-life traumatizing nature of breaking someone else’s limbs in a fight. \n\nInterested in seeing Emon breakdown another game? Leave your suggestions in the comments below.", "link": "https://www.youtube.com/watch?v=7JgjSYwtYfc", "date_published": "2021-02-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Outriders Demo: Everything To Know", "description": "Check out the official Outriders Demo 10 things to know before the Demo drops tomorrow! The demo will be the entire opening chapter with taking an estimated 3 hours to play through!", "link": "https://www.youtube.com/watch?v=Y2YQsqgjeNk", "date_published": "2021-02-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Outriders Game Demo Details and Breakdown", "description": "Tune into the fifth Outriders Broadcast, Into the Fray, to learn more about the game's demo coming, which is out on February 25. In addition, developer People Can Fly will recap what makes Outriders on PC shine and dive into community Q and A.", "link": "https://www.youtube.com/watch?v=KQdMLjlpNAw", "date_published": "2021-02-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Zelda: Skyward Sword - Nintendo Switch vs. Wii Trailer Comparison", "description": "With the recent announcement of The Legend of Zelda: Skyward Sword HD on Nintendo Switch, we decided to put the new trailer head-to-head with the Wii original.\n\nThe Legend of Zelda: Skyward Sword is almost 10 years old, originally launching for Nintendo Wii in November 2011. The game was released five years after the last home console entry, The Legend of Zelda: Twilight Princess, and we wouldn’t get the next home console release, The Legend of Zelda: Breath of the Wild, for almost six years--though we did get some other Zelda games along the way like A Link Between Worlds, so it wasn’t completely empty.\n\nThe Wii is an SD console with games outputting at 480p, so despite the PS3 and Xbox 360 being around and HD being a thing in 2011, Skyward Sword was only ever seen in SD before now. You’ll also notice in this comparison video that the Switch version is running a lot more smoothly in comparison to the original Wii version. On Wii, Skyward Sword runs at 30fps while the Switch version looks to be running at 60fps. \n\nThe Wind Waker and Twilight Princess both got the HD treatment back on Wii U, so it was only a matter of time for Skyward Sword to get the same treatment. The Legend of Zelda: Skyward Sword HD releases on Nintendo Switch on July 16 with newly added button controls as the original version only had motion controls.", "link": "https://www.youtube.com/watch?v=dxZTQ4CKa1k", "date_published": "2021-02-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]