[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "Linux fanboy reviews Windows 11", "description": "Improve your VM patching workflow with QEMUCare: http://tuxcare.org/qemu-care\n\nGet your Linux desktop or laptop here: https://slimbook.es/en/\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nI also do a Gaming Podcast: https://www.youtube.com/channel/UCbRPZ11S1quJ4ESoj42A3ug\nJoin us on our new Discord server: https://discord.gg/xK7ukavWmQ\nTwitter : http://twitter.com/thelinuxEXP\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\nFollow me on ODYSEE: https://odysee.com/@TheLinuxExperiment:e\nOr join ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\n\n00:00 Intro\n00:41 Sponsor: QEMUCare\n01:32 Installation\n04:00 Desktop experience\n08:35 AppStore and installating apps\n10:35 The crappy stuff\n11:39 What do I think?\n\n\nInstalling Windows is still a very simple process if you just want to reformat your drive. While a lot of the install process still looks like what it did in the Vista days, it's relatively straightforward, I must say. It doesn't look amazing, it definitely doesn't really handle as many things as most Linux installers, but it works.\n\nAlthough it lets you only reinstall just the system WITHOUT needing a separate partition for your user files. That's something we could take inspiration from.\n\n\nThe config screens that come next are really much better than what we usually get in Linux installers. These screens are clean, super simple and enticing, and very reassuring.\n\nThese constant loading times and reboots and restarts and \"please wait\" screens are pretty jarring and don't make for a super nice setup experience.\n\nUnfortunately, unless you remove internet access to your device, there is no setting up a computer without a MS Account, which is very annoying. Then, you get to the multiple screens where you'll decide how much you want to restrict MS Data collection, knowing full well you can't completely stop it.\n\nNow I gotta say, out of the box, Windows 11 is shiny. I also like the customization options, with the dark mode and accent colors. But these aren't picked up everywhere in the system. Some right click menus don't use them, the file manager doesn't use it either, that's where it all starts to crumble, basically.\n\nBasically, everytime I get out of one of MS's revamped default apps, and go to something from the Windows 95 era, I get this horrendous disconnect. It's incredible to me that this isn't fixed yet. They've had the whole lifecycle of Windows 10 to fix it and replace these panels and interfaces with modern components.\n\nThe desktop itself is pretty simple, though. The new menu is nice, if you don't like using your mouse to navigate. Because objectively, the list of apps is worse if you're a mouse user. Search is much better and quicker to find something anyways, than to try and navigate nested menus. It was time to move to this way of using a menu, and it's well done.\n\nOf course, you STILL get these terrible ads.\n\nI also liked the fact that you get touchpad gestures on a laptop, although these aren't 1:1 and just trigger in the middle of a swipe, so they're not as good as what we get on GNOME or elementary OS on Linux.\n\nI kinda like the Teams integration out of the box. In general, I don't think the default experience on Windows 11 is bad. It looks good, it's smooth and well animated. The default apps do their job well, **unless you're a privacy nerd like me**, and using the system is pretty simple. Simpler than on WIndows 10, i'd say.\n\nThe only real issue is that once you dive any further than one or 2 levels of an app, you realize it's just another coat of paint on top of Windows XP.\n\n\nNow let's talk about the appStore experience. This new MS Store has progressed VERY nicely compared to what I remember from WIndows 10.\n\nHere, it's basically 10% of what you'd want, and the rest is either shady, paid-for redistributions of open source applications without any respect for branding or trademarks, for example LibreOffice, or it's just not available.\n\nBut for now, it's not enough, and you still have to go hunt for .exe files and install them manually like a caveman, without any centralized way to manage updates to these.", "link": "https://www.youtube.com/watch?v=ewwTJdC5T-o", "date_published": "2021-11-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]