[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "11 Halo Infinite Advanced Tricks You Didn't Know", "description": "There's a lot you might not know that you can do in Halo Infinite, such as Super Sliding with your handy grapple. We put together a list of advanced tips and tricks to help you gain the extra edge on the battlefield.\n\nEach new weapon and piece of equipment has secret perks and changes the landscape of Halo Infinite's multiplayer. Getting increased grenade distance with Repulsors, launching farther with Grappleshots, and using Threat Sensors and shock weapons as a mobile shock pole are just some of the secrets hidden in the game's engine. As time goes one, more is sure to be uncovered in Halo Infinite's sandbox.\n\nAs Jordan Ramée states in the Halo Infinite's Review In Progress, \"The multiplayer feels like old-school Halo, but tweaked to better fit the modern FPS playerbase that has fallen in love with shooters that accentuate their solid gunplay with smooth movement and quick-to-deploy abilities.\"\n\n0:00 Intro\n0:16 Swing Your Grappleshot\n0:55 Sprint While Grappling\n1:38 Grapple Down Gravity Lifts\n1:53 Repulsor Is King\n2:13 Repulsor Nade-Launch\n2:42 Repulsor Kickstart\n2:56 Dropwall Weakness\n3:06 Disruptor's Teamplay Potential\n3:44 Shock Weapon Perks\n4:08 Bladed Melees Hurt More\n4:23 Old Tricks Still Work", "link": "https://www.youtube.com/watch?v=RIK9br0BrRI", "date_published": "2021-11-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Infinite’s Fracture: Tenrai Event Pushes Game To Top 3 On Steam | GameSpot News", "description": "In today’s GameSpot News, Persia talks about Halo Infinite reaching 200k concurrent players on steam, Warzone’s Secret of the Pacific event, and more. \n\nHalo Infinite reached more than 200,000 peak concurrent players on Steam recently, and the spike in players is surely attributable in part to the launch of Halo Infinite's first multiplayer event, Fracture: Tenrai, on November 23. The Fracture: Tenrai event adds new cosmetics, a new Fiesta mode which spawns you with a random weapon every life, and more.\n\nLater in the video, Persia covers how Call of Duty: Vanguard will have a few limited-time events for players to bid farewell to Verdansk. Following the ongoing Operation: Flashback event, Secrets of the Pacific is now live. Secrets of the Pacific is described as an event that will grant players vital information on Caldera and its various points of interest prior to the December launch.\n\nLastly, DICE has restated its commitment to Battlefield 2042 in a recent blog post that it will be \"supporting and evolving it for years to come.\" The post gives a roadmap on planned updates and changes coming to Battlefield 2042, details on updates #2 and #3, and more details about the game's first season in 2022.\n\nFor more information on all of our topics, please visit gamespot.com.\n\nTimestamps:\nIntro - 00:00\nHalo Infinite - 00:09\nCall of Duty - 01:32\nBattlefield 2042 - 03:06\nKojima & Outro - 05:08", "link": "https://www.youtube.com/watch?v=1NQgVFefgHU", "date_published": "2021-11-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "More Xbox Game Pass Games Not To Miss", "description": "The ever growing Xbox Game Pass library is a good problem to have, but it can be a little overwhelming. So here's a list of games worth checking out.\n\nYou're likely playing loads of Halo Infinite multiplayer and Forza Horizon 5 right now, but these games may be worth taking a short break to try out.\n\nRecently, Xbox Game Pass has received a wide variety of games like the irreverent DEEEER Simulator, to the harsh and brooding world of Mortal Shell. If those don't seem up your alley, there's more relaxing and chill titles like Exo One and Unpacking. In the above video, we go over those and plenty others.\n\nThanks to the addition of Cloud Beta on Xbox Series X|S, trying this games is even easier, since now you don't need to download them to try them.", "link": "https://www.youtube.com/watch?v=7TYjVPJQsUo", "date_published": "2021-11-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 Review", "description": "Although some specialists can feel a bit useless at times, tweaks to the formula with Battlefield 2042 add a lot of interesting gameplay variety.", "link": "https://www.youtube.com/watch?v=bNuhnHEDPYo", "date_published": "2021-11-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Infinite Multiplayer Review in Progress", "description": "Though it has an unfulfilling progression grind, Halo Infinite hosts a welcome assortment of multiplayer modes that offer a rewardingly fun experience.", "link": "https://www.youtube.com/watch?v=VZ4wysoKdtk", "date_published": "2021-11-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Brilliant Diamond & Shining Pearl Review", "description": "Pokemon Brilliant Diamond and Shining Pearl are comfortably nostalgic, with just enough modern tweaks to smooth over the rough edges.\n\nNintendo and ILCA's Pokémon Brilliant Diamond & Shining Pearl are now available on Nintendo Switch. You can read the full written Pokémon Brilliant Diamond & Shining Pearl review by Steve Watts on GameSpot: https://www.gamespot.com/reviews/pokemon-brilliant-diamond-shining-pearl-review/1900-6417790/\n\nIf you’re looking for more Brilliant Diamond and Shining Pearl videos, we’ve got you covered here on GameSpot:\n\nDS vs. Switch Graphics Comparison: https://youtu.be/ZQwOMVwRJws \nFirst 24 Minutes Of Shining Pearl Gameplay: https://youtu.be/8jAXbh-05kI\n14 Things I Wish I Knew Before Starting Pokémon Brilliant Diamond & Shining Pearl: https://youtu.be/5v2AJzD_Ok4", "link": "https://www.youtube.com/watch?v=Om2yXWX0A04", "date_published": "2021-11-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]