[{"source": "https://lukesmith.xyz/rss.xml", "title": "Obscenities are symptoms of weak minds.", "description": "<p>Over the past few years, I made the decision to totally cut obscenities\nout from my speech. You might actually be able to find recordings of me\ncursing four or five years ago, but as of now, I really stand by my\ndecision.</p>\n<p>Obscenities are the linguistic equivalent of an trashy emaciated person\nentirely decked in tattoos, smoking cigarettes and wearing a shirt with\nnudity on it. They'll defend what they do on the idea that it's\nsomeone &quot;their right,&quot; or &quot;expression,&quot; as if they do what they do\nfor some lofty philosophical reason. What everyone else sees is a person\nwho is not in control of themselves or their vices, in fact, someone who\nviews their vices as a good thing.</p>\n<p>There's the atomistic and nihilistic tendency to give an\n&quot;intellectual&quot; argument for obscenities: &quot;What's so special,&quot; the\nargument goes, &quot;about obscenities in English? They're just a\ncombination of arbitrary sounds! They don't have some objective magical\nharm in them.&quot;</p>\n<p>But the &quot;arbitrary sounds&quot; in an obscenity do indeed have a special\nplace in human psychology. Obscenities are produced and processed in the\nbrain quite differently from non-obscene language, involving the more\nanimalistic/reptilian parts of the brain. When assembling a well-thought\nout case, there is really never a temptation to litter it with curses.</p>\n<p><strong>When a person curses, it's a direct indication that they are thinking\non a lower, more reactive, more emotional level.</strong></p>\n<p>I get a lot of email every day and most I don't answer for time\nconstraints. I've gotten good at filtering out emails, and I have\nrealized that obscenities are one of the best indications of a low\nquality content. I haven't gone so far as to totally block curse words\nwith Spam Assassin, but it is genuinely rare that I receive an email of\nany quality with obscenities.</p>\n<p>All of this is to say that obscenities are a great indication of\nreactive thinking. When someone is cursing, he is thinking at least in\npart like an animal. In deciding not to curse, I have decided to be\nquiet first, then only evaluate things calmly afterwards.</p>\n<p>For me, there is extra reason not to curse because I am in a position of\nan exemplar for many people on the internet. The internet is full of\n&quot;snarky&quot; people cursing profusely and creating the idea that all\n&quot;famous&quot; people should be highly arrogant and emotional.</p>\n<p>There might be times when it's proper for someone to react in righteous\nanger, but those are in reality so rare as to only happen in\nlife-and-death situations. Instead, a lot of modern nihilism is becoming\njust as emotionally transfixed on minor slights and imaginary problems,\nthus one spews out curses as if one is fighting some kind of crusade.\nThis makes profuse cursers not only the type of people who are reactive\nand hard to relate to, but indicates how disordered their priorities\nare.</p>", "link": "https://lukesmith.xyz/articles/obscenities-are-symptoms-of-weak-minds/", "date_published": "2021-09-03 00:00:00+00:00", "persistent": true, "user": null, "language": "en-US"}]