[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Covid bounce back", "description": "COVID bounce back, based on PCR and LFT test data\nhttps://covid.joinzoe.com/data#levels-over-time\n\nhttps://covid.joinzoe.com/post/covid-bounces-back-as-cases-start-to-rise\n\nBased on PCR and LFT test data\n\n7th to 21st August 2021\n\nAround one million weekly contributors\n\n25,876 recent swab tests\n\nSymptomatic cases in fully vaccinated (UK), 29.4% of the total new daily cases\n\nOur data shows post-vaccination infections are much more like a cold than the flu, with the top symptoms being runny nose, headache, sneezing, sore throat and loss of smell. \n\nWe’re again calling on the government to add these cold-like symptoms to their list to help educate the public and catch more cases\n\nNew cases are highest in the 18-35 age groups\n\nFollowed by the 0-18 year olds\n\nPrevalence\n\nOn average 1 in 100 people in the UK currently have symptomatic COVID\n\nUK R value is 1.1 (Scotland, 1.2)\n\nLong covid\n\nEstimated that 870 cases a day will go on to experience symptoms for longer than 12 weeks\n\nProbability of long COVID is much lower than the previous wave\n\nProbability of contracting long COVID is much higher in younger people\n\nDriven by the fact that more young people are contracting COVID now compared to older \ngenerations\n\nProfessor Tim Spector\n\nUnfortunately, we’re back in a position where cases, hospitalisations and deaths are all going up and the UK has the highest rates of COVID in Europe, despite our superior vaccination rates. \n\nThe main difference between the UK and Europe is our lack of restrictions. In many parts of Europe, people are still wearing face coverings and observing some social distancing. \n\nIn the UK, where we eagerly declared ‘freedom’ from COVID and did away with even the most basic social measures, COVID has found an opportunity to spread. \n\nAs kids head back to the classrooms, there’s a good chance cases will continue to rise from here.\n\n\nUK data\n\nhttps://coronavirus.data.gov.uk\n\nUnited States data\n\nhttps://covid.cdc.gov/covid-data-tracker/#trends_dailytrendscases\n\nhttps://covid.cdc.gov/covid-data-tracker/#vaccination-trends\n\nhttps://covid.cdc.gov/covid-data-tracker/#hospitalizations", "link": "https://www.youtube.com/watch?v=b_d7OLO_2nE", "date_published": "2021-09-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Interview on the NHS in the UK", "description": "A short interview for those intrested in the NHS and the philisopichal approach to health care", "link": "https://www.youtube.com/watch?v=F2HNp42rz9I", "date_published": "2021-09-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Risks following infection versus vaccination", "description": "UK, (England), Risk of thrombocytopenia and thromboembolism after covid-19 vaccination and SARS-CoV-2 positive testing: self-controlled case series study\n\nhttps://www.bmj.com/content/374/bmj.n1931\n\nhttps://www.bbc.co.uk/news/health-58347434\n\nProf Julia Hippisley-Cox\n\nPeople vaccinated with first doses, 16 or over\n\nN = 29,121,633\n\nOxford-AstraZeneca (ChAdOx1 nCoV-19)\n\nN = 19,608,008\n\nPfizer-BioNTech (BNT162b2mRNA)\n\nN = 9,513,625\n\nPeople testing positive SARSCoV-2\n\nN = 1,758,095\n\nWithin 28 days of three exposures\n\nFirst dose of the ChAdOx1 nCoV-19 vaccine\n\nFirst dose of the BNT162b2 mRNA vaccine\n\nSARS-CoV-2 positive test\n\nFor every 10 million people vaccinated with the AstraZeneca\n\nAn extra 107 would be hospitalised or die from thrombocytopenia\n\n(1 in 93,459)\n\n9 times lower than the risk following an infection\n\nAn extra 66 would be hospitalised or die from blood clots in the veins\n\nNearly 200 times lower than the risk following an infection\n\nFor every 10 million people vaccinated with the Pfizer\n\nAn extra 143 extra strokes would be seen\n\n(1 in 69,930)\n\n12 times lower than the risk following an infection\n\nMyocarditis and pericarditis\n\nChest pain, shortness of breath, or feelings of having a fast-beating, fluttering, or pounding heart\n\nhttps://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-june-25-2021\n\nhttps://www.cdc.gov/mmwr/volumes/70/wr/mm7027e2.htm\n\n52 million doses to 12–29 years\n\n1,226 reports of myocarditis after mRNA vaccination 42,414\n\nOne in 42,414\n\nData demonstrate increased risks, particularly within the seven days following the second dose\n \nThe observed risk is higher among males under 40 years of age compared to females and older males\n\nRisk is highest in males 12 through 17 years of age", "link": "https://www.youtube.com/watch?v=Sk4UoAkLaDU", "date_published": "2021-09-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]