[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Tiny Desk Contest 2021: Desks In The Wild", "description": "From fields of flowers to seaside cliffs (and to lots and lots of backyards), Tiny Desk Contest entries have taken us to some pretty amazing places this year. Here are some of the artists who used their outdoor voices and recorded their entries in the wild. \n\nMusic: \"Man On Fire\" by Paul Saint John and the Nighthawks\n\nWatch more entries: https://tinydeskcontest.npr.org/2021/browse/\n\n#tinydesk #tinydeskcontest", "link": "https://www.youtube.com/watch?v=vixsBxoufRg", "date_published": "2021-06-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Carrtoons, Kaelin Ellis, Kiefer and The Kount: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nBobby Carter | June 28, 2021\nThe Tiny Desk managed to stay nimble during the COVID-19 pandemic thanks to our (home) concert series and the musicians who were determined to make moves in quarantine. Creative souls found myriad ways to get their art to the masses via live streams and social media while also conjuring new ways to collaborate and connect to audiences. Over the past year and some change, beatmakers Carrtoons, Kaelin Ellis, Kiefer, and The Kount took to social media individually and often collaboratively to cook up productions, often resulting in viral moments and never-seen-before glimpses into their creative process. \nAs we continue to celebrate 50 years of NPR, Tiny Desk was determined to take part. To honor the iconic themes from our news programs, we asked these four producers to come up with their own spin on the All Things Considered theme (written by Don Voegeli) the Morning Edition theme and the theme for Weekend Edition (both written by B.J. Leiderman).\n\nSET LIST\n\"All Things Considered (Remix)\"\n\"Morning Edition (Remix)\"\n\"Weekend Edition (Remix)\"\n\nMUSICIANS\nCarrtoons: bass\nKaelin Ellis: drums\nKiefer: piano, keyboards\nThe Kount: percussion\n\nCREDITS\nVideo and Audio: Carrtoons, Kaelin Ellis, Kiefer, The Kount\n\"All Things Considered\" theme song: Don Voegeli\n\"Morning Edition\" and \"Weekend Edition\" theme songs: B.J. Liederman\n\nTINY DESK TEAM\nProducers: Bobby Carter, Suraya Mohamed\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin, Andy Huether\nTiny Production Team: Bob Boilen, Kara Frame, Gabrielle Pierre\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #carrtoons #kiefer #kaelinellis #thekount", "link": "https://www.youtube.com/watch?v=vXWcUdV9AsY", "date_published": "2021-06-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]