[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCswH8ovgUp5Bdg-0_JTYFNw", "title": "Feel Like Screaming? Try this! | Russell Brand", "description": "Elites are taking over! Our only hope is to form our own. To learn more join my cartel here http://russellbrand.com/ and get weekly bulletins too incendiary for anything but your private inbox.\n*not a euphemism\n\nMy Audible Original, ‘Revelation', is released on 25 March\nUS: http://adbl.co/revelation\nUK: http://adbl.co/revelationuk\nAU: http://adbl.co/revelationau\nCA: http://adbl.co/revelationca\n\nTry this 3 minute Kundalini exercise for emotional balance! How did you get on? What would you like to see next?\n\nI am not a kundalini teacher - I am a student like you - let's try this together\n\nHere are a few guidelines:\n\nBefore practicing this meditation drink a glass of water.\n\nSit in easy pose.\n\nMUDRA \n- Place the arms across the chest and lock hands under the armpits, with palms open and against the body. \n- Raise the shoulders up tightly against the earlobes without cramping the neck muscles.\n-  Apply Neck Lock.\n\nEYE POSITION: Close the eyes.\n\nBREATH: The breath will automatically become slow.\n\nTIME: Continue for 3 minutes, gradually increasing to 11 minutes.\n\nThis meditation is called Sunia(n) Antar. It is very good for women. It is essential at times when one is worried or upset and doesn’t know what to do, or when one feels like screaming, yelling and misbehaving. When out of focus or emotional, attention should be given to the body’s water balance and breath rate. Humans are approximately 70% water, and behaviour depends upon the relation of water and earth, air and ether. Breath, representing air and ether, is the rhythm of life.\n\nNormally we breathe 15 times a minute, but when we are able to rhythmically slow down the breath to only four breaths per minute, we have indirect control over our minds. This control eliminates obnoxious behaviour, promoting a calm mind regardless of the state of affairs.\n\nWhen there is a water balance in the system and the kidneys are under pressure, it can cause worry and upset. Drinking water, pulling the shoulders up to the ears and tightly locking the entire upper area creates a solid brake that can be applied to the four sides of the brain. After 2/3minutes thoughts will still be there, but one does not feel them. This is a very effective method of balancing the functional brain.\n\n-------------------------------------\n\nIf you liked this video, check out my playlist on Yoga & Meditation here: https://www.youtube.com/watch?v=wmPPvPkEaEA&list=PL5BY9veyhGt47NoUFchwKbpfjv5jRbC8s\n\nSubscribe to my channel here: http://tinyurl.com/opragcg\n(make sure to hit the BELL icon to be notified of new videos!)\n\nListen to my Under The Skin podcast here: \nhttp://luminary.link/russell\n\nInstagram: http://instagram.com/russellbrand/\nTwitter: http://twitter.com/rustyrockets", "link": "https://www.youtube.com/watch?v=O3dx_moHbKY", "date_published": "2021-01-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCswH8ovgUp5Bdg-0_JTYFNw", "title": "“The real pandemic” - who benefits from our breakdown?", "description": "Elites are taking over! Our only hope is to form our own. To learn more join my cartel here https://www.russellbrand.com/join/ and get weekly bulletins too incendiary for anything but your private inbox.\n*not a euphemism\n\nMy Audible Original, ‘Revelation', is released on 25 March\nUS: http://adbl.co/revelation\nUK: http://adbl.co/revelationuk\nAU: http://adbl.co/revelationau\nCA: http://adbl.co/revelationca\n\nThe Coronavirus crisis poses the greatest threat to mental health since the second world war. But whilst mental health trusts continue to receive funding cuts, billionaires - who benefit from government wealth-friendly tax laws and loopholes - have enjoyed record profits. \n\nListen to my Under The Skin podcast here: \nhttp://luminary.link/russell\n\nSubscribe to my channel here: http://tinyurl.com/opragcg\n(make sure to hit the BELL icon to be notified of new videos!)\n\nGet my book \"Recovery\" here: https://amzn.to/2R7c810\nGet my book \"Mentors\" here (and as an audiobook!): https://amzn.to/2t0Zu9U\n\nInstagram: http://instagram.com/russellbrand/\nTwitter: http://twitter.com/rustyrockets\n\nProduced by Gareth Roy", "link": "https://www.youtube.com/watch?v=f-ZaBPnGJVY", "date_published": "2021-01-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]