[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Miley Cyrus: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nMiley Cyrus has always understood that music is theater. So it's no surprise that, visiting the imaginative space that is the Tiny Desk, she transforms it into something both fantastical and true to her topsy-turvy Mileyness.\n\nCyrus ruled preteen hearts on the small screen before mastering pop stardom's big stages, and throughout her career she's played with sound and image in unexpected and even controversial ways. And she's never balanced pop's glorious artifice with her own soulful authenticity more self-assuredly than she does on her latest album, the rock and roll manifesto Plastic Hearts.\n\nHere, the scene opens with Cyrus, dressed head to toe in rock-star faux fur, in what looks like a teenage girl's bedroom. But the perspective in this pink-and-purple space feels a little ... odd. As Cyrus sings, it becomes clear that this is her Wonderland – like Alice full of magical cake, she's grown to exceed her surroundings. By the end of this three-song set, Cyrus reveals that it's the adolescent enclave that grew too small for her, not the other way around.\n\nThe songs Cyrus offers are as direct and affecting as the set is whimsical. Cyrus has lately proven herself one of pop's great interpretive vocalists, and she scores another triumph with her version of Mazzy Star's \"Fade Into You,\" a hazy psychedelic anthem that she infuses with just the edge of the next day's hangover. The two songs from Plastic Hearts that follow are her own bids at classic-rock timelessness. In \"Golden G-String\" Cyrus assesses her own life in the spotlight with Leonard Cohen-esque charm. And \"Prisoner\" is the power ballad that lets Cyrus really break out – as she leaves the tiny room — just a box, it turns out, on a soundstage – and joins her band, she's as free and self-confident as she's ever been.\n\nSET LIST\n\"Fade Into You\"\n\"Golden G-String\"\n\"Prisoner\"\n\nMUSICIANS\nMiley Cyrus: vocals\nStacy Jones: drums\nMike Schmid: keys\nMax Bernstein: guitar\nJamie Arentzen: guitar\nJoe Ayoub: bass\n\nCREDITS\nProducer: Johnny Pascucci\nDirector: Alana O'Herlihy\nAssistant Director: Steve Bagnara\nDirector of Photography: Jordan Ritz\nSet Design: Eamonn McGlynn\nSound Tech: Johnny Karlsson\nFOH/Broadcast Engineer: Paul Hager\n\nTINY DESK TEAM\nProducers: Bob Boilen, Bobby Carter\nVideo Producer: Morgan Noelle Smith\nAudio Mastering: Josh Rogosin\nTiny Production Team: Kara Frame, Maia Stern\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann", "link": "https://www.youtube.com/watch?v=W5-yezpcZNU", "date_published": "2021-01-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Lous and The Yakuza: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nBob Boilen | January 27, 2021\nThere's an elegant vibe as Lous and The Yakuza perform a Tiny Desk from the Book Bar in the Hôtel Grand Amour in Paris. And while the music is smooth, upbeat and warm, what lies beneath in Lous backstory, in her French lyrics, is, at times, deep and disturbing.\n\nLous — an anagram for \"soul\" — is Marie-Pierra Kakoma, a 24-year-old artist based in Belgium but born in the Democratic Republic of the Congo. She came to Belgium because her family escaped war in the Congo. They were refugees. For her Tiny Desk (home) concert, she opens with her 2019 single, \"Dilemme.\" The song conjures up images of growing up in the Congo and Rwanda: \"Living haunts me, everything that surrounds me made me mean,\" she sings in French. Her songs are often set to Congolese rumba rhythms, filled with resilience, beauty and resistance.\n\nThese songs come from her 2020 album, Gore, and are steeped in a life that saw her mother imprisoned in the Congo for being Rwandan, then become separated during their escape to Belgium. They were eventually reunited, butLous was a troubled teen and spent a period of time adrift before pulling her life together in pursuit of music and art. There's much to uncover and discover here. This Tiny Desk (home) concert is a deep journey.\n\nSET LIST\n\"Dilemme\"\n\"Bon Acteur\"\n\"Dans La Hess\"\n\"Solo\"\n\"Amigo\"\n\nMUSICIANS\nLous: vocals\nJoseph Nelson: keys\nJamiel Blake: drums\nSwaeli Mbappe: bass\nAyelya Douniama: vocals\nMyriam Sow: vocals\n\nCREDITS\nVideo: Lenny Grosman, Robin Conrad and Loris de Oliveira\nAudio: Charles Darnaud\nDirectors: Lenny Grosman and Robin Conrad\nCamera: Loris de Oliveira\nFOH Engineer: Florent Livet\nMonitor Engineer: Antoine Lalbat\nProduction: Jim Schachmes and Brieux Ferot\nStage Manager: Maddly Mendy-Sylva\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nTiny Production Team: Kara Frame, Morgan Noelle Smith\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann", "link": "https://www.youtube.com/watch?v=dzgEjZyN9ec", "date_published": "2021-01-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]