[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "The Retirement Gamble (full documentary) | FRONTLINE", "description": "Will your IRA or 401K accounts ensure a safe retirement? FRONTLINE investigates the big business of retirement, raising troubling questions about how America's financial institutions protect our savings. (Aired 2013)\n\nThis journalism is made possible by viewers like you. Support your local PBS station here: http://www.pbs.org/donate​.\n\nTrillions of dollars in Americans' retirement savings are invested in large and small accounts managed by banks, brokerages, mutual funds, and insurance companies. But whether your IRA or 401K will assure a safe retirement is largely a gamble. In the 2013 documentary “The Retirement Gamble,” producers Martin Smith and Marcela Gaviria build off reporting from the groundbreaking series “Money, Power and Wall Street,” revealing how fees, self-dealing, and kickbacks bring great profits to Wall Street while imperiling the prospects of a secure future for individuals. The documentary explores who has the consumer's best interests in mind, and whether there is a better way to manage our retirements.\n\nLove FRONTLINE? Find us on the PBS Video App where there are more than 300 FRONTLINE documentaries available for you to watch any time: https://to.pbs.org/FLVideoApp​ \n\n#Documentary #RetirementGamble\n\nSubscribe on YouTube: http://bit.ly/1BycsJW​\nInstagram: https://www.instagram.com/frontlinepbs​\nTwitter: https://twitter.com/frontlinepbs​\nFacebook: https://www.facebook.com/frontline\n\nFunding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Major funding for FRONTLINE is provided by the Ford Foundation. Additional funding is provided by the Abrams Foundation; the John D. and Catherine T. MacArthur Foundation; Park Foundation; and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation, and additional support from Koo and Patricia Yuen.", "link": "https://www.youtube.com/watch?v=lkOQNPIsO-Q", "date_published": "2021-09-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]