[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCAKcSON6PSG_JkTbXh2WdIg", "title": "LineCheck - Minnesota's Music Ecosystem (full video)", "description": "Live music has been on pause since March 2020. As venues and audiences start to return to shows, what is the state of Minnesota’s live music economy? \n\nIn the first episode of LineCheck, The Current's virtual conversation series, Kristin Schwab of @marketplaceAPM interviewed venue operators Sophia Eris (Aunties), Ashley Ryan (First Avenue), and Molly Maher (freelance). Each operator talked about their experiences during the shutdown and their preparations for the challenges and opportunities ahead.\n\nTo open and close the evening, Charlie Parr performed \"817 Oakland Avenue\" and \"Last Of The Better Days Ahead\" from Sacred Heart Music Center in Duluth.\n\nFull LineCheck schedule: https://www.thecurrent.org/feature/2021/05/18/linecheck-series", "link": "https://www.youtube.com/watch?v=Xxk1HL4erjc", "date_published": "2021-06-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCAKcSON6PSG_JkTbXh2WdIg", "title": "Minnesota Sessions: Miloe at Franconia Park", "description": "For The Current's Minnesota Sessions, @miloe brings his cool, breezy music to a warm summer day at the Franconia Sculpture Park. Blending elements of lo-fi bedroom pop with restrained yet bubbly production, Miloe performs songs from his 2020 debut EP, Greenhouse. \n\nSongs Played\n00:00 Winona\n03:10 Change Your Mind\n06:11 Marna\n\nMinnesota Sessions are presented by Lovin' Lake County. \n\nSubscribe to our channel:\nhttp://www.youtube.com/user/893TheCurrent\n\nLike/Follow:\nhttps://www.facebook.com/TheCurrent/​​​​\nhttps://twitter.com/TheCurrent​​​​\nhttps://www.instagram.com/thecurrent/\n\nThe Current encourages all music fans to support their local artists and the continued longevity of their craft. As part of this effort, The Current will be compensating artists for their performances in Minnesota Sessions through the Legacy Amendment Arts and Cultural Fund.", "link": "https://www.youtube.com/watch?v=bUWxHIoVVc4", "date_published": "2021-06-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]