[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Ratchet and Clank No Damage Challenge Powered by truth", "description": "(Powered by truth) How long can our resident Ratchet and Clank expert progress through Rift Apart without taking any damage? We’re about to put our skills to the test!\n\n#ratchetandclank #nodamagechallenge #ratchetclank", "link": "https://www.youtube.com/watch?v=k2ediQ46jCw", "date_published": "2021-06-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Super Smash Bros. Ultimate – Mr. Sakurai Presents \"Kazuya\"", "description": "Check out the full presentation for Super Smash Bros. Ultimate presented by Mr. Sakurai for the new character, Kayuza who was unveiled at Nintendo Direct during E3 2021!\n\n#supersmashbros #smashbros #kazuya", "link": "https://www.youtube.com/watch?v=rK6-ShLfQtI", "date_published": "2021-06-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Zelda: Breath of the Wild Sequel - 6 Things You Might Have Missed", "description": "E3 didn't give us a release date, but it did drop new information through a Zelda: Breath of the Wild Sequel Trailer. We reconstruct some of the scenes around Ganondorf's awakening, theorize what happens with the Master Sword, and examine details you might have missed about the Zonai's involvement.\n\nWe mention other important things, such as influences from works of Studio Ghibli yet again, if some combat mechanics are returning, and how floating island exploration is possibly designed. As time goes on, more theories will come about until the next trailer, and finally the release of the game.\n\nBreath of the Wild’s sequel seems to start off right after the end of the original game. What we learned with the newest sequel is there is now a new counterpart to Link and his adventure continues in the clouds with floating islands. While several techniques and pieces of the world were shown, much of the sequel is still a mystery.\n\nThe sequel to Breath of the Wild is planned to release sometime in 2022.\n\n#zelda #botw #botw6", "link": "https://www.youtube.com/watch?v=LSClLrdNMUE", "date_published": "2021-06-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]