[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "At Black Funeral Homes in New Orleans, COVID's Toll Is Steep | \"Death Is Our Business\" | FRONTLINE", "description": "Watch a scene from \"Death Is Our Business,\" a forthcoming documentary chronicling how two of the oldest Black-owned funeral homes in New Orleans have navigated the coronavirus pandemic and its racially disproportionate toll.\n\nSubscribe on YouTube: http://bit.ly/1BycsJW \n\nFrom award-winning filmmaker Jacqueline Olive, the short film documents how staff at these funeral homes have reimagined traditional cultural grieving practices for the COVID-19 era, aiming to bring comfort to a hard-hit city — while trying to keep from falling ill themselves.\n\n“It's been a very stressful time,” says embalmer Stephanie Simon in the above clip. “It was like we were playing Russian roulette with our own lives.\"\n\nWatch \"Death Is Our Business,\" a co-production between FRONTLINE, Firelight Media and WORLD Channel, starting March 23. https://to.pbs.org/3vRkxer\n\nThe documentary also airs on WORLD Channel March 24: \n\nInstagram: https://www.instagram.com/frontlinepbs\nTwitter: https://twitter.com/frontlinepbs\nFacebook: https://www.facebook.com/frontline\n\nFRONTLINE is streaming more than 300 documentaries online, for free, here: http://to.pbs.org/hxRvQP \n\nFunding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Major funding for FRONTLINE is provided by the Ford Foundation. Additional funding is provided by the Abrams Foundation; the John D. and Catherine T. MacArthur Foundation; Park Foundation; the Heising-Simons Foundation; and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation, and additional support from Koo and Patricia Yuen.", "link": "https://www.youtube.com/watch?v=V25clOnIZl0", "date_published": "2021-03-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]