[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "25 Years Of Resident Evil", "description": "Resident Evil is 25 years old today, and to celebrate its undying life, here are 25 reasons to love the iconic survival horror franchise.\n\n25 years ago today, Resident Evil clawed its way into the gaming medium, paving way for the survival-horror genre as we know it. Originally launching on the first PlayStation back in 1996, Resident Evil has since spawned 28 games, including critically acclaimed sequels like Resident Evil 4 and its renowned remakes.\n\nThroughout its undying life, Resident Evil has introduced us to an iconic cast of characters like Leon S. Kennedy, Jill Valentine, Chris Redfield, Ada Wong, and, of course, the ever-charming Barry Burton. Since the franchise’s dawn, it reinvented itself and the horror genre, revolutionizing from fixed camera angles and tank controls, to an over-the-shoulder perspective in Resident Evil 4 that influenced games like Gears of War and Batman: Arkham Asylum.\n\nTo celebrate Resident Evil’s 25th anniversary, we’ve created a list of 25 reasons to love its undying place in games. From its masterfully orchestrated horror, like Mr. X’s first appearance or Jack Baker bursting through a wall in Resident Evil 7: Biohazard, to the more quirky, like its Japanese musical Biohazard: Voice of Gaia, and its, at times, very silly dialogue. \n\nThere’s a lot to love, and thankfully there’ll be more to love in the future with the release of Resident Evil: Village and the already fan-favorite lady Alcina Dimitrescu.\n\n#ResidentEvil #ResidentEvil25th #ResidentEvilVillage", "link": "https://www.youtube.com/watch?v=qER5UHITvJI", "date_published": "2021-03-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Razer & HyperX's Budget $50 Headphones - Which Is Best?", "description": "HyperX Cloud Stinger: https://bit.ly/3sh4OD6\nRazer Kraken X: https://bit.ly/3c7kzXE\n\nWe look at the cheapest gaming headphone offerings from Razer and HyperX, both running $50, and decide which is the best product.\n\nIt's easy to break the bank when shopping for audio gear like headphones, but both Razer and HyperX have released competing wallet-friendly options. The Razer Kraken X and the Kingston HyperX Cloud Stinger are both on the market for roughly $50, but which is better?\n\nIn this video we go over some important factors like build quality including weight and materials, audio features, and microphone quality. The Razer set also comes with a piece of bonus software for its 7.1 surround sound software, which seems to work reasonably well at imitating true 7.1 surround. The headsets do come out almost evenly, so some of the factors might be worth more in your personal preference. Check out the video for the full breakdown of all the features to help pick which headset is right for you.\n\n#GamingHeadset #Razer #HyperX", "link": "https://www.youtube.com/watch?v=Sp4TUGie7iY", "date_published": "2021-03-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "TEKKEN 7 – Lidia Sobieska Launch Trailer", "description": "After the Tekken​ Force arrived into parts of Poland, the Polish citizens cried out for a stronger leader and Lidia answered that call! Get a glimpse of what Lidia Sobieska can do in ther launch trailer in Tekken 7.\n\nLidia Sobieska, joins the TEKKEN 7 ranks on March 23rd!", "link": "https://www.youtube.com/watch?v=lS96JVoPYgE", "date_published": "2021-03-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call Of Duty’s Nuke Event Is Odd", "description": "Call of Duty: Modern Warfare has been teasing a nuke event and possible map change since mysterious bunkers opened up on the Warzone map nine months ago. It hasn’t happened yet and we’re looking over rumors, leaks, and what’s happened so far to speculate if Cold War Season 3 will finally deliver. \n\nCall of Duty: Modern Warfare has been teasing a nuke event and a possible map change since mysterious bunkers opened up on the Warzone map nine months ago. It hasn’t happened yet and we’re wondering if Cold War season two will finally deliver. There have been a number of unconfirmed leaks recently containing audio files referencing races, plague zones, Verdansk being overrun with zombies, and nukes inbound. These could be hinting at a map change, a limited-time mode similar to The Haunting Of Verdansk, or a season-ending event similar to Know Your History. So far, Cold War Season two has seen a mysterious ship carrying Nova 6 gas crash into the battle royale map and split apart. Zombies that players can trigger and fight by activating Trials computers have migrated from the Ship to the Prison and Hospital as well as started evolving. \n\nIn this video, we talk about how slowly the event has been progressing and the mixed messaging about it on official Call Of Duty social media. We’ll cover the audience mismatch between Cold War and Modern Warfare players and why the Cold War takeover is still having a negative impact on the battle royale map. We’ll talk over Warzone’s past events and why limited time modes are important. Finally, we’ll take a look at your comments and how you’re feeling about Modern Warfare and what Activision could do to keep Infinity Ward’s game alive. \n\nFans are hoping Call Of Duty: Warzone will have some type of major event between Season 2 and Season 3, which could happen in mid-April. Call Of Duty: Warzone seasons typically run about 10 weeks, with the current Battle Pass ending on April 20.\n\n#CallofDuty #Warzone #CodChat", "link": "https://www.youtube.com/watch?v=YMFNre_mqlk", "date_published": "2021-03-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]