[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "Amazing elementary apps you can install on other linux distributions", "description": "Wanna get your own Linux server? Visit https://www.linode.com/linuxexperiment for a 100$ credit ! \n\nGet your Linux desktop or laptop here: https://slimbook.es/en/\n\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nI also do a Gaming Podcast: https://www.youtube.com/channel/UCbRPZ11S1quJ4ESoj42A3ug\nJoin us on our new Discord server: https://discord.gg/xK7ukavWmQ\nTwitter : http://twitter.com/thelinuxEXP\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\nFollow me on ODYSEE: https://odysee.com/@TheLinuxExperiment:e\nOr join ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\n00:00 Intro\n00:33 Sponsor: Linode\n02:19 Clips\n03:35 Planner\n04:49 Outliner\n05:27 Minder\n06:06 Norka\n06:48 TextShine\n07:38 Frog\n08:11 Resizer\n08:34 Optimizer\n09:11 Annotator\n09:49 Ensembles\n10:25 Tuner\n10:27 Mixer\n11:28 Eddy\n11:44 Pebbles\n12:20 Ordne\n12:45 Fondo\n\nADD ELEMENTARY'S REMOTE:\nflatpak remote-add --if-not-exists --system appcenter https://flatpak.elementary.io/repo.flatpakrepo\n\nClips\n\nIt's a simple clipboard manager that lets you look at everything you copied in a graphical way.\n\nPlanner\n\nThe second app here is Planner. It's the best todo list / project management application you can use on Linux, period.\n\nOutliner\n\nIt lets you, well, outline, your document, by structuring it with big titles, subtitles, and notes.\n\nMinder\n\nMinder is a mind mapping tool, that lets you create nodes linked to each other.\n\nNorka\n\nA much simpler app, but really useful when you just want to write something without worrying about formatting. It's a continuous text editor, so no pages, no styles, only text, and markdown if you really, really want to add formatting.\n\nTextshine\n\nThere's also textshine, it's a very, very powerful text manipualtion utility. It lets you grab or write anything, and then transform it by setting it all to upper case, lowser case, sentence case, titles, camelcase, snake case, whatever case you want.\n\nFrog\n\nThe first one is Frog. it's a very simple OCR tool. You just open it, select an area of your screen, and it's going to grab all the text it can read or detect in the image\n\nResizer\n\nNext is resizer, it's a very simple tool that lets you resize images. You can just open it through your apps menu, and drag any image in there to resize it to the desired dimensions.\n\nOptimizer\n\nCombine it with Optimizer, which automatically optimizes you images to use less space.\n\nAnnotator\n\nNext is Annotator, a simple image annotation tool, that can still do a lot. If you don't want to fire up something like Inkscape or GIMP each time you want to mark down a few notes or ideas onto an image, a design proposal, or a simpe screenshot for a bug report, this is your tool.\n\nEnsembles\n\nIt's an arranger workstation that lets you play music, arrange a performance, or just improvise with a few pre-recorded styles to give you a beat and a tempo. It has DSP effects, more than 200 bult-in instruments, you can sample sounds to automate your band, and connect to an external MIDI keyboard.\n\nTuner\n\nNext is Tuner, and it will be a nice addition to the apps library of anyone who likes to discover new music: it lets you browse a huge catalog of web radios, and play them.\n\nMixer\n\nThis next app kinda solves a missing feature of elementary OS, which is that it doesn't really let you control your audio outputs all that much. With Mixer, you can see each app that plays audio, change its volume and balance, and change its output.\n\nEddy\n\nThe first one is Eddy, and it's a graphical .deb package installer. By default, elementary OS doesn't let you install deb packages graphically, and this solves that need. it's simple, straightforward, and heavily recommended on elementary OS.\n\nPebbles\n\nThe default elementary OS calculator is OK, but if you need something more powerful, Pebbles is your new best friend.\n\nOrdne\n\nIt's a simple pomodoro timer that you can use to apply that working method.\n\nFondo\nIt lets you browse, search, and filter images that you can get as your wallpaper in just one click.", "link": "https://www.youtube.com/watch?v=pyg615mdZeQ", "date_published": "2021-11-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]