[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCHnyfMqiRRG1u-2MsSQLbXA", "title": "Most People Don't Know How Bikes Work", "description": "Why are bicycles stable? The most common answer is gyroscopic effects, but this is not right. This video was sponsored by Kiwico. Get 50% off your first month of any crate at https://kiwico.com/veritasium50\n\nHuge thanks to Rick Cavallaro for creating this bike on short notice. Thanks to all the friends who participated in the filming. Rick was also responsible for the Blackbird Faster Than The Wind Downwind Cart. https://youtu.be/jyQwgBAaBag \n\nMuch of the information presented here on the stability of a riderless bicycle stems from original research at\n  Delft       http://bicycle.tudelft.nl/schwab/Bicycle/\n  and\n  Cornell  http://ruina.tam.cornell.edu/research/topics/bicycle_mechanics/overview.html\n\nThis line of bicycle-balance research was initiated by Jim Papadopoulos:  https://www.nature.com/articles/535338a\n\nGreat videos on bikes and counter-steering:\n\nMinutePhysics: How Do Bikes Stay Up? https://youtu.be/oZAc5t2lkvo\n\nMinutePhysics: The Counterintuitive Physics of Turning a Bike: https://youtu.be/llRkf1fnNDM\n\nWhy Bicycles Do Not Fall - Arend Schwab TED talk: https://youtu.be/2Y4mbT3ozcA\n\nToday I Found Out: We Still Don't Know How Bicycles Work https://youtu.be/YWsK6rmsKSI\n\nTU Delft - Smart motor in handlebars prevents bicycles from falling over: https://youtu.be/rBOQp2uY_lk\n\nAndy Ruina Explains How Bicycles Balance Themselves: https://youtu.be/NcZCzr9ExKk\n\n▀▀▀\nMore References:\n\nTU Delft Bicycle Site: http://bicycle.tudelft.nl/schwab/Bicycle/\n\nBicycle stability program: http://ruina.tam.cornell.edu/research/topics/bicycle_mechanics/JBike6_web_folder/index.htm\n\n▀▀▀\nSpecial thanks to Patreon supporters: Luis Felipe, Anton Ragin, Paul Peijzel, S S, Benedikt Heinen, Diffbot, Micah Mangione, Juan Benet, Ruslan Khroma, Richard Sundvall, Lee Redden, Sam Lutfi, MJP, Gnare, Nick DiCandilo, Dave Kircher, Edward Larsen, Burt Humburg, Blake Byers, Dumky, Mike Tung, Evgeny Skvortsov, Meekay, Ismail Öncü Usta, Crated Comments, Anna, Mac Malkawi, Michael Schneider, Oleksii Leonov, Jim Osmun, Tyson McDowell, Ludovic Robillard, Jim buckmaster, fanime96, Ruslan Khroma, Robert Blum, Vincent, Marinus Kuivenhoven, Alfred Wallace, Arjun Chakroborty, Joar Wandborg, Clayton Greenwell, Michael Krugman, Cy 'kkm' K'Nelson,Ron Neal \n\n▀▀▀\nWritten by Derek Muller\nFilmed by Trenton Oliver, Raquel Nuno and Derek Muller\nEdited by Derek Muller\nMusic from Epidemic Sound and Jonny Hyman\nProduced by Derek Muller, Petr Lebedev and Emily Zhang", "link": "https://www.youtube.com/watch?v=9cNmUNHSBac", "date_published": "2021-11-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]