[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Omicron objectivity", "description": "Omicron variant\n\nDr Angelique Coetzee, South African Medical Association\n\nFirst to raise alarm about the new omicron\n\nhttps://www.youtube.com/watch?v=wr-v-bT8X38\n\na storm in a teacup\n\nWhy everyone up in arms\n\nSo far, what we have seen is very mild cases\n\n17 to 18 November, noticed a change in clinical picture\n\nAfter 10 week of low numbers\n\nFor not its extremely mild cases that we are seeing\n\nLooking at the mildness of these symptoms, I think it’s been missed in other countries\n\nSeverely mild, headache\n\nWhat is different is the extreme tiredness\n\nBody aches\n\nMostly men under 40s\n\nI really think the vaccine plays a role here, breakthrough infections, but very very mild\n\nYou can call all of the hospitals in Pretoria you will see there is not a huge influx of patients with this omicron\n\nIf Africa is not going to be vaccinated you will see new variants coming up\n\nRudo Mathivha, head of the intensive care unit at Soweto’s Baragwanath hospital\n\nWe’re seeing a marked change in the demographic profile of patients with Covid-19\n\nYoung people, in their 20s to just over their late 30s, are coming in with moderate to severe disease, \n\nsome needing intensive care.\n \nAbout 65% are not vaccinated and most of the rest are only half-vaccinated\n\nI’m worried that as the numbers go up, the public health care facilities will become overwhelmed\n\nUrgent preparations are needed to enable public hospitals to cope with a potential large influx of patients needing intensive care\n\nOmicron variant may be responsible for as many as 90% of the new SA cases\n\n24% fully vaccinated\n\nOmicron variant\n\n50 mutations overall\n\n32 on spike protein\n\n10 on RBD (delta has 2 RBD mutations)\n\nPresumed high viral load\n\nProf Ravi Gupta, University of Cambridge\n\nhttps://www.bbc.co.uk/news/health-59418127\n\nBeta was all immune escape and nothing else, Delta had infectivity and modest immune escape, this potentially has both to high degrees\n\nUS response\n\nAlready in US\n\nNY, state of emergency\n\nAfrica travel restrictions from Monday\n\nUS citizens allowed back\n\nTSA, 2.3 million passengers on Wednesday\n\nGermany\n\nhttps://www.dw.com/en/covid-germany-confirms-first-2-cases-of-omicron-variant/a-59958183\n\nTwo cases of omicron confirmed in Munich\n\nEntered Munich airport on 24th November\n\nCzech Republic\n\nConfirms first omicron case in Liberec\nWoman had been in Namibia \n\nItaly\n\nOne omicron infection coming from Mozambique.\n\nIsrael response\n\nNo entry to non Israelis\n\nUK response\n\nhttps://www.youtube.com/watch?v=CBMC6S7Hf1E\n\nBrentwood in Essex and Nottingham, two cases linked\n\nThanks to SA for information\n\nSpreads rapidly\n\nCan be spread between people that are double vaccinated\n\nSome immune escape\n\nNeed to slow down seeding\n\nTime for vaccinations and boosters\n\nMore African countries added\n\nRed list, 10-day hotel quarantine\n\nPCR test by 2nd day in the country, isolate until then\n\nAll contacts of a detected case of omicron to self-isolate, regardless of vaccination status\n\nIncrease face coverings in public\n\nVaccines will give protection, boosters will help\n\nBoost the booster campaign\n\nBelgium, first Omicron variant case in Europe\n\nhttps://www.reuters.com/world/europe/belgium-seeks-slow-down-social-life-fight-fourth-covid-wave-2021-11-26/\n\nBelgium, Health Minister Frank Vandenbroucke\n\nB.1.1.529, found in an unvaccinated person\n\nWho had developed symptoms and tested positive on Nov. 22.\n\nYoung adult woman, developed symptoms 11 days after returning from a trip to Egypt via Turkey. \n\nFlu-like symptoms, but no signs of severe disease.\n\nNone of her household members developed symptoms, but were being tested.\n\nProf Sir Andrew Pollard, director of Oxford Vaccine Group\n\nhttps://www.theguardian.com/world/live/2021/nov/27/covid-news-live-omicron-variant-spreads-to-europe-countries-rush-to-impose-travel-bans-on-southern-africa\n\nIf you look at where most of the mutations are, \n\nthey are similar to regions of the spike protein that have been seen with other variants so far\n\nand that tells you that despite mutations existing in other variants, \n\nthe vaccines have continued to prevent very severe disease as we’ve moved through Alpha, Beta, Gamma and Delta.\n\nAt least from a speculative point of view we have some optimism that the vaccine should still work against this variant for severe disease\n\nbut really we need to wait several weeks to have that confirmed.\n\nBut it is extremely unlikely that a reboot of a pandemic in a vaccinated population like we saw last year is going to happen\n\nThe processes of how one goes about developing a new vaccine are increasingly well oiled.\n\nSo if it’s needed that is something that could be moved very rapidly.\n\nHundreds of passengers arriving in Amsterdam from South Africa\n\nOn tarmac for 4 hours\n\nhttps://www.bbc.co.uk/news/world-59442129\n\nTwo KLM flights, 61 tested positive\n\nQuarantined at hotel, awaiting further tests", "link": "https://www.youtube.com/watch?v=cdkCVeWc1pQ", "date_published": "2021-11-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "DW news interview, Omicron latest", "description": "Latest thinking on Omicron", "link": "https://www.youtube.com/watch?v=Xbng22rED1A", "date_published": "2021-11-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Gibraltar Pandemic Achievements", "description": "Fascinating discussion with Dr. Sohail Bhatti, until recently Head of Public Health in Gibraltar.  Sohail is now Public Health Consultant for Slough in UK.", "link": "https://www.youtube.com/watch?v=gZcIuEZUiZw", "date_published": "2021-11-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Interview, correction, qualification", "description": "DW news, quite rightly and correctly, asked me for clarification on my contention that the virus was likely to have arisen in Africa. We know that a young woman arrived from Egypt who had flown via Turkey into Belgium landing on the 11th of November.\n\nWe also we also know that she became symptomatic and tested positive for the omicron variant on the 22nd of November.\n\nIt is possible that this young woman had a long incubation period of 11 days or more, but this is somewhat improbable.\n\nThis clearly leaves open the possibility that she contracted the virus within Belgium, between the 11th and 22nd of November.\n\nIt is therefore within the bounds of possibility that she originally contracted this virus in Egypt, or on the flight from Egypt to Turkey, or the flight from Turkey to Belgium, or in Belgium.\n\nThis is what we know so far and of course it is important not to over extrapolate from the facts at our disposal.", "link": "https://www.youtube.com/watch?v=abMDdJojnqc", "date_published": "2021-11-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]