[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "Stallman returns to the FSF, Microsoft buys Discord, and GNOME 40 is out ! - Linux News - March 21", "description": "Try KernelCare Enterprise for free: https://lp.kernelcare.com/kernelcare-enterprise-experiment\n\nNow, let's see what we have in store fort this video: the release of GNOME 40, Stallman returning to the Free Software Foundation, and the uproar around it, and Microsoft buying Discord.\n\nBecome a channel member to get access to a weekly patroncast and vote on the next topics I'll cover:\nhttps://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nSupport the channel on Patreon: \nhttps://www.patreon.com/thelinuxexperiment\n\nFollow me on Twitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\nFollow me on ODYSEE: https://odysee.com/@TheLinuxExperiment:e\nOr join ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\nThe Linux Experiment merch: get your goodies there! https://teespring.com/en-GB/stores/the-linux-experiment\n\n\n00:00 Intro\n01:30 Linux\n05:24 Open Source\n10:22 Gaming\n11:31 Hardware\n12:25 Apps\n\nUbuntu published a much needed blog post explaining the rationale behing their full on support for Flutter. \nhttps://ubuntu.com//blog/flutter-and-ubuntu-so-far\n\nGNOME 40 was released, and it's probably the biggest change to GNOME since GNOME 3.\nhttps://www.youtube.com/watch?v=eV2KNvtejJw&t=15s\n\nUbuntu will implement desktop icons in a more feature-complete way in Ubuntu 21.04.\nhttps://www.omgubuntu.co.uk/2021/03/ding-ubuntu-21-04-fixes-my-biggest-pet-peeve\n\nMost of you probably knew about the Windows Subsystem for Linux, that lets you run Linux inside of a windows terminal, and use the Linux command Line and even some graphical apps from inside windows. Well, there is now a new project, just as badly named, called LSW, for Linux Subsystem for Windows.\nhttps://bit.ly/3fnNZTq\n\n\nThe first instance of the Elementary Developer Weekend will be held on the 26th and 27th of June 2021. \nhttps://edw.elementary.io/\n\nWikipedia has launched a new service dedicated to companies, called Wikimedia Enterprise.\nhttps://www.wired.com/story/wikipedia-finally-asking-big-tech-to-pay-up/\n\n\nRichard Stallman announced his return to the Free Software Foundation board of directors. An open letter to push the FSF to remove him was co-signed by people from Igalia, KDE, Debian, Ubuntu, Arch, Apache, Mozilla, Solus, OBS Studio, or elementary OS and GNOME. This open letter seems to have done its job, as the FSF announced some changes to the board, where all board members, including existing ones, will be nominated through a more transparent process\n\nhttps://www.theregister.com/2021/03/22/richard_stallman_back_on_fsf_board/\n\nhttps://www.fsf.org/news/preliminary-board-statement-on-fsf-governance\n\nGoogle and Microsoft are trying to fix web browser compatibility issues. The effort is called Compat2021, and it aims to solve the main pain points for developers, like CSS Flexbox, CSS Grid, or how 3D animations are rendered in the browsers.\nhttps://www.engadget.com/google-microsoft-browser-compatibility-issues-104040745.html\n\nGNOME announced the creation of Libadwaita. This new library aims to de-couple GTK, GNOME, and the Adwaita look and feel.\nhttps://aplazas.pages.gitlab.gnome.org/blog/blog/2021/03/31/introducing-libadwaita.html\n\n\nThe Funkey S is a super small handheld running Linux, and which will please a lot of retro gamer. Basically it's something you can affix to your keys, and play games on to pass the time, but it's probably not going to become your go-to handheld any time soon.\n\nhttps://www.youtube.com/watch?v=sMBeDmGHzl0\n\nWine 6.5 was released\nhttps://www.winehq.org/announce/6.5\n\nSytem76 released a new version of their Pangolin laptop, running on a full AMD base. \nhttps://system76.com/laptops/pangolin\nrem-tunnel-is-leaving-ios/\n\nFirefox 87 makes more efforts towards privacy, by trimming down the HTTP referrers being to sent to the websites you visit.\nhttps://blog.mozilla.org/security/2021/03/22/firefox-87-trims-http-referrers-by-default-to-protect-user-privacy/\n\nMicrosoft might end up buying Discord, for the hefty sum of 10 billion dollars.\nhttps://www.theverge.com/2021/3/26/22352028/microsoft-discord-acquisition-analysis-report", "link": "https://www.youtube.com/watch?v=-A0yeFz5vds", "date_published": "2021-04-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]