[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "25 MORE Things You STILL Didn't Know In Zelda Breath Of The Wild", "description": "Returning with more secrets that you probably don't know about in Breath of the Wild! This time we dive into what heart containers are made of, the highest damage amount you can do in the game, lifting ingredients in your hands, and much more!\n\nIn the video above, we cover 25 tips and tricks that aren’t quite as well known, ranging from secrets to glitches, some that are pretty simple and others that are fairly complex. Breath of the Wild has been out for four years at this point, and players have found some amazing things, intended or not, that keep the game and its sense of discovery feeling fresh.\n\n0:00 Intro\n0:15 Satoru Iwata's Moon Phase\n0:31 Protect This Precious Pup\n0:46 Stal Horses Somehow Eat\n0:59 Master Sword Beam Durability\n1:17 Master Sword Beam Cutting\n1:28 Octoroks Can Throw Boomerang\n1:36 Spear Attack Special Animation\n1:47 Master Cycle Inspirations\n2:09 Is The Master Cycle Accurate?\n2:40 Pokeball Master Cycle Scrapped\n2:56 Sneak Into Gerudo Town\n3:15 Ricochet Thrown Objects\n3:31 Shock Balls Cancel Windcleavers\n3:36 Hold And Float Items\n3:54 Super Updrafts\n4:15 Korok Holes\n4:25 What Heart Containers Are Made Of\n4:34 Parry Backwards\n4:52 How To Do 1,180,000 Damage\n5:35 Luminous Talus' Are Bugged\n5:56 Nintendo's Arrow Crafting Recipes\n6:11 Kass' Instrument\n6:30 Rito Village Floors\n6:46 Chest Opening Animations\n7:05 Dueling Peaks Stable Secret\n7:31 Outro", "link": "https://www.youtube.com/watch?v=aQI7S8TbUBo", "date_published": "2021-10-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Revisiting The Original Metroid", "description": "With Metroid 5, aka Metroid Dread, right around the corner is it worth starting all the way back at the first entry in 2021?\n\nMetroid was released on the Famicom in Japan on August 6th, 1986, and then August 1987 on the NES in North America. The game follows Samus Aran, the best space hunter in the galaxy, on her mission to defeat the Metroid and destroy the Mother Brain. Metroid’s unique design has gone on to inspire the Metroidvania genre as seen in games like Hollow Knight and Axiom Verge, and it’s also among the first games to feature a female protagonist, so it’s definitely an important one in the history of video games.\n\nBut how is the original Metroid in 2021? Should you go back to it in the leadup to Metroid Dread? Hopefully this video will help answer that question, and the answer might not be what you think it is. Regardless, the original NES Metroid is currently available through Nintendo Switch Online making it easy to try out if you’re interested in doing so.\n\nSomething even I didn’t realize before Dread’s announcement is that each of the 2D Metroid games is a numbered entry and one continuous story. There’s the original NES Metroid and it’s remake Zero Mission, Metroid II: Return of Samus and it’s remake Samus Returns, Super Metroid which is Metroid 3, and Metroid Fusion which is Metroid 4. Unfortunately if you want to play Metroid 2 & 4 you’ll need to own a Nintendo 3DS and Wii U. I always knew owning a Wii U would be cool one day.\n\nMetroid NES Map: https://nesmaps.com/maps/Metroid/MetroidCompleteMapBG.html\n\nMetroid Instruction Booklet: https://www.nintendo.co.jp/clv/manuals/en/pdf/CLV-P-NAAQE.pdf\n\nChalk Font: https://www.dafont.com/chalk.font\n\nRevisiting The Original No More Heroes: https://youtu.be/wSVXloMQXGY\n\nMore Metroid videos:\nThe Complete Metroid Timeline Explained: https://youtu.be/SrCFB-jxPVg\nThe Metroid Franchise - Which Are Worth Playing/Buying?: https://youtu.be/04aibjsKiXo\nMetroid Dread's Tension Is Relentless | Hands-On Preview: https://youtu.be/Gy9LZ2sSnHM\nMetroid Dread - 5 Minutes of Off-Screen Gameplay: https://youtu.be/HzrGWR4cgt0\nMetroid Dread Review: https://youtu.be/mYFZwzo7qlQ", "link": "https://www.youtube.com/watch?v=3FCtAdnjK7M", "date_published": "2021-10-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Deathloop’s Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of Deathloop, including a pair of pistols that transform into a submachine gun, a shotgun with 2 magazines, and Colt’s trusty sidearm, the Limp-10.\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of Deathloop and compares them to their real-life counterparts.\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020", "link": "https://www.youtube.com/watch?v=E9UmB3r1Cf8", "date_published": "2021-10-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]