[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "27 MORE Things You STILL Didn't Know In Zelda Breath Of The Wild", "description": "Another round of secrets you probably don't know about in Breath of the Wild! This time we explain the secret launch properties of regular Chuchu jellies, special NPC's that react to the Gerudo disguise, and alternative sources of fuel for updrafts.\n\nIn the video above, we cover 27 tips and tricks that aren’t quite as well known, ranging from secrets to glitches, some that are pretty simple and others that are fairly complex. Breath of the Wild has been out for four years at this point, and players have found some amazing things, intended or not, that keep the game and its sense of discovery feeling fresh.\n\n0:00 Intro\n0:14 Dubious Food That's Not Bad\n0:31 Quince Tries To Hit On You\n0:48 Satty Is The Only Named Dog\n0:58 Many Ways To Smuggle\n1:19 Active Arrow Smuggling\n1:38 Auto Dodge A Lynels Triple Slash\n2:00 Trade Stalnox Eyes With Each Other\n2:19 Stalnox Can Kill Themselves\n2:32 Campfire Updraft Secret 1\n2:39 Campfire Updraft Secret 2\n2:48 Premade vs. Homemade Campfire\n2:57 Stand Weapons Upright\n3:13 Enemies Need To Reach The Handle\n3:27 Oil Friends\n3:42 Crab Dance\n3:50 Epona Co.\n4:01 Lasers Are Beamos\n4:18 Speedrun Categories\n4:45 These Rocks Represent Races\n5:03 Jelly Bouncing\n5:21 Launch Lynels\n5:40 Nightmare Fuel\n5:46 Keese Get Distracted\n5:55 Camp Lanterns\n6:06 Biggest Plastic Shader\n6:33 Easy Launch\n6:53 How To Disarm Shielded Enemies\n7:11 Bonus Fact About Me\n7:24 Outro\n\n#botw #Zelda #BreathofTheWild", "link": "https://www.youtube.com/watch?v=SaTHVCz8gDM", "date_published": "2021-08-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Rust’s Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of the Rust, including the MP5 submachine gun, a variant on the infamous ‘Shovel-AK’, as well as a whole load of ridiculous hand-crafted firearms.\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of Rust and compares them to their real-life counterparts.\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\n#rustsguns #royalarmouries", "link": "https://www.youtube.com/watch?v=X0P-p8dGfsY", "date_published": "2021-08-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Infinite Edition Xbox Series X Is Already Getting Scalped | GameSpot News", "description": "Pre-orders for Halo Infinite’s special edition Xbox Series X, originally listed at $550 USD, are being sold on sites like eBay for marked up prices months before release. \n\nIn a blog post, Microsoft’s Joseph Staten revealed why Halo Infinite’s campaign was absent from Gamescom and Opening Night Live. Meanwhile, community manager John Junyszek revealed how XP will work in the game’s multiplayer. \n\nLocation descriptions from Bethesda’s upcoming game Starfield have been revealed in new developer update videos. These locations include, the United Colonies capital city of New Atlantis, the pleasure city of Neon, and the capital of the Freestar Collective, Akila. \n\n00:17 - Scalpers selling Halo Infinite Xbox Series X Pre-Orders\n01:42 - Halo Infinite Campaign Details\n02:16 - Halo Infinite Multiplayer Details\n03:28 - Xbox Mini Fridge\n03:43 - Starfield Location Details\n\n#haloinfinite #xboxseriesx", "link": "https://www.youtube.com/watch?v=CEPgXf-xsQM", "date_published": "2021-08-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Tim Schafer Answers 23 Questions", "description": "How fast can Tim Schafer solve a Rubik's cube? What's his favorite Ramones album? Or what's his morning routine? Tim answers those and more in this special Q&A.\n\nTim Schafer is the creative mind behind games like Full Throttle, Grim Fandango, Broken Age, and, most recently, the action platformer Psychonauts 2. Tim's career goes back 30 years, starting at LucasArts co-writing The Secret of Monkey Island. In 2000, however, Tim set on his own path and founded Double Fine Productions, with its debut title being the cult-classic Psychonauts. In the above video, Tim answers 23 questions like \"what's the hardest part of writing?\", or \"what's Psychonauts 2's biggest inspirations?\"\n\nIn Kurt Indovina's review, he says \"Psychonauts 2 does more than just fill the shoes of its beloved predecessor, it sets itself apart as a classic in its own right.\" Read the full review here: https://www.gamespot.com/reviews/psychonauts-2-review-mind-over-matter/1900-6417718/\n\nPsychonauts 2 is available now for Xbox Series X|S, PS4, PC, as well as Xbox Game Pass.\n\n#timschafer", "link": "https://www.youtube.com/watch?v=r_JTISAygac", "date_published": "2021-08-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]