[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "FIRST LOOK: New Documentaries Coming to FRONTLINE (PBS) in 2021", "description": "This fall, FRONTLINE investigates the decisions that transformed America after 9/11, the rise of far-right extremism around the globe, and police violence.\n\nThis journalism is made possible by viewers like you. Support your local PBS station here: http://www.pbs.org/donate​.\n\nLove FRONTLINE? Find us on the PBS Video App where there are more than 300 FRONTLINE documentaries available for you to watch any time: https://to.pbs.org/FLVideoApp​ \n\n#FrontlineSeason40 #NewDocumentaries\n\nSubscribe on YouTube: http://bit.ly/1BycsJW​\nInstagram: https://www.instagram.com/frontlinepbs​\nTwitter: https://twitter.com/frontlinepbs​\nFacebook: https://www.facebook.com/frontline\n\nFunding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Major funding for FRONTLINE is provided by the John D. and Catherine T. MacArthur Foundation and the Ford Foundation. Additional funding is provided by the Abrams Foundation, Park Foundation, the Heising-Simons Foundation, and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation.", "link": "https://www.youtube.com/watch?v=AWrR5dGlkgw", "date_published": "2021-09-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "Losing Iraq (full documentary) | FRONTLINE", "description": "FRONTLINE traces how decisions by the Bush and Obama administrations contributed to ISIS bursting onto the world stage, seizing territory in Iraq more than two years after President Obama pulled U.S. troops out. (Aired 2014)\n\nThis journalism is made possible by viewers like you. Support your local PBS station here: http://www.pbs.org/donate​.\n\nIn the 2004 documentary “Losing Iraq”, FRONTLINE filmmakers Michael Kirk, Jim Gilmore and Mike Wiser explore the key political stories behind the Iraq war’s defining moments: from the toppling of the statue of Saddam Hussein, through the violent rise of ISIS. Drawing on one of the richest archives in broadcast journalism — including more than 40 reports on the war on terror — as well as in-depth interviews with policymakers and military leaders, FRONTLINE examines the U.S. role starting from the 2003 invasion. \n\nLove FRONTLINE? Find us on the PBS Video App where there are more than 300 FRONTLINE documentaries available for you to watch any time: https://to.pbs.org/FLVideoApp​ \n\n#Documentary​ #LosingIraq\n\nSubscribe on YouTube: http://bit.ly/1BycsJW​\nInstagram: https://www.instagram.com/frontlinepbs​\nTwitter: https://twitter.com/frontlinepbs​\nFacebook: https://www.facebook.com/frontline\n\nMajor funding for FRONTLINE is provided by the Ford Foundation. Additional funding is provided by the Abrams Foundation; the John D. and Catherine T. MacArthur Foundation; Park Foundation; and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation, and additional support from Koo and Patricia Yuen.", "link": "https://www.youtube.com/watch?v=G-Wi2LgwD5U", "date_published": "2021-09-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]