[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCPKT_csvP72boVX0XrMtagQ", "title": "Cercle: 5 years and counting...", "description": "Today, Cercle is 5 years old!\n\n5 years of unforgettable experiences, 5 years of encounters, and more importantly: 5 years that you’ve been sharing this incredible journey with us.\n\nWe decided to celebrate this very special anniversary together and launch our first ever Cercle of Fortune! We’ll also broadcast an exclusive radio show next Monday with all the team and some surprise guests, read below for more information.\n\nClick to enter the Cercle of Fortune and win some incredible gifts: https://Cercle.lnk.to/Fortune\n\nThe Cercle of Fortune will be on until the 20th of April at 00h CET.\nWinners will be announced on Wednesday 21st! Enjoy, and good luck!\n\nRewards:\nGold ticket: You choose!\nThe winner of the Gold ticket will have the choice between two gifts: A LIFETIME TICKET or the CERCLE EXPERIENCE!\n\nThe Lifetime Ticket\nGet access to every Cercle Show with audience… forever! Choose a +1 and and enjoy unlimited dancing at all Cercle Shows & Festivals and some more surprise perks (transport and accommodation are not included)\n\nor\n\nThe Cercle Experience\nHave you ever wondered what really takes place behind the scenes?\nThe gold ticket winner will have the possibility to become a member of the team and follow the whole crew on a show.\nFeel the pressure before the show, the relief after the success, spend some time with the crew and the artists and discover the secrets behind a Cercle Show. Transport, food, housing: EVERYTHING will be included for our newest Cercle member!\n\nSilver ticket: GET THE CERCLE PASS\n5 years of Cercle… for you!\nThe lucky winner will receive an exclusive pass allowing him/her to have access to e v e r y Cercle Show or Festival  with audience and some surprise perks for 5 full years!\nChoose your +1, choose your shows, and enjoy the moment!\n(transport and accommodation are not included)\n\nLast but not least!\n20 lucky winners will receive an emblematic HD-25 light headset from Sennheiser.\n\nRadio Show: Cercle Crew x Surprise Guests\n\nAs we are feeling nostalgic about the good old times, we will go back to our roots and host a Radio Show, live on our Twitch channel on Monday 19th of April at 8 pm CET, around the very same table where everything started 5 years ago.\nTurn your camera on, and you might be able to join and discuss with the Cercle Crew and the surprise guests. Note that this particular show will be held in french.\n\nWe will never thank you enough for your unwavering support and we hope we will get to meet you back on the dancefloor very soon!\n\nAfter a crazy year, we can’t wait to share our newest projects with you.\n\nThanks to each one of you for being a part of this incredible journey.\n\n☞ Support us and get access to exclusive videos & perks: https://Cercle.lnk.to/Patreon\n☞ Listen to our playlists, tracks & sets: https://Cercle.lnk.to/Playlists\n☞ Subscribe to our newsletter to know about our next shows: https://Cercle.lnk.to/Members\n☞ Subscribe to our YouTube channel: https://Cercle.lnk.to/ytcercle", "link": "https://www.youtube.com/watch?v=tpmoiWCdKrg", "date_published": "2021-04-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]