[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Nathaniel Rateliff: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nBob Boilen | April 12, 2021\nNathaniel Rateliff stands in an old familiar place, sharing his pain. The Mercury Café is one of the first places Nathaniel frequented when he moved to Denver in 1998, hearing jazz, dancing, and eventually playing many shows there. For his Tiny Desk (home) concert, he's assembled a dozen players including a string section, backing singers, and some of his oldest friends: Joseph Pope III on bass, Mark Shusterman on keys, Luke Mossman on guitar and Patrick Meese on drums. On the opening song and the title track to his 2020 album, And It's Still Alright, they're restrained as Nathaniel sings about loss, including his friend and producer Richard Swift, but he's holding on. \"I'll be damned if this old man / Don't start to counting his losses / But it's still alright.\"\nBut restraint lets loose on the chorus of \"Redemption,\" a song about breaking free of the past and written for Apple original film Palmer, starring Justin Timberlake. The ender, a tune called \"Mavis,\" truly is a grand finale, a song that conjures up images of The Band singing Bob Dylan's \"I Shall Be Released\" — and what a fabulous release it is.\n\nSET LIST\n • \"And It's Still Alright\"\n • \"All Or Nothing\"\n • \"Redemption\"\n • \"Mavis\"\nMUSICIANS\n • Nathaniel Rateliff: guitar, vocals\n • Patrick Meese: drums, keys\n • Joseph Pope III: bass\n • Mark Shusterman: keys\n • Luke Mossman: guitar\n • James Barone: drums, guitar\n • Chris Jusell: violin\n • Joy Adams: cello\n • Adrienne Short: violin\n • Rachel Sliker: viola\n • Larea Edwards: vocals\n • Chrissy Grant: vocals\n • Kinnie Maveryck: vocals\n\nCREDITS\n • Video: Rett Rogers, Jasper Gray, Frank Pickell, Will Gardner, Hillary Thomas, Trevor McKenna, Christian Silberbauer, Sam Sigler\n • Audio: Patrick Meese, James Mefford\n\nTINY DESK TEAM\n • Producer: Bob Boilen\n • Video Producer: Maia Stern\n • Audio Mastering: Josh Rogosin\n • Associate Producer: Bobby Carter\n • Tiny Production Team: Kara Frame\n • Executive Producer: Lauren Onkey\n • Senior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #nathanielrateliff", "link": "https://www.youtube.com/watch?v=Q3p7JxooncM", "date_published": "2021-04-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]