[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Animal Crossing New Horizon 2.0 Update - How To Unlock Everything ASAP", "description": "Animal Crossing: New Horizon's free update adds a ton to the game and you’ll want make sure you take care of a few things right away if you want access to all the new content as soon as possible.\n\nFirst thing you’ll want to do is head over to resident services and spend a lot of time over at the ABD. Hope you’ve been saving up those nook Miles cause you have a lot to purchase. Right away you’ll want to buy all the upgrades you can unlock instantly. That would be the Island Life 101 Service, Be a Chef! DIY Recipes+, Pro Camera App, Custom Designs Patterns+, Pro Decorating License, Custom Fencing in a Flash, New Reactions Notebook, and Top 4 Rad Hairstyles. There are also a few new recipes; if you’re lucky, one or both of the two daily fence recipes will be one of the nine new fences available. Additionally, there is a recipe for a wooden storage shed, which will allow you to access home storage from anywhere on your island. Lastly, there’s a donation box recipe which can act as a tip jar for visitors - only the island owner can collect donations from the donation box.\n\n#AnimalCrossing #NewHorizon", "link": "https://www.youtube.com/watch?v=ibhYFPhpYVI", "date_published": "2021-11-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Vanguard - Full Campaign & Story Cinematics", "description": "MAJOR SPOILERS AHEAD! \n\nCall of Duty: Vanguard's story of Task Force One is told through a mix of in-game narrative and pre-rendered CG cutscenes. In this video, we bring you the complete story of Vanguard and the rise of the first special forces group led by Arthur Kingsley.\n\nTimestamps:\n00:00 - Phoenix\n04:56 - \"Captured\"\n10:10 - Operation Tonga\n18:07 - \"The Lion's Den\"\n26:05 - Stalingrad\n37:14 - \"Just A Tourist\"\n43:08 - The Battle of Midway\n44:33 - \"Tested\"\n48:52 - Numa Numa Trail\n01:00:27 - \"Setting the Stage\"\n01:02:01 - Lady Nightingale\n01:10:04 - \"The Intelligent Thing\"\n01:13:44 - The Rats of Tobruk\n01:20:11 - \"The Yarn\"\n01:20:55 - The Battle of El Alamein\n01:25:53 - \"Plan B\"\n01:30:52 - The Fourth Reich\n01:36:41 - \"Vanguard\"\n\nCheck out our round up of Call of Duty: Vanguard's entire campaign as told by in-game cutscenes and cinematics. Major spoilers ahead- this video features the story of Vanguard from the opening cutscene to the game's final moments.\n\nCall of Duty: Vanguard tells a heroic tale of Task Force One; A team of the best soldiers from military branches around the world. The first of its kind, this special forces group's mission is to track down information about \"Project Phoenix\"- classified intel from the German Army with plans to shift the balance of WWII in their favor.\n\nStay tuned to GameSpot for our review of Call of Duty: Vanguard, as well as continued coverage on Warzone's latest Pacific map Caldera. Look out for livestreams, gameplay videos and more coming soon.", "link": "https://www.youtube.com/watch?v=1B4IS0tfInc", "date_published": "2021-11-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Vanguard Remastered Maps From World at War", "description": "Call of Duty: Vanguard launches with 20 multiplayer maps, three of which are actually remakes from 2008's Call of Duty: World at War. Let's take a look at how the maps have changed with this side-by-side comparison.\n\nTimestamps:\n00:00 - Intro\n00:16 - Castle Map\n02:17 - Dome Map\n03:27 - Sub Pens Map\n\nCall of Duty: Vanguard launched on November 5th with the most multiplayer maps to date. Within these 20 maps lie a few remakes from Call of Duty's past, specifically from 2008's Call of Duty World at War. In this video we'll be taking a look back at the original maps and see how they compare to their remade counterparts 13 years later.\n\nWe begin with the fan-favorite \"Castle\" map. The medium sized battlefield was remembered for its few key elevation spots, as well as multiple routes that cut through the center as well as it's hectic west area where its stone stairs were a memorable hotspot. Next is the wildly popular \"Dome\". This small map was the \"Nuketown\" before the release of Black Ops 1. Its imamate, square design made battles here a cluster, no matter the player count. Lastly, the Sub Pens made was remade for both multiplayer as well as campaign. Featured early on in the \"Phoenix\" mission, this map has seen the most changes in it's redesign.\n\nCall of Duty Vanguard is finally here! Stay tuned to GameSpot for continued coverage on this year's COD including gameplay, livestreams, and updates on Warzone's new Pacific map Caldera coming soon.", "link": "https://www.youtube.com/watch?v=R1OXUWkEpCE", "date_published": "2021-11-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Vanguard Review", "description": "Tweaks in multiplayer and Zombies advance the Call of Duty franchise overall, and an emphasis on distinct characters makes Vanguard's story fun, but it doesn't always mix well with the series' gameplay.", "link": "https://www.youtube.com/watch?v=_hrSnVfch1s", "date_published": "2021-11-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "EA's Plan After Battlefield 2042 | GameSpot News", "description": "In this episode of GameSpot News, we talk about how a Battlefield free-to-play could happen someday, Nintendo reiterating a plan to launch a new console before 2100, New World’s 1.0.5 patch, and 30-Series GPUs being stolen off a truck. \n\nIn this video, we talk about how a Battlefield free-to-play could happen someday. EA CEO Andrew Wilson said it \"probably makes sense\" for the Battlefield series to have a free-to-play component some day in the future.  \n\nDeVante also talks about Nintendo sharing a slide related to its \"future outlook,\" and this included mention of an \"integrated hardware-software next gaming system\" that will arrive by the end of 2099.\n\nLater in the video, New World patch 1.0.5 cracks down on gold sellers, addresses gold duplication exploits and EVGA 30-Series GPUs being stolen off a truck.", "link": "https://www.youtube.com/watch?v=iO894scMaU8", "date_published": "2021-11-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "19 Minutes of Elden Ring Gameplay Preview", "description": "Elden Ring unveils 19 minutes of gameplay showing various slices of gameplay. First off it shows a fight against a large dragon in an open field, Later on we learn more about the various Elden Ring weapons, and fighting mechanics. They showcase the spirit summoning in Elden Ring, and also co-op multiplayer. We also get a glimpse of the dungeons that you'll get to explore in Elden Ring that are filled with enemies and a boss. We even get a glimpse of one of the Demigod Bosses Godrick The Golden.\n\n#EldenRing", "link": "https://www.youtube.com/watch?v=FrXy4fARXns", "date_published": "2021-11-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty Vanguard - Early Launch Livestream", "description": "Call of Duty: Vanguard is almost here! Join Richie as he plays through the game in our early access livestream.", "link": "https://www.youtube.com/watch?v=fIK0uRhczqo", "date_published": "2021-11-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Vanguard - First 13 Minutes of PS5 Gameplay", "description": "Call of Duty: Vanguard's opening mission introduces us to Task Force One on their first mission to hijack a train. Let's take a look at the campaign being played on Veteran difficulty. \n\nCall of Duty Vanguard releases on November 5th, 2021 on Xbox Series X and Series S, PlayStation 4, PlayStation 5, Xbox One, Microsoft Windows.\n\n#CallofDuty", "link": "https://www.youtube.com/watch?v=g29DEk0-99c", "date_published": "2021-11-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Vanguard - Lady Nightingale Mission Gameplay", "description": "Call of Duty: Vanguard gives us an early look at the \"Lady Nightingale\" mission before the official November 5th launch! Check out Call of Duty streamer Courage, accompanied by a live orchestra, play as Polina Petrova and her brother Misha as they make their way through across a vast snow-covered field surrounded by German snipers.", "link": "https://www.youtube.com/watch?v=O1eJukQksa0", "date_published": "2021-11-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Vanguard - World Premiere Zombies Cinematic", "description": "Call of Duty: Vanguard reveals its opening Cinematic for its Zombies mode. Zombies will launch with Vanguard on November 5th, however, the Easter Egg quest will go live with the launch of season 1 on December 2nd.", "link": "https://www.youtube.com/watch?v=DLtCx6ljJT4", "date_published": "2021-11-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Warzone - Pacific Map Cinematic", "description": "During Call of Duty: Vanguard's launch event, we got some more information about Warzone's future Pacific map, Caldera.", "link": "https://www.youtube.com/watch?v=QxrCotPujOE", "date_published": "2021-11-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "ELDEN RING 15 Minute Gameplay Preview Livestream", "description": "Tune in at 3 PM CET/7 AM PDT on November 4th for a 15-minute Elden Ring Gameplay Preview. Countdown begins at 2:45 PM CET / 6:45 AM PDT.", "link": "https://www.youtube.com/watch?v=30zvFqyLFK8", "date_published": "2021-11-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Forza Horizon 5 Review", "description": "Alessandro explored ancient ruins in a McLaren F1, jumped sand dunes in an Ariel Nomad, and took a breezy seaside drive in a VW California Coast for 20 hours with Forza Horizon 5. Review code was provided by Microsoft.\n\nForza Horizon 5 releases on November 9th on Xbox Series X and Series S, Xbox One, Microsoft Windows.", "link": "https://www.youtube.com/watch?v=wb626AtcObw", "date_published": "2021-11-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New Elden Ring Gameplay + Details Revealed! | GameSpot News", "description": "In this episode of GameSpot News, we talk about the Elden Ring gameplay reveal and how you can play it early, Animal Crossing: New Horizons 2.0 update releasing early and the delay of EA’s PGA Tour, Marvel’s Midnight Suns, and Sol Cresta. \n\nIn this video, DeVante talks about the extended look at Elden Ring gameplay. In the footage, we see the game’s location “Lands Between” and its map, combat, summoning, PvP invaders and dungeons. \n\nDeVante also talks about the Animal Crossing: New Horizons 2.0 update going live ahead of its November 5, 2021 release. The early update was reported across social media, when players received a surprise prompt to update the game after logging in.  \n\nLater in the video, EA’s PGA Tour, Marvel’s Midnight Suns, and Sol Cresta are delayed.", "link": "https://www.youtube.com/watch?v=fh2SlRtKTa8", "date_published": "2021-11-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Riders Republic Review", "description": "Riders Republic is a thrilling, approachable, and incredibly varied extreme sports game, featuring an awe-inspiring open world that impresses with both its scale and diversity.\n\nRiders Republic released on October 28, 2021 on PlayStation 4, PlayStation 5, Xbox One, Xbox Series X and Series S, and Microsoft Windows.", "link": "https://www.youtube.com/watch?v=WxRfD0fNQ3s", "date_published": "2021-11-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Shin Megami Tensei V Review", "description": "Shin Megami Tensei V may be slow-paced, but its strategic turn-based combat and dark, foreboding atmosphere deliver a challenging and rewarding RPG experience.", "link": "https://www.youtube.com/watch?v=-Jz-5g1jeFA", "date_published": "2021-11-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]