[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 - Even More Things To Know", "description": "More information about Battlefield 2042, releasing in October, has come out and we’re digging further into specialists, vehicles, gear, guns, progress, and maps. \n\nBattlefield 2042 has now shown off a cinematic reveal trailer and gameplay. An E3 q&a session with developers answered a lot of questions around specialists, gear, vehicle play, progress, maps, guns, and pacing. In this video, we’re clearing up confusion around new mechanics and looking at whether these changes are as different from previous Battlefield games as they first appeared to be.\n\nBattlefield 2042 is releasing October 22 for everyone and October 15 for certain editions of the game. There are also alphas and betas coming up, one of which will test DICE’s battle-royale alternative, titled Hazard Zone. EA is expected to show off a lot more information on July 22 at EA Play.\n\n#battlefield2042", "link": "https://www.youtube.com/watch?v=pMlgXmI57bY", "date_published": "2021-06-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Sea of Thieves - A Pirate's Life Showcase Livestream", "description": "Tune in June 20 at 11am PT for the Sea of Thieves A Pirate's Life showcase. Get a deep dive on the collaboration between Sea of Thieves and Disney on how they included Captain Jack Sparrow, and many other notable characters. You'll get first look at a few tales, and gameplay of those as well as some behind the scenes developer interviews.\n\n#seaofthieves #pirateslife", "link": "https://www.youtube.com/watch?v=jtVOOGszmJM", "date_published": "2021-06-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Counter-Strike Franchise's Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the insane weaponry of the Counter-Strike franchise, including the iconic AK47 automatic rifle, the FNP90 submachine gun, and the many versions of the AR-15/M4 rifle.\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of the Counter-Strike franchise, and compares them to their real-life counterparts.\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can purchase Jonathan’s book here - https://www.headstamppublishing.com/bullpup-rifle-book\n\n#firearms", "link": "https://www.youtube.com/watch?v=N1ajq6L_k8w", "date_published": "2021-06-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]