[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCAKcSON6PSG_JkTbXh2WdIg", "title": "Davina Lozier has the most wholesome life goals (Live at LineCheck)", "description": "Early in their career, Davina Lozier of Davina & The Vagabonds saw music as a competition. But now, all they want to do is make people dance.\n\nThis clip is from The Current's weekly conversation series LineCheck. On June 15, 2021, panelists Annie Mack, Nazeem, and Davina Lozier gathered via Zoom to discuss music and mental health. Mary Bue opened and closed the evening with performances from her album \"The World is Your Lover.\"\n\nFull LineCheck schedule: https://www.thecurrent.org/feature/2021/05/18/linecheck-series", "link": "https://www.youtube.com/watch?v=q2OTknhx7As", "date_published": "2021-06-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCAKcSON6PSG_JkTbXh2WdIg", "title": "Rock The Cradle Play Along Episode 6", "description": "In episode 6 of Rock the Cradle Play Along, we visit Annie Humphrey on her farm, meet her horses Harry and Bella, and enjoy a drum and vocal performance. We learn about the bongos, steel drum and talking drum with MacPhail Center for Music. House of Dance keeps us moving and spinning! We sing and dance along with Siama's Congo Roots. Plus, Koo Koo Kanga Roo share another new song, \"Backyard Swimsuit\" — the perfect tune for your next backyard slip-and-slide party! Watch the video in the window above.\n\nEPISODE 6 CONTENTS\nIntro with Bill DeVille 00:00\nAnnie Humphrey: Drum Song 01:15\nMacPhail Center for Music's Amanda Breininger: Drum Exploration 04:17\nLittle Moments Count: Sing with Baby 06:53\nHouse of Dance: three breakdance spins 07:56\nSiama's Congo Roots: \"Malembe\" 12:56\nKoo Koo Kanga Roo: \"Backyard Swimsuit\" 18:10\n\nBig thanks to our Rock the Cradle Play Along sponsors: Minneapolis Institute of Art, Bell Museum, Pizza Lucé, Little Moments Count, MacPhail Center for Music, Sala Architects and Park Dental. Enjoy these special offers from our sponsors: https://files.apmcdn.org/production/44a599df4cf8938bde128245edfa495c.pdf\n\nYou can also find this on our website: https://www.thecurrent.org/feature/2021/05/15/rock-the-cradle-2021-a-saturday-morning-video-series\n\nABOUT THE PERFORMERS\n\nHouse of Dance Twin Cities — Established in 2014, House of Dance Twin Cities is Minnesota's first and premier dance studio dedicated to teaching breakdancing, popping and locking, and hip hop dance classes to people of all ages and experience levels. The instructors humbly maintain that they are students themselves, dedicated to improving their dance so that they can share more with others. They take their art and their jobs very seriously and appreciate everyone who entrusts their learning with them.\n\nKoo Koo Kanga Roo is a dance party of the senses. For the last 12 years, lifelong friends and collaborators Bryan and Neil have toured the globe delighting fans with their high-energy music, infectious positivity, and interactive live show. Of course, the global pandemic of 2020 threatened to put an end to the carefree fun that had come to define the band, but instead of putting the group on pause or looking for office jobs, Bryan and Neil doubled down and created their most triumphant and expansive album yet.\n\nSiama's Congo Roots — Back in Africa, Siama Matuzungidi recorded hundreds of songs and toured the world with popular artists. Now based in Minneapolis, he's known for his catchy songs, rhythmic guitar, spirited singing and traditional instruments like mbira, balafon and lokole. His wife and musical partner, Dallas Johnson, plays shakers and encourages everyone to sing along in Lingala, Kikongo and English as they bring Siama's rural childhood to life. They've earned World Music Pedagogy certificates from Smithsonian Folkways, and they're Teaching Musicians for COMPAS, Classical MPR's 'Class Notes' and the Schubert Club. Their children's album, \"Land of Yangalele\" received a Parents' Choice Parent-Approved award.\n\nSubscribe to our channel:\nhttp://www.youtube.com/user/893TheCurrent?sub_confirmation=1\nLike/Follow:\nhttps://www.facebook.com/TheCurrent/\nhttps://twitter.com/TheCurrent\nhttps://www.instagram.com/thecurrent/\n\n#thecurrent #rockthecradle", "link": "https://www.youtube.com/watch?v=ZTgLH8anf4s", "date_published": "2021-06-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]