[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCAKcSON6PSG_JkTbXh2WdIg", "title": "Sounds Like Home VII – virtual music festival from The Current", "description": "It's time for Sounds Like Home VII, another burst of performances by Minnesota musicians. We've got an incredible lineup — Double Grave, Annie and the Bang Bang, Mark Mallman, Blood $moke Body, and Paul Metsa. Join The Current's Andrea Swensson for this latest round of exclusive performances in our virtual festival series.\n\nABOUT THE ARTISTS\n\nDouble Grave are an indie-rock trio made up of Jeremy Warden on guitar andvocals, Bree Meyer on bass, and Seth Tracy on drums. They formed back in 2014 under the name Ego Death and have since played shows ranging from DIY basement sets to opening for bands such as Palm and LVL UP to headlining their own shows. Since 2017, they’ve been releasing music under the name Double Grave, their most recent work being Chrysanthemum, coming out March 2021. \n\nAnnie and the Bang Bang are a local rock band. Coming off the release of their latest album, LOVELAND, their music incorporates elements of folk-pop,blues, and also has a tinge of sixties style. Fronted by guitarist and songwriter Annie Enneking, Annie and the Bang Bang’s music is led by an honest voice telling stories of a “person living in a world full of people”. The group is rounded out by John Riedlinger of guitar, Kare Tweiten on bass, and Mike Kittel on drums. \n\nMark Mallman is Minneapolis icon who plays many roles, not only as a rock musician, but also as a film composer, memoirist, and lately, a TikTok personality. While audiences contemplate whether rock and roll is dead, Mallman consistently steps forward to prove them wrong. He’s joining The Current for Sounds Like Home ahead of the release of his newest record Happiness coming out this April, his first in five years. \n\nBlood $moke Body are a local hip-hop act, formerly known as Nazeem and Spencer Joles. Having started their musical partnership by rapping under the stairwell of their middle school, Nazeem and Spencer’s career has been a long-haul. After taking a three-year hiatus to reflect on their past and work on inhabiting positive habits into their lives, the duo has rebranded and returned with the release of their latest record Lovesick Animal Online, which was released back in May 2020. \n\nPaul Metsa is a Minnesota folk artist from the same Minnesota Iron Range that produced Bob Dylan. He was born to a jazz singer and a professional accordion player, so it wasn’t a surprise when he started his own folk duo and rock band. He moved to Minneapolis in 1979, and began his solo career in 1982, releasing Paper Tigers. Since the start of his career, Metsa has gone on to play tons of shows across the world, release several records, and share countless stories with his many fans. \n\nSubscribe to our channel:\nhttp://www.youtube.com/user/893TheCurrent?sub_confirmation=1Like/Follow:\nhttps://www.facebook.com/TheCurrent/\nhttps://twitter.com/TheCurrent\nhttps://www.instagram.com/thecurrent/\n#soundslikehome \n#thecurrent", "link": "https://www.youtube.com/watch?v=Vm8LQQ6fuXQ", "date_published": "2021-03-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCAKcSON6PSG_JkTbXh2WdIg", "title": "Wolf Alice - two songs at The Current (2019; 2015)", "description": "Three years ago today, Wolf Alice visited The Current studio to perform what they called a \"coffeehouse-style\" set. The band were in town for a couple days, putting on an in-store performance at the Electric Fetus in Minneapolis ahead of a show at First Avenue the next day.\n\nWatch a song from that 2018 acoustic performance, as well as Wolf Alice performing \"Moaning Lisa Smile\" from their 2015 session at The Current.\n\nSONGS PERFORMED\n0:00 \"Sadboy\" (2018)\n3:40 \"Moaning Lisa Smile\" (2015)\n\nPERSONNEL\nEllie Rowsell – lead vocals, guitar\nJoff Oddie – guitar\nTheo Ellis – bass\nJoel Amey – drums\n\nCREDITS\nVideo & Photo: Leah Garaas; Nate Ryan\nAudio: Michael DeMark\nProduction: Jade; Anna Weggel\n\nFIND MORE:\n2015 studio session: https://www.thecurrent.org/feature/2015/03/11/wolf-alice-perform-live-in-the-current-studio\n2015 Theft of the Dial:\nhttps://www.thecurrent.org/feature/2015/10/16/theft-of-the-dial-wolf-alice\n2018 studio session: https://www.thecurrent.org/feature/2018/03/27/wolf-alice-perform-a-coffeehouse-style-set-in-the-current-studio\n\nSubscribe to our channel:\nhttp://www.youtube.com/user/893TheCurrent?sub_confirmation=1\nLike/Follow:\nhttps://www.facebook.com/TheCurrent/\nhttps://twitter.com/TheCurrent\nhttps://www.instagram.com/thecurrent/\n\n#wolfalice", "link": "https://www.youtube.com/watch?v=viHZLGXrsU0", "date_published": "2021-03-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]