[{"source": "https://lukesmith.xyz/rss.xml", "title": "YouTube Channel Deletion", "description": "<p>Google is prepping to delete my YouTube channel. As of today (March 26,\n2021), I now cannot post for another two weeks. YouTube &quot;strikes&quot;\nwhich are functionally unappealable (automatically rejected) last for 3\nmonths. If they give thee concurrent strikes, you channel is permanently\ndeleted.</p>\n<p>If YouTube Jannies delete my YouTube channel, remember that <strong>100% of my\nvideos are still easily viewable, including new videos I will make</strong>.\nYou have no excuse to whine if all you know how to do is consoooming\nproduct on YouTube's walled garden:</p>\n<ul>\n<li>Follow me on Odysee: <a href=\"https://odysee.com/@Luke:7\">https://odysee.com/@Luke:7</a></li>\n<li>Follow me on PeerTube: <a href=\"https://videos.lukesmith.xyz\">https://videos.lukesmith.xyz</a></li>\n<li>Follow me on RSS: <a href=\"https://lukesmith.xyz/rss.xml\">https://lukesmith.xyz/rss.xml</a></li>\n</ul>\n<p>I can and have already done livestreams on\n<a href=\"https://videos.lukesmith.xyz\">PeerTube</a>. Expect those as well.\nLBRY/Odysee will probably have livestreams too soon.</p>\n<h2 id=\"when-youre-banned-from-youtube-will-you-keep-making-videos\">&quot;When you're banned from YouTube will you keep making videos?&quot;</h2>\n<p>Yes, at <a href=\"https://odysee.com/@Luke:7\">Odysee</a> and\n<a href=\"https://videos.lukesmith.xyz\">PeerTube</a>. I will also probably actually\nbring back <a href=\"https://notrelated.xyz\">Not Related!</a> for real this time\nbecause the first reason I made a podcast was to communicate with people\nusing less bandwidth.</p>\n<p>I suppose my only regret is not shilling RSS, webrings and other\nclassical internet technology to free us from social media companies.</p>\n<h2 id=\"the-importance-of-youtube\">The &quot;importance&quot; of YouTube</h2>\n<p>YouTube ad revenue by itself is a nice thing to have, but it is not a\nhuge loss if I lose it (less than minimum wagies make). Very few\nmegachannels actually make decent money on it and frankly, it's a kind\nof bloodmoney if you ask me.</p>\n<p>The only concern for me is that YouTube is still the vehicle by which\npeople find out about me and use other stuff I offer and that can mean\nother sources of income for me.</p>\n<p>While I try to push people into a decentralized internet, use RSS feeds,\nsuperior platforms like Odysee and PeerTube, and encourage them to have\nwebsites and the like, most people still passively use YouTube\nrecommendations and curation.</p>\n<h2 id=\"how-you-can-help\">How you can help.</h2>\n<h3 id=\"encourage-youtube-followers-to-follow-me-in-proper-places\">Encourage YouTube followers to follow me in proper places.</h3>\n<p>If you have friends who watch my YouTube channel or know of people on\nother sites who do, make sure they:</p>\n<ul>\n<li>Follow me on RSS: <a href=\"https://lukesmith.xyz/rss.xml\">https://lukesmith.xyz/rss.xml</a></li>\n<li>Follow me on PeerTube: <a href=\"https://videos.lukesmith.xyz\">https://videos.lukesmith.xyz</a></li>\n<li>Follow me on Odysee: <a href=\"https://odysee.com/@Luke:7\">https://odysee.com/@Luke:7</a></li>\n</ul>\n<p>Google is not going to be accidentally recommending new people to me\nafter they ban me. That's your job.</p>\n<h3 id=\"donate\">Donate</h3>\n<p>You can donate to me even without having extra money by using my\n<a href=\"https://lukesmith.xyz/links\">affiliate links</a>.</p>\n<p>If you <em>do</em> have spare money:</p>\n<ul>\n<li><a href=\"https://lukesmith.xyz/donate\">Donate money</a> to me. You can easily\nmake a monthly pledge for stability's sake.</li>\n<li>Donate Bitcoin (<a href=\"https://lukesmith.xyz/pix/qr_btc.png\">QR</a>):\n<code>bc1qyvkzw7hrtp9ecxd2pa3w7p5dfg09tv6jfrs0df</code></li>\n<li>Donate Monero <a href=\"https://lukesmith.xyz/pix/qr_xmr.png\">QR</a>):\n<code>48jewbtxe4jU3MnzJFjTs3gVFWh2nRrAMWdUuUd7Ubo375LL4SjLTnMRKBrXburvEh38QSNLrJy3EateykVCypnm6gcT9bh</code></li>\n<li>You can donate BAT on this site, or LBC on Odysee/LBRY.</li>\n</ul>\n<h2 id=\"what-are-they-giving-you-strikes-for\">&quot;What are they giving you strikes for?&quot;</h2>\n<p>To be clear, before this year, I never received any strikes, but now\nI've received a warning and two strikes <em>all for old videos</em>.</p>\n<p>I will emphasize that this is merely the sign of either: (1) coordinated\nthird-party mass-reports or (2) YouTube specifically and arbitrarily\nadopting new standards in a bid to remove the channel.</p>\n<p>The strikes are for the following very innocent videos:</p>\n<ul>\n<li>For a video I put up in either 2016 or 2017 where I made an ffmpeg\nslideshow with a bunch of Pepe memes set to music. Deleted for\n&quot;inciting violence.&quot; I can't find the original video of this, I\nmight've deleted it.</li>\n<li>For a video I did sometime in 2020 when I in passing made jokes\nabout low-quality Indian tech channels that used to dominate\nYouTube. Deleted for &quot;inciting violence.&quot;\n<a href=\"https://odysee.com/@Luke:7/thanks-luke-for-vanquishing-pajeettube:f\">Here</a>\nis the video so you can see how innocuous (also true) it was.</li>\n<li>For a video I made maybe in 2018 or 2019 on <code>youtube-dl</code>.\n<a href=\"https://odysee.com/@Luke:7/downloading-videos-music-and-more-with:5\">Here</a>\nis the video. The absurdity is that I recommend people to use this\ntool to back up my YouTube channel (and all of my videos are in\nlicensed permissively via Creative Commons). I guess it's a crime\nto distribute my own videos on a video distribution platform!</li>\n</ul>\n<p>This is the arbitrariness of Google today. If my channel survives the\nstorm of these strikes (which I severely doubt) expect me to be using\n<a href=\"https://videos.lukesmith.xyz\">PeerTube</a> and\n<a href=\"https://odysee.com/@Luke:7\">Odysee</a> as primary platforms. From now on,\nmy YouTube exists to lead people to more healthy places.</p>", "link": "https://lukesmith.xyz/updates/deletion/", "date_published": "2021-03-26 00:00:00+00:00", "persistent": true, "user": "rumpel", "language": "en-US", "tags": ["technofeudalism", "censorship"]}]