[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "Linux News - Ubuntu's new Installer, Favicons can track you, AMD hires Linux people, and Plasma 5.21", "description": "Visit https://www.linode.com/linuxexperiment for a 100$ credit on your new Linode account!\nThis time, we have a new installer for Ubuntu, a new release of Plasma, AMd hiring more people to enhance their Linux support, and Favicons being used to track you around the web, even it you have a VPN.\n\nBecome a channel member to get access to a weekly patroncast and vote on the next topics I'll cover:\nhttps://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nSupport the channel on Patreon: \nhttps://www.patreon.com/thelinuxexperiment\n\nFollow me on Twitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\nFollow me on LBRY: https://lbry.tv/@TheLinuxExperiment:e\n\nThe Linux Experiment merch: get your goodies there! https://teespring.com/en-GB/stores/the-linux-experiment\n\n00:00 Intro\n01:26 Linux News\n03:22 Open Source News\n06:40 Application News\n08:37 Privacy News\n09:42 Hardware News\n11:38 Gaming News\n\nUbuntu is finally going to replace its current installer, called Ubiquity. Martin Wimpress, the Ubuntu desktop team lead, announced that they would be replacing the old installer, dating back to 2006, by a whole new one, developed with Flutter. \nhttps://www.omgubuntu.co.uk/2021/02/ubuntu-is-working-on-a-brand-new-installer\n\nA new version of the Linux Kernel is out. 5.11 adds more work on various filesystems, like F2FS or XFS.\nhttps://kernelnewbies.org/Linux_5.11\n\nA recent survey from O'Reilly and IBM points out that developers need open source skills nowadays. They interviewed 3400 developers and tech managers, and 94% rated Open source software as equal or better than proprietary software.\nhttps://developer.ibm.com/blogs/oreilly-open-source-skill-survey-blog/\n\n\nAnother month, another GNOME team blog post about the research they have done before making changes to the GNOME Shell. Now they're giving a new rundown of the research they did before deciding on this.\nhttps://blogs.gnome.org/shell-dev/2021/02/15/shell-ux-changes-the-research/\n\nPlasma 5.21 was released.\nhttps://www.youtube.com/watch?v=qbAuxp_I0zk&t=62s\n\nNow there is a GUI for Touchegg lets you create gestures, for your whole system, or for a specific application.\nTouché is the name of the app, and it's available on flathub, or as a Deb package.\nhttps://www.linuxuprising.com/2021/02/touche-is-new-gui-to-configure-touchegg.html\n\nLibre Office 7.1 was released, and it comes with a lot of interesting changes. The biggest one, in my opinion, is a first run dialog that will let users pick the interface they want to use.\nhttps://wiki.documentfoundation.org/ReleaseNotes/7.1\n\n\nA german researcher has shown that favicons can be used to track you even if you use a VPN or a tracker blocker. https://it.slashdot.org/story/21/02/09/1920256/browser-favicons-can-be-used-as-undeletable-supercookies-to-track-you-online\n\nSystem76, the Linux hardware manufacturer and retailer, has announced a while ago that they were working on their own keyboard, a mechanical, high quality, custom layout thing that will probably appeal to a lot of people. Well they now revealed a few pictures of the aluminium chassis, and a few more information.\nhttps://www.gamingonlinux.com/2021/02/system76-tease-shots-of-their-custom-keyboard-and-release-the-source-code\n\nAMD wants to recruit a Linux Technical lead, which should coordinate with, as they say, OEM partners and the tier one linux distributions around new features and components.\nhttps://www.phoronix.com/scan.php?page=news_item&px=AMD-Hiring-More-Linux-2021\n\nIf you have tons of games and you'd like to ensure that your saved games are safe, there is now a new tool called Ludusavi, or Ludusavi, however you decide to pronounce it.\nIt can backup more than 8000 games, from Steam or other game libraries, and even saves that are stored in the windows registry using Proton, or your steam screenshots.\nhttps://www.gamingonlinux.com/2021/02/ludusavi-seems-like-a-pretty-good-open-source-game-save-backup-tool\n\nWIne 6.2 was released. This new version brings an updated mono engine, up to version 6.0, with directX support, and support has been added to NTDLL debugger APIs. On Mac OS, the Xbox controller should also behave better. 51 bugs have been fixed in that release, including for Earth 2160, Shadow Warrior 2, Inside, Multiple Adobe Creative Cloud products, Serious Sam, Hitman Absolution or World of Tanks.\nhttps://www.winehq.org/announce/6.2\n\nBut not yet, it seems, as Proton 5.13-6, still based on Wine 5.13, has been released. It embarks fixes from Proton Experimental, including for Cyberpunk 2077, Yakuza Like a Dragon, Subnautica, or Doom 2016. It seems like Nioh 2 is now playable, and No Man's Sky should now support VR back again. Players of Deep ROck Galactic will have their voice chat back, and PS 5 controllers are now better supported.\nhttps://github.com/ValveSoftware/Proton/wiki/Changelog", "link": "https://www.youtube.com/watch?v=ySs5nVKdu-4", "date_published": "2021-02-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]