[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "Linux doesn't need marketing, it needs HARDWARE", "description": "Try KernelCare+ for free for 30 days by signing up here: https://lp.kernelcare.com/kernelcare-plus-experiment\n\nLinux, as in the whole of GNU/Linux, including all distributions, is amazing, but it's still stagnating at around one to 2 percent of market share on the desktop. While I don't think Linux needs to reach more than 5 to 10% market share to start seeing important contributions in terms of third party applications, and AAA developer support, I also think most people have it backwards when they try to imagine what we could do to promote Linux as a whole. They mostly tend to try and promote it through marketing, and I did as well, but in my opinion, what Linux needs to grow, is hardware\n\n\nBecome a channel member to get access to a weekly patroncast and vote on the next topics I'll cover:\nhttps://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nSupport the channel on Patreon: \nhttps://www.patreon.com/thelinuxexperiment\n\nFollow me on Twitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\nFollow me on LBRY: https://lbry.tv/@TheLinuxExperiment:e\n\nThe Linux Experiment merch: get your goodies there! https://teespring.com/en-GB/stores/the-linux-experiment\n\nThe typical horror strings by Sascha Ende\nLink: https://filmmusic.io/song/17-the-typical-horror-strings\nLicense: https://filmmusic.io/standard-license\n\nUnified marketing is a dream\n\nThe Linux desktop is not a unified thing. It's split in multiple distributions, multiple desktop environments, and multiple packaging systems, and applications.\n\nIt's a proteiform thing, that is virtually impossible to market, or promote, as a whole.\nFirst, specific distribution makers probably don't see the interest of promoting the Linux desktop as a whole, instead of promoting their own version of it.\n\nUbuntu is not going to spend advertising dollars to promote the concept of \"Linux\", when they could promote \"Ubuntu\".\n\nThat's when most people object that we could gather efforts and have unified marketing. I was of that opinion as well, for a time. Why don't all distro vendors gather together, and pull resources to draft a nice, big campaign to promote the \"Linux desktop\".\n\nI think the real reason why no one is doing that, is because it wouldn't work. You could, of course, invest money and time into a campaign that promotes the Linux desktop.\n\nSurely, a unified campaign would resonate with people? It might, yes, but in the end, where would these interested people go? They would still be confronted with the mighty problem of learning about the various distributions, their differences, the various desktop environments, applications...\nThey would still have to make a choice, and install Linux manually. None of these barriers to entry are removed by a unified marketing campaign. Linux is still a scary prospect for a lot of people, even if you try to push them over the edge with well crafted campaigns, and reasonable arguments.\nIt might be enough to push a few people over the line, but in general, it wouldn't work in terms of mass market appeal.\n\nBut to make people switch, we have to explain a lot of concepts:\n- What is an operating system.\n- What is Linux.\n- What is a distribution.\n- How to install Linux.\n- Why some hardware might not work\n\nNo one will move to Linux on their own due to an advertising campaign, because an advertising campaign can't reliably explain these concepts, and guide people through these steps. It's just not doable, and it can't bypass these barriers to entry.\n\n## Hardware can lift this block\n\nThat's why I think hardware is the way to go. And I'm talking about selling preinstalled Linux devices in main street shops. In Walmart, in french FNAC, wherever people shop for electronics.\n\nWe have to display the Linux desktop here. Whatever the distribution that achieves this, there would be plenty of time to argue the merits of one or the other afterwards. It's not important.\n\nWhat matters is that regular users can get into a store, use a Linux desktop for a few minutes, have a salesperson explain to them why it's \"Not Windows\", and buy one and take it home.\n\nI know, we already have plenty of hardware manufacturers and resellers, like Tuxedo, System76, Slimbook, or Starlabs. But these only sell digitally. This only appeals to people who already know what Linux is, and are looking for it.\n\nNow, if one of these manufacturers, or Dell, or Lenovo, offered their Linux powered devices in mainstream computer shops, or supermarkets, now we could reach the mainstream audience.\n\nThis would lift most barriers to entry.\nWhat we need isn't a grand unified marketing effort from all Linux distribution vendors. What we need is a mass market store or supermarket willing to take the risk to carry a few Linux devices, train their people for a few hours to explain the benefits,  like no windows license to pay, no spying, etc...), and we're golden.", "link": "https://www.youtube.com/watch?v=Av-NBWG8qtQ", "date_published": "2021-03-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]