[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Tiny Desk Meets AFROPUNK: ChocQuibTown", "description": "LaTesha Harris | April 25, 2021\nTiny Desk Meets AFROPUNK is the electrifying kick-off to AFROPUNK's \"Black Spring\" festival. The virtual celebration, hosted by Jorge \"Gitoo\" Wright, features performances from ChocQuibTown, Calma Carmona, Luedji Luna and Nenny. AFROPUNK, born out of a 2003 short film by the same name, is an international movement and music festival centered on Black exploration and rebellion. Starting as a way to create space for the unacknowledged presence and influence of Black culture in a predominantly white punk scene, AFROPUNK has since evolved into a distinct, multi-genre experience.\n\"Black Spring\" was created to spotlight outstanding talent in Afro-Latine and Afro-Caribbean music across the globe. The Tiny Desk Meets AFROPUNK program aims for the same. The showcase's four artists have come to the Tiny Desk to honor their homes and celebrate the art their heritage has inspired. Learn more about them below.\n\nChocQuibTown\n\"¡Tú sabes!\" Carlos \"Tostao\" Valencia exclaims after Colombian hip-hop trio ChocQuibTown performs its first song, the energetic \"Somos Pacífico.\" \"ChocQuibTown, straight from Colombia, from the Pacific coast,\" he says. \"We call it Africa inside Colombia, we got the flavor, we got the flow.\" ChocQuibTown — named after the coastal area the trio hails from — is a family affair comprised of siblings Miguel \"Slow\" Martinez and Gloria \"Goyo\" Martinez, the latter of which is married to Valencia. In 2000, the trio formed to promote their neglected corner of Colombia's culture; today, ChocoQuibTown's music blends the traditionality of Afro-Latin jazz with the modernity of hip-hop to create a singular, yet versatile sound.\n\nSET LIST\n • \"Somos Pacífico\"\n • \"De Donde Vengo Yo\"\n • \"Pa Olvidarte\"\n • \"Qué Lástima\"\n • \"Lo Que Quieras Tú\"\n • \"Cuando Te Veo\"\n\nMUSICIANS\n • Goyo: vocals\n • Slow: vocals\n • Tostao: vocals\n • Carlos Palmet: bateria\n • Alejandro García: guitar\n • Daniel Rodríguez \"Noize\": piano\n • Braulio Fernández: bajo\n • José González: trumpet, piano, vocals\n • Eignar Renteria: vocals\n • Yaima Saurez: vocals\n • Juancho Valencia: arrangements\n\nCREDITS\n\nVideo: Kevin Quiles, Roberto Vélez, Diego Valerio, MotionHaze, GoldenHour Music Group LLC\nAudio: Gabriel Gil, Waldy D.\n\nTiny Desk Meets AFROPUNK\nTINY DESK TEAM\n • Producer: Abby O'Neill\n • Video Producer: Maia Stern\n • Audio Mastering: Josh Rogosin\n • Associate Producer: Bobby Carter\n • Tiny Production Team: Bob Boilen, Kara Frame\n • Executive Producer: Lauren Onkey\n • Senior VP, Programming: Anya Grundmann", "link": "https://www.youtube.com/watch?v=mkYN0mzY_2E", "date_published": "2021-04-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Amplify with Lara Downes: Esperanza Spalding", "description": "Lara Downes | April 24, 2021\nTo be Esperanza Spalding is to be many things that myths are made of — the myths of genius, of creativity, of beauty, of success and stardom. Just to be a female bass player in the man's world of jazz is to be a unicorn, that most mythical creature. To have, on top of that, a voice that spins gold and casts spells — to win a Grammy for an album literally called 12 Little Spells. The possibilities for myth, magic and fairytale are endless. \n\nBut Esperanza Spalding is very real. She's grounded in the pursuit of truth before fantasy, determined to sing songs that avoid the same old stories, to create work that defies convenient endings. \n\nAt the moment, she's busy deconstructing an actual Greek myth while taking on the fabulous beast that is opera. Her self-produced and crowd-funded project Iphigenia is a collaboration with mentor/creative partner Wayne Shorter. His groundbreaking improvisation – and legendary quartet of musicians at the center – mixes classical and jazz forms in a score set to Esperanza's poetic and subversively radical libretto. Together, the music and text reveal a new perspective into this ancient story that would have us believe that Iphigenia was born to be sacrificed. But what if we let her tell her own story and make her own ending?\n\nIn this conversation, we talk about our power to liberate the victims of historical sacrifice — in myth, in opera, in the day-to-day experience of being human. \n\nTo deconstruct also means to rebuild, and Esperanza is applying her \"athletic creativity\" to the construction of work intended to give shelter and safe haven from the dangers of our time. Her Songwrights Apothecary Lab, developed during this pandemic year, is a hybrid of songwriting workshop and guided research practice. She brings together musicians and practitioners of various disciplines — music therapy, neuroscience, Black American music, Sufism and South Indian Carnatic music —  in the spirit of radical healing. It's a bold vision of what music can do, of what artists can do. And what can happen when we tell our own stories.", "link": "https://www.youtube.com/watch?v=-Lq4Vw1T1Jk", "date_published": "2021-04-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]