[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Apex Legends & Titanfall Timeline Explained", "description": "As the Legacy season of Apex Legends approaches, it's important to know how it intertwines with Titanfall to understand what's on the way for Respawn Entertainment's Sci-Fi universe. Join Persia as she goes into a deep dive on the connections between Apex Legend and Titanfall that occur over the course of over 700 years and major connections within the titles such as Kuben Blisk, Ash, and Viper. \n\nIn this video, Persia goes into a deep dive on the various connections between Apex Legends and the Titanfall universe. Season 9 of Apex Legends is right around the corner and will be bridging its gap between Titanfall 2 more than ever with the introduction of Viper's daughter as the newest legend to join the Apex Games.\n\nPersia runs through the entire timeline beginning in the 2100s and leading to the present-day in Apex which is 2735. The beginnings of this ever-expanding universe were controlled by the rise of Hammond Engineering and the IMC who become one of the biggest connections besides Kuben Blisk, the leader of the Apex Predators and the commissioner of the Apex Games.\n\nOther notable connections that Persia mentions are Ash, the doctor or Apex Predator depending on who you're asking, and  Bangalore who has a family history within the IMC as soldiers and scientists.\n\nPlenty more lore from Respawn Entertainment's Sci-Fi universe is on the way, so if you want to stay up to date on everything Apex and Titanfall, then be sure to leave a like and subscribe!", "link": "https://www.youtube.com/watch?v=OWaQNdqedXc", "date_published": "2021-04-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil Village | Castle Demo Gameplay (PS5)", "description": "Enjoy a look at the Castle portion of the Resident Evil Village demo, running on PS5.", "link": "https://www.youtube.com/watch?v=JQ6mv73GTQM", "date_published": "2021-04-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To The Last Of Us Part 2’s Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of The Last Of Us Part 2, including the Taurus Model 66 revolver, the Thompson Centre Arms Contender hunting pistol, and the SIG-Sauer MPX silenced submachine gun.\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of The Last Of Us Part 2 and compares them to their real-life counterparts.\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can purchase Jonathan's book here - https://www.headstamppublishing.com/bullpup-rifle-book", "link": "https://www.youtube.com/watch?v=oxmj53Qe_tY", "date_published": "2021-04-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]