[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Tiny Desk (Home) Concert: Kacy & Clayton and Marlon Williams", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nBob Boilen | March 29, 2021 - Across hemispheres, despite a nearly 8,000-mile separation, the Saskatoon, Canada duo of cousins Kacy & Clayton and New Zealand's Marlon Williams manage to create harmony and intimacy. The Tiny Desk (home) concert, on the surface, is joyful and playful with animated illustrations by Daniel Syrnick. But a careful listen to \"Plastic Bouquet,\" the title track to the 2020 collaboration between Kacy Lee Anderson, Clayton Linthicum, and Marlon Williams, reveals a depth of storytelling more familiar in murder ballads than the trio's upbeat Americana sound. \nKacy sings, \nWhen a small four-door car was severed in two\nThree girls were killed by a boy they all knew\nOut for a party, they'd never attend \nPockets with money they never would spend \n\nThe devastatingly sad tale is met with smiles across hemispheres while an animated teacup pops on screen for Kacy to sip. Clayton's guitar twangs and Marlon's Roy Orbison-like voice conjure a 1950s rock and roll sound that's a surprisingly perfect match for Kacy's serene voice. It's a magic collaboration of the very far north meeting the very deep south. The wizardry of technology reminds me of the wondrous world we often share these days, from a distance.\n\nSET LIST\n\"I Wonder Why\"\n\"Plastic Bouquet\"\n\"Arahura\"\n\"Isn't It\"\n\"Devil's Daughter\"\n\nMUSICIANS\nKacy Anderson: vocals, guitar \nClayton Linthicum: guitar \nMarlon Williams: vocals, guitar\n\nCREDITS\nVideo: Little Jack Films, Tom Lynch \nAudio: Micah Erenberg, Tom Lynch, Ben Delany\nIllustration: Daniel Syrnick\nLighting: Simeon Hoggan\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Kara Frame\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Maia Stern\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann\n\n#kacyandclayton #marlonwilliams #tinydesk #nprmusic", "link": "https://www.youtube.com/watch?v=e0zFkeH9PAM", "date_published": "2021-03-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]