[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "How did the pandemic start?", "description": "Viral origins\n\nReporting Tuesday\n\nTeam hit the ground one year after outbreak\n\nhttps://www.washingtonpost.com/world/who-wuhan-report-/2021/03/29/cb6ca64e-7778-11eb-9489-8f7dacd51e75_story.html\n\nJoint World Health Organization-China report\n\nCoronavirus most likely jumped from animals to humans via an intermediate animal host\n\nDownplays the possibility it leaked from a lab\n\nRecommends further study, path of transmission between animals and humans\n\nTransmission through frozen food\n\nDoes not recommend additional research on the lab leak hypothesis\n\nUS Secretary of State Antony Blinke\n\nConcerns about the methodology and the process\n\nthe fact that the government in Beijing apparently helped to write it\n\nJake Sullivan, national security\n\nIt is imperative that this report be independent, with expert findings free from intervention or alteration by the Chinese government \n\nTo better understand this pandemic and prepare for the next one, China must make available it’s data from the earliest days of the outbreak\n\nMuch data collected by Chinese scientists, ahead of visit, then analyzed by the joint team\n\nDominic Dwyer, Australian microbiologist team member\n\nI mean, yes, we did a three-hour visit. \n\nAnd it was sort of managed in the sense that there’s a lot of people there, and we do a tour. \n\nBut we did get to ask questions\n\nYou could do, if so desired, a more detailed forensic examination\n\nBut that is another whole negotiation and discussion\n\nCDC, Right now, I’m scared\n\nhttps://www.washingtonpost.com/nation/2021/03/29/coronavirus-covid-live-updates-us/\n\nRochelle Walensky\n\n7 day average, about + 60,000 per day\n\nUp 10%\n\nDeath rate up 3%\n\nI’m going to lose the script and I’m going to reflect on the recurring feeling I have of impending doom\n\nWe have so much to look forward to, so much promise and potential of where we are and so much reason for hope. But right now, I’m scared\n\nInfectious diseases physician at Massachusetts General Hospital\n\nU.S. trajectory mirrors the trends a few weeks ago in Europe\n\nPlease hold on a little while longer. I so badly want to be done\n\nWe are just almost there, but not quite yet\n\nCountry does not have the luxury of inaction\n\nWH working on standardized vaccine passport\n\nUK government update\n\nhttps://www.gov.uk/government/publications/slides-and-datasets-to-accompany-coronavirus-press-conference-29-march-2021\n\nhttps://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/974356/2021-03-29_COVID-19_Press_Conference_Slides__for_publication_.pdf\n\n\nUK roadmap\n\nhttps://www.bbc.co.uk/news/explainers-52530518\n\nThe coronavirus vaccine programme continues to go to plan\n\nVaccines are sufficiently reducing the number of people dying or needing hospital treatment\n\nInfection rates do not risk a surge in hospital admissions\n\nNew coronavirus variants do not fundamentally change the risk of lifting restrictions", "link": "https://www.youtube.com/watch?v=-poCVhV5-yY", "date_published": "2021-03-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]