[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "27 Warframe Questions Answered With Rebecca Ford", "description": "Warframe is a massive and sprawling game with many questions to seek answers to. Thankfully Warframe's Community Director, Rebbeca Ford, is here to answer the internet's most searched Warframe questions. \n\nSince Warframe's debut in 2013, the community surrounding the free-to-play online game has grown significantly across PC and consoles. With the concept being about playing as \"space ninjas\" exploring a strange universe filled with open worlds to explore and ancient loot to uncover, there have undoubtedly been some lingering questions from fans. These include the fate of key characters, how to unlock some of the more high-end Frames, and just where the hell you can find some of the rare crafting materials. With this in mind, we spoke with the one person at developer Digital Extremes who has been at the forefront of answering all of the internet's most asked questions about Warframe, and that's \"Space Mom\" herself, Rebecca Ford.\n\nAlong with being the voice of the in-game character Lotus, who serves as the guide for all active Tenno, Ford is also Digital Extreme's Live Operations and Community Director and is the most knowledgeable Warframe player on the internet. When she isn't playing Warframe on livestreams, she's answering the community's burning questions and keeping fans up to date on the latest of what's happening with the game.\n\nIn this latest video, GameSpot spoke with Ford about the growing scope of Warframe and how the community has reacted to the latest updates. In addition to explaining what some of the top-tier Frames are, what's new with the Railjack, and just what the deal is with characters like Clem, she also gave a brief update on the current state of things with the anticipated expansion The Duvari Paradox, first announced back in 2019.\n\nFor more on Warframe, check out our latest update for our Warframe review, which includes impressions on the PS5 edition of the game.", "link": "https://www.youtube.com/watch?v=2-hq11zgACc", "date_published": "2021-03-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Cyberpunk 1.2 Patch: Is It Playable Yet?", "description": "Cyberpunk 2077's 1.2 patch just dropped and it is massive! Jake and Jean-Luc take it for a spin to see how CD Projekt Red's RPG runs now.", "link": "https://www.youtube.com/watch?v=ala-F5aOjuE", "date_published": "2021-03-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "DISCO ELYSIUM - The Final Cut Official Launch Trailer", "description": "Check out the official launch trailer for Disco Elysium: The Final Cut that is the definitive edition of the groundbreaking game released in 2019, Disco Elysium! \n\n#DiscoElysium #Gaming #DiscoElysiumFinalCut", "link": "https://www.youtube.com/watch?v=nk_K5DM0UTk", "date_published": "2021-03-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Fortnite Raptors Hatching - Official Trailer", "description": "In Fortnite Season 6, Raptors are hatching across the Island. Check out this official trailer showing off the announcement of Raptors entering Fortnite in Fortnite Season 6 Primal! \n\n#Fortnite #FortniteSeason6 #FortnitePrimal", "link": "https://www.youtube.com/watch?v=dz61Opf_zZ8", "date_published": "2021-03-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Monster Hunter Rise Review", "description": "Monster Hunter Rise's renewed focus on fully-fledged action represents the series at the peak of its powers.\n\nRichard has spent over 40 hours with Rise thus far, with many more to come over the coming months. He will be playing multiplayer on live servers once the game has launched in order to finalize this review. Review code was provided by the publisher.", "link": "https://www.youtube.com/watch?v=nkQ1wUAAZZM", "date_published": "2021-03-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Outriders' Coolest Weapons and Abilities", "description": "(Presented by Square Enix) No looter-shooter is complete without an incredible arsenal of weapons to make slaying your enemies in the most creative ways possible something to strive for, but the awesome abilities at your disposal is just icing on the cake. Here are some of our favorites of both from Outriders!", "link": "https://www.youtube.com/watch?v=dM6ZhWT-uls", "date_published": "2021-03-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "DOOM 3 VR Edition - Launch Trailer | PS VR", "description": "Check out the official launch trailer for DOOM 3 VR Edition coming to Playstation VR (PS VR). \n\nDOOM 3: VR Edition transforms id Software’s critically acclaimed action-horror shooter into a white-knuckle VR experience, immersing players in a terrifying world where Hell lurks around every corner.\n\nA demonic invasion has overwhelmed the Union Aerospace Corporation’s Martian research facility, leaving horror and death in its wake. You are one of the few survivors, a marine with access to an arsenal of weapons. Fight your way through the darkened, claustrophobic corridors of the research facility and into Hell itself to stop the invasion from reaching Earth.  \n\nDOOM 3: VR Edition also includes both expansions – Resurrection of Evil and The Lost Mission. In The Lost Mission you are the sole survivor of Bravo Team, tasked with destroying a teleportation relay located deep inside Hell capable of sending an army of demons to Earth. Resurrection of Evil takes place two years after the events of DOOM 3 -- you must recover an ancient artifact able to open a portal to Hell and destroy it before the Maledict can use it to exterminate humanity.\n\n#DOOM #DOOM3 #PSVR", "link": "https://www.youtube.com/watch?v=aTejy_IVL0o", "date_published": "2021-03-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Season Two Reloaded | Call of Duty: Black Ops Cold War Update", "description": "Check out the official Season Two update video for Call of Duty: Black Ops Cold War, Season Two Reloaded! The Call of Duty devs break down what updates are coming in the mid-season update for Call of Duty: Black Ops Cold War! \n\n#CoD #CallofDuty #ColdWar", "link": "https://www.youtube.com/watch?v=9vNMxvSgBMM", "date_published": "2021-03-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]