[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "28 MORE Things You STILL Didn't Know In Zelda Breath Of The Wild", "description": "Returning with more secrets that you probably don't know about in Breath of the Wild! This time we dive into an object you can multi-stasis, what diaries around Hyrule actually say, teleporting fire with the Master Cycle, and much more!\n\nIn the video above, we cover 28 tips and tricks that aren’t quite as well known, ranging from secrets to glitches, some that are pretty simple and others that are fairly complex. Breath of the Wild has been out for four years at this point, and players have found some amazing things, intended or not, that keep the game and its sense of discovery feeling fresh.\n\n0:00 Intro\n0:12 How To Avoid Mudpit Drowning   \n0:32 Propogate Fish\n0:41 Fish Swim In Mud, Ice Water, and Lava\n0:53 Horse Follow Command\n1:13 All Books Are April Fools Jokes\n1:41 Kiltons Real Shop Name\n1:48 Typos\n2:08 Multi-Stasis\n2:28 Moblin Arm-Blocking\n2:38 Sleepy NPC's Ignore Weapons\n2:55 Campfire Glitch Uses\n3:18 Sheikah Tower Hidden Designs\n3:30 Sheikah Tower Ledge Secret\n3:45 Memory Launch\n4:07 Shop Item Weirdness\n4:18 Camouflaged Lizalfos Are Weird\n4:40 Horse Don't Give A Damn\n4:49 Fairy Refueling\n5:02 Master Cycle Teleports Fire\n5:24 Tree Jumping\n5:30 Octoballoon Weight Momentum\n5:46 Giant Horses In Deep Water\n6:00 Turn Things Invisible\n6:23 Get Cool Snapshots\n6:38 Lynel Speedkilling\n7:13 Forest Octorok's Drown?\n7:24 Ganon Selfie\n7:31 Pull The Legendary Master Bomb\n\n#zelda #zeldabreathofthewild #breathofthewild", "link": "https://www.youtube.com/watch?v=WHQ9v5vxfEU", "date_published": "2021-07-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Warframe New War 30 Minute Gameplay Demo | Tennocon 2021", "description": "At TennoCon 2021, we got our first look at Warframe's next major expansion, The New War. Coming later this year, this new cinematic quest will see the Tenno will face off against the growing force of the Sentients, who have now invaded Earth.\nIn this extended gameplay reveal, we see the full invasion of Cestus, Earth's major human settlement, showing off the scale of the Sentient invasion.  But in a surprise twist, we then cut to gameplay for characters other than our familiar Tenno. While your adventures throughout Warframe have focused on the Tenno, The New War will mark the first time players take on an active role as side characters for story missions. In the gameplay we saw during the stream, The New War will feature missions letting you control the sword-wielding Teshin of the Conclave faction, Kahl-175 of the Grineer, and the Corpus engineer Veso. These standalone missions will focus on each character's particular loadout and skills, making them stand apart from the slate of Frames you've become well accustomed to over the years. However, The New War will still focus on the Tenno and their actions during this questline.\n\n#warframe #warframenewwar #tennocon2021", "link": "https://www.youtube.com/watch?v=ylV8c3jnbig", "date_published": "2021-07-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "7 Reasons COD Zombies Is Great", "description": "For more than 13 years, Call of Duty's Zombies has been a fan-favorite game mode. Let's find out what the series has done right to make this possible.\n\nCall of Duty's Zombies mode has been around for almost as long as the series entirely. Dating back to 2008's Call of Duty: World at War, the side mode (that almost wasn't) took over and became a phenomenon over night.  In this video, Richie Bracamonte explains why the series is so fun and the reasons why it's so great.\n\nFrom humble beginnings, to the sprawling multiverse it has become, Zombies mode has had many successful staples of gameplay that have helped it succeed for more than 10 years. These include gameplay mechanics like perks, wonder weapons and the hunt for the illustrious Easter eggs. As the years went on, more and more secrets were uncovered that led to a grand story. Across multiple titles through the Black Ops series, we saw strong character development and several additions to the mode that only made for a stronger experience.\n\nToday, Zombies mode is still going strong. New maps are regularly added, as well as new modes and ways to play. The story continues to expand on a seasonal basis, and fans are still chomping at the bit for more content just like they were in 2008. Stay tuned to GameSpot for Zombies updates and more nostalgic videos just like this one.\n\n#cod #codzombies", "link": "https://www.youtube.com/watch?v=Q0KAL0R0okE", "date_published": "2021-07-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Fallout 3’s Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of Fallout 3, including the ridiculous Railway Rifle, the Alien Blaster, and the clunky Microwave Emitter.\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of Fallout 3 and compares them to their potential real-life counterparts.\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nIf you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can purchase Jonathan's book here - https://www.headstamppublishing.com/bullpup-rifle-book\n\nYou can check out Jonathan on the Fighting on Film podcast here - https://www.youtube.com/playlist?list=PLNsrU8HuCAzaizIqbAcNZ5VUQW789z3ZF\n\n#firearms #fallout3", "link": "https://www.youtube.com/watch?v=FspvZxv-qWc", "date_published": "2021-07-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Steam Deck Everything We Know", "description": "Valve surprised the gaming community this week with the announcement of the Steam Deck, a new foray into dedicated PC gaming hardware.\n\nThe portable device bears more than a passing resemblance to Nintendo's popular handheld-console hybrid, the Nintendo Switch, given its general size and form factor. But unlike the Switch, the Steam Deck is built to play your Steam library on-the-go, and the impressive-looking piece of tech is launching this December. Here is everything we know so far, including the various versions, incompatible games, design, battery, specs, accessories, and preorder information. \n\nTimestamps:\n00:25 - SKUs/Versions\n01:38 - Games \n02:24 - Incompatible Games\n03:19 - Design\n04:39 - Battery\n04:58 - Hardware Specs\n06:08 - Accessories\n06:54 - Preorder Info\n\n#steamdeck", "link": "https://www.youtube.com/watch?v=luRHTpUNTEg", "date_published": "2021-07-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "TennoCon LIVE with Persia and L1fewater", "description": "(Presented by Warframe) Join Persia and Warframe Expert, L1fewater, as they react to and discuss every huge announcement from TennoCon 2021, an event dedicated to all things Warframe!\n\nFor more info about TennoCon and Warframe, visit https://www.warframe.com/landing?utm_medium=paid-media&utm_source=gamespot&utm_campaign=2021-07-TennoCon-Costream-GameSpot\n\n#tennocon", "link": "https://www.youtube.com/watch?v=kYoXkqBcyBg", "date_published": "2021-07-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]