[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "TRAILER: \"American Insurrection\" | FRONTLINE", "description": "FRONTLINE, ProPublica and UC Berkeley’s Investigative Reporting Program present “American Insurrection”: a timely, 90-minute documentary that probes the far-right groups and leaders responsible for the recent threats and violence.\n\nThis journalism is made possible by viewers like you. Support your local PBS station here: http://www.pbs.org/donate\n\nOver the last three years, FRONTLINE has collaborated with ProPublica to investigate the rise of extremism in America. Now, in the aftermath of the assault on the U.S. Capitol, FRONTLINE, ProPublica and UC Berkeley's Investigative Reporting Program team up to examine how far-right groups were emboldened and encouraged by former President Trump and how individuals were radicalized and brought into the political landscape.\n\nWatch \"American Insurrection,\" a co-production between FRONTLINE, ProPublica and UC Berkeley’s Investigative Reporting Program, beginning April 13: https://to.pbs.org/31YcLl6\n\nLove FRONTLINE? Find us on the PBS Video App where there are more than 300 FRONTLINE documentaries available for you to watch any time:\nhttps://to.pbs.org/FLVideoApp\n\n#Documentary #AmericanInsurrection #Extremism\n\nSubscribe on YouTube: http://bit.ly/1BycsJW \nInstagram: https://www.instagram.com/frontlinepbs \nTwitter: https://twitter.com/frontlinepbs \nFacebook: https://www.facebook.com/frontline\n\nFunding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Major funding for FRONTLINE is provided by the John D. and Catherine T. MacArthur Foundation and the Ford Foundation. Additional funding is provided by the Abrams Foundation; Park Foundation; the Heising-Simons Foundation; the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation; and Koo and Patricia Yuen. Funding for American Insurrection is provided by The WNET Group’s “Exploring Hate” initiative on Antisemitism, Racism and Extremism, with principal support by The Sylvia A. and Simon B. Poyta Programming Endowment to Fight Antisemitism and additional major funding from The Peter G. Peterson and Joan Ganz Cooney Fund, and Patti Askwith Kenner. Additional support from Sue and Edgar Wachenheim III, James and Merryl Tisch, Nancy and Morris W. Offit, and Judy and Josh Weston.", "link": "https://www.youtube.com/watch?v=WnIEtfa7MdU", "date_published": "2021-04-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]