[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Ireland, vitamin D report", "description": "Report on addressing Vitamin D deficiency as a public health measure in Ireland.\n\nhttps://www.oireachtas.ie/en/press-centre/press-releases/20210407-oireachtas-health-committee-launches-report-on-addressing-vitamin-d-deficiency-in-ireland/#:~:text=The%20Joint%20Committee%20on%20Health,established%20to%20address%20that%20deficiency\n\nhttps://data.oireachtas.ie/ie/oireachtas/committee/dail/33/joint_committee_on_health/reports/2021/2021-04-07_report-on-addressing-vitamin-d-deficiency-as-a-public-health-measure-in-ireland_en.pdf\nVitamin D levels and deficiency with different occupations: a systematic review. Sowah et al. BMC Public Health (2017) 17:519 doi:10.1186/s12889-017-4436-z\nVitamin D Deficiency Is Associated With an Increased Likelihood of Incident Depression in Community-Dwelling Older Adults. Briggs et al. doi:10.1016/j.jamda.2018.10.006 \nVitamin D supplementation for the prevention and treatment of COVID-19: a position statement from the Spanish Society of Geriatrics and Gerontology. Tarazona-Santabalbin et al. nhttps://doi.org/10.1016/j.regg.2021.02.001\nThe Environment and Disease: Association or Causation? Bradford Hill. Proc R Soc Med 1965 May; 58(5): 295–300. https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1898525/ \nScientific Opinion on the Tolerable Upper Intake Level of vitamin D. EFSA Panel on Dietetic Products, Nutrition and Allergies (NDA) (2012) EFSA Journal;10(7):2813. [45 pp.] doi:10.2903/j.efsa.2012.2813. \nScientific Advisory Committee on Nutrition (SACN) Vitamin D and Health. Crown copyright 2016. Report available online at: https://www.gov.uk/government/groups/scientific-advisory- committee-on-nutrition \nDietary Reference Intakes for Calcium and Vitamin D. Institute of Medicine (IOM) (2011) Washington, DC: The National Academies Press \nThe Safety of Vitamins and Minerals in Food Supplements – Establishing Tolerable Upper Intake Levels and a Risk Assessment Approach for Products Marketed in Ireland (Revision 2). FSAI Scientific Committee on Nutrition (2018) Dublin: FSAI. \nTithe na Oireachtais; Joint Committee on Health debate. Tuesday, 23 Feb 2021 https://www.oireachtas.ie/en/debates/debate/joint_committee_on_health/2021-02-23/ \nPerspective: Vitamin D deficiency and COVID-19 severity plausibly linked by latitude, ethnicity, impacts on cytokines, ACE2 and thrombosis. Rhodes, J.M.; Subramanian, S.; Laird, E.; Griffin, G.; Kenny, R.A.. J. Intern. Med. 2020. \nAutumn COVID-19 surge dates in Europe correlated to latitudes, not to temperature-humidity, pointing to vitamin D as contributing factor. Walrand, S., Sci. Rep. 2021 \nCOVID-19 Nursing Homes Expert Panel: Final Report. Department of Health, 19 August 2020 \nPopulation and Labour Force Projections 2017-2051. Central Statistics Office. \nHealthy Ireland Survey 2015, Summary of Findings. \nObesity in an Ageing Society Implications for health, physical function and health service utilisation. Siobhan Leahy, Anne Nolan, Jean O’Connell, Rose Anne Kenny (The Irish Longitudinal Study on Ageing, TCD and St. Vincent’s University Hospital, Dublin) 2014. \nA High Prevalence of Vitamin D Deficiency Observed in an Irish South East Asian Population: A Cross-Sectional Observation Study. Laird et al, November 2020. doi:10.3390/nu12123674 \nSuccessful nutrition policy: improvement of vitamin D intake and status in Finnish adults over the last decade. Raulio et al., 2017. doi:10.1093/eurpub/ckw154 \nEffect of calcifediol treatment and best available therapy versus best available therapy on intensive care unit admission and mortality among patients hospitalized for COVID-19: A pilot randomized clinical study. Castillo et al; 2020 doi:10.1016/j.jsbmb.2020.105751 \nVitamin D and clinically extremely vulnerable (CEV) guidance. UK Government Publications, February 2021. \nThe Joint Committee on Health\n\nThe Committee heard evidence that Vitamin D deficiency is prevalent across the population and the report recommends that public health measures are established to address that deficiency. These public health measures are preventative in nature and are recommended to reduce the risk of respiratory and other illnesses such as osteoporosis.\n\n1 That daily Vitamin D supplementation of 20-25µg/day should be recommended to the entire adult population as a public health measure, \n\nhigher doses recommended for vulnerable groups under medical supervision.\n\n2 That a public health policy, which promotes better knowledge of the benefits of Vitamin D, and which encourages Vitamin D supplementation, should be developed in time for consideration in Budget 2022.\n\n3 That reducing the cost of Vitamin D supplementation, in order to promote its uptake, should be considered.\n\n4 That specific measures need to be put in place for vulnerable groups, and for frontline and healthcare workers, \n\nso that Vitamin D supplementation is administered on an opt-out basis, \n\nand for the duration of this pandemic, people should be offered Vitamin D supplements when presenting at Covid-19 test centres.", "link": "https://www.youtube.com/watch?v=hG72xGd0W0M", "date_published": "2021-04-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Vaccine safety update", "description": "EMA\n\nhttps://www.bbc.co.uk/news/world-europe-56665150\n\npossibility of very rare cases of blood clots combined with low levels of blood platelets occurring within two weeks of vaccination\n\n86 European cases\n\nplausible explanation for these rare side effects is an immune response to the vaccine\n\n18 deaths\n\nBenefits of the vaccine outweighed the risk\n\n25 million doses\n\n(One case per 290,697 doses)\n\n(One death per 1,388,888)\n\nCould not list specific risk factors such as age or gender, but most blood clot cases were women under 60\n\nEmer Cooke\n\nNo available evidence of specific risk factors such as age, gender, or previous medical history of clotting disorders\n\nThis vaccine has proven to be highly effective - it prevents severe disease and hospitalisation, and it is saving lives.\n\nBelgium\nRestrict AstraZeneca to those aged 56 and above\n\nItaly\nOver 60s\n\nNo evidence to stop people having a second dose of AstraZeneca\n\nSpain\nRestricting AstraZeneca to those between 60 and 64\n\nFrance\nGiven only to those aged 0ver 55\n\nGermany\n\nOver 60s, plus high-priority groups\n\nUnder-60s who have received an AstraZeneca first dose should get a different vaccine for their second\n\nNorway and Denmark\n\nFull suspension\n\nGermany also says its \n\nWorld Health Organization's advisory vaccine safety panel\n\nBlood clot link was plausible \n\nnot confirmed\n\nvery rare among 200 million people vaccinated with AstraZeneca globally\n\nStatement from the Joint Committee on Vaccination and Immunisation (JCVI) on the use of the AstraZeneca COVID-19 vaccine\n\nhttps://www.gov.uk/government/publications/use-of-the-astrazeneca-covid-19-vaccine-jcvi-statement\n\nActing on a precautionary basis, if these persons (under 30) are still unvaccinated, it is preferable for them to be offered an alternative COVID-19 vaccine, if available.\n\nMHRA issues new advice, concluding a possible link between COVID-19 Vaccine AstraZeneca and extremely rare, unlikely to occur blood clots\n\nhttps://www.gov.uk/government/news/mhra-issues-new-advice-concluding-a-possible-link-between-covid-19-vaccine-astrazeneca-and-extremely-rare-unlikely-to-occur-blood-clots\n\nSlides from press conference\n\nhttps://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/976877/CovidStats_07-04-21-final.pdf\n\nMedicines and Healthcare products Regulatory Agency (MHRA)\n\nPossible risk of extremely rare and unlikely to occur specific types of blood clots\n\nMHRA has undertaken a thorough review into UK reports\n\nVery rare and unlikely to occur, cerebral venous sinus thrombosis (CVST)\n\nOccurring together with low levels of platelets (thrombocytopenia)\n\nIt is also considering other blood clotting cases (thromboembolic events) alongside low platelet levels\n\nMost presenting within 14 days of first dose\n\nAnalysed by\n\nCommission on Human Medicines (CHM)\n\nhttps://www.gov.uk/government/organisations/commission-on-human-medicines/about/membership\n\nCOVID-19 Vaccines Benefit Risk Expert Working Group\n\nUp to and including 31 March 2021\n\n20.2 million doses of AstraZeneca had given in the UK\n\nOverall risk of these blood clots is approximately 4 people in a million\n(One in 255,696)\n\nMHRA had received 79 UK reports of blood clotting cases alongside low levels of platelets\n\n44 of the 79 cases were of CVST with thrombocytopenia\n\n35 of the 79 cases were of thrombosis in other major veins with thrombocytopenia\n\n79 cases occurred in 51 women and 28 men, aged from 18 to 79 years\n\n19 deaths\n\n(One in 1,063,157)\n\n19 people have died out of the 79 cases, 13 females and 6 males\n\n11 out of the 19 people who died were under the age of 50\n\n3 of whom were under 30\n\n14 of these 19 cases were of CVST with thrombocytopenia\n\n5 of the 19 were thrombosis with thrombocytopenia\n\nAll 79 cases occurred after a first dose of the vaccine\n\nUK CoViD deaths\n\n8th April, + 53 = 126,980\n\nor 149,968\n\nLevel of risk\n\n31 March numbers, slightly higher than 24 March\n\nAnyone who did not have these side effects should have second dose\n\nPregnancy predisposes to thrombosis, discuss with their healthcare professional \n\nPrecautionary measure, seek prompt medical advice\n\nShortness of breath, chest or persistent abdominal pain, leg swelling\n\nBlurred vision, confusion or seizures\n\nPin-prick rash or bruising beyond the injection site\n\nNew onset of severe or persistent headache that does not respond to simple painkillers starting four days or more after vaccination should speak to their doctor.\n\nDr June Raine, MHRA Chief Executive\n\nUse Yellow Card Website\n\nhttps://coronavirus-yellowcard.mhra.gov.uk\n\nIt is still vitally important that people come forward for their vaccination when invited to do so\n\nAdvice for health care professionals\n\nhttps://www.gov.uk/government/publications/regulatory-approval-of-covid-19-vaccine-astrazeneca/information-for-healthcare-professionals-on-covid-19-vaccine-astrazeneca\n\nFollowing administration, the S glycoprotein of SARS CoV 2 is expressed locally stimulating neutralising antibody and cellular immune responses.", "link": "https://www.youtube.com/watch?v=vEg523BilxI", "date_published": "2021-04-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]