[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCyl5V3-J_Bsy3x-EBCJwepg", "title": "Abigail Shrier Interview: The Truth Behind Trans Children", "description": "This is the Babylon Bee Interview Show.\n\nIn this episode of The Babylon Bee Podcast, Kyle and Ethan talk to Abigail Shrier, a writer for the Wall Street Journal, The Federalist and author of new book Irreversible Damage. In the book she explores the “transgender craze,” where in the last few years, there has been an explosion in people identifying as transgender -- especially among biological females now identifying as male. The book was recently banned from Target -- though later reinstated -- after one transgender individual complained on Twitter. Topics include the Transgenderism craze, big tech, and making women a victim class.\n \nBuy her book here: Irreversible Damage: The Transgender Craze Seducing Our Daughters\n\nWatch The Babylon Bee animation on our animation playlist: https://bit.ly/BeeAnimation  \n\nSubscribe on iTunes: https://podcasts.apple.com/us/podcast/the-babylon-bee/id1468715531\n\nSubmit Your Own Headlines: https://babylonbee.com/plans\n\nThe Official The Babylon Bee Store: https://shop.babylonbee.com\n\nFollow The Babylon Bee:\nWebsite: https://babylonbee.com\nTwitter: http://twitter.com/thebabylonbee\nFacebook: http://facebook.com/thebabylonbee\nInstagram: http://instagram.com/thebabylonbee", "link": "https://www.youtube.com/watch?v=_C6YTHGg0fA", "date_published": "2021-01-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCyl5V3-J_Bsy3x-EBCJwepg", "title": "Who Was Really Behind The Attack On The Capitol?", "description": "Who is really behind Proud Boy violence? AntiFa? What about Black Lives Matter? Is it secretly the cops? Or is it something even deeper?\n\nSee more The Babylon Bee animation on our animation playlist: https://bit.ly/BeeAnimation", "link": "https://www.youtube.com/watch?v=6glA2QJEozc", "date_published": "2021-01-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCyl5V3-J_Bsy3x-EBCJwepg", "title": "Abigail Shrier on The Babylon Bee Podcast | Preview", "description": "🎙 Tomorrow, author of “IRREVERSIBLE DAMAGE: The Transgender Craze Seducing Our Daughters”, Abigail Shrier joins Kyle and Ethan on The Babylon Bee podcast.\n\nSUBSCRIBE TODAY! ▶️ http://bit.ly/TheBeeYouTube", "link": "https://www.youtube.com/watch?v=HTmLocSG0Eg", "date_published": "2021-01-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCyl5V3-J_Bsy3x-EBCJwepg", "title": "The Absolute Best Way to Propose to Your Christian Girlfriend", "description": "The Babylon Bee made history by participating in its first wedding proposal hidden in a satire article! Kyle and Ethan were bribed by a Babylon Bee subscriber into writing an article about the 10 best ways to propose to your Christian girlfriend. It ends with a serious marriage proposal written in the most loving way. Watch to find out if she said yes!\n\nSee the full show here:\nhttps://youtu.be/bqXUTUKZZqI\n\nSubscribe to The Babylon Bee to help us make more happy marriages.\n\nHit the bell to get your daily dose of fake news that you can trust.", "link": "https://www.youtube.com/watch?v=P5QHbQBsHyE", "date_published": "2021-01-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]