[{"source": "https://lukesmith.xyz/rss.xml", "title": "Modern \"Freedom\" Means Being a Slave to Impulses", "description": "<h2 id=\"what-does-freedom-mean\">What does freedom mean?</h2>\n<p>See this article in video form\n<a href=\"https://lukesmith.xyz/articles/modern-freedom-means-being-a-slave-to-impulses\">here</a>.</p>\n<p>Which of the following two people is more free:</p>\n<ol>\n<li>A drug addict.</li>\n<li>A average man who is only not a drug addict because he lives in a\ncountry where drugs are regulated or shamed in a way to make them\nhard to obtain.</li>\n</ol>\n<p>Most modern people will have a kind of cognitive dissonance, a kind of\nglitch in their matrix here. In the modern view of freedom, freedom\nmeans the ability to do what you want without the government or society\ntelling you what to do, so (1), the drug addict, should be more\n&quot;free.&quot;</p>\n<p>But at the same time, this feels wrong. (2) probably lives a better\nlife. He is more suited to make more and better decisions. Someone\naddicted to drugs is highly constrained in the kind of life they have to\nlive to fulfill their addiction.</p>\n<p>Even extreme libertarians will probably say (2) is in a better place,\nbut might chalk things up to (1) needing to have more discipline and\nthey'll make up some just-so story as for why unambiguously bad drugs,\nor pornography, or dangerous things should be allowed anyway.</p>\n<h2 id=\"classical-freedom\">Classical freedom</h2>\n\n<figure class=\"resright\"><img src=\"https://lukesmith.xyz/pix/paul.jpg\" /></figure>\n\n<p>In reality, since the Enlightenment, we have had a hobbled understanding\nof what &quot;freedom&quot; is. Enlightenment &quot;freedom&quot; is only the freedom to\nperfectly follow the whims of impulses and vices indiscriminately.</p>\n<h3 id=\"the-christian-tradition\">The Christian tradition</h3>\n<p>Christians stated the classical view of freedom very clearly. Paul\nwrites that all men are either &quot;slaves to Christ&quot; or &quot;slaves to\nsin.&quot; The modern man wants to retort that he doesn't want to be a\nslave to anything, but wants to be his own master, but there is really\nno such thing.</p>\n<p>One can be guided by Christ, or more generally, by consistent moral\nprinciples, restraint and forethought. Or one can abandon the pretense\nof morality and by definition follow his impulses to fornication,\nsubstance-abuse, and general reckless living.</p>\n<p>These masters aren't equivalent either. Being a slave to one is nothing\nlike being a slave to another. Slaves to sin are wrapped up into\nincoherent and uncontrollable behavior. Following one's sexual whims\nmight be inconsistent and thoughtless behavior that one likes one second\nand is disgusted by the next. It might mean someone exploding in rage\nand emotion.</p>\n<p>This &quot;free&quot; man, a slave to sin, is only bound by the practical\nconsideration that he might get caught or shamed by &quot;prudes&quot; and that\nmight dampen his ability to follow his inpulses more.</p>\n<h3 id=\"impulses-are-not-the-man\">Impulses are not the man</h3>\n\n<figure class=\"titleimg\"><img src=\"https://lukesmith.xyz/pix/nihilism.jpg\" /></figure>\n\n<p>If we look at the modern world as if it has desires and goals for us, it\ncertainly seems like it is trying to induce as many people as possible\ninto being slave to sin. People no long have identity in who they\nactually are, but in accidental preferences formed over years of\nimpulse-seeking: their sexual fetishes, drugs of choice, their favorite\nTV show to consoom or their favorite music they constantly pump in their\nhead to dampen the possibility that an original reflective thought might\noccur to them.</p>\n<p>More than that, these people often can't even fathom of life without\ntheir master sins, and retort in rage when someone dares to direct them\notherwise or &quot;judge&quot; them. They don't just have a kind of Stockholm\nSyndrome with sin, but they can't comprehend the fact the people are\nsomething deeper than their pleasure habits.</p>\n<h3 id=\"control-of-impulses-leads-to-freedom\">Control of Impulses Leads to Freedom</h3>\n<p>However if one can constrain his impulses, he will be free to truly sit\ndown and deliberate and make free decisions on what is best to do.</p>\n<p>This is where true freedom begins. The concept is totally alien to the\ncoomer, the slave to sin, because he can't even afford the mental space\nto think further than his constant service to sin.</p>\n<p>To him, it is merely &quot;me having fun,&quot; versus &quot;some haters who are\nagainst fun.&quot;</p>\n<h2 id=\"slaves-to-vices-are-slaves-in-general\">Slaves to Vices are Slaves in General</h2>\n\n<figure class=\"titleimg\"><img src=\"https://lukesmith.xyz/pix/fedora_consoomer.jpg\" /></figure>\n\n<p>If you indentify with your impulses, it's very easy to get you\nmotivated to defend them with the same impulsivity if you are told that\nthey are &quot;under attack.&quot; While impulsive people might be hard to be\naround as individuals, they are easy to control as groups and can be\nherded around like unthinking sheep.</p>\n<p>People who are reactive in politics are always the losers, and what is\nan impulsive life but one that is entirely reactive and therefore\ncontrollable?</p>\n<h2 id=\"the-kingly-state\">The Kingly State</h2>\n<p>With the classical understanding of freedom, the goal of social\nconventions, traditional morality and the good government is to increase\ntrue liberty by minimizing one's temptation to vice. People are born\nwith some tendency to vice (original sin to Chrisitians) that can be\neasily made worse. The goal of normal society is to lead people away\nfrom lasciviousness and impulsive behavior. (That is clearly not the\ngoal of the modern West, however.)</p>\n<p>A drug addict is not free. A teenager who gets home from school\neveryday, closes his door and watches internet pornography is not free.\nA person who compulsively checks their social media feed when they wake\nup or are minorly bored is not free. A woman who sleeps around\nthroughout her twenties and is left with nothing is not free. A boy who\nstays up late because he has to &quot;grind&quot; on a video game is not free.</p>\n<p>No one can say that these people truly want what they do: no one <em>fully</em>\nconsents to any impulsive behavior. This is actually why in the Catholic\ntradition, sins of incontinence are not as grave as deliberate sins.\nIt's not a fair game.</p>\n<p>Either way, the goal of the church, or a moral society and moral\ngovernment generally, is to increase freedom by being a countervailing\npower to inborn vices.</p>\n<p>The point of moral instruction is not to restrain man, but to make him\nmore free by eliminating the true causes of his enslavement: his vices,\nhis bad habits, his sexual paraphilias, his gluttony and greed.</p>", "link": "https://lukesmith.xyz/articles/modern-freedom-means-being-a-slave-to-impulses/", "date_published": "2021-05-06 00:00:00+00:00", "persistent": true, "user": null, "language": "en-US"}]