[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To The Last Of Us Part 2’s Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of The Last Of Us Part 2, including the Taurus Model 66 revolver, the Thompson Centre Arms Contender hunting pistol, and the SIG-Sauer MPX silenced submachine gun.\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of The Last Of Us Part 2 and compares them to their real-life counterparts.\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can purchase Jonathan's book here - https://www.headstamppublishing.com/bullpup-rifle-book", "link": "https://www.youtube.com/watch?v=oxmj53Qe_tY", "date_published": "2021-04-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "COD Black Ops Cold War & Warzone - Season Three Battle Pass Trailer", "description": "Unlock all 100 tiers to light up Call of Duty Warzone​ and Black Ops Cold War​ with the Season Three Battle Pass. Available now.", "link": "https://www.youtube.com/watch?v=R5J8ap3O6MU", "date_published": "2021-04-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Judgment: PS5 vs. PS4 Pro Comparison", "description": "Head back into the streets of Kamurocho with this side-by-side comparison of Judgment on PS4 Pro and PS5.\n\nJudgment was originally released for PS4 in 2018 in Japan and 2019 in the West. The game stars Takayuki Yagami, a former lawyer turned private detective who’s hunting down the mystery of multiple Yakuza members getting their eyes gouged out. Judgment is a spin-off of the Yakuza games and has similar beat-em-up combat. But this game also includes detective sequences where you comb through an area to find details that might help your case. \n\nIn this side-by-side video, we've put the original PS4 version (running on PS4 Pro) against the new PS5 version and we show off load times, cutscenes, combat, detective work, tailing people, and a chase sequence. The original PS4 version only ran at 30 frames per second and the new PS5 version goes up to 60 frames per second so you’ll definitely notice one is smoother than the other.\n\nJudgment is now available on PS5, Xbox Series X/S, and Stadia with refined visuals and running at 60fps. RGG Studio, the creators of Yakuza and Judgment, are also teasing a Judgment related announcement on May 7 at 7am PT. A countdown to that can be found here: http://ryu-ga-gotoku.com/20210507/", "link": "https://www.youtube.com/watch?v=H6koX9VFy94", "date_published": "2021-04-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "MLB The Show 21 | PS4 Pro Vs PS5 Graphics and Loading Comparison", "description": "See the \"difference\" between the PS4 Pro and PS5 versions of MLB The Show 21. We take a look at some side by side comparison of gameplay and also compare the load times between the PlayStation 4 Pro and the PlayStation 5. MLB The Show 21 came out 4/20/21 on PlayStation 5, Playstation 4, Xbox Series X, and Xbox One X.", "link": "https://www.youtube.com/watch?v=KHF4Y02mQ-A", "date_published": "2021-04-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Nier (Original) vs Nier Replicant Ver.1.2247 Graphics Comparison", "description": "See the differences in graphics, voice acting, and combat of the original PS3 release of Nier and the remastered Nier Replicant Ver.1.22474487139 for PS4.\n\nThe original Nier released in 2010 on PS3 and Xbox 360, and while it's story is timeless, it's gameplay elements weren't that great. Nier Replicant ver. 1.22, out now for PS4, Xbox One, and PC isn't quite a remake and not quite a remaster, but rather something in between--and it's an astonishing improvement over the original version. This comparison encompasses the PS3 version of the original Nier and the PS4 version of Nier Replicant.\n\nThis upgraded version of Nier Replicant uses a brand-new combat system that plays closer to Nier: Automata with features like new combo mechanics, a revamped magic system, lock-on enemy targeting, smoother player movement, higher resolution, better textures and assets, and a much smoother frame rate. And as you see in this comparison, it stars \"brother Nier\" instead of \"father Nier.\"\n\nIn the video above, you'll see a fight against a floating dictionary in Emil's mansion to obtain some vital information. This should help you get a taste of how these two versions differ. You'll notice that the cutscenes have been recreated one-to-one and preserve the strong overall narrative Nier was always known for, but they look much better with the visual enhancements. If you listen close enough, you may also catch that the voiceovers have been re-recorded by the original cast to give a modern edge to what were already stellar performances.\n\nNier Replicant is out now, and if you're thinking about jumping into this tragic and emotional action-RPG, be sure to check out our full Nier Replicant review and prepare to cry.", "link": "https://www.youtube.com/watch?v=oSla4s7D_KY", "date_published": "2021-04-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]