[{"source": "https://lukesmith.xyz/rss.xml", "title": "Bringing back old-school web pins and buttons", "description": "<p>Back in the not-quite-as-bad-old-days (at least as far back as the\n90's), every good website had a small &quot;ad&quot; gif that fans of the site\ncould use as a colorful link. These are called &quot;buttons&quot; or sometimes\n&quot;pins.&quot;</p>\n<p>You can see sites that collect these internet artifacts (both the good\nones and boring ones)\n<a href=\"https://anlucas.neocities.org/88x31Buttons.html\">here</a> and\n<a href=\"http://cyber.dabamos.de/88x31/\">here</a>.</p>\n<p>Most people would have <strong>dozens</strong> of these at the bottom of their site,\nlinking to all their favorite sites, back when people actually linked to\nthings because search engines hadn't taken over the internet.</p>\n<p>The only rules are:</p>\n<ol>\n<li>It has to be 88 by 31 pixels.</li>\n<li>It has to be a .gif.</li>\n<li>And it <em>should</em> be animated, colorful or memorable (but some people\ndo the gray ones to be ironic or boring).</li>\n</ol>\n<p>Since we're all trying to Reject the Modernity of the current internet,\nI figure I should do my part to bring these back.</p>\n<p>I made a little button for LARBS, which you can see here:</p>\n<p><img alt=\"LARBS\" src=\"https://larbs.xyz/pix/larbs.gif\" /></p>\n<p>Nice, simple, noticeable and memorable. Best of all, at 88x31, it's\nvery small. Adding dozens of these to your site is a great way to link\ncreatively without using more than 90's bandwidth. After I get a good\ncollection of them, I might link my favorite sites with them.</p>\n<p>So I encourage you to make some of these for sites you like. You're\neven welcome to make some for my sites:\n<a href=\"https://landchad.net\">LandChad.net</a>, <a href=\"https://notrelated.xyz\">Not\nRelated</a>, heck, even\n<a href=\"https://based.cooking\">Based.Cooking</a>, or even my personal website for\nthat matter.</p>\n<p>I might talk about these things in a video later because it's one of\nthose aethetical niceities that has been lost to time.</p>\n<p>(PS: GIMP can make gifs, look it up, and remember to &quot;Optimize for\ngifs&quot; after you're almost done to make the filesize super low.)</p>", "link": "https://lukesmith.xyz/updates/bringing-back-oldschool-web-pins-and-buttons/", "date_published": "2021-08-13 00:00:00+00:00", "persistent": false, "user": null, "language": null}]