[{"source": "https://lukesmith.xyz/rss.xml", "title": "Matrix vs. XMPP", "description": "<figure class=\"titleimg\"><img src=\"https://lukesmith.xyz/pix/xmpp.svg\" title=\"The Chad XMPP\" /></figure>\n\n<h2 id=\"what-are-xmpp-and-matrix-and-what-makes-them-special\">What are XMPP and Matrix and what makes them special?</h2>\n<p>XMPP and Matrix are two decentralized and federated free sofware\nprojects for chat, including true end-to-end encrypted chat.</p>\n<p>Users can either install the software on their own server if they want,\nbut they can also easily register on any public server&mdash;both allow any\nXMPP or Matrix user to talk to users on their server or on any other\none. In essence, it works like email: you might have an email account on\na different site than your friend, but all accounts on all sites can\ncommunicate.</p>\n<p>In a world where most communication is done on centralized proprietary\nplatforms without end-to-end encryption like Facebook, Telegram and\nGoogle, Matrix and XMPP both are permanent solutions to communication\nprivacy. Even based boomerware like IRC has to play second fiddle to\nthem.</p>\n<p>The only question is, &quot;Which is better? XMPP or Matrix?&quot;</p>\n<h2 id=\"matrix-vs-xmpp-which-is-better\">Matrix vs. XMPP: Which is better?</h2>\n<p>After timely research and experience, I will say that XMPP is superior\nto Matrix. I'll talk about why here, but I'll firstly discuss\nMatrix's apparent advantages over XMPP.</p>\n<p>There are some use-cases where Matrix is preferrable to use and Matrix\nis somewhat easier for normal people to start using. However, Matrix,\nalthough it is still end-to-end encrypted has larger metadata\nliabilities. Although Matrix is decentralized, there are many issues\nthat make it too reliant on the &quot;main&quot; Matrix.org server. It also has\nmore significant problems in that metadata is spread from server to\nserver.</p>\n<h3 id=\"matrixs-advantages-over-xmpp\">Matrix's advantages over XMPP</h3>\n<h4 id=\"matrix-is-more-normie-friendly\">Matrix is more normie friendly.</h4>\n<p>Although there are <a href=\"https://matrix.org/clients/\">many Matrix clients out\nthere</a>, there is one &quot;primary&quot; one,\nElement (formerly called Riot). Element is a lot more streamlined and\neasier to use than most all other clients, and it is available on all\nplatforms. This is because it is an odious Electron-based application,\nbut that it is a big advantage to be able to tell your friends just\nabout one program they can use on all platforms.</p>\n<h4 id=\"matrix-now-comes-end-to-end-encrypted-by-default\">Matrix now comes End-to-end encrypted by default.</h4>\n<p>The standard Matrix-Synapse server now encrypts all chats and private\nrooms with end-to-end encryption by default. This is not the case for\nmost XMPP servers. For example, OMEMO encryption can be used with XMPP\nservers, but it usually requires extra setting up and many XMPP clients\ndo not have proper or easy compatibility with default End-to-end\nencryption (you may have to manually select to encrypt communications\nfor each chat).</p>\n<h4 id=\"matrixs-default-functionality-is-more-intuitive\">Matrix's default functionality is more &quot;intuitive.&quot;</h4>\n<p>If someone sends you a message, you expect it to show up on all your\ndevices, not just the one that checks first. When you install a new\napplication on your phone, you sort of expect it to be able to view\nprevious conversations in the chat. XMPP does not necessarily work like\nthis by default (I should say that some XMPP servers do allow this), but\nin general Matrix chats are really more like entire chat histories that\nmultiple people can edit and sync.</p>\n<p>This makes Matrix a lot more familiar in functionality to old AOL/Google\nchats, or things like Discord or Telegram, which people are used to and\nfind convenient. XMPP can indeed do all this, but it requires more\nsetting up, and you are more likely to run into unexpected things when\nsetting it up yourself.</p>\n<h3 id=\"xmpps-advantages-over-matrix\">XMPP's advantages over Matrix</h3>\n<p>But all that said, as I said above, XMPP is better than Matrix.</p>\n<h4 id=\"xmpp-servers-are-easier-to-manage-than-matrix\">XMPP servers are easier to manage than Matrix.</h4>\n<p>The default Matrix server software is atrocious. Trying to do something\n&quot;simple&quot; like deleting a user account from the command line is\nfrustration. You might have to open up databases yourself and do it\nmanually. There is a distinct lack of configuration options in Matrix\ncompared to XMPP servers and XMPP server usually have a good\ncommand-line interface to do basic things.</p>\n<h4 id=\"xmpp-is-lightweight-matrix-is-big-bloatware\">XMPP is lightweight. Matrix is big bloatware.</h4>\n<p>I just logged into a VPS where I host both a Matrix and an XMPP server.\nIt has about 1G of RAM. Right now, <strong>27.7% of my memory is hogged by the\nMatrix server</strong>, while <strong>the XMPP server is only using 1.4%</strong>. That\nmakes Matrix a major resource hog, while XMPP is the kind of thing you\ncan spin up on your already-existing VPS and not really have to worry\nabout it.</p>\n<p>This is no big surprise because the default Matrix server is soyware\nwritten in Python. While the Matrix team is allegedly working on a\nbetter non-Python server-side, XMPP already has <a href=\"https://xmpp.org/software/servers.html\">many different kinds of\nserver software to choose from</a>,\nsome of the more popular ones being\n<a href=\"https://docs.ejabberd.im/admin/installation/\">ejabberd</a> and <a href=\"https://prosody.im/\">Prosody\nIM</a>.</p>\n<h4 id=\"matrix-is-less-decentralized\">Matrix is less decentralized.</h4>\n<p>This might be somewhat related to the above issue, but very few people\nactually run their own Matrix servers and instead, just use Matrix.org,\nwhich is the Matrix server of the official company. This means that\npolicies and blocks issued by Matrix the organization can functionally\ndisconnect who they want from most Matrix users.</p>\n<p>Additionally, the default settings in the Matrix server configuration\nuse matrix.org and vector.im. These sites thus get a lot of independent\nmetadata from other unsuspecting instances.</p>\n<h4 id=\"matrix-is-a-metadata-disaster\">Matrix is a metadata disaster.</h4>\n<p>It gets worse. Because Matrix doesn't really just exchange individual\nmessages, but because it syncs entire chats to all involved servers,\nthis means that while all messages might be end-to-end encrypted, the\nconversation metadata is known to all servers, including what accounts\nare involved, when messages are sent and other account information made\npublic (for example, users can add their emails and phone numbers to\ntheir accounts). <a href=\"https://gist.github.com/maxidorius/5736fd09c9194b7a6dc03b6b8d7220d0\">See more\nhere.</a></p>\n<p>That means that all Matrix servers, <em>especially</em> Matrix.org, has a huge\nrepository of metadata. Although chats are thankfully encrypted,\nencrypted chat logs are synced between all relevant servers, spreading\nmetadata far and wide, and nearly always back to Matrix.org.</p>\n<p>Privacy with Matrix <a href=\"https://www.matrix.org/blog/2019/09/27/privacy-improvements-in-synapse-1-4-and-riot-1-4\">used to be even\nworse</a>.\nPasswords used to be verified on a centralized identity server, and much\nmore.</p>\n<p>You're probably wondering how any of this could get any worse...</p>\n<p>   </p>\n<p>...</p>\n<p>   </p>\n<p>Take a guess...</p>\n<p>   </p>\n<p>...</p>\n<p>   </p>\n<h4 id=\"-matrix-is-linked-to-israeli-intelligence-\">🇮🇱 Matrix is linked to Israeli intelligence! 🇮🇱</h4>\n<p>Matrix was developed and funded by a company Amdocs. Amdocs is an\nIsraeli company that has since moved to America and has near total\nknowledge of American telephone communications.</p>\n<p>You can read about the fun history of Amdocs\n<a href=\"https://www.counterpunch.org/2008/09/27/an-israeli-trojan-horse/\">here</a>.\nMore about Matrix and Amdocs\n<a href=\"https://web.archive.org/web/20201219014215/https://samba.noblogs.org/post/2018/08/27/matrix-org-a-federated-app-funded-by-a-mossad-company/\">here</a>.</p>\n<p>Since American telephone records have &quot;mysteriously&quot; fallen into the\nhands of Israel, there are many questions as how this has happened.\nPerhaps this Israeli company which has had many Israeli military and\nintelligence officers involved with it and which also has all American\ntelephone records might be involved?</p>\n<p>Actually, this is just like Matrix. Amdocs does not have access to\ntelephone audio (so far as I know), they only traffic in metadata (when\ncalls are made and between whom). Matrix functions the same way. Chats\nare <em>at least</em> end-to-end encrypted (which still puts this Israeli\nhoneypot lightyears ahead of proprietary spyware like Telegram), but\nMatrix metadata is easily available to server administrators.</p>\n<p>Now to be clear, formally, <a href=\"https://web.archive.org/web/20201104154843/https://github.com/matrix-org/matrix-doc/issues/979\">since\n2017</a>,\nAmdocs no longer is the open sponsor of Matrix. It is instead funded by\na break-off organization called Vector. But Matrix/Vector has somehow\nremained very, very well-funded for a &quot;community-driven&quot; project:\n<a href=\"https://www.matrix.org/blog/2019/10/10/new-vector-raises-8-5-m-to-accelerate-matrix-riot-modular\">they raised $8.5\nmillion</a>,\nthat's a lot for free stuff! Crowd-funding for relatively unknown open\nsource software projects is apparently much more lucrative than I\nthought!</p>\n<p>(Of course, we all know that this is a baseless and widely deboonkted\nanti-semitic conspiracy theory as Our Greatest Ally^®️^ Israel would\nnever do <a href=\"https://www.whatreallyhappened.com/WRHARTICLES/ussliberty.html\">anything\nbad</a> <a href=\"https://dancingisraelis.com/\">to\nus at all</a>.)</p>\n<h2 id=\"in-conclusion\">In conclusion</h2>\n<p>Matrix is federated and free software which is end-to-end encrypted, but\nit's bloated and the company behind it might be a privacy danger. Using\nMatrix is indisputably better than using Telegram or Google or Facebook\non nearly every count, but XMPP outclasses Matrix on pretty much\neverything.</p>\n<p>XMPP is minimal software that is easy to run on a small server. It\nrequires more setup time and has the Linux-like &quot;problem&quot; of there\nbeing a lot of &quot;fragmentation&quot; (i.e. choices), but XMPP is a much\nbetter long-term tool despite the fact that it might require you to set\na couple more settings to get it how you want. XMPP is also more\nscalable and customizeable.</p>\n<p>I do run a Matrix server because I had to move some Telegram-using\nfriends to something better and I was worried that the world of XMPP\nmight be a little much. Retrospectively, I think I could've just\nswitched them to XMPP, and I might still in the future, but Matrix is\nsimpler for people to grasp and install if they don't know too much\nabout computers.</p>\n<h3 id=\"how-the-xmpp-environment-can-be-improved\">How the XMPP environment can be improved</h3>\n<p>It would be very nice to have a cross-platform XMPP chat platform.\nObviously I don't want Electron trash like Matrix's Element (although\nElement is intuitive enough), but when I say cross-platform, that might\njust be several different XMPP clients (one Linux, one Android, one iOS,\netc.) that decide to go for similar design principles and branding. This\nmight sound stupid, but it makes the environment accessible to people\nunfamiliar with it because they know that one program (or &quot;branding&quot;)\nthey can look up and recomend friends.</p>\n<h3 id=\"other-note\">Other note</h3>\n<p>I suspect some people will be a little upset I &quot;only&quot; talked about\nMatrix and XMPP as chat protocols. In reality, both are highly\nextensible and can to many more things. I'll talk about that when I\nfeel it's relevant, but most people looking into them are looking for\nan actually secure chat system.</p>", "link": "https://lukesmith.xyz/articles/matrix-vs-xmpp/", "date_published": "2021-06-26 00:00:00+00:00", "persistent": false, "user": null, "language": null}]