[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCAKcSON6PSG_JkTbXh2WdIg", "title": "Lord Huron - three songs at The Current (2015; 2018)", "description": "On May 21, 2021, Lord Huron released \"Long Lost,\" their fourth full-length album. In recognition of that, here are three performances by Lord Huron recorded in The Current studio in 2015 and in 2018.\n\nSONGS PERFORMED\n0:00 \"The World Ender\" (2015)\n4:00 \"When The Night Is Over\" (2018)\n9:07 \"Wait By The River\" (2018)\n\nPERSONNEL\nBen Schneider – guitar, vocals\nMark Barry – percussion\nMisty Boyce – keys, vocals (2018 only)\nMiguel Briseño – bass\nBrett Farkas – guitar (2015 only)\nTom Renaud – guitar\nBrandon Walters – guitar (2018 only)\n\nCREDITS\nVideo & Photo: Nate Ryan\nAudio: Michael DeMark; Brandon Smith\nProduction: Derrick Stevens; Lindsay Kimball\n\nFIND MORE:\n2015 studio session: https://www.thecurrent.org/feature/2015/04/27/lord-huron-perform-in-the-current-studio\n2018 studio session: https://www.thecurrent.org/feature/2018/04/24/lord-huron-perform-in-the-current-studio\n\nSubscribe to our channel:\nhttp://www.youtube.com/user/893TheCurrent?sub_confirmation=1\nLike/Follow:\nhttps://www.facebook.com/TheCurrent/\nhttps://twitter.com/TheCurrent\nhttps://www.instagram.com/thecurrent/\n\n#lordhuron", "link": "https://www.youtube.com/watch?v=A4-vJm6MoNs", "date_published": "2021-05-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCAKcSON6PSG_JkTbXh2WdIg", "title": "Rock the Cradle Play Along: Episode 2", "description": "In episode two of Rock the Cradle Play Along, Gaby Moreno delights us with a couple of Spanish children's songs. We continue our breakdancing lessons with House of Dance. MacPhail Center for Music's Adam Marshall (of the Bazillions) teaches us how to make a paper fan. Then we put that fan to use when we dance along with Zorongo Flamenco and the Minneapolis institute of Art. We also get silly at a Cat Party with Koo Koo Kanga Roo! Watch the video in the window above.\n\nEPISODE 2 CONTENTS\nIntro with Maddie 00:00\nGaby Moreno, \"La Rana Debajo del Agua\" 01:04\nHouse of Dance: Break Dancing Lesson 05:19\nKoo Koo Kanga Roo, \"Cat Party\" 09:14\nPaper Fan Project with Adam Marshall 12:56\nLittle Moments Count: Sing to Your Baby 15:56\nMIA and Zorongo Flamenco: Flamenco Dance Lesson 16:50\nGaby Moreno, \"Arroró Mi Niño\" 23:17\n\nBig thanks to our Rock the Cradle Play Along sponsors: Minneapolis Institute of Art, Bell Museum, Pizza Lucé, Little Moments Count, MacPhail Center for Music, Sala Architects and Park Dental. Enjoy these special offers from our sponsors: https://files.apmcdn.org/production/44a599df4cf8938bde128245edfa495c.pdf\n\nYou can also find this on our website: https://www.thecurrent.org/feature/2021/05/15/rock-the-cradle-2021-a-saturday-morning-video-series\n\nABOUT THE PERFORMERS\n\nGaby Moreno — Born and raised in Guatemala, the Los Angeles-based singer, songwriter and producer Gaby Moreno received a Latin Grammy for Best New Artist in 2013. Her album Ilusión was nominated for a Grammy for Best Latin Pop Album. She also co-wrote the theme song for NBC's hit television show Parks and Recreation. Armed with a warm, soulful sound, Moreno creates music that offers an intoxicating invitation into her musical world for English and Spanish speakers alike. She is preparing to release a new album later this year. \n\nHouse of Dance Twin Cities — Established in 2014, House of Dance Twin Cities is Minnesota's first and premier dance studio dedicated to teaching breakdancing, popping & locking and hip hop dance classes to people of all ages and experience levels. The instructors humbly maintain that they are students themselves, dedicated to improving their dance so that they can share more with others. They take their art and their jobs very seriously and appreciate everyone who entrusts their learning with them.\n\nKoo Koo Kanga Roo — Koo Koo Kanga Roo is a dance party of the senses. For the last 12 years, lifelong friends and collaborators Bryan and Neil have toured the globe delighting fans with their high-energy music, infectious positivity, and interactive live show. Of course, the global pandemic of 2020 threatened to put an end to the carefree fun that had come to define the band, but instead of putting the group on pause or looking for office jobs, Bryan and Neil doubled down and created their most triumphant and expansive album yet.\n\nSubscribe to our channel:\nhttp://www.youtube.com/user/893TheCurrent?sub_confirmation=1\nLike/Follow:\nhttps://www.facebook.com/TheCurrent/\nhttps://twitter.com/TheCurrent\nhttps://www.instagram.com/thecurrent/\n\n#thecurrent #rockthecradle", "link": "https://www.youtube.com/watch?v=dm0aG-YilBA", "date_published": "2021-05-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCAKcSON6PSG_JkTbXh2WdIg", "title": "Sounds Like Home IX – virtual music festival from The Current", "description": "On Saturday, May 22, The Current is hosting round nine of Sounds Like Home. Join an incredible lineup of Minnesota musicians as we meet up on the internet for a virtual festival. Great music lives here, and you can still enjoy it live right here on The Current’s YouTube channel!\n\nABOUT THE ARTISTS\n\nBrianna Kočka — You know the kind of grief that confines you to bed? The kind that dulls your whole life for a while? Brianna Kočka has been through that. Over the last few years, the Zoo Animal guitarist has lost a marriage, a boyfriend, and her faith. Throughout the pandemic, she says she has been \"learning how to put it all back together again.\" Kočka’s upcoming EP Let It Stay, which comes out on May 14, is a warm, crisp collection of jazz-influenced folk songs.\n\nKing Pari — Cameron Kinghorn and Joe Paris Christensen weren’t setting out to start another project. Kinghorn, frontman of R&B act Nooky Jones, and Christensen, guitarist for the funk band PHO, stumbled into the project after a text exchange. A feverish burst of creative energy kicked off by a beat sent over by Christensen, and King Pari was brought into existence. Eschewing perfection and embracing the squiggly edges of lo-fi production, the duo bring in sounds of funk, '80s electro, and R&B for a dose of \"stonersoul\" that pairs well with a sunny afternoon sitting by the pool.\n\nStrange Relations — \"There’s nothing more punk than a heartfelt ballad,\" write the duo behind \nStrange Relations. After meeting in college in Philadelphia, Casey Sowa and Maro Helgeson moved to Minneapolis and started their band. When you listen, don’t expect a whole lot of cushion — this is a bass and drums operation, no guitar in sight. Do expect to be reminded of the Yeah Yeah Yeahs, Sparks, and maybe even Björk.\n\nLow Rats — Formed in Minneapolis in early 2019, Low Rats are a garage-punk rock-and-roll group with a landlocked surf rock undercurrent. The tunes are steeped in Nuggets, and their roots are planted in 80s punk. Low Rats' latest album, Year of the Rat MMXX, dropped in December of 2020 and shows the band successfully resisting the slowdown of quarantin — full of energetic and scuzzy shredding — a much needed reminder of the rowdy in-person shows that will soon return.\n\nTufawon — pronounced like \"two for one\" in reference to the artist’s Dakota and Boricua roots — is a hip-hop artist, producer, and activist from South Minneapolis. With plans to release a track every week in 2021, Tufawon's ever-growing catalog pulls from his experiences growing up in Minnesota. His socially conscious lyrics connect deeply with his time as an activist: \"Wherever you find resistance, you're more than likely going to find hip-hop,\" Tufawon explained in a 2017 interview with The Current. \"Hip-hop goes hand in hand with resistance.\"\n\nThank you to Gardner Builders for its support of Sounds Like Home IX.\n\nSubscribe to our channel:\nhttp://www.youtube.com/user/893TheCurrent?sub_confirmation=1\nLike/Follow:\nhttps://www.facebook.com/TheCurrent/\nhttps://twitter.com/TheCurrent\nhttps://www.instagram.com/thecurrent/\n\n#thecurrent #soundslikehome", "link": "https://www.youtube.com/watch?v=qLbuetlYMRw", "date_published": "2021-05-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]