[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3I2GFN_F8WudD_2jUZbojA", "title": "El Sonido 10th Anniversary Special", "description": "http://KEXP.ORG is excited to present the El Sonido 10th Anniversary Special! DJ Chilly and Albina will share memories of past in-studio sessions, 13 brand new performances, hellos from artists that have been a part of El Sonido over the years and  exclusive conversations with influential musicians and key figures of music en español – all joined together by a shared passion for Latin music and the community that has powered El Sonido for 10 years.\n\nThanks to everyone who made these sessions possible in each of the more than 10 countries.\n\nMula: Agencia Creativa Conuco, El Nido Lab, Costa Futuro, Schubert Music, Raúl Fernández, Zobeida Cruz, Charco Música, Contrapedal Música\n\nFrancisca Valenzuela: Alejandra Villalba García, Francisco Sánchez de la Vega, Alejandra Villalba García, Sofía Cravioto\n\nJaviera Mena:  Festival Centro\n\nJuan Wauters: Juan Wauters y Gustavo Miguez\n\nLos Blenders: Alejandra Villalba García, Francisco Sánchez de la Vega, Sofía Cravioto\n\nHidrogenesse: Hidrogenesse:  Austrohúngaro, Stanley Sunday\n\nBarbi Recanati: Lux Raptos, Juan Manuel Segovia, Tomas Molina Lera, Marilina Bertoldi, Florencia Vaccaro, Tota Romero, Estudio Atomo, Agustina Ruiz Teira\n\nTriángulo de Amor Bizarro: Mushroom Pillow, La Fábrica de Chocolate, Vigo, Aleuto S.L., Carolos Hernández Nombela\n\nLuisa Almaguer: Julián, Rocko\n\nAsimov: Orbital Studio, Luis Alonso (Durísimo Producciones), Phantom Records, Vini Wunderlich\n\nATALHOS: Brain Productions, Delfina Campos, Artsy Club Studio, José TM, Daniel Barosa, Gustavo Vargas, Tata Leon, Rollinos, Vans Brasil and Rock City Agencia\n\nYanna: Esteban Marchand, Jess and Ágatha, Trinidad, Javi, Ar13$\n\nTres Leches + Terror Cactus: Mark Mirabile, Ryan Purcell, Paul Breslin, David Salonen, Alaia D'Alessandro\n\n\nhttp://kexp.org", "link": "https://www.youtube.com/watch?v=xwF8ClQXHA0", "date_published": "2021-05-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3I2GFN_F8WudD_2jUZbojA", "title": "Lea Porcelain - Full Performance (Live on KEXP at Home)", "description": "http://KEXP.ORG presents Lea Porcelain performing live, recorded exclusively for KEXP.\n\nSongs:\n100 Years\nBones\nOhio\nPool Song\nI Am Ok\n\nSession recorded at Funkhaus Berlin\nDOP & Director: Manuel Ruge & Annemarie Falk\nCameras: Leyla Hoppe, Marcel Riedel, Max Hartmann\nAdditional Musician (Guitar): Philipp Koch \nStyling: Sara El Hailouli\n\nhttps://www.leaporcelain.com\nhttps://www.funkhaus-berlin.net\nhttp://kexp.org", "link": "https://www.youtube.com/watch?v=uaalXfERB5c", "date_published": "2021-05-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]