[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "C. Tangana: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nAnamaria Sayre | April 20, 2021\nC. Tangana's extended family basking in the warmth of sobremesa with easy smiles and effortless baile looks otherworldly after more than 13 months amid a global pandemic. But considering the Spanish rapper's past year back home in Madrid, the simplicity feels fiercely authentic. (Check his mama and tía vibing in the corner.)\n\nThis first live performance of his latest album, El Madrileño (including a global premiere of a fresh single, \"Me Maten\") buzzes with communal energy, spotlighting talent from across Latin landscapes. From Mexican Regional to Spanish flamenco, C. Tangana is simultaneously coming home and reaching out to bridge Latin music boundaries. He's building a community of cross-cultural collaboration, rooted in a unifying love of language and tradition, making it clear he's intent on giving everyone a seat at the table.\n\nThe entirety of the show, from impromptu harmony to string octet, hums along with a distinctly Spanish cadence, paying homage to the flamenco-infused streets the global superstar came up in. The concert's star-studded cast of Spanish collaborators, including long-time friends (producers Alizzz and Victor Martínez) and new contributors (rumba legend Kiko Veneno and flamenco-pop icon La Húngara), are each spotlighted for their contributions to the record.\n\nAll these parts compound in a room full of people with a shared desire to connect and create juntos, manifesting an authentic joy we've seen again and again at the real Tiny Desk. And at the helm is C. Tangana, humming a melody and bringing the room to life: hands, harmonies, heartbeats, perfectly in sync.\n\nSET LIST\nC. Tangana and Antonio Carmona, \"Me Maten\"\nC. Tangana and Kiko Veneno, \"Los Tontos\"\nC. Tangana, \"Demasiadas Mujeres\" (contains replayed elements of “Campanera”)\nC. Tangana, La Húngara and Niño De Elche, \"Tú Me Dejaste De Querer\"\n\nMUSICIANS\nC. Tangana: vocals\nAlizzz: vocoder, keys\nVictor Martínez : guitar, percussion\nAntonio Carmona: vocals, percussion\nKiko Veneno: vocals, guitar\nLa Hungara: vocals\nNiño De Elche: vocals, guitar\nJuan Carmona: guitar\nHuberto Morales: percussion\nLucia Fernada Carmona: vocals\nPilar Cerezo: vocals\nMarina Carmona: vocals\nÁfrica Heredia: vocals\nMaría Rubio: vocals\nMariola Orellana: vocals\nPatri Alfaro: vocals\nMari Estrada: vocals\n\nSTRING OCTET\nPablo Quintanilla\nPaula Sanz\nFranciso Palazón\nMarina Arrufat\nPaloma Cueto-Felgueroso\nAdrián Vázquez\nIrma Bau\nDaniel Acebes\n\nCREDITS\nVideo: Little Spain, Santos Bacana, Maria Rubio, Cris Trenas\nAudio: Jorge Rodriguez, Sergio Jiménez, Pablo Kohler, Harto Rodriguez, El Madrileño, Alex Cappa\nDirector of Photography: Nauzet Gaspar\nArt Director: Mariola Viejo\nCostume Designer: Alex Turrión\nHair and Makeup: Miky Vallés\n1st AD: Joel Marquez\nEditor: Maia de Zan Hatch\nColor: Marti Somoza\nProduction Manager: Yago López Abril\nRecording Engineers: Jorge Rodriguez, Sergio Jiménez, Pablo Kohler\nMixed: Harto Rodriguez, El Madrileño at Metropol Studios\nMastering Engineer: Alex Cappa at Metropol Studios\n\nTINY DESK TEAM\nProducer: Bobby Carter\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nTiny Production Team: Kara Frame, Bob Boilen\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann\n\n#ctangana #tinydesk #nprmusic", "link": "https://www.youtube.com/watch?v=SW6L_lTrIFg", "date_published": "2021-04-20 00:00:00+00:00", "persistent": false, "user": "rumpel", "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Rina Sawayama: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nAlex Ramos | April 19, 2021\nAs usual, Rina Sawayama is one step ahead of us. She's back in the office, clad in a periwinkle blazer with waist cut-outs and a high ponytail cleaner than the view of the city skyline. Make no mistake: even in fluorescent lighting, the Japanese British pop star performs with the same tenacity and drama you hear in her 2020 debut album, SAWAYAMA, a lustrous pop epic peppered with early aughts R&B, nu-metal and classic rock.\n\nUnable to tour because of the pandemic, the artist has been holding onto these songs for the last year. Sawayama's Tiny Desk (home) concert successfully reminds us — in just three tracks — of her range and versatility as both artist and performer. Tears calcify in \"Dynasty,\" a song like a salve to wounds inherited from generations past. The heaviness of the music never overshadows her voice, which ascends heroically. \"Won't you break the chain with me?\" she belts out.\n\nAs if turning the other cheek, Sawayama swiftly moves into the sweet, cha-ching pop of \"XS,\" and later the soft-hearted ballad \"Chosen Family,\" rendered in the style of her 2021 collaboration with Elton John. The song was reborn, in part, because of John's admiration for Sawayama and her ability to cross-pollinate genres, but also because the two held \"Chosen Family,\" both the song and concept, dearly. Funny enough, the song's thesis — \"I chose you / You chose me\" — reflects their meeting, too.\n\nSET LIST\n\"Dynasty\"\n\"XS\"\n\"Chosen Family\"\n\nMUSICIANS\nRina Sawayama: vocals\nVic Jamieson: guitar\nSimone Odaranile: drums\nGeordan Reid-Campbell: keys\nPhebe Edwards: vocals\nDesrinea Ramus: vocals\nBraimah Kanneh-Mason: violin\nAyla Sahin: violin\nDidier Osindero: viola\nJonah Spindel: cello\n\nCREDITS\nVideo: Chester Lockhart, Thomas Davis\nAudio: Jon Gilmore, Ted Jensen\n\nTINY DESK TEAM\nProducers: Bob Boilen\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Kara Frame, Bob Boilen\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann\n\n#rinasawayama #tinydesk #nprmusic", "link": "https://www.youtube.com/watch?v=85_uFm1R5TA", "date_published": "2021-04-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]