[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "GNOME redesign, Manjaro Cinnamon goes Vivaldi, and Steam Deck hype deflation - Linux news", "description": "Subscribe to CentOS 8 Extended Lifecycle Support by TuxCare: https://tuxcare.com/extended-lifecycle-support/centos-8-extended-support/?utm_campaign=TC%20-%20ELS%20-%20CENTOS%208%20-%20TLE%20-%20September&utm_source=youtube\n\n\nGet your Linux desktop or laptop here: https://slimbook.es/en/\n\n\n\nThis time, we have GNOME showing off multiple parts of their ongoing redesign process, Manjaro cinnamon moving to Vivaldi as its default browser, and Vavle trying to lower expectations about the Steam Deck's game compatibility situation\n\n\n\n\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nJoin us on our new Discord server: https://discord.gg/xK7ukavWmQ\nTwitter : http://twitter.com/thelinuxEXP\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\nFollow me on ODYSEE: https://odysee.com/@TheLinuxExperiment:e\nOr join ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\n\n00:00 Intro\n01:22 Linux News\n05:36 Hardware News\n07:17 Applications News\n08:45 Gaming News\n09:11 Privacy News\n\n## Linux\nGNOME 41 is almost upon us, and the software app is getting a nice redesign, especially on the Applications pages. \nhttps://blogs.gnome.org/tbernard/2021/09/07/ready-for-software-41/\n\nManjaro Cinnamon edition decided to replace the Firefox browser with Vivaldi, as their default choice.\nhttps://vivaldi.com/blog/vivaldi-is-the-default-browser-on-manjaro-linux/\n\n\nLinus Torvalds has agreed to add the NTFS driver inside of the next release of the linux kernel, version 5.15. \nhttps://www.zdnet.com/article/linux-boosts-microsoft-ntfs-support-as-linus-torvalds-complains-about-github-merges/\n\nA new malware seems to be targeting Linux hosts: the ChaChi remote access trojan virus is written in Golang, and tied to a specific ransomware gang.\nhttps://siliconangle.com/2021/09/09/new-chachi-malware-variant-designed-target-linux-systems/\n\nGNOME team member Alexander Mikhaylenko detailed the changes coming to Adwaita, especially regarding the appearance of buttons.\nhttps://blogs.gnome.org/alexm/2021/09/10/cleaning-up-header-bars/\n\nTuxedo Computers is the latest KDE Patron, joining the likes of The Qt Company, SUSE, Google, Blue Systems, Canonical, Enioka, Slimbook or Pine64. \nhttps://dot.kde.org/2021/09/14/tuxedo-computers-becomes-newest-kde-patron\n\n## Hardware\n\nThe framework laptop has started shipping in batches, and it seems that it's a popular device to run Linux on! \nhttps://www.gamingonlinux.com/2021/09/linux-on-the-framework-diy-laptop-has-been-very-popular\n\nValve spoke a little bit more about the Steam Deck, to clarify the situation on supporting the whole Steam library. As expected, they're deflating expectations a bit, saying that they do intend the Steam Deck to be able to run all steam games hardware wise, but that Proton might not bring 100% game compatibility.\nhttps://www.gamingonlinux.com/2021/09/clearing-up-what-games-will-and-wont-run-on-the-steam-deck\n\n##  Apps\nThe Heroic Games Launcher got a new release, that's considered essential for its users.\nhttps://www.gamingonlinux.com/2021/09/heroic-games-launcher-for-the-epic-store-on-linux-gets-some-essential-fixes\n\nFirefox 92 was released. It's a pretty minor update, with more ways to upgrade the connection to HTTPS, and support for full range color levels for video playback. It also brings the rest of the browser in line with their \"Proton\" redesign, notably the bookmarks toolbar and the overflow menu.\nhttps://www.mozilla.org/en-US/firefox/92.0/releasenotes/\n\n## Gaming\nWine 6.17 was released.\nhttps://www.winehq.org/announce/6.17\n\n\n## Privacy\nFirefox is trying to expand their revenue sources, and this includes their VPN, which was audited and found pretty vulnerable by an independent company called Cure53.\nhttps://blog.mozilla.org/en/mozilla/news/mozilla-vpn-completes-independent-security-audit-by-cure53/\n\nProton Mail, which bases a lot of their marketing on privacy, got under fire for complying with Swiss law, and logging the IP address of an environmental activist.\nhttps://thenextweb.com/news/protonmail-french-activist-email-service", "link": "https://www.youtube.com/watch?v=cxpCVeoaduw", "date_published": "2021-09-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]