[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "J Balvin: Tiny Desk (Home) Concert", "description": "From Sept. 15 through Oct. 15, Tiny Desk is celebrating Hispanic Heritage Month with an \"El Tiny\" takeover of the (home) concert series, featuring J Balvin, Camila Cabello and several more musicians from all corners of Latinidad. \n\nReanna Cruz | September 16, 2021\nA tattooed hand scrawls on a small school desk — \"Jose by J Balvin\" — followed by a signature smile. It's an intimate beginning for the príncipe del reggaetón, J Balvin himself, as he begins his \"El Tiny\" performance on a sunny barge in the middle of the East River. Backed by the Brooklyn Bridge, Balvin breezes through some of the best cuts off of his new album JOSE (Balvin's birth name). The first three — \"Vestido,\" \"Que Locura\" and \"OTRO FILI\" — are moody and gentle popetón, creating expectations of familiar intimacy before he blows the performance wide open with the Tainy-produced, tempo-shifting album opener, \"F40.\" And as the sun descends on the New York skyline, Balvin closes it out with a drop-laden extended mix of the jock-jam Skrillex collaboration, \"In Da Getto.\"\n\nTo talk about modern Latin music is to talk about J Balvin. Over the course of the past 10 years, \"the boy from Medellín\" has risen from humble beginnings in Colombia to global superstardom, building an unprecedented fanbase at the intersection of pop, reggaetón, house and hip-hop, with over 18 billion views and 35 million record sales to prove it. He is the first Latino to headline Coachella and Lollapalooza, and there isn't a more fitting artist to kick off our month of \"El Tiny\" performances — Balvin is the epitome of cross-cultural success.\n\nWhen a drone flies out during the last drop of \"In Da Getto,\" and we finally see the true scope of the barge that Balvin has been performing on, it serves as a reminder that no matter how personal his songs may be, Balvin will always, always, be massive.\n\nSET LIST\n\"Vestido\"\n\"Que Locura\"\n\"OTRO FILI\"\n\"F40\"\n\"In Da Getto\"\n\nMUSICIANS\nJ Balvin: vocals\nJose Rivera: DJ\nGeorge Ponce: bass, keys\nMarcus Thomas: drums\n\nCREDITS\nVideo: Jose-Emilio Sagaró Anca Valeanu Omar Reynoso Christopher Cabrera\nAudio: John Buitrago Fernando Argento Hugo Pinzon John Cardona\nProduction Company: Filmheads\nAssistant Director: Iohana Sagaro\nDirector of Photography: Kristoff Cabrera\nProduction Manager: Alejandro (ADO) Arias\nFront of House: John Buitrago\n\nTINY DESK TEAM\nProducers: Bobby Carter, Anamaria Sayre\nVideo Producer: Kara Frame\nAudio Mastering: Josh Rogosin\nAlt.Latino 'El Tiny' Team: Felix Contreras, Reanna Cruz, Anaïs Laurent, Stefanie Fernandez\nTiny Production Team: Bob Boilen, Maia Stern, Sofie Hernandez-Simeonidis\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #jbalvin", "link": "https://www.youtube.com/watch?v=coMyNfnNBs4", "date_published": "2021-09-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]