[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Ivermectin in Australia", "description": "New restrictions on prescribing ivermectin for COVID-19\nhttps://www.tga.gov.au/media-release/new-restrictions-prescribing-ivermectin-covid-19\n(10 September 2021)\n\nTGA, acting on the advice of the Advisory Committee for Medicines Scheduling\n\nplaced new restrictions on the prescribing of oral ivermectin. \n\nGeneral practitioners are now only able to prescribe ivermectin for TGA-approved conditions - scabies and certain parasitic infections\n\nCertain specialists will be permitted to prescribe ivermectin for other unapproved indications if they believe it is appropriate for a particular patient\n\nIvermectin is not approved for use in COVID-19 in Australia\n\ncurrently strongly discouraged by the National COVID Clinical Evidence Taskforce, the World Health Organisation and the US Food and Drug Administration\n\nhttps://www.covid19treatmentguidelines.nih.gov/therapies/antiviral-therapy/ivermectin/\n\nRecommendation\n\nThere is insufficient evidence for the COVID-19 Treatment Guidelines Panel (the Panel) to recommend either for or against the use of ivermectin for the treatment of COVID-19. \n\nFirstly\n\nthere are a number of significant public health risks associated with taking ivermectin in an attempt to prevent COVID-19 infection rather than getting vaccinated\n\nIndividuals who believe that they are protected from infection by taking ivermectin may choose not to get tested or to seek medical care if they experience symptoms. \n\nDoing so has the potential to spread the risk of COVID-19 infection throughout the community.\n\nSecondly\n\nthe doses of ivermectin that are being advocated for use in unreliable social media posts and other sources for COVID-19 are significantly higher than those approved and found safe for scabies or parasite treatment. \n\nThese higher doses can be associated with serious adverse effects, including severe nausea, vomiting, dizziness, neurological effects such as dizziness, seizures and coma.\n\nhttps://bnf.nice.org.uk/drug/ivermectin.html\n\nhttps://shop.amh.net.au/products/digital\n\nhttps://www.tga.gov.au/sites/default/files/auspar-ivermectin-131030-pi.pdf\n\nBMJ\n\nhttps://bestpractice.bmj.com/topics/en-gb/3000110\n\nUntreated paracetamol poisoning may cause varying degrees of liver injury over the 2 to 4 days following ingestion, including fulminant hepatic failure.\n\nFinally\n\nthere has been a 3-4-fold increased dispensing of ivermectin prescriptions in recent months, leading to national and local shortages for those who need the medicine for scabies and parasite infections\n\nIt is believed that this is due to recent prescribing and dispensing for unapproved uses, such as COVID-19. \n \nSuch shortages can disproportionately impact vulnerable people, including those in Aboriginal and Torres Strait Islander communities.\n\nThere is only one TGA approved oral ivermectin product, Stromectol ivermectin 3mg tablet blister pack\n\nIndicated for the treatment of river blindness (onchocerciasis), threadworm of the intestines (intestinal strongyloidiasis) and scabies.\n\nAll medical practitioners can continue to prescribe oral ivermectin for the approved indications. \n\nHowever, prescribing of oral ivermectin for indications that are not approved is now limited to certain specialists.\n\n\n \n\n\nOnchocerciasis\n\nhttps://www.who.int/news-room/fact-sheets/detail/onchocerciasis\n\nMore than 99% of infected people live in 31 African countries. The disease also exists in some foci in Latin America and Yemen.", "link": "https://www.youtube.com/watch?v=_gndsUjgPYo", "date_published": "2021-09-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Winter hospitalisations will increase", "description": "Eight-week scenarios for daily hospital admissions in England \n\nR = 1.1 – green, (is much more possible through a range of many different situations)\n\nR = 1.5 – blue (also likely)\n\nR = 2.0 – red (a possible outcome, but highly unlikely)\n\nhttps://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1017676/2021-09-14_COVID-19_Press_Conference_Slides__for_publication_.pdf\n\nHospitalisations likely to rise, 2,000 to 7,000 per day next month\n\nhttps://www.bbc.co.uk/news/uk-58566235\n\nGovernment's Plan B if the NHS faced unsustainable pressure\n\nSir Patrick Vallance\n\nWhen you make a move, you have to go earlier than you think you want to, you have to go harder than you think you want to and you have to make sure you have got the right geographical coverage\n\nSPI-M-O: Consensus Statement on COVID-19 (SAGE)\n\nhttps://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1017129/S1376_SPI-M-O_Consensus_Statement.pdf\n\nScientific Pandemic Influenza Group on Modelling (SPI-M)\n\nThe UK is currently experiencing high prevalence and likely entering a period of growth\n\nA time of significant uncertainty\n\nSchool holidays\n\nPossibility for further evidence to emerge on the duration of immunity against COVID-19\n\nPossibly broader, longer peaks than those originally estimated\n\nPotential for another large wave of hospitalisations\n\nIncreasing cases remain the earliest warning sign that hospital admissions are likely to rise\n\nClear consensus that continued high levels of homeworking has played a very important role in preventing sustained epidemic growth\n\nHighly likely that a significant decrease in homeworking in the next few months would result in a rapid increase in hospital admissions\n\nIf enacted early enough, a relatively light set of measures could be sufficient to curb sustained growth\n\nCurrent epidemic estimates \n\nUK (Health Security Agency)\n\nR in England is between 0.9 and 1.1\n\nGrowth rate is between -1% and +1% per day \n\nIt is unclear how high prevalence and admissions may go without intervention. \n\nReflections on modelling Step 4 of the Roadmap \n\nAfter step 4 of the Roadmap on 19th  July\n\nFactors\n\nSchools closed for summer\n\nChanges in behaviour\n\nChanges in mixing patterns have been more gradual\n\nthe population has not reduced their cautious behaviours as dramatically as was considered possible\n\nWarm weather\n\nMore sunshine\n\nLarge proportion of the population isolating after being identified as a contact of a case\n\nImperial’s modelling\n\n‘pessimistic scenarios’ which assume a three-year average duration of infection-induced immunity\n\nDoes not consider any variants of concern beyond Delta\n\nPeaks occurring in October to December instead of August to October\n\nHighest levels seen in Step 4 Roadmap scenarios\n\nWill not be reached without waning immunity\nor a novel variant emerging\n\nBehaviour was assumed to be consistent across age groups\n\nIf those at higher risk of morbidity and mortality from COVID-19 take greater precautions, \n\nlevels of hospital admissions and deaths could be lower than those seen in the Roadmap modelling \n\nVaccine effectiveness estimates continue to be refined\n\nThere is now evidence of waning vaccine effectiveness particularly 140 days after the second dose\n\nThose individuals vaccinated in late 2020 and early 2021 will have less protection in the coming months\n\nThird doses and booster vaccinations, which are able to reverse waning of protection, will limit the impact of waning immunity\n\nPolicy clarification\n\nThird doses for all over 50 or at increased risk\n\nUK Chief Medical Officers, advised vaccination aged 12 to 15\n\nIf acute COVID-19 combines with other pressures\n\nLong COVID\n\nOther infectious diseases, influenza, RSV, norovirus\n\nCo-infection of SARS-CoV-2 with other diseases\n\nMedium-term projections and scenarios \n\nThey are neither forecasts nor predictions\n\nCannot fully reflect recent changes in transmission that have not yet filtered through into surveillance data. \n\nEven in the R =1.1 scenario, up to 2,000 a day) in England\n\nFor a potentially protracted period of time\n\nthis could lead to a difficult few months for the health and care sector \n\nWarning signs \n\nNumber of cases\n\nPositivity rate\n\nAge profile of those infected\n\nDeclining immunity, new variant, radical behaviour change, 5 million unvaccinated (John)\n\nTiming of interventions \n\nA basket of measures, light enough to keep the epidemic flat, would be sufficient if enacted when hospitalisations were at a manageable level. \n\nIf the epidemic were allowed to continue to grow until hospitalisations were at a level that needed to be rapidly reduced, \n\nmuch more stringent measures would be needed to bring prevalence down quickly. \n\nThe nature of interventions \n\nIf enacted early enough, a relatively light set of measures could be likely be sufficient to curb sustained but slow growth", "link": "https://www.youtube.com/watch?v=nPrKA5p9a_I", "date_published": "2021-09-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]