[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Infinite Co-Op Campaign - Why You Have To Wait | GameSpot News", "description": "In today's GameSpot News, DeVante goes over Halo Infinite co-op delays, December's free Games With Gold, and more. \n\nHalo development boss Joseph Staten has commented on the delay of Halo Infinite's campaign co-op feature, saying Halo and co-op are synonymous, so it was \"very, very hard\" to choose to delay the feature, but it was essential so the team could prioritize other areas and get the game out the door this holiday.\n\nLater in the video, DeVante talks about which free games Xbox players can look forward to playing next month. Starting December 1, Xbox gold members can grab The Escapists 2 and Orcs Must Die, with the latter only being available until December 15. Starting on the 16th, members can grab Tropico 5: Penultimate Edition as well as Insanely Twisted Shadow Planet.\n\nLastly, in other Xbox-related news, the Series X Mini Fridge is reportedly louder than most would like. Our very own Gabe Gurwin recently set up his fridge and found that it is “easily as loud or louder than the actual Xbox Series X or PS5 when they have discs spinning.”\n\nFor more information on all of our topics, please visit gamespot.com.\n\nTimestamps:\nIntro - 00:00\nHalo Infinite - 00:06\nGames With Gold - 01:30\nXbox Mini Fridge - 02:06\nOutro - 02:52", "link": "https://www.youtube.com/watch?v=hOL7gnTn-r0", "date_published": "2021-11-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Highs And Lows Of One Year All Digital", "description": "Marching into this new generation, Kurt made a conscious choice to go all-digital with the Xbox Series S and the Playstation 5. And the result has been, well, rather unexpected.\n\nGoing all-digital can be a troubling prospect for some gamers. No selling/trading in games? No borrowing or lending them? What if your favorite series just disappears off the digital marketplace? They're all valid points. But still, Kurt Indovina marched bravely, or maybe naively, into an all-digital future with the Xbox Series S and PlayStation 5 Digital Edition. \n\nJoin Kurt on the highs and lows of his digital future, including his unexpected appreciation for past games. \n\nThe digital future can feel like a brittle one. Games like Jump Force will cease to exist on digital storefronts come February 2022; Metal Gear Solid 2 & 3 have pulled due to licensing issues over archival footage; and Rockstar Games delisted GTA 3, Vice City, and San Andreas weeks before the release of Grand Theft Auto: The Trilogy -- The Definitive Edition. On the flipside, however, there's a lot for what digital features offer, like Xbox's Quick Resume, and the digital service Game Pass.\n\n#PS5 #XBOX", "link": "https://www.youtube.com/watch?v=6_1l_FHym7I", "date_published": "2021-11-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "5 Secrets From the Elden Ring Network Test", "description": "Like Dark Souls, Demon's Souls, Bloodborne, and Sekiro before it, Elden Ring is filled with secrets. Even within this small taste of the Elden Ring Network Test, there were plenty of Elden Ring Secrets to discover. So, join Dave Klein of DaveControl as he goes over some of his favorite Elden Ring secrets he was able to find.\n\n0:00 - Intro\n0:29 - Spirit Tracks\n1:35 - Dragon Heart and Dragon Communion\n3:46 - A Glint in the Rock\n4:04 - Boc, the NPC\n5:24 - Pumpkin Head", "link": "https://www.youtube.com/watch?v=lM1IygouClU", "date_published": "2021-11-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Mass Effect Legendary Edition Coming Soon To Xbox Game Pass? | GameSpot News", "description": "In today’s GameSpot News, Persia talks about Mass Effect Legendary Edition possibly coming to Xbox Game Pass, some fighting game announcements, and more.\n\nAccording to Polish website XGP, and reported by VGC, the Mass Effect Legendary Edition might be heading to Xbox Game Pass as early as this week, according to an apparently accidental listing on the Xbox Store. \n\nLater in the video, Persia talks about some recent fighting game news starting with Riot Games revealing more information on Project L, a 2D fighting game set in Runeterra. As an assist-based fighter, players will build a team of two different champions that they can switch between during a match, and the game will reward \"strategic team building, on the fly decision-making, and strong fighting fundamentals.\"\n\nPeria also covers the addition of Ryu, Chun-Li, and Akuma from Street Fighter crossing over with Ubisoft's free-to-play fighting game Brawlhalla. This is the latest set of characters announces as a part of Brawlhalla's \"epic crossovers\" event.\n\nFor more information on all of our topics, please visit gamespot.com.", "link": "https://www.youtube.com/watch?v=3MrwTtlwkuU", "date_published": "2021-11-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Why Halo 3: ODST Is The Best Halo Game", "description": "From Halo: Combat Evolved to Halo Infinite, Xbox’s biggest franchise has been defined by battle rifles, explosions, and murdering Elites. Yet in 2009, Bungie delivered a more somber FPS experience with Halo 3: ODST. And, for producer Jessie Earl, Halo 3: ODST is far and away the best campaign in the entire Halo franchise. \n\nYes, better than Halo 2, Halo Reach, or especially Halo 5: Guardians. \n\nHalo 3 ODST is the game that should not be. Not only is ODST a complete tonal shift for the franchise, focusing on a more somber, small stakes story, it was also created out of the ashes of a completely different Halo project and made in basically a single year. This game should be a complete mess.\n\nYet, instead Bungie’s Halo 3: ODST is a masterclass in tone, storytelling, and game design that resonates, even more, today than it did back when it was released. So let’s break down why this underappreciated gem still holds up amidst its blockbuster siblings.\n\nAnd, if you want to see our full Halo Ranking from everyone at Gamespot, check out this video: https://youtu.be/YWTvIuHCgUE", "link": "https://www.youtube.com/watch?v=4Hw58JxXj-I", "date_published": "2021-11-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]