[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Ivermectin in Japan", "description": "Antivirals in Japan\n\nIvermectin allowed as a treatment on August 13\n\nDoctors can prescribe without restrictions\n\nPeople can buy it legally from India\n\nDr. Haruo Ozaki, Chairman of the Tokyo Medical Association\n\nhttps://www.tokyo-np.co.jp/article/123988\n\nThe situation is that the whole country is suffering from disasters. \n\nNo one will listen to me, so I will come up with a new policy\n\nThe antiparasitic drug \"ivermectin\" shows the number of infections and deaths of the new corona in a country that is prophylactically administered for another disease in Africa.\n\nIt is necessary to thoroughly study the clinical trial, but it seems that we are at the stage where it is okay to have the patient give an informed outlet and get permission to use it\n\nJapan\n\nhttps://www.japantimes.co.jp/news/2021/11/22/national/japan-coronavirus-november22/\n\nPopulation, 126 million\n\nCases, + 79\n\nDeaths, + 2\n\nLowest since June 23, 2020\n\nCurrently reopening\n\nMore than 76% of population is fully vaccinated\n\n(South Korea, high vaccination but uptick in infections)\n\nBoosters to start in December\n\nIngrained pre-pandemic flu seasons mask wearing\n\nDelta variant wave ends\n\nDelta variant “self-extinction”\n\nViral genetic mutations\n\nIturo Inoue, professor, National Institute of Genetics\n\nDelta variant in Japan accumulated too many mutations\n\nVirus’s error-correcting protein, nsp14\n\nMajority of nsp14 specimens in Japan seemed to have undergone many genetic changes in mutation sites called A394V\n\nNon-structural protein, made by the virus\n\nTherefore errors accumulated leading to non-viability\n\nAlso\n\nMore people in Asia have a defense enzyme called APOBEC3A that attacks RNA viruses, \n\nIncluding the SARS-CoV-2 virus that causes COVID-19, \n\nwhen compared to people in Europe and Africa.\n\nNational Institute of Genetics and Niigata University\n\nResearch to discover how the APOBEC3A protein affects the nsp14 protein\n\nA394V discovered in 24 other countries\n\nSARS ended abruptly in 2003\n\nWorking on a drug to inhibit nsp14", "link": "https://www.youtube.com/watch?v=E1GF0H9V_1g", "date_published": "2021-11-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Spontaneous abortion after vaccine", "description": "Risk of spontaneous abortion after vaccination\n\nRisk of Stillbirth Among Women With and Without COVID-19 at Delivery Hospitalization — United States, March 2020–September 2021\n\nhttps://www.cdc.gov/mmwr/volumes/70/wr/mm7047e1.htm?s_cid=mm7047e1_x\n\nSixth, it was not possible to assess vaccination status in this analysis. \n\nHowever, because COVID-19 vaccines are highly effective, and COVID-19 vaccination coverage among pregnant women was approximately 30% as of July 2021,\n\nmost women with COVID-19 at delivery were likely unvaccinated.\n\nEtiology of Spontaneous Abortion\n\nhttps://www.msdmanuals.com/en-gb/professional/gynecology-and-obstetrics/abnormalities-of-pregnancy/spontaneous-abortion\n\nSporadic\n\ncytomegalovirus, herpesvirus, parvovirus, and rubella virus\n\nlive vaccines, not in pregnancy\n\nnon-live vaccines have previously been shown to be safe in pregnancy (flu and whooping cough)\n\nRecurrent\n\nGenetic abnormalities\n\nImmunologic abnormalities\n\nMajor trauma\n\nUterine abnormalities\n\nMost often, the cause is unknown\n\nRisk factors for spontaneous abortion include\n\nAge more than 35\n\nHistory of spontaneous abortion\nCigarette smoking\n\nUse of certain drugs (eg, cocaine, alcohol, high doses of caffeine)\n\nA poorly controlled chronic disorder (eg, diabetes, hypertension, overt thyroid disorders) in the mother\n\nSpontaneous Abortion Following COVID-19 Vaccination During Pregnancy (8 September 2021)\n\nhttps://jamanetwork.com/journals/jama/fullarticle/2784193\n\nConcerns regarding risks of spontaneous abortion may be a barrier to vaccination during pregnancy\n\nWe present findings from case-control surveillance of COVID-19 vaccination during pregnancy and spontaneous abortion.\n\nMethods\n\nData from 8 health systems (Kaiser Permanente: Washington, Northwest, Northern California, Southern California, and Colorado; Denver Health; HealthPartners; and Marshfield Clinic, Wisconsin)\n\n4-week surveillance periods from December 15, 2020, through June 28, 2021\n\nOngoing pregnancies between 6 and 19 weeks’ gestation\n\nResults\n\nOf 105,446 pregnancies \n\n13,160 spontaneous abortions\n\n92,286 ongoing pregnancies were identified\n\nVaccine during pregnancy and before 20 weeks’ gestation\n\n7.8% of women received 1 or more BNT162b2\n\n6.0% received 1 or more mRNA-1273 (Moderna)\n\n0.5% received an Ad26.COV.2.S (Janssen)\n\nA COVID-19 vaccine was received within 28 days prior to an index date\n\n8.0% of ongoing pregnancy periods\n\n8.6% of spontaneous abortions\n\nSpontaneous abortions did not have an increased odds of exposure to a COVID-19 vaccination in the prior 28 days compared with ongoing pregnancies\n\nadjusted odds ratio, 1.02\n\nResults were consistent for mRNA-1273 and BNT162b2 and by gestational age group\n\nDiscussion\n\nDespite limitations, these data can be used to inform vaccine recommendations and to counsel patients.\n\nReceipt of mRNA Covid-19 Vaccines and Risk of Spontaneous Abortion\n\n(14 October 2021)\n\nhttps://www.nejm.org/doi/full/10.1056/NEJMc2113891\n\nSingleton pregnancy, n = 2,456\n\nCenters for Disease Control and Prevention (CDC)\n\nhttps://www.cdc.gov/coronavirus/2019-ncov/vaccines/safety/vsafepregnancyregistry.html\n\nv-safe Covid-19 vaccine pregnancy registry \n\nwho had received at least one dose of an mRNA Covid-19 vaccine,\n\neither before conception or before 20 weeks of gestation,\n\n52.7% had received the BNT162b2 vaccine\n\nThe cumulative risk of spontaneous abortion from 6 to less than 20 weeks of gestation was 14.1%\n\nhttps://www.nejm.org/doi/full/10.1056/NEJMc2113516\n\nhttps://www.nejm.org/doi/full/10.1056/NEJMx210016\n\nThe estimated risks (14.1% overall and 12.8% in age-standardized analyses) are consistent with the risks of spontaneous abortion reported in the general population\n\nhttps://www.rcog.org.uk/en/guidelines-research-services/coronavirus-covid-19-pregnancy-and-womens-health/covid-19-vaccines-and-pregnancy/covid-19-vaccines-pregnancy-and-breastfeeding/\n\nCOVID-19 vaccines are recommended in pregnancy.\n\nVaccination is the best way to protect against the known risks of COVID-19 in pregnancy for both women and babies, \n\nincluding admission of the woman to intensive care and premature birth of the baby\n\nYou should not stop breastfeeding in order to be vaccinated against COVID-19.\n\nWomen trying to become pregnant do not need to avoid pregnancy after vaccination, \n\nthere is no evidence to suggest that COVID-19 vaccines will affect fertility.\n\nSo far (11th October)\n\nmore than 82,000 pregnant women in England have received at least one dose of COVID-19 vaccination and \n\nPublic Health Scotland have reported that more than 19,000 pregnant women have received a vaccine, \n\nwith no serious adverse effects recorded.\n\nResearch from across six studies in four countries, \n\ninvolving more than 40,000 pregnant women, \n\nshows having the vaccine does not increase the risk of miscarriage, preterm birth, stillbirth, nor does it increase the risk of a small-for-gestational age baby, \n\nor the risk of congenital abnormalities.", "link": "https://www.youtube.com/watch?v=wFpH3aq95j0", "date_published": "2021-11-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]