[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Making Popular Music in the Midst of Change and Transition: PopCon 2021Keynote Panel", "description": "NPR Music is proud to present the keynote panel conversation for the 2021 Pop Conference, hosted by New York University’s Clive Davis Institute of Recorded Music. The keynote is titled \"Fluxed: Making Popular Music in the Midst of Change and Transition.\"\n\nTo kick off a four-day special “Convergence” version of the annual Pop Conference, the keynote conversation invites a panel of four artists thriving within the highly volatile environment of contemporary popular music to discuss how the spirit and realities of change both challenge and inspire them. From taking on the themes of transformation and precariousness in their own music, to fully exploring what new technologies can communicate, to coping with a radically altered social and economic landscape, musicians must act at the forefront of new 21st-century modes of being. This open-ended conversation connects the transforming craft and business of music-making to the art of capturing musical meanings in a highly turbulent world.\n\nThe panel’s participants are leaders in reimagining what music and its cultures can be: singer-songwriter-auteur Devonté Hynes, whose work under many different names (Blood Orange, Lightspeed Champion) exemplifies the refusal to adhere to outdated categories; producer and musician Rostam, who has been instrumental in defining the anti-genre sound of 21st century pop; singer, songwriter and producer Roísín Murphy, whose dance-inspired music finds the point where past meets future, and Tamara Lindeman, who records as the Weather Station and models how the singer-songwriter role is changing in response to both exploding musical categories and a world in crisis. Ann Powers, NPR Music Critic and author of many books, most recently Good Booty: Love and Sex, Black and White, Body and Soul, moderates. The event is produced by Jason King.\n\nTHE FULL POP CONFERENCE SCHEDULE\nhttps://popcon2021.sched.com/\n\nTHE POP CONFERENCE WEBSITE / REGISTRATION:\nhttp://popconference.org\n\nFOLLOW Pop Conference:\nTwitter - https://www.twitter.com/popconorg\nInstagram - https://www.instagram.com/popconorg\n\nFOLLOW Keynote Panelists:\nDevonté Hynes: https://www.instagram.com/devhynes\nRostam: https://www.instagram.com/matsor,  https://www.twitter.com/matsoR\nRoísín Murphy: https://www.instagram.com/roisinmurphyofficial,  https://www.twitter.com/roisinmurphy\nTamara Lindeman: https://www.instagram.com/theweatherstation,  https://www.twitter.com/TheWeatherStn\nAnn Powers: https://www.instagram.com/annkpowers,  https://www.twitter.com/annkpowers\n\n\nFOLLOW New York University’s Clive Davis Institute of Recorded Music:\nTwitter -  https://www.twitter.com/clivedavisinst\nInstagram - https://www.instagram.com/clivedavisinst\n\nFOLLOW NPR Music:\nTwitter -  https://www.twitter.com/nprmusic\nInstagram - https://www.instagram.com/nprmusic\nFacebook - https://www.facebook.com/nprmusic\n\n#popcon2021 #nprmusic", "link": "https://www.youtube.com/watch?v=Y7ByQy2UTJ4", "date_published": "2021-04-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Butcher Brown: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nNikki Birch | April 21, 2021\nButcher Brown takes to a restaurant's rooftop terrace in the band's hometown of Richmond, Va., for a home concert and sizzles from the first note. The band opens with \"Sticky July,\" a tune every bit as catchy as its name implies; think rollerskating with a popsicle under a cloudless sky of blue. When you think you've figured it out, keyboardist DJ Harrison switches it up, launching into a solo so funky you wonder if it's a new song, that is until Marcus \"Tennishu\" Tenney brings us back home with some sweet trumpet.\n\nThat's the thing about Butcher Brown: are they playing jazz ... or funk ... or soul? They scoff at the limitations of adjacent genres with the expertise of master musicians who've played together so long that they flow from one vibe to the next without missing a beat. This is clear as they slide into \"Camden Square,\" but not before Tennishu introduces the band, thanks their parents, and shouts out Ann Paciulli, who provided the old-school desk seen in the video. Viewers of a certain vintage may recall interminable afternoons spent sitting in a tiny desk just like that one. Fortunately, boredom is the last thing that happens when Butcher Brown hits. \"#KingButch\" is next, a stank-face hip-hop head-bobber that once again proves they can do it all. (And yes, not only does Tennishu rap, he also plays sax and trumpet, which is no minor feat.) They close with \"Tidal Wave\": smooth, delightful, classic.\n\nSET LIST\n\"Sticky July\"\n\"Camden Square\"\n\"#KingButch\"\n\"Tidal Wave\"\n\nMUSICIANS\nDJ Harrison: keys\nCorey Fonville: drums\nAndrew Jay Randazzo: bass\nTennishu: trumpet, saxophone, vocals\nMorgan Burrs: guitar\n\nCREDITS\nVideo: Joey Wharton, R. Anthony Harris, WhartonMajor\nAudio: Zach Fichter\nSpecial Thanks: Peter Cerrito, Pete LeBlanc and Jason Moore\n\nTINY DESK TEAM\nProducer: Nikki Birch\nVideo Producer: Kara Frame\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Maia Stern, Bob Boilen\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann\n\n#butcherbrown #tinydesk #nprmusic", "link": "https://www.youtube.com/watch?v=ZfqmSZ-6Cgo", "date_published": "2021-04-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]