[{"source": "https://lukesmith.xyz/rss.xml", "title": "Monero Maximalism: Or, How Bitcoin Is a 💩coin", "description": "<figure class=\"titleimg\"><img src=\"https://lukesmith.xyz/pix/xmr_maxi.webp\" title=\"You have one goal and one goal only: Buy and hold Monero!\" /></figure>\n\n<h2 id=\"the-biggest-problem-with-cryptocurrency\">The Biggest Problem with Cryptocurrency</h2>\n<p>Most normal people hear the word &quot;cryptocurrency&quot; and assume that\nmeans that they are &quot;cryptic&quot; or &quot;private,&quot; but that's actually a\nhuge, perhaps the hugest misunderstanding of our time and it has some\nbig consequences. The &quot;crypto&quot; in <em>cryptocurrency</em> merely comes\nfrom its cryptographic nature.</p>\n<p>When it comes to actual privacy, cryptocurrencies are an unmitigated\ndisaster: All transactions and wallet balances are easily viewable on\nthe necessarily public blockchain.</p>\n<p>This might not <em>seem</em> like a problem to some, and there are also some\nwho will retort with &quot;Well, I'm not doing anything illegal so it\ndoesn't matter to me.&quot;</p>\n<p>But here's the thing: <strong>Every currency in human history has been\ntotally private, so we have no other similar disaster scenario to even\ncompare this to.</strong></p>\n<p>American dollars are centrally financially controled, but we can\ntransact without that being public information. Even when using a Visa\nor Mastercard with your bank, Visa or your bank might know of the\ntransaction, but it <em>isn't</em> broadcast publicly to the entire world like\nBitcoin or other cryptocurrencies.</p>\n<p><strong>Bitcoin is therefore a unique privacy disaster that we can't even\nanticipate.</strong> No cryptocurrency is widely used enough as an actual\ncurrency for people to really feel the burn of this, but this opens up\nhuge liabilities for every human on the planet. You might think the\nAmerican dollar is a NWO/Satanic/Mark-of-the-Beast currency that will\ntake away your freedoms, but let me tell you that Bitcoin as it is <em>is\nfar worse!</em></p>\n<h3 id=\"the-disaster-of-the-bitcoin-future\">The Disaster of the Bitcoin Future</h3>\n<p>Here's some of the things we can expect in a world running on Bitcoin:</p>\n<ul>\n<li>Your personal budget, income and bank account is necessarily public\ninformation.</li>\n<li>Every business's expenditures and payroll are now necessarily\npublic information. Everyone in the world knows how much everyone\nmakes and know what suppliers each business transacts with. Trade\nsecrets are a thing of the past. Employee privacy is a thing of the\npast.</li>\n<li>Consumer privacy is a thing of the past. Everyone knows how much\nmoney everyone spends everywhere else.</li>\n<li>Even giving money to friends for favors or help is visible to the\nIRS. This makes easy micromanagement and taxation of even minor\nthings that might not be plausibly taxable now.</li>\n<li>Nearly every privacy law is rendered unenforceable and useless by\nBitcoin.</li>\n</ul>\n<p>No sane person would volunteer to reveal all their bank accounts,\ntransaction histories, spending habits and thereby physical movements\nfor no reason to every government and business in the world. But if you\nuse most cryptocurrencies, that is exactly what you're doing.</p>\n<h3 id=\"it-will-be-even-worse\">It will be even worse.</h3>\n<p>Losing personal privacy is one thing. Maybe you don't even mind a world\nwhere eveyone is continuously &quot;doxxed&quot; and bombared with perfectly\ntargetted ads <em>a là</em> Minority Report.</p>\n<p>More important than that is <em>systemic privacy</em>. In a system with glass\nwalls like Bitcoin, criminals, governments, corporations and regulatory\nagencies realize that it is very easy for them to abuse and exploit\npeople. Expect the maximum amount of extortion, the maximum amount of\ntaxes on increasingly mundane things and the maximum amount\nmicromanagement.</p>\n<p>While you might not be able to imagine in your mind's eye all the\nterrible things that might happen with a fully monitorable currency,\nneedless to say, it will contain what are, in effect, indescribable\nLovecraftian monsters from the blackest Stygian depths. Bitcoin is the\nopposite of freedom. It is giving a <em>carte blanche</em> to all the world's\nworst people to prey on innocents.</p>\n<h2 id=\"the-solution-monero\">The Solution: Monero</h2>\n<p><a href=\"https://www.getmonero.org/\"><img alt=\"monero icon\" src=\"https://lukesmith.xyz/pix/xmr.svg\" />Monero</a> (also\nknown by its ticker &quot;XMR&quot;) is an exception to this.</p>\n<p>Monero is a digital currency that has the blockchain technology of\nBitcoin, but has in its core very smartly designed tech to keep the\ntransactions on this public blockchain totally opaque. It takes what\nwe've learned from Bitcoin and makes a complete project that can\nfunction, in fact <em>is functioning</em> in real life.</p>\n<p>Firstly, the technologies which make the Monero blockchain private:</p>\n<ol>\n<li><em>Ring signatures</em> to protect sender privacy. All transactions\nare jointly signed by not just the actual sender, but ten other\naddresses. Security by obscurity and plausible deniability.</li>\n<li><em>Stealth addresses</em> to protect receiver privacy. Instead of\none address on the blockchain, you technically have a different\naddress for every single transaction and only by your private view\nkey can you see that they are yours.</li>\n<li><em>Ring confidential transactions</em> to obscure the amount sent.</li>\n</ol>\n\n<figure class=\"resright\"><img src=\"https://lukesmith.xyz/pix/satoshi_monero.webp\" /><figcaption>The creator of Bitcoin really intended to create what Monero would later become. Bitcoin itself is incomplete.</figcaption></figure>\n\n<p>None of this means any complication for the user. Monero works just like\nany other cryptocurrency and if you use the <a href=\"https://www.getmonero.org/downloads/#gui\">default graphical Monero\nwallet</a>, it's just as easy to\nuse Electrum or something else for Bitcoin.</p>\n<h3 id=\"monero-is-for-normal-people\">Monero is for normal people</h3>\n<p>Monero is often portrayed as being subversive because it is coming to\ntotally replace Bitcoin on the dark net for illegal transactions. It\noften has a reputation associated with those potentially criminal\npurposes it could be used for (same thing with Bitcoin before blockchain\nmonitoring became a science). Monero is not doing anything illegal that\ncash couldn't do beforehand, but there's a more important point:</p>\n<p><strong>Much more evil can be done with public transactions than private\ntransactions: they can cause blackmail, rumors, gossip-mongering,\nwitchhunts, stalking and targeted robberies and attacks.</strong> Seasoned\ncriminals know how to juggle Bitcoin and other non-cryptic\ncryptocurrencies to avoid compromising privacy; normal people do not and\ncan fall prey to some of the worst things just by using Bitcoin for\nnormal things in normal ways.</p>\n<p>At the end of the day, <strong>it's not Monero that's weird or subversive or\nniche, it's Bitcoin and all other cryptocurrencies</strong>. Privacy is a bare\nminimum for any functioning currency. Currency users deserve that and no\ncurrency could function without it. The dollar, the euro, the renminbi\nand every other currency by definition has the same privacy features as\nMonero. Bitcoin just doesn't have that.</p>\n<h3 id=\"monero-solves-all-of-bitcoins-other-problems\">Monero solves all of Bitcoin's other problems.</h3>\n<p>Bitcoin also has other drawbacks:</p>\n<ol>\n<li>Bitcoin block size is limited to such a small size that spenders\nhave to compete with massive fees to get their transactions\nprocessed. It often takes $10 of Bitcoin to send $5 of Bitcoin.</li>\n<li>It is unclear if the Bitcoin have incentives to continue once all\nBitcoins are mined.</li>\n<li>Bitcoin mining is increasingly centralized and requires extreme\nspecialty ASIC hardware to compete.</li>\n</ol>\n<p>All of these pale in comparison to the privacy issue, and a lot of smoke\nis generated by random coins trying to solve these issues, but Monero\nhas a solution for them all.</p>\n<h4 id=\"1-monero-has-low-transaction-fees\">1. Monero has low transaction fees.</h4>\n<p>Monero has variable block size that avoids this issue as well, as long\nwith a disincentive for large blocksizes to prevent spurious\ntransactions (that could otherwise be theoretically used in an attack to\ncompromise network privacy).</p>\n<h4 id=\"2-monero-will-be-mined-forever\">2. Monero will be mined forever.</h4>\n<p>The second issue is the big question mark behind the whole Bitcoin\nsystem. Once all Bitcoins are mined, will miners continue to process\ntransactions if they are paid by fees only?</p>\n<p>This isn't an issue for Monero because there is never a point where the\nblock reward for mining is zero. It will eventually stagnate at 0.6 XMR\nfor eternity, which is a supply inflation which approaches zero over\ntime and avoids the issue of no block rewards. This is called <em>tail emission</em>.</p>\n<p>Note also that any solution to Bitcoin's first problem above, will\nnecessarily exacerbate the second problem. If you solve the fee problem,\nyou make the mining incentive problem worse. If there is the Lightning\nNetwork or something else that reduces Bitcoin's fees dramatically, the\nchance of those lower fees maintaining miners will decrease\ndramatically.</p>\n<p>I will say, if you think that the capped supply of Bitcoin will work out\nfine and might be better, you can still have the benefits of Monero with\n<a href=\"https://wownero.org\"><img alt=\"\" src=\"https://lukesmith.xyz/pix/wow.svg\" />Wownero</a>, which is a Monero fork\nwith a capped supply and doge-tier memes (it also has a higher ring\nsignature size of 22 which might theoretically be better for privacy (or\noverkill)). <a href=\"https://coinmarketcap.com/currencies/wownero/\">(See on\nCoinmarketcap)</a> They also\nhave <a href=\"https://suchwow.xyz/\">a meme site</a>.</p>\n<h4 id=\"3-monero-stays-decentralized-by-avoiding-mass-mining\">3. Monero stays decentralized by avoiding mass-mining.</h4>\n<p>Monero is specifically designed to avoid allowing specialty hardware\n(ASICs) participate in mining. This makes individual mining on consumer\ncomputers more possible for longer and makes it hard to farm Monero.\nThey use a technology called\n<a href=\"https://www.getmonero.org/resources/moneropedia/randomx.html\">RandomX</a>\nto do this.</p>\n<h3 id=\"other-monero-perks\">Other Monero Perks</h3>\n<p>In short, Monero is cryptocurrency done right. Bitcoin was a great proof\nof concept, but Monero fixes all the issues that the Bitcoin project\nbrought to attention.</p>\n<p>There are yet more good features of Monero that are worth mentioning:</p>\n<h4 id=\"optional-transparency-with-private-view-keys\">Optional Transparency with Private View Keys</h4>\n<p>In some cases, you might <em>not</em> want privacy, but transparency with\nMonero. Suppose you're running a kind of non-profit that want's to\nproudly show all their financials to potential donnors. Monero allows\nthis too with <em>Private View Keys</em>. You can publish your private\nview keys on your website for your transactions to visible to whoever\nhas them.</p>\n<h4 id=\"monero-is-actively-developed-and-improved\">Monero is actively developed and improved.</h4>\n<p>Monero users and developers are constantly trying to improve, break and\nstress-test the technology. A lot of the features I've mentioned here\nhave been added to Monero since its founding. If you want to have an in\ndepth look at the history of Monero's development and technology, you\ncan see <a href=\"https://www.youtube.com/playlist?list=PLsSYUeVwrHBnAUre2G_LYDsdo-tD0ov-y\">this video series &quot;Breaking\nMonero&quot;</a>\nwhere some guys overview how Monero has overcome previous issues to\nbecome the prime privacy coin of today.</p>\n<h2 id=\"using-and-holding-monero\">Using and Holding Monero</h2>\n<p>If you're reading this, I'll assume you're at least superficially\nfamiliar with cryptocurrencies and probably have some Bitcoin. Even if\nthat's not so, just follow the links and you're smart enough to get\nstarted.</p>\n<h3 id=\"wallets\">Wallets</h3>\n<p><a href=\"https://www.getmonero.org/downloads/\">Get a Monero wallet here</a> from\ntheir main site. Write down and store your wallet seed where you will\nnever lose it.</p>\n<h3 id=\"getting-monero\">Getting Monero</h3>\n<p>The first thing I recommend everyone should do is put your public\naddress on your website for donations and produce high-quality writing\nand other website content. Monero users will usually be more likely to\nsend small Monero donations since transaction fees are low. This also\nincreases the profile of Monero in the eyes of anyone who sees it, which\nis a good costless investment for you now. Cryptocurrencies are driven\nby networking effects. Note that you can make a QR code with <code>qrencode</code>\nor an online generator if you're a true-blue normie.</p>\n<p>The unofficial site <a href=\"https://www.monero.how/\">Monero.how</a> lists many\nexchanges where you can exchange Bitcoin or Ethereum for Monero and\nstore it on your private wallet, including many that don't require KYC\n(sending in an ID).</p>\n<p>The site <a href=\"https://localmonero.co/\">Local Monero</a> is even an anonymous\nservice where you can mail in cash to exchange with a trusted Monero\nvendor or vice versa.</p>\n<p>I also recommend using <a href=\"https://bisq.network/\">Bisq</a> for the highest\nlevel of privacy. It is a peer-to-peer and totally anonymous exchange\nwhich even creates its own Tor service automatically. You can exchange\nXMR for BTC there too.</p>\n<p><a href=\"https://localmonero.co/nojs/knowledge/monero-atomic-swaps\">There are also Bitcoin/Monero atomic swaps in the\nworks.</a> This\nis something very new, but when it happens and goes fully public, you\nmight expect a lot of value in Bitcoin moving over into Monero.</p>\n<h3 id=\"use-now-or-to-hodl\">Use now or to HODL?</h3>\n<p>They also keep a small list of <a href=\"https://www.getmonero.org/community/merchants/\">the growing number of services that\naccept Monero</a>.\nEverything from online services, to houses, to computer parts and more.\nI also keep a <a href=\"https://lukesmith.xyz/crypto.html\">Monero donation address</a> public and\nrecommend others to do so as well. Since Monero transaction fees are so\nlow, microtransactions and small donations are easy.</p>\n<p>Although if you're persuaded by my case here, you might just want to\nHODL Monero for the most part and expect that it will rise. As I'm\nwriting this (April 21, 2021) Monero has increased a lot recently in the\nongoing bullrun, but it is still proportionately far lower than it was\nin comparison with Bitcoin in the 2017 run. I have no clue whether it\nwill moon or crash hard at the end of the bullrun or anything, all I can\nsay is that I think the technological fundamentals are far better than\nBitcoin and all other currencies and its only getting scarcer.</p>\n<p>What separates Monero from everything else is that it is a gimmickless\ncurrency that has all the bare minimums of privacy. It is Bitcoin\nperfected. It's what Bitcoin should've been. That's it.</p>\n<p>My Monero donation address:</p>\n<p><code>48jewbtxe4jU3MnzJFjTs3gVFWh2nRrAMWdUuUd7Ubo375LL4SjLTnMRKBrXburvEh38QSNLrJy3EateykVCypnm6gcT9bh</code></p>\n\n<figure class=\"titleimg\"><a href=\"https://lukesmith.xyz/pix/xmr.png\"><img src=\"https://lukesmith.xyz/pix/xmr.png\" /></a></figure>\n\n\n<figure class=\"titleimg\"><a href=\"https://lukesmith.xyz/pix/monero_hodlers.jpg\"><img src=\"https://lukesmith.xyz/pix/monero_hodlers_small.webp\" /></a></figure>", "link": "https://lukesmith.xyz/articles/monero-maximalism-or-how-bitcoin-is-a-coin/", "date_published": "2021-04-21 00:00:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://lukesmith.xyz/rss.xml", "title": "My blog system now has tagging (all pure POSIX shell of course)", "description": "<p>This isn't live on the <a href=\"https://github.com/lukesmithxyz/lb\">old blog system's\nGithub</a>, but partially inspired by\nby <a href=\"https://based.cooking\">Based Cooking</a>'s tag system which is based\non <a href=\"https://pedantic.software/git/blogit\">blogit</a>, I've added in the\nfeature to tag articles.</p>\n<p>I've been wanting to write more articles and informational pages on my\nwebsite, but doing that with no organization is somewhat impratical. I\nnow have a tagcloud <a href=\"https://lukesmith.xyz\">on my homepage</a>.</p>\n<p>My issue with <a href=\"https://pedantic.software/git/blogit\">blogit</a>, the tool\nused for Based.Cooking is that it is <em>slow</em>, mainly due to the fact that\nfor every file, it has multiple system/program calls (<code>grep</code>, <code>sed</code>,\netc. might be called for each article or tag).</p>\n<p>Here's an example of what I do, just for info. Instead of looking\nthrough each file and calling <code>grep</code> and friends each time to get file\ninformation, the title, the tags, etc., I merely run <code>awk</code> and <code>sed</code>\nonce to get all the info from all files:</p>\n<pre><code># Awk prints out the filename, title and keywords/tag lines and Sed rearranges them for parsibility\noutput=&quot;$(awk 2&gt;/dev/null '\n    /&lt;title&gt;/ {printf &quot;\n&quot; FILENAME $0};\n    /keywords/ {printf $0}' &quot;$webdir/$artdir&quot;/*html |\n        sed &quot;s/\\s*&lt;meta.*keywords.*content=[\\&quot;']/|/\n            s/\\s*&lt;title&gt;\\s*/;/\n            s/\\(\\s\\+\\|[\\&quot;']&gt;$\\)/ /g\n            s/^\\s*//\n            s/,//g\n            s/\\( *&amp;ndash.*\\)*&lt;\\/title&gt;//&quot; | grep &quot;|&quot;)&quot;\n</code></pre>\n<p>Then, instead of recursing and reading every file and manually running\nthe same <code>grep</code> or <code>sed</code> commands each time, just recurse through the\noutput of that previous command stored in <code>$output</code>.</p>\n<p>Actually, I realize in the title of this post, I lied! It actually\nisn't POSIX shell, but bash, but for a very good reason. Bash has a\nbuilt-in that capitalizes strings:</p>\n<pre><code>$ name=luke\n$ echo &quot;${name^}&quot;\nLuke\n</code></pre>\n<p>POSIX shell lacks such a feature and would have to call an external\nprogram like <code>sed</code> or <code>tr</code> to capitalize strings, which I would need\nwhen later in the script recursing through tag names. This actually is a\ngood case of when bash is faster to use, since it has the feature built\ninto it, without needing to call external programs.</p>\n<p>Of course I'm sure someone will email me saying that there is some\n(albeit perhaps less elegant) way of capitalizing the first character of\na string in POSIX sh...</p>\n<p>I might make my new blog system Makefile-based like blogit to get the\nperks of that, but I've always found Makefile syntax in a kind of\ndisturbing and confusing uncanny valley. I know that's a silly thing to\nsay.</p>", "link": "https://lukesmith.xyz/updates/my-blog-system-now-has-tagging-all-pure-posix-shell-of-course/", "date_published": "2021-04-21 00:00:00+00:00", "persistent": false, "user": null, "language": null}]