[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Apex Legends – Legacy Launch Trailer", "description": "Check out the all new Apex Legends Legacy launch trailer featuring the all new character Valkyrie as well as a surprise appearance from Ash. \n\n#ApexLegends #ApexLegendsLegacy", "link": "https://www.youtube.com/watch?v=VLRHPi8-6DQ", "date_published": "2021-04-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "COD Warzone Verdansk '84 Livestream", "description": "Call Of Duty nuked the Verdansk Warzone map and a trailer has shown off what looks like the new one. Let's find out if we get to drop on the next battle-royale arena today as we progress through the next part of this two day event.", "link": "https://www.youtube.com/watch?v=95PcRDR_l-w", "date_published": "2021-04-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "COD Warzone Verdansk 84 Cinematic Cutscene", "description": "Get a glimpse of the nuke on Rebirth Island that takes us into Verdansk '84 in Call of Duty Warzone. This leads us into the Season 3 and the new map.", "link": "https://www.youtube.com/watch?v=kKNInnXUp6A", "date_published": "2021-04-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call Of Duty’s New Warzone Map: Everything You Should Know", "description": "Call Of Duty Warzone is finally nuking the old Modern Warfare map and replacing it with a 1980s Cold War-themed Verdansk. Here are all the changes coming, including new and redone locations, new weapons, and how the limited-time event will play out with zombies, Plague Zones, and more than one nuclear weapon.\n\nCall Of Duty: Warzone has had the same map for over a year now, and Operation Rapid Sunder is changing that, starting with a four-part event that ends with Modern Warfare’s battle royale map being nuked forever and replaced with Verdansk 84. This nuke event has been teased for a number of seasons, with players finding bunkers and nuclear weapons on the map followed by a zombie invasion. \n\nThe four parts of the current event are Escalation Protocol, where zombies travel across the map, eventually leaving corruption zones in their wake. Phase two is the Destruction Of Verdsansk, where players race against a countdown clock while the Corruption Zones expand in a last-ditch effort to save Verdansk, which does not go well. Phase three sees players taken to Rebirth Island on a night map and tasked with unraveling the mystery of what just happened on Verdansk and will end with yet another nuke being launched. The final and fourth phase will transport players back in time to Verdansk in the 1980s.\n\nThe new Warzone map will have a number of environmental and location changes. The map is based on locations from Black Ops Cold War and has seven new locations and five revamped areas. The spring environment is greener with thicker forests. Urban areas sport 80’s colors and less dense cities. In a final but sad note, the Modern Warfare battle-royale map is gone forever, thanks for the memories.", "link": "https://www.youtube.com/watch?v=2_Qq1-xZT0A", "date_published": "2021-04-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty Warzone | Season 3 Trailer", "description": "Check out the all new season 3 trailer for Call of Duty Warzone and drop into Verdansk84 with your squad today! \n\n#COD #Warzone #CallofDuty", "link": "https://www.youtube.com/watch?v=yXzMOUCYGBs", "date_published": "2021-04-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Cold War Season 3 Hunt for Adler Cinematic", "description": "Cold War Season 3 new operators Wraith and Knight nuke Mt. Yamantau continuing with their mysterious plan to do more than just brainwash Adler using the numbers program. The trailer ends with Stitch entering Verdansk.\n\n#CallofDuty #COD #Warzone", "link": "https://www.youtube.com/watch?v=JgPEeB0vw34", "date_published": "2021-04-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Nier Replicant ver.1.2474487139 Review", "description": "Though antiquated in some respects, Nier Replicant will tear your heart out with its timeless story, endearing and tragic characters, and beautiful soundtrack.\n\nMichael cherishes Nier: Automata as one of his all-time favorites, and recently played the original Nier and found something just as special. Nier Replicant recaptures that magic, and he'll never forget what Emil, Weiss, and Kaine mean to him. He spent 40 hours with the PS4 version of Nier Replicant (playing on PS5) and saw all of its endings, including the brand-new Ending E. A review code was provided by Square Enix.", "link": "https://www.youtube.com/watch?v=TAW6cUIdsoA", "date_published": "2021-04-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Verdansk '84 Trailer | Call of Duty Warzone", "description": "Check out the all new trailer for the new Call of Duty Warzone Map, Verdansk '84! \n\n#CallofDuty #Warzone #Verdansk84", "link": "https://www.youtube.com/watch?v=s2JTy3Y3DV0", "date_published": "2021-04-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Apex Legends “Northstar” Trailer Easter Eggs You Might’ve Missed", "description": "Ahead Apex Legends Legacy season, Respawn released a new trailer that gave us the backstory of Kairi Imahara, an upcoming legend. Sticking to the themes of legacy, the trailer was packed with references and easter eggs from the Titanfall universe.\nNotes: Ahead of the start of Apex Legends Legacy, Respawn released Northstar, a brand-new trailer that showcased the upcoming season's playable character: Kairi \"Valkyrie\" Imahara. And sticking with the theme of \"legacy,\" the Northstar trailer contains several references to the rest of the Titanfall universe.\n\nIn the video above, Jordan Ramée details all of the Easter eggs and references that we've managed to find in the trailer. Some are rather obvious, like the appearance of Blisk and Rampart. Others, however, are a bit more subtle, like the appearance of several Apex Predators prior to the Battle of Typhon.\n\nAlongside the addition of Valkyrie, Legacy will also introduce a brand-new bow weapon and Olympus map overhaul. The bow, called the Bocek Bow, will be a new mid-range option for Respawn's battle royale. Meanwhile, the pristine look of Olympus will be replaced with an infested metropolis that's filled with plantlife. \n\nApex Legends Legacy is scheduled to begin May 4.", "link": "https://www.youtube.com/watch?v=YRaKYsywGtU", "date_published": "2021-04-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "COD Warzone Nuke Event: The End of Verdansk", "description": "After over a month of waiting, the Warzone's zombies have finally taken over. Join Richie as he plays through the event to find out the fate of Verdansk.\n\nFor more than a month, Zombies have infected Warzone's Verdansk map. Recent blog posts from Activision indicate that all hope is lost and that it's the end of Verdansk as we know it. To find out what's happening, Richie is here to play through the event to find out the fate of Warzone's premiere map.\n\nBeginning in Season 2, the mysterious Vodianoy ship made its way from Rebirth Island to Verdansk. Players in the gulag area began hearing a haunting message from the doomed ship's captain, Rosental. Turns out his ship was infested with zombies and toxic Nova 6 gas. Little by little throughout season 2, zombies began to infect Verdansk. From the gulag to the dam, the infection rate rose from 5%-100%. Players were able to interact with the undead and receive rewards for killing hoards throughout numerous locations.\n\nRecently zombies started to leave behind plague zones that could turn players into zombies themselves. While this was building to something larger, the experience was panned for its slow pace and confusing marketing. Today, we put our theories to rest and find out what's really going to happen to Verdasnk and if it will finally get nuked.", "link": "https://www.youtube.com/watch?v=R2MvTj9cJYM", "date_published": "2021-04-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Life is Strange: True Colors - Alex's Opening Scene", "description": "Alex Chen speaks to her social worker about her time in foster care and the new life ahead of her in this opening scene from Life is Strange: True Colors.", "link": "https://www.youtube.com/watch?v=xo95r8yTbyI", "date_published": "2021-04-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "MLB The Show 21 Review", "description": "MLB The Show 21 maintains the series' continued excellence on the diamond, but missing features and uneven additions hold it back.\n\nRichard has played MLB The Show every year since 2006 when he could only play it on the PSP. He spent 25 hours between the different modes on MLB The Show 21. Review code was provided by the publisher.", "link": "https://www.youtube.com/watch?v=9NOR_YgCvp4", "date_published": "2021-04-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil 4 VR Gameplay Breakdown", "description": "Check out the all new Resident Evil 4 VR Gameplay Breakdown presented by Oculus VR! \n\n#ResidentEvil4 #Oculus #ResidentEvil4VR", "link": "https://www.youtube.com/watch?v=bDYEIN9QlTQ", "date_published": "2021-04-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Returnal Opening Gameplay Livestream", "description": "We get our hands on Returnal early to check out the opening area in the game. Get a glimpse of some different suit upgrades, weapons, enemies and more. Returnal arrives on the PlayStation 5 on 4/30.", "link": "https://www.youtube.com/watch?v=GIl-xl5UJk4", "date_published": "2021-04-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Verdansk Has Been NUKED - Warzone Event Gameplay", "description": "Verdansk is lost. Warzone’s zombie takeover comes to a close in this season-ending event. Watch as we figure out what becomes of Verdansk, and what’s in store for Warzone players.\n\nCall of Duty: Warzone's Verdansk map has been overrun by zombies. With the infestation spreading to 100%, watch how events unfold in Call of Duty's latest event, Operation: Rapid Sunder. In this gameplay, you'll see Warzone players fight to survive expanding plague zones before a nuclear missile inevitably wipes out Verdansk. This limited-time mode falls within a short window of time, so if you weren't able to be there yourself, you're in the right place. \n\nThe nuke event finally kicks off Cold War Season 3 that adds news operators, maps, and weapons to the game. As of this point we're not sure what this nuke means for Verdansk and if we're finally getting the rumored map changes. The next phase of this event takes place on a night version of Rebirth Island where players will unravel the mystery of what just happened. \n\nStay tuned to GameSpot for more coverage of Call Of Duty: Black Ops Cold War and Warzone Season 3 as this event continues to unfold.", "link": "https://www.youtube.com/watch?v=Ni-OYiV7neU", "date_published": "2021-04-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]