[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "7 Things To Get You Started In Biomutant", "description": "Biomutant is a strange game. Filled with poison biomes, weird weaponry, and some bizarre enemies. It can also be a pretty punishing game to begin with so we've put together a few tips to get you started. Everything from combat, crafting, looting, exploration and more.", "link": "https://www.youtube.com/watch?v=g3JtNXivCpU", "date_published": "2021-05-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Biomutant Every Hazard Biome Gameplay (1440p)", "description": "The world of Biomutant is pretty messed up, between the lush fields and forests lie some pretty dangerous places. From Deadzones devoid of oxygen, burned out tundra, poison factories and radiated wastelands. Get a glimpse of 14 minutes of gameplay showcasing the various biomes and different enemies.", "link": "https://www.youtube.com/watch?v=ueHGc_oww3k", "date_published": "2021-05-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Biomutant Review", "description": "Biomutant presents a different take on the post-apocalypse, but a forgettable story and uneven gameplay hold it back.\n\nBiomutant is now available on PS4, Xbox One X, and PC. You can read the full written review by Richard Wakeling on GameSpot.com: https://www.gamespot.com/reviews/biomutant-review-a-flawed-mutation/1900-6417678/", "link": "https://www.youtube.com/watch?v=COotoXMsYRc", "date_published": "2021-05-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Psychonauts is still amazing 16 years later", "description": "16 years later and Psychonauts remains a quintessential classic that is still absolutely worth your time, especially now that it's on Game Pass.\n\n2005 was an eclectic and exciting year for games, with influential titles like God of War, Shadow of the Colossus, Splinter Cell, Resident Evil 4, and last, but not least, Psychonauts. Each one of these games hold a legacy today, but not all of them were a success upon their release. 16 years ago Psychonauts was released to critical acclaim, but was a commercial failure. Today, however, the game has reached cult status, and now has a sequel on the way.\n\nPsychonauts was the debut title from Double Fine, a studio led by LucasArts veteran Tim Schafer -- the mastermind behind Grim Fandango and Full Throttle. While Psychonauts was not an initial success, it has steadily grown in sales over the years thanks to re-distribution on current gen consoles, giving the game a second wind in 2011. \n\nIn 2019 Microsoft acquired Double Fine, and now most of its titles are available on Game Pass, with the most recent entry being Psychonauts. In this video, Kurt Indovina revisits Psychonauts 16 years later, and regales as to why it’s even a miracle that we’re getting a sequel in the first place.", "link": "https://www.youtube.com/watch?v=eIdXHvxzcQc", "date_published": "2021-05-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Revisiting Mass Effect's Many Controversies", "description": "Like with most games, the Mass Effect trilogy has occasionally found itself in the headlines for less than ideal reasons. Here's a timeline of its biggest moments.\n\nMass Effect Legendary Editions is available now on PS4, Xbox One, and PC and includes the first 3 Mass Effect games. At The Game Awards in 2020, Bioware revealed that they were working on a brand new title in the Mass Effect series. For more on Mass Effect Legendary Edition, including our lore videos and our review, stay here on GameSpot.", "link": "https://www.youtube.com/watch?v=vqrGzHNoygA", "date_published": "2021-05-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]