[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Viral origins, last chance saloon", "description": "WHO and viral origins, Link to featured video\nhttps://www.youtube.com/watch?v=E18Jbmz6D1I&t=308s\n\nLink to Wefwafwa’s channel\nhttps://www.youtube.com/channel/UCzsLklGgOttU3Se-WGLp7ow\n(he needs more suscribers)\n\nLink to Patrion to support Wefwafwa’s work in Africa\npatreon:https://www.patreon.com/awmedicalvideos\n\nhttps://www.reuters.com/business/healthcare-pharmaceuticals/who-says-it-may-be-last-chance-find-covid-origins-2021-10-13/\n\nNewly formed advisory group on dangerous pathogens\n\nMike Ryan\n\nThis is our best chance, and it may be our last chance to understand the origins of this virus\n\ntake a step back, create an environment where we can again look at the scientific issues\n\nUrged China to provide data from early cases\n\nChina, no more visits are needed\n\nPrevious WHO team spent four weeks in and around Wuhan\n\nDr Peter Daszak, recused himself from The Lancet's inquiry commission\n\nhttps://www.thelancet.com/journals/lancet/article/PIIS0140-6736(20)30418-9/fulltext\n\nWe stand together to strongly condemn conspiracy theories suggesting that COVID-19 does not have a natural origin. \n\nDr. Tedros Adhanom Ghebreyesus\n\nInvestigation was hampered by a dearth of raw data pertaining to the first days of the outbreak\n\nHas called for lab audits\n\nNew, 26 members, Scientific Advisory Group on the Origins of \n\nNovel Pathogens (SAGO)\n\nMaria van Kerkhove, WHO technical lead on COVID-19\n\nHopes there would be further WHO-led international missions to China,\n\nwhich would engage the country's cooperation\n\nmore than three dozen recommended studies required to determine how the virus crossed from the animal species to humans\n\nReported Chinese testing for antibodies in Wuhan residents in 2019 will be absolutely critical\n\nIncluding analyses of stored blood samples from 2019 in Wuhan\n\nand retrospective searches of hospital and mortality data for earlier cases.\n\nChen Xu, China's ambassador to the UN\n\nConclusions of the joint study were quite clear\n\nAs international teams had been sent to China twice already, it \n\nis time to send teams to other places", "link": "https://www.youtube.com/watch?v=zHazL7-EyDA", "date_published": "2021-10-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Important scientific information with Dr. Pieter Gaillard and John", "description": "Direct link to Pieter’s article with references\nhttps://www.linkedin.com/pulse/astrazeneca-vaccine-pull-back-push-through-pieter-j-gaillard/?trk=pulse-article_more-articles_related-content-card\nLink to Pieter's brain vasculature video from his picture I the background, amazing\nhttps://www.youtube.com/watch?v=9y3AXr8EyG8\nVideo on Pieter's scientific work\nhttps://www.youtube.com/watch?v=k0o-b5JK9bA", "link": "https://www.youtube.com/watch?v=hbjuWs99CrE", "date_published": "2021-10-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]