[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "33 Amazing Ways To Fly In Zelda: Breath of the Wild", "description": "Over the past four years, players have made some unconventional ways to navigate Zelda: Breath of the Wild. Here is a list of 33 amazing ways to launch and fly around the land of Hyrule.\n\nThe world of Breath of the Wild is huge, and the developers have offered many ways for you to travel across the massive landscapes. But over the years players have preferred some less conventional methods by air. So today we'll be covering 33 techniques and some variations of them, small and large, to launch and fly across the land of Hyrule, and do a very light explanation for each, with nothing too in-depth.\n\nIf you want to learn more about BLSS here is our guide:  https://youtu.be/SHFbg9HDxiE\n\n0:00 Intro\n0:30 Stasis Launch\n0:46 Rocket Launch\n1:04 Box Walk\n1:19 Guardian Airship\n1:35 Magnesis Chest Launch\n1:48 Daruk's Perfect Launch\n2:07 Kibako Launch\n2:22 Ladder Launch\n2:44 Horse Slide\n3:03 Cycle Slide\n3:17 Octoballoon Snap Launch\n3:37 Moon Jump\n3:54 Super Soul Launch\n4:21 Flying Chest\n4:36 Flying Machine\n4:48 Flying Machine (With Box)\n5:01 Death Mountain SBR\n5:24 Momentum Transfer\n5:36 Horse Momentum Transfer\n5:54 Bullet Time Bounces\n6:16 Molduga Bounce\n6:31 Hinox Arm Launch\n6:44 Cycle Cryonis Launch\n6:54 Stasis Bounce\n7:15 Cryonis Bounce\n7:34 Bomb Launch\n7:59 Windbomb\n8:16 Bullet Time Windbomb\n8:33 Midair/Linear Windbomb\n8:47 Vertical Windbomb\n9:00 Spider Windbomb\n9:12 Bomb Arrow Windbomb\n9:21 Bow Lift Smuggling Slide\n9:42 Outro", "link": "https://www.youtube.com/watch?v=nl8j6aug1sM", "date_published": "2021-10-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "DC FanDome 2021 Livestream", "description": "Tune into DC FanDome 2021's Live stream! DC FanDome is DC's free global virtual fan event featuring a live webcast and activities, for one day only, where you'll get to see DC's biggest movies, games, shows, comics and more and get up close and personal with the people behind the characters and worlds we love. With exclusive reveals, behind the scenes looks, fan celebrations and can’t-miss moments, you’ll want to be sure you’re here on October 16 to catch all the action! We'll get to see a new Batman trailer, more from Gotham Knights and Suicide Squad: Kill the Justice League, more on Titans, and more. \n\nJoin us on October 16th at 10am PDT/ 1pm EDT as the show will run for roughly 4 hours.\n\n#DCFandome #Batman #DC", "link": "https://www.youtube.com/watch?v=fMMeDzsApDU", "date_published": "2021-10-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Battlefield 2042 Beta’s Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of the Battlefield 2042 Beta, including the KRISS Vector submachine gun, and the SIG MCX Spear.\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of the Battlefield 2042 Beta and compares them to their real-life counterparts.\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020", "link": "https://www.youtube.com/watch?v=u6SzbVSbmoo", "date_published": "2021-10-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Gotham Knights Court of Owls Behind The Scenes Trailer", "description": "Get a behind-the-scenes look at Gotham Knights from DC FanDome 2021. Hear from Jim Lee, Scott Snyder, Greg Capullo, Patrick Redding and Ann Lemay who all expand on the Courts of Owls origins, lore and inspiration in bringing this elusive enemy to the interactive world of Gotham Knights. \n\nPlay as Batgirl, Nightwing, Red Hood and Robin in Gotham Knights. They represent the new guard trained to protect Gotham after the death of Batman. \n\n#GothamKnights #CourtofOwls #DCFanDome", "link": "https://www.youtube.com/watch?v=wfUV7nqKHZI", "date_published": "2021-10-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Gotham Knights Court of Owls Official Story Trailer", "description": "Learn more about Gotham Knights in this new story trailer released at DC FanDome 2021. Learn more about Gotham Knight's main antagonist, the fabled Court of Owls, a secret society made up of Gotham City’s wealthiest families. The trailer also introduces Oswald Cobblepot (aka The Penguin), the infamous DC Super-Villain who seemingly knows important details about this omnipresent silent predator and the threat it poses to Gotham and its new protectors: Batgirl, Nightwing, Red Hood and Robin.\n\nPlay as Batgirl, Nightwing, Red Hood and Robin in Gotham Knights. They represent the new guard trained to protect Gotham after the death of Batman. \n\n#GothamKnights #CourtofOwls #DCFanDome", "link": "https://www.youtube.com/watch?v=HN5uNxcHG48", "date_published": "2021-10-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Minecraft Live 2021", "description": "Minecraft Live 2021 will be filmed live and beamed across the world via the internet! The show is packed with juicy Minecraft news, content creators, and will include a pre-show and community vote to actually influence the game! The show goes live on October 16, noon EDT.\n\nFind out who wins the fan vote for the next new mob to join the Minecraft Universe!\n\n#Minecraft", "link": "https://www.youtube.com/watch?v=5o04TMISohc", "date_published": "2021-10-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Minecraft Live 2021 Full Presentation", "description": "Check out the full Minecraft Live 2021 presentation brought to you by Microsoft and Mojang. Learn more about the changes coming to the game, to Minecraft Dungeons, and which new mob will be added to the game!\n\n#Minecraft", "link": "https://www.youtube.com/watch?v=pip-WZYhJqg", "date_published": "2021-10-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Suicide Squad: Kill The Justice League Official Story Trailer", "description": "Get your first look at Suicide Squad: Kill The Justice League's story in the latest trailer debuted at DC FanDome 2021. \n\nThe brand-new story trailer sheds light on the origins of Amanda Waller’s infamous Task Force X (a.k.a. the Suicide Squad) as Harley Quinn, Deadshot, Captain Boomerang and King Shark begrudgingly embark on their mission to take down the World’s Greatest DC Super Heroes, The Justice League. Travel through an expansive open-world Metropolis. Suicide Squad: Kill the Justice League puts four DC Super-Villains on a collision course with an invading alien force and DC Super Heroes who are now laser-focused on destroying the city they once vowed to protect. \n\nSuicide Squad: Kill the Justice League will be available worldwide in 2022 on PlayStation 5, Xbox Series X|S and PC.\n\n#SuicideSquadKilltheJusticeLeague #DCFanDome", "link": "https://www.youtube.com/watch?v=Aytlx2lW3Jw", "date_published": "2021-10-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]