[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "JAMBINAI: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nBob Boilen | July 9, 2021\nI don't think I've ever used the word \"fierce\" to describe a Tiny Desk, but that's precisely what JAMBINAI has created in this (home) concert. The show begins in front of a massive recreation of my desk and what happens next ... well, no spoilers here. Filmed in an immersive media art museum created by an organization known as d'strict on Jeju Island, this Korean band contains multitudes. At its heart, JAMBINAI's music mixes elements of metal, noise and Korean tradition. There's full-on distorted guitar, bass and drums, but also a haegeum (a fiddle-like instrument), a piri (a type of flute), a taepyeongso (a reed instrument) and a most appropriately named instrument, a geomungo (a giant Korean zither). We also hear some delicate vocals in the mix.\n\nThe two pieces performed here include 2015's \"Time of Extinction\" and the more recent and epic \"ONDA.\" I last saw JAMBINAI on two consecutive nights at SXSW in 2014 and then again at the 2021 virtual festival. It reminded me of their intensity and originality, and I look forward to the day when they come and play a more modest, tinier desk and, perhaps, shake the shelves.\n\nSET LIST\n\"Time Of Extinction\"\n\"ONDA\"\n\nMUSICIANS\nIlwoo Lee: guitar, piri, taepyeongso, saenghwang, vocals\nBomi Kim: haegeum, vocals\nEunyong Sim: geomungo, vocals\nByeongkoo Yu: bass, chorus\nJaehyuk Choi: drums, chorus\n\nCREDITS\nDirector: Jinho Park\nProducer: Hyunggun Kim (The Tell-Tale Heart)\nVideo Production: DEEPCUT\nD.O.P: Hanhee Cho\nProduction Assistant: Younggyun Lee\nAudio Recording: Minjae Lee (ssplworkz)\nAudio Mixed and Mastered: Sanghyun Cho (M.O.L STUDIOS)\nMedia Art Installation: d'strict\nSpecial thanks to Stella Heesun Suh (KOCCA), Victor Eun Suk Choe (d'strict), Yunjung Yeum (d'strict), Sangwoo Lee (d'strict)\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Maia Stern\nAudio Mastering: Andy Huether\nAssociate Producer: Bobby Carter\nTiny Production Team: Kara Frame, Josh Rogosin, Gabrielle Pierre\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #jambinai", "link": "https://www.youtube.com/watch?v=wEk0YlYEJAE", "date_published": "2021-07-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Black Motion: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nAbby O'Neill | July 8, 2021\nBlack Motion's Tiny Desk (home) concert, recorded at the former residence of Nelson Mandela, feels like a spiritual sound bath. The South African production duo turntablist Bongani Mohosana of the Zulu tribe and percussionist Thabo Mabogwane of Sotho tribe — open their set with \"Mayibuye iAfrica,\" a cry for Africa to return to its culture and history.\n\nThis Afro-House set is brought to life thanks to several featured vocalists and guest musicians. Afro-House has spread joy and healing across the country of South Africa, transcending local boundaries to become a thriving global dance phenomenon. In my experience, Its indigenous sounds and percussive rhythms drench the soul and heart with healing powers and cultivate communion with the infinite.\n\nSouth African singer Msaki makes her third appearance in our (home) concert series, after earlier credits with Black Coffee and our Coming 2 America special. She lends her vocals to \"Marry Me,\" a soulful jam from Black Motion's 2020 album, The Healers: The Last Chapter. \"Imali,\" featuring Nokwazi, soothes the lingering remnants of pandemic fears, while Tabia closes with the lilting \"Prayer for Rain.\"\n\nSET LIST\n\"Mayibuye iAfrica\"\n\"Rainbow\"\n\"Joy Joy\" (feat. Brenden Praise)\n\"Marry Me\" (feat. Msaki)\n\"Imali\" (feat. Nokwazi)\n\"Prayer For Rain\" (feat. Tabia)\n\nMUSICIANS\nThabo Roy Mabogwane: percussion, producer\nBongani Mohosana: DJ, producer, music director\nBrenden Praise: vocals\nMsaki: vocals\nNokwazi: vocals\nTabia: vocals\nAlmotie \"Alie-keyz\" Mtombeni: keys, synths, vocoder, auto-vocals, piano\nLifa \"Sir_Lifa\" Mavuso: guitar\nSiyabonga Hosana Magagula: bass, synth, bass\nLusindiso \"Jojo\" Zondani: backing vocals, tenor\nGugu Shezi: backing vocals, soprano\nNoxolo Radebe: backing vocals, alto\n\nCREDITS\nVideo: \nNS Production (Sakhile Fakude, Zolani Phakade and Ndumiso Buthelezi)\nMoses N Mokgoko \nThamsanqa Fakazi \n\nAudio: \nKatlego Katt Masoga\nBodega Bros ( Vukile Nonkonyana and Thina Fonya)\n\n\nTINY DESK TEAM\nProducer: Abby O'Neill\nVideo Producer: Maia Stern\nAudio Mastering: Andy Huether\nAssociate Producer: Bobby Carter\nTiny Production Team: Bob Boilen, Kara Frame, Josh Rogosin, Gabrielle Pierre\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #blackmotion", "link": "https://www.youtube.com/watch?v=plMNAPdAyPY", "date_published": "2021-07-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]