[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Among Us Airship Clips of the Week", "description": "With a new map comes a whole new world of deception. Join Persia as she rounds up the best community clips of the week in Among Us on the brand new map, the Airship! From some of your favorites on Twitch to an epic acapella group called MayTree, we've got it all to start your week right.\n\nCheck out the links below to see all of our featured clips:\nhttps://www.twitch.tv/tinakitten/clip/NaiveEphemeralAardvarkOMGScoots-zhu0XWzfluz4hg9c\n\nhttps://www.twitch.tv/dakotaz/clip/ScaryGlamorousCardDoritosChip--3GRopdjKncCobdf\n\nhttps://www.twitch.tv/ludwig/clip/WrongCoweringPoxGivePLZ-lKKufKy8WexRWndW\n\nhttps://www.twitch.tv/sleepy/clip/ElatedYummyReindeerSSSsss-HWAnOpas0CaZTi5Y\n\nhttps://www.twitch.tv/fuslie/clip/NeighborlyLaconicClamNotLikeThis-ChXj5wmcyvWF4BYl\n\nhttps://www.youtube.com/watch?v=XeZOof2FxTg\n\nhttps://www.youtube.com/watch?v=o6aeXTf5nOo\n\nhttps://youtu.be/012NtpkZETg?t=790\n\nhttps://www.twitch.tv/stevesuptic/clip/ResoluteVictoriousLampSquadGoals-YAYH0ZM9cdJSHpPA\n\nhttps://www.twitch.tv/fuslie/clip/StrangeUninterestedChoughDBstyle-N4lQx8PImlOVAYhp\n\nhttps://www.twitch.tv/loserfruit/clip/GeniusScaryVultureSmoocherZ-2x87zhjMTtRkMEIC\n\nhttps://www.twitch.tv/dakotaz/clip/BlatantApatheticSnakeCharlietheUnicorn-MNbMyksMyvTv_bWI\n\nhttps://www.twitch.tv/junkyard129/clip/SavoryManlyFerretTheRinger-emsY-kIhaGbmQx4T?filter=clips&range=7d&sort=time\n\nIn this video, Persia is back with another round-up of the best community clips of the week! A brand new map has been added to everyone's favorite deception game - Among Us! The Airship has everyone back on Among Us and ready to go through more chaos.\n\nFrom some of your favorite Twitch streamers like Fuslie meeting an extremely unfortunate fate of dying twice within a few seconds, to an acapella group called MayTree performing magic by recreating the iconic sound effects from the game with just their voices. Tons of funny moments, would-be epic plays, and even smash bros inspired kill animations are all packed and ready to start your week a little less sus. \n\nSubmit your own funny gaming moments to us on Twitter! Tag @persia_xo and @GameSpot in your clip for a chance to be featured!", "link": "https://www.youtube.com/watch?v=V-A4gIrGJtA", "date_published": "2021-04-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "E3 Is Back, But PlayStation Isn't", "description": "With the official confirmation from The ESA that E3 2021 will be a free online digital event, Lucy, Tamoor, and Jordan discuss the future of the gaming show and what to expect this summer. \n\nIt's official: E3 2021 is happening and it's going to be a free online event for everyone to enjoy. The ESA has released a list of the publishers that will be taking part, and it makes for an interesting read.\n\nWith so many publishers having their own digital events and showcases, do publishers even need E3? This sounds like a question for the Console Crew! Tamoor, Jordan, and Lucy got together to discuss the news in this week's episode. In particular, they talk about Sony's absence and Xbox's inclusion in the huge summer event. They also discuss the future of E3 and the show's hopes of being an in-person event in 2022.\n\nFor all the latest gaming news, make sure to keep an eye on GameSpot, or consider subscribing to our channel, youtube.com/GameSpot, for all the latest from the world of video games.", "link": "https://www.youtube.com/watch?v=xBhuNg2DMJI", "date_published": "2021-04-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Fortnite - The Recycler Two-Handed Heavy Weapon", "description": "Check out the all new video from Epic Games and Zeke at Fortnite breaking down the new two-handed weapon, The Recycler! \n\nYou can now support GameSpot in the Fortnite Item shop using code \"gamespotrv\"! \n\n#Fortnite #TheRecycler #Gaming", "link": "https://www.youtube.com/watch?v=diVPA_CM4Ts", "date_published": "2021-04-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Apparently, I'm An Xbox Bro Now", "description": "The Xbox's identity has come a long way over the years, from being the system Kurt Indovina had zero interest in, to his console of choice... but how did this happen?", "link": "https://www.youtube.com/watch?v=Kk4hZB3Fhps", "date_published": "2021-04-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Elgato Wave Panels | Is it Worth $100?", "description": "Elgato Wave Panel: https://bit.ly/2Q1eSSh\nElgato Wave 3: https://bit.ly/3fJPdsj\nElgato HD60S: https://bit.ly/3fJYdha\nElgato Key Light: https://bit.ly/31PkcuM\n\nWe got the new El Gato Wave panels so we put them to the test to see if they are worth $100 dollars and also how much better your audio sounds with them.\n\nElgato wants to be the company that sells you everything you could possibly need for your at home streaming setup. Capture cards, microphones, lights, and now acoustic paneling of all things. You know, the stuff you attach to your wall to improve the sound quality of your room.\n\nThese are the Elgato Wave panels, not to be mixed up with the Wave, which confusingly is also the name of their brand of microphones. For $100 USD you get the starter pack of 6 wave panels, a not insignificant amount of money to be spending, especially when you can buy generic acoustic foam much cheaper. Elgato sent us a pack to try out so in this video we’re gonna breakdown what you’re getting for that added price, how the setup works, and if these actually make enough of a difference in acoustics to be worth buying.", "link": "https://www.youtube.com/watch?v=UoYP_Lwil84", "date_published": "2021-04-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]