[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Tiny Desk Meets SXSW: Yasser Tejeda & Palotré", "description": "Every year, NPR Music participates in the SXSW music festival, whether it's curating a stage or simply attending hundreds of shows at the annual event in Austin, Texas. Last year, the festival was canceled due to the pandemic, but it returned this March as an online festival. We programmed a 'stage' of Tiny Desk (home) concerts and presented them on the final day of the festival. Now, we present to you Tiny Desk Meets SXSW: four videos filmed in various locations, all of them full of surprises.\n\nFelix Contreras | April 6, 2021\nIf only I could have experienced Yasser Tejeda and Palotré at one of the bars along Austin's Sixth Street. Tejeda, a New York-based guitarist from the Dominican Republic, started his musical career on the Dominican cuatro (a folkloric guitar-like instrument) and has incorporated guitar stylings that have made him a \"go-to guy\" for Dominican artists looking for passionate elegance in their sound.\n\nYasser Tejeda and his band Palotré begin their set behind a home desk with \"Amor Arrayano,\" weaving a vaguely Caribbean feel with a killer R&B hook. After a brief introduction of his bandmates Tejeda launches into \"La Culebra,\" the track that caught my attention from their album Kijombo. Palotré is a powerful groove machine behind Tejeda's virtuosic guitar playing and his playful dance moves.\n\nTejeda has stated one of the goals of this project is to explore the crossroads between Afro-Dominican musical traditions with anything else that pops onto their radar. Their final song here,\"Nuestras Raices,\" has become one of my favorites because I hear the essence of Africa mixed with jazz and maybe a hint of heavy metal, as Tejeda steps on his distortion pedal to kick the band into overdrive with guest tenor saxophonist Mario Castro in tow.\nI won't spoil the surprise, but be sure to stay until the end.\n\nSET LIST\n\"Amor Arrayano\"\n\"La Culebra\"\n\"Nuestras Raíces\"\n\nMUSICIANS\nYasser Tejeda: guitar, vocals\nJonathan \"Jblak\" Troncoso: percussion, vocals\nVictor Otoniel Vargas: drums, vocals\nKyle Miles: bass\nMario Castro: tenor sax\n\nCREDITS\nVideo: Andreas Hofweber\nAudio: Quinn McCarthy\nStylist and Set Designer: Jill Peacock\n\nTINY DESK TEAM\nProducer: Felix Contreras\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Bob Boilen, Kara Frame\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #yassertejeda", "link": "https://www.youtube.com/watch?v=C9fMzxICTjU", "date_published": "2021-04-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Tiny Desk Meets SXSW: Steady Holiday", "description": "Every year, NPR Music participates in the SXSW music festival, whether it's curating a stage or simply attending hundreds of shows at the annual event in Austin, Texas. Last year, the festival was canceled due to the pandemic, but it returned this March as an online festival. We programmed a 'stage' of Tiny Desk (home) concerts and presented them on the final day of the festival. Now, we present to you Tiny Desk Meets SXSW: four videos filmed in various locations, all of them full of surprises.\n\nBob Boilen | April 5, 2021\nWe've posted close to 200 Tiny Desk (home) concerts in this insane pandemic year. Few have made me smile and laugh out loud as much as this one from Steady Holiday. I'll stop with the spoilers now.\n\nSteady Holiday is the music of Dre Babinski. This video, filmed for our virtual SXSW showcase, finds her by the fireplace, a dog at her feet, an acoustic guitar in her arms. Steady Holiday is singing \"Living Life,\" a tune about a favorite topic of mine: the everyday, the mundane, and living in the moment. All the songs in this Tiny Desk (home) concert are from Steady Holiday's 2021 album Take The Corners Gently, a top album of mine this year. Laughing while her dog grabs a chew toy, she performs the album's opening track, \"White Walls,\", a song about self-reflection and how doing the same thing over and over (\"painting white walls white\") won't make life better.\n\nAs her printer cues the last song, (oops, small spoiler), Steady Holiday takes us out on a lovely tune, \"Love Me When I Go To Sleep\": \"Fragile aren't we, who would guess / Here today, tomorrow's taking bets.\" Her refrain amplifies that fragility with a reminder to appreciate the gift of life. \"Love me when I go to sleep / Love me with no certainty / Love me when I go to sleep.\"\n\nSET LIST\n • \"Living Life\"\n • \"Tangerine\"\n • \"White Walls\"\n • \"Love Me When I Go To Sleep\"\n\nMUSICIANS\n • Dre Babinski: vocals, guitar\n • Derek Howa: keys\n • Brijesh Pandya: drums, vocals\n\nCREDITS\n • Video: Isaac Ravishankara, Drew Bienemann, Derek Hansen, Zack Hetlage\n • Audio: Chris Hackman, Dave Pizzimenti\n • Color: Derek Hansen, Zack Hetlage\n\nTINY DESK TEAM\n • Producer: Bob Boilen\n • Video Producer: Maia Stern\n • Audio Mastering: Josh Rogosin\n • Associate Producer: Bobby Carter\n • Tiny Production Team: Kara Frame\n • Executive Producer: Lauren Onkey\n • Senior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #steadyholiday", "link": "https://www.youtube.com/watch?v=wNy-HJXcFho", "date_published": "2021-04-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]