[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "19 Minutes of Elden Ring Gameplay Preview", "description": "Elden Ring unveils 19 minutes of gameplay showing various slices of gameplay. First off it shows a fight against a large dragon in an open field, Later on we learn more about the various Elden Ring weapons, and fighting mechanics. They showcase the spirit summoning in Elden Ring, and also co-op multiplayer. We also get a glimpse of the dungeons that you'll get to explore in Elden Ring that are filled with enemies and a boss. We even get a glimpse of one of the Demigod Bosses Godrick The Golden.\n\n#EldenRing", "link": "https://www.youtube.com/watch?v=FrXy4fARXns", "date_published": "2021-11-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty Vanguard - Early Launch Livestream", "description": "Call of Duty: Vanguard is almost here! Join Richie as he plays through the game in our early access livestream.", "link": "https://www.youtube.com/watch?v=fIK0uRhczqo", "date_published": "2021-11-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Vanguard - First 13 Minutes of PS5 Gameplay", "description": "Call of Duty: Vanguard's opening mission introduces us to Task Force One on their first mission to hijack a train. Let's take a look at the campaign being played on Veteran difficulty. \n\nCall of Duty Vanguard releases on November 5th, 2021 on Xbox Series X and Series S, PlayStation 4, PlayStation 5, Xbox One, Microsoft Windows.\n\n#CallofDuty", "link": "https://www.youtube.com/watch?v=g29DEk0-99c", "date_published": "2021-11-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Vanguard - Lady Nightingale Mission Gameplay", "description": "Call of Duty: Vanguard gives us an early look at the \"Lady Nightingale\" mission before the official November 5th launch! Check out Call of Duty streamer Courage, accompanied by a live orchestra, play as Polina Petrova and her brother Misha as they make their way through across a vast snow-covered field surrounded by German snipers.", "link": "https://www.youtube.com/watch?v=O1eJukQksa0", "date_published": "2021-11-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Vanguard - World Premiere Zombies Cinematic", "description": "Call of Duty: Vanguard reveals its opening Cinematic for its Zombies mode. Zombies will launch with Vanguard on November 5th, however, the Easter Egg quest will go live with the launch of season 1 on December 2nd.", "link": "https://www.youtube.com/watch?v=DLtCx6ljJT4", "date_published": "2021-11-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Warzone - Pacific Map Cinematic", "description": "During Call of Duty: Vanguard's launch event, we got some more information about Warzone's future Pacific map, Caldera.", "link": "https://www.youtube.com/watch?v=QxrCotPujOE", "date_published": "2021-11-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "ELDEN RING 15 Minute Gameplay Preview Livestream", "description": "Tune in at 3 PM CET/7 AM PDT on November 4th for a 15-minute Elden Ring Gameplay Preview. Countdown begins at 2:45 PM CET / 6:45 AM PDT.", "link": "https://www.youtube.com/watch?v=30zvFqyLFK8", "date_published": "2021-11-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Forza Horizon 5 Review", "description": "Alessandro explored ancient ruins in a McLaren F1, jumped sand dunes in an Ariel Nomad, and took a breezy seaside drive in a VW California Coast for 20 hours with Forza Horizon 5. Review code was provided by Microsoft.\n\nForza Horizon 5 releases on November 9th on Xbox Series X and Series S, Xbox One, Microsoft Windows.", "link": "https://www.youtube.com/watch?v=wb626AtcObw", "date_published": "2021-11-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New Elden Ring Gameplay + Details Revealed! | GameSpot News", "description": "In this episode of GameSpot News, we talk about the Elden Ring gameplay reveal and how you can play it early, Animal Crossing: New Horizons 2.0 update releasing early and the delay of EA’s PGA Tour, Marvel’s Midnight Suns, and Sol Cresta. \n\nIn this video, DeVante talks about the extended look at Elden Ring gameplay. In the footage, we see the game’s location “Lands Between” and its map, combat, summoning, PvP invaders and dungeons. \n\nDeVante also talks about the Animal Crossing: New Horizons 2.0 update going live ahead of its November 5, 2021 release. The early update was reported across social media, when players received a surprise prompt to update the game after logging in.  \n\nLater in the video, EA’s PGA Tour, Marvel’s Midnight Suns, and Sol Cresta are delayed.", "link": "https://www.youtube.com/watch?v=fh2SlRtKTa8", "date_published": "2021-11-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Riders Republic Review", "description": "Riders Republic is a thrilling, approachable, and incredibly varied extreme sports game, featuring an awe-inspiring open world that impresses with both its scale and diversity.\n\nRiders Republic released on October 28, 2021 on PlayStation 4, PlayStation 5, Xbox One, Xbox Series X and Series S, and Microsoft Windows.", "link": "https://www.youtube.com/watch?v=WxRfD0fNQ3s", "date_published": "2021-11-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Shin Megami Tensei V Review", "description": "Shin Megami Tensei V may be slow-paced, but its strategic turn-based combat and dark, foreboding atmosphere deliver a challenging and rewarding RPG experience.", "link": "https://www.youtube.com/watch?v=-Jz-5g1jeFA", "date_published": "2021-11-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 New Portal Gameplay", "description": "Get an all brand new look at Battlefield 2042's Portal Gameplay in this latest trailer. Create and play Battlefield the way you want to.\n\n#Battlefield2042", "link": "https://www.youtube.com/watch?v=8btI7myXgO0", "date_published": "2021-11-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Vanguard World Premiere ft. Migos, #LilsVsBigs and more", "description": "Tune in November 3rd at 6pm PDT for the World Call of Duty: Vanguard Premiere with VERZUZ. \n\nStarting off will be a showcase of the Vanguard Campaign, followed by a multiplayer showdown between Lils and Bigs. Plus an exclusive first look at Zombies and Call of Duty Warzone Pacific.", "link": "https://www.youtube.com/watch?v=ulBe5t-yRw0", "date_published": "2021-11-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New Battlefield Portal Gives Us ALL The Options | GameSpot News", "description": "In today’s GameSpot News, Persia talks about the new Battlefield Portal details, Elden Ring gameplay that’s coming November 4th, and more. \n\nBattlefield Portal details have been revealed and it will give players the chance to create the Battlefield experiences of their dreams with content from Battlefield 3, Battlefield Bad Company 2, Battlefield 1942, and 2042 available to choose from. Gameplay modes, maps, weapons, UI, AI, and more can all be tuned to your liking. \n\nBandai Namco will show off more of From Software's eagerly awaited RPG Elden Ring on November 4th, 2021. It will air at 7 AM PT / 10 AM ET and you can watch the footage on YouTube and Twitch.\n\nAs announced in its latest quarterly earnings, Activision Blizzard has delayed the releases of both Overwatch 2 and Diablo 4, two of Blizzard's most anticipated upcoming titles. In another part of the investor presentation, Activision Blizzard noted that the Overwatch League will still play an early build of Overwatch 2 starting next spring. \n\nAnd in case you didn’t know, a new category has been added to Twitch called “Animals, Aquariums, & Zoos”. This week is Animal Week and Twitch is partnering with select groups to raise awareness for the conservation of wildlife.\n\nFor more information on all of our topics, please visit gamespot.com\n\nTIMESTAMPS:\nIntro - 00:00\nBattlefield 2042 - 00:10\nElden Ring - 02:03\nOverwatch 2 & Diablo 4 - 02:52\nCute Animals & Outro - 04:14", "link": "https://www.youtube.com/watch?v=rkaWzL323g0", "date_published": "2021-11-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Uncharted 3 Is Still The Most Important Entry 10 Years Later", "description": "What makes Uncharted 3: Drake’s Deception the most important game in the series? DeVante Chisolm takes a look at how Uncharted 3 lived up to its predecessor, what it did for the franchise and how it holds up in a post-Uncharted 4 world.\n\nNovember 1st, 2021, marks the 10th anniversary of Uncharted 3: Drake’s Deception and even though Uncharted 2 and 4 are widely held up as the best in the series, Uncharted 3 is the most important for Nate’s development. If each game boils down to searching for treasure, then Uncharted 3 was the first to include the subtext of Nate searching for himself. \n\nIn this videos, DeVante celebrates the anniversary of Nathan Drake’s third adventure and revisits Uncharted 3 to see what makes it so special. \n\nUncharted 3 originally released on PS3 in 2011, but is now available on PS4/PS5 via The Nathan Drake Collection. The game will also come to PC in early 2022 via the Uncharted: Legacy of Thieves Collection.\n\nTIME STAMPS:\n00:00 - INTRO\n01:13 - Among Success\n02:46 - Drake’s Development\n07:27 - A Video’s End\n09:29 - OUTRO", "link": "https://www.youtube.com/watch?v=J2YntvBGNL0", "date_published": "2021-11-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]