[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "Is GNOME user friendly?", "description": "Download Safing's Portmaster for FREE and take control of your network traffic: https://safing.io/portmaster\n\nGet your Linux desktop or laptop here: https://slimbook.es/en/\n\nToday, we're going to start a new series, exploring each desktop environment, and seeing if we could call them \"user friendly\", or not. We'll begin with GNOME, one of the most interesting to study, because it doesn't do things as other, more well known desktop experiences.\n\n00:00 Intro\n01:21 Methodology\n02:08 GNOME for pure beginners\n07:10 GNOME for Windows Users\n10:28 GNOME for Mac Users\n13:31 So, is it User Friendly?\n\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nJoin us on our new Discord server: https://discord.gg/xK7ukavWmQ\nTwitter : http://twitter.com/thelinuxEXP\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\nFollow me on ODYSEE: https://odysee.com/@TheLinuxExperiment:e\nOr join ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\n\n##  Fresh new user\n\nLet's put ourselves in the shoes of a hypothetical person that gets handed their first computer running GNOME.\n\n\n\n### Desktop\nFor someone who never used a computer before, GNOME is really simple: the only thing you'll see out of the box is the top bar, so you can't really get lost.\n\n### Applications\nIn terms of apps, GNOME couldn't be more simple. Even someone who never used a computer before will be able to understand what things do. \nYou don't get overwhelming menu bars, toolbars, or extensive preferences: it's all super streamlined and simple to figure out.\n\nThe GNOME headerbar style is, IMO, an excellent way to make sure your app is simple and easy to understand.\n\n### Store\nHere, GNOME Software does its job very nicely as well. The 3 tab layout, with \"Explore / Installed and Updates\" explains very simply what you can do. A few recommended apps might not be what you're looking for, but it also focuses the user on the fact that, yes, this thing lets them find apps. It's all rooted in familiarity.\n\n\n\n## For a Windows user\n\nNow, for someone who is used to Windows, vanilla GNOME is a lot more confusing. The conventions you're used to just don't apply here: you don't get a taskbar, or a menu, all the desktop components are located on the top of the screen, not the bottom.\n\nYou'll probably try and use alt + tab, which works here as well, but managing your windows and starting applications will probably be a learning process.\n\nThe applications will also probably feel weird to use: no titlebar, and no menubar.\n\nInteracting with your windows is also going to be trickier: no maximise button, no minimize button. Minimization doesn't exist in GNOME, and I'm pretty sure people who are used to windows will find that extremely disconcerting.\n\n\nThe software installation method will be familiar to people used to windows 10 or using the windows 11 beta: you get an app store, you click install, and everything works. You also get your updates here, nothing too complex.\n\nIn that sense, I wouldn't say GNOME is friendly to windows users: the experience is just too different, the concepts too alien compared to the good old taskbar and menu combo.\n\n### Mac User\n\nFor someone moving from mac OS, GNOME might feel a little bit more familiar. I often read that GNOME 40 copied Mac OS, and while that's really a stretch, there are still some similar concepts.\n\nA Mac user will quickly understand that the \"Activities\" view is basically like the Spaces view + exposé on macOS. They'll figure out the dock quickly, because that's what they know.\n\nThe top bar with the time, indicators, and activities button will also be pretty familiar to a mac user.\n\nThe lack of a global menubar, or of a menubar at all will probably be jarring at first, especially since you still get the name of the app that's currently running.\n\nThe app grid will be very reminiscent of the full screen app launcher from mac OS.\n\nUsing the apps themselves will be a familiar experience: no in-window menubar, and headerbars are concepts that mac OS uses more and more over time.\n\nThe lack of maximize and minimize buttons will probably confuse a mac user, though, and the position of the close button won't be familiar either.\n\nIn terms of installing apps, GNOME software won't be too alien to people who use the mac app store, but for those who hunt for apps online, the install process will be vastly different.\n\nGNOME is definitely going to be easier to grasp for mac users than for windows users: the base concepts of the app grid, the activities view, the workspaces, and the headerbars are all going to be super familiar. Window management will be a bit trickier though.", "link": "https://www.youtube.com/watch?v=-gfYlcddixo", "date_published": "2021-08-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]