[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Latest data, looking good", "description": "Full summary in the first few minutes of this video, its good news\n\nexamination of the 166 patients admitted since the Omicron variant arrived\n\nsnapshot of the clinical profile of 42 patients \n\ncurrently in the COVID wards at SB\n\nThe majority of hospital admissions are for diagnoses unrelated to COVID-19. \n\nThe SARS-CoV-2 positivity is an incidental finding in these patients and is largely driven by hospital policy requiring testing of all patients requiring admission to the hospital.\n\n76% of patients are incidental COVID admissions.\n\nThis very unusual picture is also occurring at other hospitals in Gauteng. \n\nThe high proportion of COVID incidental admissions\nmay reflect higher rates of community transmission compared to previous waves (variants)\n\nthat is not translating into higher admission rates for a primary COVID-19 diagnosis. \n\nTshwane District Omicron Variant Patient Profile - Early Features\n\n4th December\nhttps://www.samrc.ac.za/news/tshwane-district-omicron-variant-patient-profile-early-features\n\nThere has been a significant rise in new SARS-CoV-2 infections in the Gauteng Province in the last four weeks\n\nwhich has been attributed to Omicron variant announced on 24 November 2021\n\nThe first cases of Omicron were detected in the Tshwane District\n\nThe City of Tshwane Metropolitan Municipality is the metropolitan municipality that forms the local government of northern Gauteng Province, South Africa\n\nThe Metropolitan area is centred on the city of Pretoria with surrounding towns and localities\n\npopulation of 2,708,702 people \n\nThis is where the 4th wave started\n\nTshwane has been the global epicentre of the Omicron Outbreak\n\ncases rising exponentially over several weeks\n\n41,921 cases by 3 December\n\n29 November to 3 December 2021\n\nCases + 9,929 reported in Tshwane\n\nSteve Biko/Tshwane District Hospital Complex in Pretoria\n\nin the heart of the Tshwane District\n\nstatistics presented by the Gauteng Department of Health on 2 December 2021\n\nfor the province as a whole, \n\nand with admissions across all public and private hospitals in Tshwane\n\nwe have seen a sharp rise in admissions\n\nBetween 14th and 29th November 2021\n\n166 new admissions\n\nPatient information presented here only represents the first two weeks of the Omicron wave in Tshwane\n\nThe clinical profile of admitted patients could change significantly over the next two weeks, \n\nby which time we can draw conclusions about the severity of disease with greater precision.\n\nThe main observation that we have made over the last two weeks is that the majority of patients in the COVID wards have not been oxygen dependent. \n\nSARS-CoV-2 has been an incidental finding in patients that were admitted to the hospital for another medical, surgical or obstetric reason.\n\nA snapshot of 42 patients in the ward on 2 December\n\n29 (70%) are not oxygen dependent\n\nThese patients are saturating well on room air,\n\nand do not present with any respiratory symptoms. \n\n‘incidental COVID admissions’ \n\nhaving had another medical or surgical reason for admission. \n\nThirteen (13) patients are dependent on supplemental oxygen\n\nof which nine (21%) have a diagnosis of COVID-19 pneumonia\n\nAll are being prescribed steroids as the mainstay of therapy. \n\nThe remaining 4 patients are on oxygen for other medical reasons\n\nThis is a picture that has not been seen in previous waves. \n\nPast 3 waves\n\nonly been a sprinkling of patients on room air in the COVID ward\n\nThe numbers of patients in high care on double oxygen, High Flow Nasal Oxygen or non-invasive ventilation (NIV) were noticeably higher in previous waves. \n\nThis is anecdotal but confirmed by numerous clinicians who have previously worked in the COVID wards in the hospital complex.\n\nOf 38 adults in the COVID wards on 2 December\n\n6 were vaccinated\n\n24 were unvaccinated\n\n8 had unknown vaccination status\n\nOf 9 patients with COVID pneumonia\n\n8 are unvaccinated\n\n1 is a child \n\nOnly a single patient on oxygen was fully vaccinated but the reason for the oxygen was Chronic Obstructive Pulmonary Disease.\n\nAn analysis of 166 patients admitted 14 -29 November 2021\n\n80% of admissions were below the age of 50 years\n\n19% were children aged 0-9 years\n\n28% of total admissions, 30-39 years\n\nIn-hospital death rate\n\n10 deaths in the SBAH/TDH cohort in the past two weeks, \n\nmaking up 6.6% of the 166 admissions. \n\nFour deaths were in adults aged 26 – 36\n\nFive deaths were in adults over 60\n\nOne death was in a child in whom the cause of deaths was unrelated to COVID. \n\nThere were no COVID related deaths among 34 admissions in the paediatric COVID wards over the last two weeks. \n\nGauteng Province as a whole\n\nLevel of care\n\nThere were only 2 patients in the COVID ICU in the last 14 days, \n\nneither of whom had a primary diagnosis of COVID pneumonia. \n\nMuch shorter average length of stay\n\n2.8 days for SARS-CoV-2 positive patients admitted to the COVID wards over the last two weeks\n\ncompared to an average length of stay of 8.5 days for the past 18 months", "link": "https://www.youtube.com/watch?v=1Paq17X6ucQ", "date_published": "2021-12-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]