[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Vanguard & Warzone - The Pacific Launch Trailer", "description": "Check out Call of Duty: Vanguard & Warzone's The Pacific launch trailer. See the different locales you'll visit and some of the action that takes place on the map.\n\n#CallofDuty #ThePacific", "link": "https://www.youtube.com/watch?v=WQAaw1I1N-g", "date_published": "2021-12-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Infinite Campaign Review", "description": "Halo Infinite transforms the series' two-decade-old formula for the better, giving protagonist Master Chief more characterization and implementing an open world.", "link": "https://www.youtube.com/watch?v=4w8MIolHveQ", "date_published": "2021-12-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Infinite Campaign: What Went Wrong In 2020 | GameSpot News", "description": "In this episode of GameSpot News, we talk about Halo Infinite Boss Explains What Went Wrong With The 2020 Campaign Demo, Halo Infinite Is Adding More Playlists Soon, But Slayer Isn't Ready Yet and details about Call of Duty Warzone’s Pacific map launch.  \n\nIn this video, DeVante talks about what went wrong with Halo Infinite’s 2020 demo. 343’s Bonnie Ross explained because developers were mostly working from home at the time due to the pandemic and not everyone working on the game saw the same picture quality for the demo.\n\nDeVante also talks about when Halo Infinite’s multiplayer will get additional playlists.  Fiesta, Tactical Slayer (SWAT), and Free-For-All are on the way, however they won't be in the game on December 8 when the campaign launches.  \n\nLater in the video, DeVante talks about Call of Duty: Warzone finally getting its long-awaited new Pacific-themed map this week and how players can get early access.", "link": "https://www.youtube.com/watch?v=6lDY_K5zw_M", "date_published": "2021-12-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Infinite First Full Mission Xbox Series X 4K Gameplay", "description": "Check out Halo Infinite's first campaign mission \"Warship Gbraakon\". Master Chief fights his way through various enemies, while learning to use some of his new equipment including the grappling hook.\n\n#Halo #HaloInfinite", "link": "https://www.youtube.com/watch?v=d3O1tSKx818", "date_published": "2021-12-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Infinite Multiplayer Mythbusting and Testing", "description": "Halo Infinite's multiplayer has already had its share of off-the-wall combat moments that have left us with more questions than answers. Check out our list of myths that need some verification or busting.\n\n#HALO", "link": "https://www.youtube.com/watch?v=Cf3hDw970l4", "date_published": "2021-12-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Fortnite Chapter 3 Flipped Season Opening Cinematic", "description": "Fortnite's Chapter 3 is finally upon us. Find out what happened after you drifted a shore and what you'll need to do to help destroy the Imagined Order.\n\n#Fortnite", "link": "https://www.youtube.com/watch?v=joUFqBmZq7U", "date_published": "2021-12-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Fortnite Chapter 3 Season 1 Flipped Overview Trailer", "description": "Watch the Fortnite Chapter 3 Season 1 Flipped trailer! \n\nThe Fortnite Island has been flipped and a new one has been revealed.\n\n#Fortnite", "link": "https://www.youtube.com/watch?v=Q6PNL_WZsFk", "date_published": "2021-12-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "History Of Halo", "description": "Halo is the franchise that helped define modern first-person shooters on consoles. With the release of Halo Infinite, let's look back at its history: from Halo: Combat Evolved and the Bungie years, spin-offs like Halo Wars, and the passing of the torch to 343 Industries. \n\nVice article: https://www.vice.com/en/article/xwqjg3/the-complete-untold-history-of-halo-an-oral-history \n\nHalo: Combat Evolved helped define much of modern gaming. From how first-person shooters control on console to leading the charge for online play via Xbox Live, it's a series that's long been venerated for pushing gaming forward. It hasn't been without missteps, but with the strong launch of Halo Infinite multiplayer and all signs pointing towards a high-quality campaign. it seems that Halo is back, baby.\n\nIn the above video, we chart the history of the Halo games. Although it is a series synonymous with the Xbox console, it started life as a Mac exclusive. Halo: Combat Evolved, originally called Monkey Nuts, was an RTS game, but developer Bungie eventually refined it into the classic first-person shooter we know it as today. And the impact the game's success would have on its sequels, and spin-offs is something also explored in the video. We also discuss the passing of stewardship of the franchise from Bungie to 343 Industries, a team set up to be the new custodians of the Halo series.\n\nFor more on Halo, make sure to check out our Halo Infinite multiplayer review, our tips guides on how to dominate when playing online, and our latest episode of Firearms Expert Reacts, in which Jonathan Ferguson from the Royal Armouries breaks down the weapons in the game. Make sure to subscribe at youtube.com/gamespot so you don't miss out.\n\n00:24 - Halo: Combat Evolved (2001)\n04:58 - Halo 2 (2004)\n08:33 - Halo 3 (2007)\n11:09 - Halo Wars (2009)\n12:07 - Halo 3: ODST (2009)\n13:47 - Halo Reach (2010)\n15:01 - Halo 4 (2012)\n17:27 - Halo: Spartan Assault (2013)\n17:48 - Halo: Spartan Strike (2015)\n17:55 - Halo: The Master Chief Collection (2014)\n19:11 - Halo 5: Guardians (2015)\n21:02 - Halo Wars 2 (2017)\n21:49 - Halo Infinite (2021)\n\n#HALO", "link": "https://www.youtube.com/watch?v=uNjzot69mPc", "date_published": "2021-12-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]