[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "When to be exposed", "description": "Decline in personal immunity\nhttps://www.gov.uk/government/news/mhra-statement-on-booster-doses-of-pfizer-and-astrazeneca-covid-19-vaccines\nDr June Raine, MHRA Chief Executive\n\n We know that a person’s immunity may decline over time after their first vaccine course. \n\nI am pleased to confirm that the COVID-19 vaccines made by Pfizer and AstraZeneca can be used as safe and effective booster doses. \n\nIt will now be for the JVCI to advise on whether booster jabs will be given and if so, which vaccines should be used.\n\nUK, Joint Committee for Vaccination and Immunisation (JCVI)\n\nhttps://www.reuters.com/world/uk/uk-medicine-regulator-says-pfizer-astrazeneca-covid-19-shots-may-be-used-2021-09-09/\n\nDiscussing whether booster shots for the elderly and vulnerable are needed\n\nCould be end of September\n\nFinal decision with UK  government\nMonitoring Incidence of COVID-19 Cases, Hospitalizations, and Deaths, by Vaccination Status — 13 U.S. Jurisdictions, April 4–July 17, 2021\n\nhttps://www.washingtonpost.com/health/2021/09/10/moderna-most-effective-covid-vaccine-studies/\n\nhttps://www.cdc.gov/mmwr/volumes/70/wr/mm7037e1.htm?s_cid=mm7037e1_w\n\nhttps://www.cdc.gov/media/releases/2021/s0818-covid-19-booster-shots.html\n\nBased on our latest assessment, the current protection against severe disease, hospitalization, and death could diminish in the months ahead, \n\nespecially among those who are at higher risk or were vaccinated during the earlier phases of the vaccination rollout. \n\nFor that reason, we conclude that a booster shot will be needed to maximize vaccine-induced protection and prolong its durability.\n\nWe are prepared to offer booster shots for all Americans beginning the week of September 20 and starting 8 months after an individual’s second dose. \n\nWe also anticipate booster shots will likely be needed for people who received the Johnson & Johnson (J&J) vaccine.\n\nPandemic Institute, Liverpool\n\nSeven authorities and institutions\nSome Innova funding\n\nhttps://www.theguardian.com/science/2021/sep/12/uk-vaccine-volunteers-to-help-prepare-for-next-virus-at-new-pandemic-institute\n\nAims to prevent future pandemics\n\nAccelerating vaccine development\n\nHuman challenge facility\n\nHigh containment facility outside hospital, which will speed up the process\n\nWe could have had first wave trials\n\nProfessor Daniela Ferreira, Liverpool School of Tropical Medicine\n\nIf vaccine candidates could have been tested during the first wave of infections, the jabs would have been ready months earlier\n\nHere in Liverpool I led one of the sites for phase 3 of the Oxford vaccine study\n\nWe were able to set up really quickly. \n\nWhen the government implemented a national lockdown, the number of cases plummeted. \n\nWe were expecting to have the vaccine study results in three months but it took much longer because there was less community transmission\n\nBuilding a database of diseases affecting animals trying to work out which might be most likely to jump the species barrier\n\n1,500 species of bat alone\n\nProfessor Matthew Baylis of Liverpool University\n\nWhat I hope is that in 10 years’ time, we’re able to be much more precise as to which species we need to be looking at, and actually look at some of those species to confirm our predictions\nit appears to have these properties, it could be transmitted this way, it could cause this type of disease\n\nAlso, WHO\n\nOpened the Hub for Pandemic and \n\nEpidemic Intelligence in Berlin\n\nFrench government launched Prezode, an international initiative focusing on zoonotic diseases\n\nRockefeller Foundation is creating a Pandemic Prevention Institute in the US\n\nProfessor Baylis\n\nIntends to set up three hubs in east, west and southern Africa to work with local researchers\n\nLearning from Denmark\n\nhttps://www.washingtonpost.com/world/europe/denmark-ends-covid-restrictions/2021/09/10/6d6a762e-1210-11ec-baca-86b144fc8a2d_story.html\n\nSince 11th March 2020, has lifted the last of its domestic pandemic-era restrictions\n\nEarly vaccine passport\n\nCoronavirus is no longer a “critical threat to society.”\n\nFirst European Union member to issue declaration\n\nHigh vaccination rates\n\nRobust testing and sequencing\n\nRobust contact tracing and isolation\n\nNo claims of herd immunity\n\nDigital vaccine passport no longer required\n\nSweden, lift nearly all restrictions at the end of the September", "link": "https://www.youtube.com/watch?v=uUoWSfN3xo8", "date_published": "2021-09-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]