[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Anna B Savage: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nTom Huizenga | July 28, 2021\nAnna B Savage's new home these days is the west coast of Ireland near Mullaghmore, where this striking video was shot. Moss clings to a shoreline cove where seagulls circle in air so moist you could slice right through it.\n\nSavage's songs, too, are thick with unfiltered feelings, self-interrogation and wry humor, raising the bar for any Joni Mitchell-inspired confessional songwriting. The three she performs here are pulled from different moments in her career and personal life but cohere around the theme of struggling in the darkness of a toxic relationship before emerging into self-confident sunshine. The songs might be self-referential, but like Mitchell's they speak in customized messages with a voice that whispers intimacies one moment and soars with operatic glory the next.\n\nIn \"Corncrakes,\" Savage's beloved birds trigger mixed feelings for a lover, climaxing in the repeated line that itself could have been our collective mantra over the past year: \"I don't know if this is even real. I don't feel things as keenly as I used to.\"\n\n\"Since We Broke Up,\" a new song premiered here, finds Savage rising from personal struggles to once again enjoy her own company, while the astounding \"One,\" from her 2015 breakthrough EP, paints a painful bedroom scene of self-doubt and embarrassment that ultimately leads to an explosive epiphany.\n\nEnamored of her new environs, Savage told NPR she chose the locale to \"showcase some of my new, completely wild and amazing landscape.\" But what she truly offers here is the terrain inside the mind of one of today's most distinctive cartographers of human temperament.\n\nSET LIST\n\"Corncrakes\"\n\"Since We Broke Up\"\n\"One\"\n\nMUSICIANS\nAnna B Savage: vocals, guitar\n\nCREDITS\nVideo: Ross McClean\nAudio: Lee McMahon\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Maia Stern\nAudio Mastering: Andy Huether\nAssociate Producer: Bobby Carter\nTiny Production Team: Kara Frame, Josh Rogosin, Gabrielle Pierre\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #annabsavage", "link": "https://www.youtube.com/watch?v=6uMyPRYjIYw", "date_published": "2021-07-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Young Thug: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nSidney Madden | July 27, 2021\nYoung Thug looks right at home in the lush, almost regal, gardens of The Houdini Estate in Los Angeles. The serenity of the chosen location might seem too delicate for the punk-rock raps Thug and his crew reverberate through the grounds, but as hip-hop's impactful oddball, oxymoronic magic has always been his strong suit.\n\nFor the last decade, the world of rap has lived, learned and been liberated while under the influence of Young Thug. His contorted cadence, visionary fashion sense and freaky, frantic wordplay have inspired an entire generation of artists to no end. And now, the Atlanta iconoclast is evolving yet again. Not only is he wading through the waters of punk with his forthcoming album, Punk — Thug is using his Tiny Desk debut to usher in his next era, one that's meant to represent \"authenticity, consciousness and overall purity.\" Premiering songs off his long-teased album (due out Oct. 15), the Grammy winner's rhymes slither along smoothly no matter how rough the music, taking fans on a journey of energy and emotion.\n\n\"I'm just seeking for God's soul 'cause I know something's missing,\" a peach-haired Thug admits on his opener, \"Die Slow,\" before divulging specific hardships that shape his music. It's a small sample of the tests in life that inspire lines like, \"You gotta go through this s*** with your heart / You can't snooze on it\" and prompt him to celebrate even the smallest wins with VVS diamonds and exotic vacations. By the time the sun sets and the crew is joined by famed drummer Travis Barker for a fresh rendition of the chart-topping \"Ski,\" the surge of triumphant excitement is almost too much for him to contain. But then again, why would he want to?\n\nSET LIST\n\"Die Slow\"\n\"Droppin Jewels\"\n\"Hate The Game\"\n\"Tick Tock\"\n\"Ski\"\n\nMUSICIANS\nYoung Thug: vocals\nTim Stewart: guitar\nJonny Goood: bass\nTosh Peterson: drums\nTravis Barker: drums\n\nCREDITS\nVideo: Hidden Road Studios\nAudio: Demetrius Moore and Angad \"Bainz\" Bains\nCreative Director: Meggan Mckenzie\nDirector: Tom Kirk\nCinematography: John Barrett\nManagement & A&R: Geoffrey Ogunlesi\nProduction Manager: Paul Lovell Butt\nCamera Operator: Erick Turcios\nTour Director: JP Firmin\nBand Fixer: Adam Blackstone\nGaffer: Marc Patterson\n1st AC: Melissa Martine\nKey Grip: Christian Guerrero\nProduction Assistant: Duane Avery\nAssistant Mix Engineer: Aresh Banaji\nAssistant Engineering: Bernard Chavez\n\nTINY DESK TEAM\nProducers: Sidney Madden, Bobby Carter\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Kara Frame, Gabrielle Pierre\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#youngthug #tinydesk #nprmusic", "link": "https://www.youtube.com/watch?v=SAROJPnd_s8", "date_published": "2021-07-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]