[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Black Motion: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nAbby O'Neill | July 8, 2021\nBlack Motion's Tiny Desk (home) concert, recorded at the former residence of Nelson Mandela, feels like a spiritual sound bath. The South African production duo turntablist Bongani Mohosana of the Zulu tribe and percussionist Thabo Mabogwane of Sotho tribe — open their set with \"Mayibuye iAfrica,\" a cry for Africa to return to its culture and history.\n\nThis Afro-House set is brought to life thanks to several featured vocalists and guest musicians. Afro-House has spread joy and healing across the country of South Africa, transcending local boundaries to become a thriving global dance phenomenon. In my experience, Its indigenous sounds and percussive rhythms drench the soul and heart with healing powers and cultivate communion with the infinite.\n\nSouth African singer Msaki makes her third appearance in our (home) concert series, after earlier credits with Black Coffee and our Coming 2 America special. She lends her vocals to \"Marry Me,\" a soulful jam from Black Motion's 2020 album, The Healers: The Last Chapter. \"Imali,\" featuring Nokwazi, soothes the lingering remnants of pandemic fears, while Tabia closes with the lilting \"Prayer for Rain.\"\n\nSET LIST\n\"Mayibuye iAfrica\"\n\"Rainbow\"\n\"Joy Joy\" (feat. Brenden Praise)\n\"Marry Me\" (feat. Msaki)\n\"Imali\" (feat. Nokwazi)\n\"Prayer For Rain\" (feat. Tabia)\n\nMUSICIANS\nThabo Roy Mabogwane: percussion, producer\nBongani Mohosana: DJ, producer, music director\nBrenden Praise: vocals\nMsaki: vocals\nNokwazi: vocals\nTabia: vocals\nAlmotie \"Alie-keyz\" Mtombeni: keys, synths, vocoder, auto-vocals, piano\nLifa \"Sir_Lifa\" Mavuso: guitar\nSiyabonga Hosana Magagula: bass, synth, bass\nLusindiso \"Jojo\" Zondani: backing vocals, tenor\nGugu Shezi: backing vocals, soprano\nNoxolo Radebe: backing vocals, alto\n\nCREDITS\nVideo: \nNS Production (Sakhile Fakude, Zolani Phakade and Ndumiso Buthelezi)\nMoses N Mokgoko \nThamsanqa Fakazi \n\nAudio: \nKatlego Katt Masoga\nBodega Bros ( Vukile Nonkonyana and Thina Fonya)\n\n\nTINY DESK TEAM\nProducer: Abby O'Neill\nVideo Producer: Maia Stern\nAudio Mastering: Andy Huether\nAssociate Producer: Bobby Carter\nTiny Production Team: Bob Boilen, Kara Frame, Josh Rogosin, Gabrielle Pierre\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #blackmotion", "link": "https://www.youtube.com/watch?v=plMNAPdAyPY", "date_published": "2021-07-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]