[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "AMD Radeon RX 6000 Series Expands - Full Presentation", "description": "Watch the full AMD presentation discussing the new AMD Radeon RX 6000 Series graphics cards and how they perform compared to top graphic cards in the gaming space. AMD's new Radeon RX 6000 is AMD's direct competitor to the Nvidia RTX 3000 series graphics cards.", "link": "https://www.youtube.com/watch?v=TIjDDvLMI9s", "date_published": "2021-03-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Brian David Gilbert Answers 27 Questions", "description": "What's Brian David Gilbert's favorite nail polish? How tall is he? And most importantly, how does he like his eggs? BDG answers those and more in this special Q&A.\n\nBDG's channel: https://www.youtube.com/briandavidgilbert\n\nYou might know Brian David Gilbert as the host of Polygon's Unraveled. If you're not familiar with his work, he has taken on gargantuan tasks such as solving the Zelda timeline in 15 minutes. And by solving we mean taking everything that's canon and isn't and then putting it order.\n\nI think most would agree that it's a foolish endeavor. But foolish endeavors are exactly what internet sweetheart Brian David Gilbert is all about. He's also read 337 Skyrim books, ranked over 200 Mega Man robots, attempted to make sense of Kingdom Hearts, and tried to make all 78 food recipes from The Legend of Zelda: Breath of the Wild in one day.\n\nNaturally, it's all fantastic to watch and, as host and creator, Brian David Gilbert approaches each challenge with charm, humor, and a frankly alarming level of earnestness. But what makes him tick? Do we know the real Brian David Gilbert? Why is he the way he is? We decided to find out by sitting him down and interviewing him.\n\nSpecifically, we asked him 27 of the most important questions that'll help you truly get to know him. Like what is he doing now? What's his five-year plan? Favorite dance move? In fact, where did he even learn to dance?\n\nFind out more about Brian here: https://www.briandavidgilbert.com/ or follow him on Twitter @briamgilbert.", "link": "https://www.youtube.com/watch?v=2O0VVoPiHAo", "date_published": "2021-03-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Aliens: Fireteam Announcement Trailer", "description": "Check out the official announcement trailer for the Aliens: Fireteam game taking place in the Aliens universe! Aliens: Fireteam is set to launch on PC, PS5, PS4, Xbox One, and Xbox Series X|S consoles in the Summer of 2021!", "link": "https://www.youtube.com/watch?v=e6B98KAIyF8", "date_published": "2021-03-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Evolution Of The MP5 In Call of Duty", "description": "For over 14 years we’ve seen the MP5 featured in almost every Call of Duty game. Here’s a look at how the reliable submachine gun has evolved over the course of 14 titles.\n\nThe MP5 is one of Call of Duty’s most well-known submachine guns. It’s been featured in more than a dozen games and modes and has seen quite a few changes. In this video, we check out it’s evolution within the entire series. Everything from its introduction in Call of Duty 4: Modern Warfare, to its futuristic stylings of Infinite Warfare and beyond.\n\nThe reliable MP5 is a fan favorite. It usually delivers a fast fire rate with low recoil. In most Call of Duty games, it’s the strongest submachine gun in terms of damage. Unfortunately, the same can’t always can’t always be said when it comes to Treyarch’s Zombies modes. Submachine guns and zombies don’t mix very well and can leave you wanting a stronger weapon in later rounds. \n\nEven every iteration, there are a few staples that make up that classic MP5 look. This includes its iron sights and familiar body shape. In futuristic titles like Infinite Warfare, the MP5 goes by other names like the VPR, but after getting your hands on them, the feel and performance of this submachine gun stands out and feels familiar. While the look and style has changed over the years, there’s no denying it’s smooth handling and solid time to kill. It’s a gun we COD fans can’t live without.\n\nTimestamps:\n00:30 - Call of Duty 4: Modern Warfare\n01:03 - Call of Duty: Modern Warfare 2\n01:38 - Call of Duty Black Ops\n02:09 - Black Ops Pack-a-Punch\n02:30- Call of Duty: Modern Warfare 3\n03:06 - Call of Duty: Black Ops 2 \n03:18 - Black Ops 2 - Pack-a-Punch\n03:40 - Black Ops 3\n04:03- Black Ops 3  Pack-a-Punch\n04:32 - Call of Duty: Infinite Warfare\n04:53 - Call of Duty: Infinite Warfare - Pack-a-Punch\n05:21 - Call of Duty: Modern Warfare Remastered\n05:42 - Call of Duty Mobile\n06:06 - Call of Duty Modern Warfare 2019\n06:49 - Call of Duty: Modern Warfare 2 Remastered\n07:25 - Call of Duty: Black Ops Cold War\n07:56 - Black Ops Cold War - Pack-a-Punch", "link": "https://www.youtube.com/watch?v=vyNvSNoCU-g", "date_published": "2021-03-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "It Takes Two Is Gaming's First Proper Rom-Com (Feat. Greg Miller)", "description": "Two roommates (Lucy James and Kinda Funny's Greg Miller) play Hazelight Studio's latest It Takes Two, and give their impressions on the couch co-op caper.\n\nIt Takes Two is an upcoming co-op game from Josef Fares and his team at Hazelight Studios that follows a couple as they navigate the murky waters of their divorce. Unfortunately for Cody and May, it's not going to be a clean break. Thanks to a magical spell accidentally cast by their daughter, Rose, they are turned into doll versions of themselves and must explore their own house, but from a very unique point of view. \n\nIn the above video, real-life roommates Lucy James and Kinda Funny's Greg Miller discuss how the game feels to play, how funny it is, as well as how it manages to marry (pun not intended) gameplay and story to build a truly creative cooperative experience. \n\nCheck out Kinda Funny's First Impressions at youtube.com/KindaFunnyGames, or follow Greg on Twitter @gameovergreggy. For more on It Takes Two, we've got the first 20 minutes of gameplay up on https://youtube.com/GameSpotTrailers, as well as a chat with the game's director, Josef Fares on gamespot.com. It Takes Two launches on March 26 on PlayStation 4, PlayStation 5, Xbox One, Xbox Series X/S, and PC.", "link": "https://www.youtube.com/watch?v=yd9gJng884M", "date_published": "2021-03-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Zelda BOTW Expert Reacts to EVEN MORE Viral Reddit Clips", "description": "Max “RinHara5aki” Blumenthal with over 2300+ hours experience with Breath of the Wild, reacts and breaks down even more clips from viral speedrunning techniques to funny ways to abuse the games physics.\n\nBe sure to check out Max's previous episode in BOTW Expert Reacts here:\nEp1: https://youtu.be/8LntT_fN_74\nEp2: https://youtu.be/RPlHQEAXrYo\n\nMax “RinHara5aki” Blumenthal's combat glossary in progress explains a great deal about the vastness of advanced combat in The Legend of Zelda: Breath of the Wild: https://docs.google.com/document/d/1qtYT06sxweRW3tRnovcCc-f4xIOGFNsD02pG1TzloHc/edit?usp=sharing\n\nBreath of the Wild's complex mechanics and overlapping intricacies led players to push the game's boundaries, resulting in several gameplay clips that took the internet by storm. Some of these are so complex, it's hard for the average player to decipher exactly what's even happening. \n\nIn the above video, Max, our in-house BOTW expert, reacts to some of the most viral BOTW clips, and breaks down techniques like Shield Skew Clipping, Bow Spinning (which he coined), Stasis Launching, and more.\n\nWant Max to react to your clips? Have suggestions for anything you want to see? Drop them in the comments below. \n\nSources:\n00:15 - Clip 1:  https://www.reddit.com/r/Breath_of_the_Wild/comments/88kqst/i_tried_seeing_if_you_can_catch_a_boomerang_in/\n01:21 - Clip 2: https://www.reddit.com/r/Breath_of_the_Wild/comments/9l5k82/how_us_adhd_people_solve_mazes/ \n04:47 - Clip 3: https://www.reddit.com/r/Breath_of_the_Wild/comments/fcmrir/rearming_a_camp_full_of_bokoblins_with_korok/ \n06:17 - Clip 4: https://www.reddit.com/r/Breath_of_the_Wild/comments/b21r4i/a_major_test_of_strength_pacifist_route/", "link": "https://www.youtube.com/watch?v=ZLIQCFrqKS8", "date_published": "2021-03-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]