[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "Linux on Mars, Mint users don't update, block the whole web, and GNOME 40 on multi-monitor setups", "description": "Try KernelCare Enterprise for free: https://lp.kernelcare.com/kernelcare-enterprise-experiment\n\n\nThis time, we have Linux on Mars, Mint users not doing their updates, /e/ phones shipping to the US and Canada, and a browser extension that makes the web unusable, but is still interesting. \n\n\n\nBecome a channel member to get access to a weekly patroncast and vote on the next topics I'll cover:\nhttps://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nSupport the channel on Patreon: \nhttps://www.patreon.com/thelinuxexperiment\n\nFollow me on Twitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\nFollow me on LBRY: https://lbry.tv/@TheLinuxExperiment:e\n\nThe Linux Experiment merch: get your goodies there! https://teespring.com/en-GB/stores/the-linux-experiment\n\n\nUbuntu will make the GNOME Shell dark by default in 21.04.\nhttps://www.omgubuntu.co.uk/2021/02/ubuntu-21-04-dark-system-theme\n\nA small step for Tux, but a big step for Linuxkind, the Perseverance Mars rover has landed on the red planet, and it's running Linux. Well, its helicopter drone is, the rover itself still runs a proprietary OS, but it's still the first time that our beloved OS has been on Mars, so that's kind of a historic day.\n\nhttps://www.pcmag.com/news/linux-is-now-on-mars-thanks-to-nasas-perseverance-rover\n\nLinux Mint's creator, Clem Lefebvre, is calling to all Linux Mint users to actually apply their updates. \nhttps://blog.linuxmint.com/?p=4030\n\nGNOME 40 has another blog post under its belt, this time to explain how the reworked activities view will support multi-monitor setups. \nhttps://blogs.gnome.org/shell-dev/2021/02/23/gnome-shell-40-and-multi-monitor/\n\nSlimbook, the spain based computer manufacturer and reseller, has joined the long list of KDE patrons. \nhttps://dot.kde.org/2021/02/25/slimbook-becomes-kde-patron\n\nThe Pine 64, the company behind the Pinephone, pinetime, and pinetab, as well as the pinebook and pinebook pro, has announced that the pinephone will ship with plasma Mobile preinstalled.\n\nhttps://www.pine64.org/2021/02/15/february-update-show-and-tell/\n\nNvidia launched their Geforce RTX 3060, and it has day one Linux support through the proprietary Nvidia driver, version 460.56. \nhttps://www.gamingonlinux.com/2021/02/nvidia-geforce-rtx-3060-goes-out-today-new-linux-driver-released\n\nI talked about /e/, the project that aims to provide a de-googled version of Android, and I've been using it for a while now on a Galaxy S9+. One of the major complaints people had was that they didn't sell refurbished phones with /e/ preinstalled in the US or Canada, well that's now fixed! \nhttps://esolutions.shop/\n\nDXVK 1.8 was released. \nhttps://github.com/doitsujin/dxvk/releases/tag/v1.8\n\nVKD3D Proton also saw a new release, version 2.2. \nhttps://github.com/HansKristian-Work/vkd3d-proton/releases/tag/v2.2\n\n\nWine 6.3 was released, with improved debugger support, the Wine Gstreamer library being converted to the PE format, and more WinRT support. \nhttps://www.winehq.org/announce/6.3\n\nThere is a native GTK Spotify client in the works, called \"Spot\". It's built with Rust, and, as all third party Spotify clients, it will need a Spotify premium account, probably something to do with access to the Spotify APIs.\nhttps://www.omgubuntu.co.uk/2021/02/spot-gtk-spotify-client-for-linux\n\n\nFirefox 86 was released, with a few nice improvements under its belt. The first one is the ability to use multiple picture in picture windows, so if you want to keep multiple videos on a side of your screen you now can. \nIt also introduces \"total cookie protection\", which puts each website in its own, affectionately named \"cookie jar\", which means that websites have no way to communicate with each other using cookies, so you can't be tracked fro website to website. \nhttps://www.mozilla.org/en-US/firefox/86.0/releasenotes/\n\nA new browser extension will let you block every website that relies on \"big tech\" to run. The \"Big Tech Detective\" extension needs to be side loaded onto Firefox or Chrome, as it's not available in the extension stores yet, and maybe never will be.\n\nhttps://www.theverge.com/2021/2/24/22297686/browser-extension-blocks-sites-using-google-facebook-microsoft-amazon", "link": "https://www.youtube.com/watch?v=BD85fjdYL4I", "date_published": "2021-03-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]