[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Assassin's Creed Valhalla: Dawn of Ragnarök - Cinematic Trailer", "description": "Check out a world premiere trailer for Assassin's Creed Valhalla showcasing the Dawn of Ragnarok!", "link": "https://www.youtube.com/watch?v=hXYcbfXz_k8", "date_published": "2021-12-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Forspoken - Beautiful World, Seemingly Nowhere To Go", "description": "Jordan talks about his hands-off preview of Forspoken, giving early impressions on the game's world, main character and story based off what he saw. Forspoken will release for PS5 and PC on May 24, 2022.\n\nIn Forspoken, you play as Frey Holland, a young New Yorker who has hit rock bottom in her life and desperately yearns to get out of the city and find a place where she can belong. She sort of gets her wish when a strange portal suddenly transports her to the fantastical world of Athia, where she meets a sentient bracelet named Cuff.\n\nIn this video, Jordan walks through his intial thoughts after taking part in a hands-off preview of Forspoken. He talks about the game's story and poses interesting questions about it's world and characters.\n\nForspoken is planned to launch for PS5 and PC on May 24, 2022.", "link": "https://www.youtube.com/watch?v=4c_gkI0XwMw", "date_published": "2021-12-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "An Unhinged Breakdown of All Halo Media", "description": "The Halo Universe: A rich, intricate tapestry chronicling humanities’ perseverance in the face of near extinction against universe-destroying technology and exploding Lovecraftian spore monsters.  And Halo Infinite promises to be the culmination of the Halo Universe finally exploring every aspect of Halo lore. So to prepare you for the deepest of dives into history of Halo, video producer Jessie Earl explains every single piece of Halo tie-in media... and may get lost herself.\n\nFrom Halo: Combat Evolved to Halo 3 to Halo: First Strike to Halo The Graphic Novel to the story of 343 Guilty Spark, not a stone will be left unturned in the entire Halo universe… though perhaps a few stones might be turned inside Jessie Earl’s head. \n\nAnd don’t worry, there’s not that much Halo media. 6 main games...  2 spinoff shooters... 2 RTS games... 2 twin-stick shooters… a VR game… a few films… some short films... 20+ novels...several graphic novels too… numerous comics… an audio drama…. A board game… Ok, look, it’s not complicate", "link": "https://www.youtube.com/watch?v=OcDJAOkW5fo", "date_published": "2021-12-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]