[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Pandemic optimism", "description": "Natural infection and / or vaccination? and Special report Mississippi\n\nhttps://www.bbc.co.uk/news/health-58270098\n\nDelta in UK\n\nViral burden and vaccine effectiveness against new SARS-CoV-2 infections in the UK \n\nhttps://www.ndm.ox.ac.uk/covid-19/covid-19-infection-survey/results/new-studies\n\nhttps://www.ndm.ox.ac.uk/files/coronavirus/covid-19-infection-survey/finalfinalcombinedve20210816.pdf\n\nDelta infections after two vaccine doses had similar peak levels of virus to those in unvaccinated people\n\nTwo doses of either vaccine, same level of protection against infection as natural infection\n\nNatural infection followed by vaccination, even more protection than vaccination alone\n\nAfter four to five months, effectiveness of these two vaccines similar\n\nThe time between doses does not affect effectiveness in preventing new infections\n\nNow\n\nLevels of immunity in the community\n\nImplications for vaccination in children\n\nShould we use virus or booster shots to top up immunity in adults?\n\nProf Eleanor Riley, immunologist, University of Edinburgh\n\nWe could be digging ourselves into a hole, for a very long time, \n\nwhere we think we can only keep Covid away by boosting every year\n\nProf Adam Finn, government vaccine adviser\n\nOver-vaccinating people when other parts of the world had none\n\na bit insane, it's not just inequitable, it's stupid\n\nhttps://www.nature.com/articles/s41401-020-0485-4\n\nSARS-CoV-2 belongs to the β coronavirus family\n\nSeventh known coronavirus to infect humans\n\nFour cause colds, 229E, NL63, OC43, and HKU1\n\nSARS-CoV, 2002\n\nMERS-CoV, 2012\n\nSARS-CoV-2, 2019\n\nSARS-CoV-2\n\nSingle-stranded RNA-enveloped virus\n\nEntire genome, 29,881 bases\n\nEncoding 9,860 amino acids\n\n28 proteins essential for infection\n\nBreadth of immunity\n\nHow much of the virus the immune system learns to attack\n\nNatural infection, more polyclonal\n\nModerna or Pfizer or Oxford-AstraZeneca, just spike protein\n\nKeeps people out of hospital\n\n28 proteins recognised give Lymphocytes a ‘target rich environment’\n\nProf Eleanor Riley, immunologist, University of Edinburgh\n\nThat means if you had a real humdinger of an infection, you may have better immunity to any new variants that pop up as you have immunity to more than just spike\n\nStrength of immunity\n\nPower to prevent infection and cause severe disease\n\nIn the case of breakthrough infection or reinfection\n\nAsymptomatic, low levels of antibodies\n\nSymptomatic or ill, higher levels of antibodies\n\nDuration of immunity\n\nNaturally enhanced neutralizing breadth against SARS-CoV-2 one year after infection\n\nhttps://www.nature.com/articles/s41586-021-03696-9\n\nNatural infection, no vaccination\n\nAntibody to the receptor binding domain, active\n\nRBD-specific memory B cells, active and relatively stable between 6 and 12 months after infection\n\nVaccination further increases all components of the humoral response\n\nResults in serum neutralizing activities against variants of concern\n\nSimilar to or greater than the neutralizing activity against the original Wuhan Hu-1 strain\n\nachieved by vaccination of naive individuals\n\nThe data suggest that immunity in convalescent individuals will be very long lasting and that convalescent individuals who receive available mRNA vaccines will produce antibodies and memory B cells that should be protective against circulating SARS-CoV-2 variants.\n\nAnatomical location of immunity\n\nImmunoglobulin A, mucous membranes\n\nImmunoglobulin M and G, in the blood\n\nProf Paul Klenerman, University of Oxford\n\nThe location of an infection makes a difference even if it's the same virus,\n\nso we would expect important differences between natural infection and vaccines\n\nCurrent questions\n\nDo vaccinated adults need to be boosted, or is exposure to the virus enough?\n\nDo children need vaccinating at all, or does a lifetime of ongoing exposures build a good immune defence? \n\nImmune top ups occur with respiratory syncytial virus, rhinoviruses, four other coronaviruses\n\nProf Adam Finn, government vaccine adviser\n\nThis isn't proven, but it could be a lot cheaper and simpler to let that happen than spend the whole time immunising people\n\nWe could end up locked into a cycle of boosting without seeing if it was necessary\n\nIn children, argument had already been won\n\n 40-50% have already been infected and most weren't ill or particularly ill\n\nProf Eleanor Riley, immunologist, University of Edinburgh\n\nUsing vaccines to take the edge off Covid, \n\nfollowed by infection, \n\nto broaden the immune response\n\nWe really need to consider, are we just frightening people rather than giving them the confidence to get on with their lives? \n\nWe're close to just worrying people now.", "link": "https://www.youtube.com/watch?v=20DxL8KhvgA", "date_published": "2021-08-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]