[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "I Played No Man's Sky 5 Years Later", "description": "Back in 2016, No Man's Sky was one of the most anticipated game's of the year. However - after releasing, No Man's Sky was notoriously missing many of its promised features, and people swore not to overhype themselves ever again... until Cyberpunk 2077.\n\nBut, No Man's Sky has received regular free updates, and now many will tell you that No Man's Sky is one of the best redemption arcs in video games, and now worth playing. So - how is No Man's Sky 5 years later?\n\n#nomanssky", "link": "https://www.youtube.com/watch?v=uxgeVXaru7E", "date_published": "2021-08-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Revisiting The Original No More Heroes", "description": "With No More Heroes III right around the corner how does Suda51’s original hold up in 2021? \n\nNo More Heroes was released for the Nintendo Wii in 2007 in Japan and in 2008 everywhere else. The game follows Travis Touchdown, a wrestling and anime fan who wants to become the #1 ranked assassin after winning a Beam Katana in an online auction. The game never takes itself too seriously, for example, if you want to save your game you have to use the toilet to do so, and it even breaks the fourth wall sometimes. \n\nBut how is the original No More Heroes in 2021? Should you go back to it in the leadup to No More Heroes 3? Hopefully this video will help answer that question, and yes there are no spoilers for the plot of the game in this video. The original No More Heroes and its sequel got ports to Nintendo Switch and Steam making it easier than ever to try the series out.\n\nIn terms of the series as a whole, No More Heroes got an “enhanced” port to Xbox 360 and PS3 (but only PS3 outside of Japan), a sequel titled No More Heroes 2: Desperate Struggle in 2010, a Japan only mobile spin-off game, another spin-off for consoles and PC titled Travis Strikes Again: No More Heroes, and now a 3rd numbered entry titled No More Heroes 3 which is set to be released exclusively for the Nintendo Switch on August 27th, 2021. So while it’s not the most successful series in the world, it definitely wasn’t a one hit wonder.\n\nSuda51 Breaks Down His Iconic Career | Audio Logs: https://youtu.be/JgggpKr931U\n\n#nomoreheros", "link": "https://www.youtube.com/watch?v=wSVXloMQXGY", "date_published": "2021-08-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Hell Let Loose’s Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the WW2-era weaponry of Hell Let Loose, including the M1 Garand rifle, the PPSh-41 submachine gun, and the StG 44 assault rifle.\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of Hell Let Loose and compares them to their real-life counterparts.\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can purchase Jonathan's book here - https://www.headstamppublishing.com/bullpup-rifle-book\n\nYou can check out Jonathan on the Fighting on Film podcast here - https://www.youtube.com/playlist?list=PLNsrU8HuCAzaizIqbAcNZ5VUQW789z3ZF\n\n#expertreacts #royalarmouries", "link": "https://www.youtube.com/watch?v=K81e5Q6aY3g", "date_published": "2021-08-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Ghost Of Tsushima Director’s Cut - Is it Worth The Upgrade?", "description": "Ghost Of Tsushima Director’s Cut gives us a native PS5 version, with new upgrades to take advantage of the hardware. But is it enough to make the upgrade?\n\nGhost of Tsushima Director’s Cut is now out, bringing a proper next generation version of Sucker Punch’s open world samurai adventure to the PlayStation 5. This is pretty fascinating as the game already received a PS5 patch last year which let it tap into the extra horsepower of the system. So you might be wondering what a proper PS5 version brings to the table? While it’s still largely the same game there’s a number of improvements that make Ghost of Tsushima Director’s cut the definitive version.\n\n#ghostoftsushima", "link": "https://www.youtube.com/watch?v=YOFgcndewwA", "date_published": "2021-08-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "I Played Every COD in 2021 (Modern Warfare 2 to Black Ops Cold War)", "description": "Part 1: https://www.youtube.com/watch?v=QALC_jNI9WM\n\nRichie returns to share his journey playing through every Call of Duty in the series. Part 2 begins with Modern Warfare 2 from 2009 and leads to 2020's Black Ops Cold War.\n\nTimestamps:\n\n00:00 - Intro\n00:22 - Modern Warfare 2\n02:53 - Black Ops\n05:25 - Modern Warfare 3\n08:33 - Black Ops 2\n11:39 - DS Games \n13:57 - BO: Declassified\n16:06 - Ghosts\n19:11 - Advanced Warfare\n21:36 - Black Ops 3 \n25:16 - Infinite Warfare\n27:56 - WWII\n31:16 - Black Ops 4\n31:57 - Modern Warfare/WZ\n34:48 - Black Ops Cold War\n37:19 - Thank You!\n\nThe Call of Duty series has been around for almost 20 years. In its time we’ve seen it go everywhere from World War II to the final frontier of space. This year, GameSpot’s Richie Bracamonte took the plunge and played every single COD game. In part 1, we watched him begin from 2003’s Call of Duty to 2008’s Call of Duty World At War. This time around, we’ll continue with Call of Duty: Modern Warfare 2 all the way to 2020’s Call of Duty: Black Ops Cold War.\n\nOriginally based on WWII, the first few COD titles are packed with historical retellings of several battles carried out across all theatres. As the series progressed, the gaming market flooded with dozens of WWII games made by several other developers. The fad that Activision helped to create quickly took a back seat after the introduction of the Modern Warfare series in 2008. After major successes with the revitalized series, Call of Duty remained a household name to this day.\n\nIf you love Call of Duty as much as Richie, GameSpot is the place for you! We’re always covering the latest news including gameplay, breakdowns and more. GameSpot’s YouTube page also has classic COD playlists full of fun weapons videos, chats and more.\n\n#cod #callofduty", "link": "https://www.youtube.com/watch?v=74_zo2pCAiU", "date_published": "2021-08-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Madden NFL 22 Review", "description": "With meaningful additions on and off the field, Madden NFL 22 marks a recent high point for the series, but technical issues get in the way.\n\nMadden 22 is now available on PlayStation 4 and 5, Xbox Box Series X|S and Xbox One, Stadia, and PC. You can read the full written Madden 22 review by Richard Wakeling on GameSpot: https://www.gamespot.com/reviews/madden-nfl-22-review-momentum-shift/1900-6417715/\n\n#maddennfl22 #nfl22 #madden22", "link": "https://www.youtube.com/watch?v=wOYYTn_Iy7w", "date_published": "2021-08-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "QuakeCon 2021 Day Three | Quake World Championship Grand Finals, DOOM Eternal BattleMode and More", "description": "QuakeCon concludes with the Quake World Championship Grand Finals, a DOOM Eternal BattleMode Community Bonanza, and a Elder Scrolls Online Live Art Creation Panel.\n\nSchedule:\n11:00AM PT - DOOM Eternal - Battlemode Community Bonanza!\n12:30PM PT - Fallout 76 - C.A.M.P. Love It or Nuke It\n1:30PM PT - Quake World Champsionship Grand Finals\n3:30PM PT The Elder Scrolls Online - Live Art Creation\n\n#quakecon #bethesda", "link": "https://www.youtube.com/watch?v=wF-SOmqUwA0", "date_published": "2021-08-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]