[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Rae Khalil: Tiny Desk (Home) Concert", "description": "NPR Music's Tiny Desk series will celebrate Black History Month by featuring four weeks of Tiny Desk (home) concerts and playlists by Black artists spanning different genres and generations each week. The lineup includes both emerging and established artists who will be performing a Tiny Desk concert for the first time. This celebration highlights the beautiful cornucopia of Black music and our special way of presenting it. We hope you enjoy.\n\nBobby Carter | February 18, 2021\n\"Tiny Desk! Happy Black History Month!,\" rapper, singer and songwriter Rae Khalil exclaims before gliding into \"FATHER,\" from her LP Fortheworld. From the confines of Harun Coffee in the historic Leimert Park neighborhood of South Los Angeles comes one of the most exhilarating Tiny Desk home concerts I've ever seen. Khalil's set is a colorful explosion of talent, perfectly complimenting the funky patchwork and textures of her attire.\n\nShe hit our radar and was featured on All Songs Considered last year, but gained national attention as a contestant on Netflix's music competition show, Rhythm + Flow. As an emcee, she enunciates and bends her words unlike anyone in the game and if the bars don't hook you, her expansive vocal range most certainly will. The Torrance, Calif., native's musical theater background shines through here; she exudes an array of emotions in a span of minutes on tracks like \"UP LATE\" and \"MARIA,\" making it impossible to look away. The orchestration, courtesy of her band (whom she calls \"The ill\"), reflects the recorded sessions almost to a tee and features a special guest on bass and guitar: Tiny Desk alum Kelsey Gonzalez of The Free Nationals.\n\nSticking to the \"inspiration\" theme of our Black History Month celebration, she recites an excerpt from Langston Hughes's \"Let America Be America Again.\" The 86-year-old words still read painfully relevant for many Black people in this country today.\n\nSET LIST\n\"Way Down\"\n\"FATHER\"\n\"UP LATE\"\n\"MARIA\"\n\nMUSICIANS\nRae Khalil: vocals\nKelsey González: bass, guitar\nNico Vasquez: drums\nTakoda Barraza: guitar\nDominick Cruz: bass, guitar\nElyzr: piano\n\nCREDITS\nAudio: Arley Cervantes, Tom Kendall, Lucas Palmieri\nVideo: Riley Lattanza, Mike Bugaoan, Brianna Nakatani, Steve Grise\nProduction Manager: Nathan Rebolledo\nProducers: Van Caraviello & SOS Production\nSpecial Thanks: United Masters, Harun Coffee, Harun Intl.\n\nTINY DESK TEAM\nProducer: Bobby Carter\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nArt Director: CJ Riculan\nTiny Production Team: Bob Boilen, Kara Frame, Morgan Noelle Smith\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann", "link": "https://www.youtube.com/watch?v=vDZBjxj-QAU", "date_published": "2021-02-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "2 Chainz: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nNPR Music's Tiny Desk series will celebrate Black History Month by featuring four weeks of Tiny Desk (home) concerts and playlists by Black artists spanning different genres and generations each week. The lineup includes both emerging and established artists who will be performing a Tiny Desk concert for the first time. This celebration highlights the beautiful cornucopia of Black music and our special way of presenting it. We hope you enjoy.\n\nLaTesha Harris | February 17, 2021\n\"There are a lot of people who have been moving the needle forward for Black people. And they have been for some time,\" says an earnest, almost plaintive 2 Chainz. In a heart-filled sermon, he cites Martin Luther King Jr., Tyler Perry and Puffy as trailblazers, practicing gratitude for Black leaders who inspire him and the world at large. It's a sober moment of euphoria — and a drastic shift from the first 17 minutes of the Grammy winner's flashy Tiny Desk.\n\nColored in royalty, neon hues of lavender, fuchsia and violet, in his high-end nail studio Pamper (yes, he owns it, and he's not shy about letting you know), 2 Chainz is feeling himself throughout his five-song set. Getting a champagne-soaked pedicure, rolling one and periodically shouting out his sixth and latest studio album, So Help Me God!, the rapper exudes Black excellence in the way of luxurious comfortability. His unbridled braggadocio so clearly comes from the freedom of security after being denied opportunities, not just individually but generationally.\n\nAnd he's worked for it. First coming up from Atlanta's hip-hop scene as one half of Playaz Circle, 2 Chainz landed a solo record deal and guest verses on Kanye West's \"Mercy\" and Nicki Minaj's \"Beez in the Trap'' in 2012. And, through guest verses and singles, his music's been dominating the charts ever since. For his Tiny Desk (home) concert, he rewinds the clock and samples that stacked discography (\"Good Drank,\" \"I'm Different\") and performs three new hits (\"Grey Area,\" \"Southside Hov,\" \"Vampire\"). Alternating between earnest vulnerability and well-deserved conceit, 2 Chainz offers up his best: leaning into the dynamism of life and practicing gratitude.\n\nSET LIST\n\"Southside Hov\"\n\"Vampire\"\n\"Good Drank\"\n\"I'm Different\"\n\"Grey Area\"\n\nMUSICIANS\n2 Chainz: vocals\nTyler Sherard: bass\nAlex Turner: drums\nJosh Sneed: guitar\nMark Polynice: keys\n\nCREDITS\nVideo: Howard Ross, Shanika Boyd\nAudio : Willis Polk II, William \"Willy Will\" Hodge, Amond \"AJ\" Jackson, Brian \"Change\" Penny\n\nTINY DESK TEAM\nProducer: Bobby Carter\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nArt Director: CJ Riculan\nAssociate Producer: Bobby Carter\nTiny Production Team: Kara Frame, Morgan Noelle Smith\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann", "link": "https://www.youtube.com/watch?v=3ZLP8QMVse8", "date_published": "2021-02-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]