[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCHnyfMqiRRG1u-2MsSQLbXA", "title": "Why Robots That Bend Are Better", "description": "Robots of the future may be softer, squishier and bendier than robots today. This could make them ideal for space exploration. Check out http://kiwico.com/Veritasium50 for 50% off your first month of any subscription!\n\nOn Thursday February 18th, 2021 the NASA Perseverance Rover will land on Mars. It is a wonderful robot, made out of steel and wire — but will future robots look like Perseverance? There is an emerging field of  research on \"soft robots\", where the machines are flexible. These soft robots have many advantages over traditional robots — they're safer, lighter, more flexible and can change their shape and size.\n\nNASA is investigating the use of soft robots for space missions. For future visits to Enceladus or Europa, a lander could cut a hole in the ice and then insert a compliant robot through the hole. This robot could then grow and change shape on the other side.\n\nReferences:\nN. S. Usevitch, Z. M. Hammond, M. Schwager, A. M. Okamura, E. W. Hawkes, S. Follmer, An untethered isoperimetric soft robot. Sci. Robot. 4, \nhttps://ve42.co/Hammond2020 — paper about the truss robot\n\nhttps://ve42.co/Usevitch2020 — press release and video about the truss robot\n\nElectronics-free pneumatic circuits for controlling soft-legged robots\nDylan Drotman1, Saurabh Jadhav, David Sharp, Christian Chan, Michael T. Tolley Sci. Robot. 6, eaay2627 (2021)\nhttps://ve42.co/Drotman — paper about the turtle robot\n\nSpecial thanks to Patreon supporters:\nJim Osmun, Tyson McDowell, Ludovic Robillard, jim buckmaster, Robert, fanime96, Marc Forand, Juan Benet, Ruslan Khroma, Robert Blum, Grace O'Maille KRON x Arc iOS, Richard Sundvall, Lee Redden, Vincent, Lyvann Ferrusca, Alfred Wallace, Arjun Chakroborty, Joar Wandborg, Clayton Greenwell, Pindex , Michael Krugman, Cy 'kkm' K'Nelson, Sam Lutfi, Ron Neal, Bryan Baker\n\nVideo supplied by Getty Images\n\nThanks to Zachary Hammond for showing me the soft truss robot\nFilmed by Derek Muller\nEdited and GFX by Trenton Oliver\nAnimation by Ivy Tello\nMusic by Jonny Hyman\nThumbnail by Ignat Berbeci, Dan Meyer", "link": "https://www.youtube.com/watch?v=058hRtaCWC0", "date_published": "2021-02-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]