[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Apex Legends: Escape - Everything To Know About Season 11", "description": "In this video, Persia goes over all of the big changes heading to the newest season of Apex Legends. Apex Legends: Escape introduces the new battle royale map called Storm Point, Ash who is the newest legend, and the C.A.R. SMG which is also a new weapon. A variety of other changes are also coming to other weapons, legends, and the ranked playlist.\n\nStorm Point is the fourth and largest battle royale map to be added to Apex Legends and the first to be developed after the release of the game. There will be 15% more playable space on Storm Point, natural wildlife that can attack you, and gravity cannons to boost you around the map. \n\nAsh will provide exclusive intel to her and her squad with her passive that can scan deathboxes to find its attackers and slow enemies down with her tactical Arc Tether. Ash's ultimate is called dPhase Breach and it creates a one-way portal that can help your team get in or out of fights quickly.\n\nThe C.A.R. SMG is a hybrid weapon that can use both light and heavy ammo and attachments. This helps with inventory management and gives you a wider variety of loot options.\n\nThere are also changes to Wattson and overall weapon balancing for season 11's arsenal. Ranked playlists will also see changes to their point system to make games more rewarding for those who obtain kills and get kills on opponents of a higher rank. \n\nTimestamps:\nIntro - 00:00\nStorm Point - 00:21\nAsh - 02:35\nWattson - 05:03\nC.A.R. SMG - 05:51\nWeapon, Crafting, & Hot Zone Changes - 06:26\nRanked Playlist Changes - 08:42\nOutro - 09:46", "link": "https://www.youtube.com/watch?v=45fVhZ2CcWQ", "date_published": "2021-10-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 Gameplay - First Look At Renewal, Breakaway and Discarded Maps", "description": "Battlefield 2042 is available on November 19, 2021 with early access starting November 12, 2021.\n\nFrom Egypt’s giant wall to Singapore’s maze-like cargo containers, get your first look at gameplay on three of the seven maps coming at launch: Renewal, Breakaway and Discarded.\n\nThe maps in Battlefield 2042 allow for all-new gameplay experiences, with unprecedented scale and choices in gameplay. With the introduction of 128 players*, each map is specifically designed to provide a unique experience that directly impacts strategy for you and your squad. Battlefields have multiple distinct combat areas housed in a single playspace and this extra space means more variety and more meaningful vehicle gameplay.\nBattlefield 2042 is made up of three distinct multiplayer experiences – All-Out Warfare features the next generation of fan-favorite modes Conquest and Breakthrough; Battlefield™ Portal allows players to discover battles from the past, present and future as well as to creating and change the rules of war; while Battlefield™ Hazard Zone brings a tense, squad-focused survival experience. Adapt and overcome on dynamically-changing battlegrounds with the help of your squad and a cutting-edge arsenal.\n\n#Battlefield2042", "link": "https://www.youtube.com/watch?v=2_rL1p-P37o", "date_published": "2021-10-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Vanguard File Size Revealed | GameSpot News", "description": "In this episode of GameSpot News, Call Of Duty: Vanguard file size might spare you from deleting other games, change your Battle.net handle for free, BlizzCon is cancelled, and there’s another Pikmin game.\n\nHere’s what you need to know in video games today. Call Of Duty: Vanguard’s install sizes are reportedly 30%-50% smaller at launch than previous games in the series on PlayStation 5, PS4, Xbox Series X/S, Xbox One, and PC. That’s not to say it’s a small install--it'll still require 56 to 93 gigs free, depending on the system. It might finally be time for you to uninstall Modern Warfare or Cold War to make space. Don’t forget to plan for more Warzone installs when the new Pacific map launches. \n\nBlizzard's is still seeing the fallout of toxic workplace allegations against it, with the latest developments being the cancellation of BlizzCon this year, and Overwatch character McCree's name changing to Cole Cassidy. McCree previously carried the name of an employee who was ousted from the company amid sexual harassment and discrimination allegations at Activision Blizzard. To go along with Cole's new name, players can now change their BattleTags for Battle.net for free for a limited time. \nFinally, Division 2 post-launch content has been delayed to February 2022 and Nintendo and Niantic have announced their next mobile app, Pikmin Bloom, coinciding with the 20th anniversary of Nintendo's nature-based franchise.\n\nTo find out what you need to know tomorrow, head on over to GameSpot.com and YouTube.com/Gamespot for more news.", "link": "https://www.youtube.com/watch?v=OBGkQYNJmKc", "date_published": "2021-10-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Mario Party Superstars - N64 vs. Switch Graphics Comparison", "description": "With Mario Party Superstars bringing back boards and minigames from the N64 titles, we put Mario Party 2 head-to-head with Superstars to see the graphical differences.\n\nMario Party Superstars is the newest entry in the Mario Party series, and with it, five classic boards from the Nintendo 64 titles return. Those five boards are Peach’s Birthday Cake and Yoshi’s Tropical Island from the original Mario Party, Space Land and Horror Land from Mario Party 2 (which are showcased in this video), and Woody Woods from Mario Party 3. Superstars also contains 100 minigames from across the entire series, including the GameCube, Wii, and Wii U entries. \n\nA few things to note about this video: The original version of Mario Party 2 is an N64 game, but the capture used in this video is the N64 version running on Wii U Virtual Console, while Mario Party Superstars was captured on a Nintendo Switch. Also, Mario Party 2 is running at 30fps, while Mario Party Superstars runs at 60fps, so you’ll notice one is smoother than the other.\n\nMario Party Superstars releases for Nintendo Switch on October 29, 2021. As of right now, the N64 Mario Party games are not scheduled to be released as a part of Nintendo 64 - Nintendo Switch Online, but hopefully some of them will be in the future. If you’re looking for more Mario Party Superstars videos, we’ve got you covered here on GameSpot.\n\nVideo Review: https://youtu.be/rNStB_1EtWs\n18 Minutes of Gameplay: https://youtu.be/QkswF9VuxgM", "link": "https://www.youtube.com/watch?v=6Jom434UcNo", "date_published": "2021-10-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Mario Party Superstars Review", "description": "Mario Party Superstars delivers on the nostalgia, but at the cost of feeling fresh.\n\nNintendo's Mario Party Superstars will be available on Nintendo Switch on October 29, 2021. You can read the full written Mario Party Superstars review by Randolph Ramsay on GameSpot: https://www.gamespot.com/reviews/mario-party-superstars-review-the-fault-in-our-stars/1900-6417771/\n\nIf you’re looking for more Mario Party Superstars videos, we’ve got you covered here on GameSpot.\n\nN64 vs. Switch Graphics Comparison: https://youtu.be/6Jom434UcNo\n18 Minutes of Gameplay: https://youtu.be/QkswF9VuxgM", "link": "https://www.youtube.com/watch?v=rNStB_1EtWs", "date_published": "2021-10-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Best Of Xbox Game Pass... Don't Miss These", "description": "There's so many games on Game Pass it can be a little overwhelming. Add Game Pass Ultimate and EA Play to the mix, and the sea of games to play gets a lot bigger. It can be hard to narrow down what to play first, so we put together a list showcasing some of the best games to play right now on Xbox Game Pass.\n\nIf you're in the mood for something scary to match the Halloween season, there's plenty of horror games on offer like the PT inspired Visage, or the Left 4 Dead spiritual successor Back 4 Blood. But if horror isn't your bag, there's more charming and heartfelt games like The Good Life or Psychonauts 2. There's even classics like Myst, or the highly meditative Tetris Effect: Connected. Suffice to say, you have options.\n\nThe library is ever-growing, so this list is only a snapshot of the 100+ games Game Pass has. For our other list on great games to consider playing, check out this video: https://youtu.be/70Vd2mGXhJY\n\nBest Horror Games To Play Right Now: https://youtu.be/nNO_Q2I9I-A\n\n00:00 - Intro\n00:30 - Visage\n01:20 - Resident Evil 7\n02:00 - Back 4 Blood\n02:53 - The Good Life\n03:40 - Psychonauts 2\n04:10 - The Forgotten City\n04:55 - Myst\n05:51 - Tetris Effect: Connected\n06:20 - Hades\n06:50 - Microsoft Flight Simulator\n07:11 - Outro\n\n#xbox #xboxgamepass", "link": "https://www.youtube.com/watch?v=9E_WsxqugrA", "date_published": "2021-10-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Deathverse Let It Die Trailer | Playstation State of Play 2021", "description": "Deathverse: Let it Die is a 3rd person action survival game. You'll hunt your oponnents all while a flamboyant rich man watches the games. You can forge new weapons to compete again. Deathverse: Let it Die releases Spring 2022", "link": "https://www.youtube.com/watch?v=fR64s_v2C5Q", "date_published": "2021-10-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Five Nights at Freddy's: Security Breach Gameplay Trailer | Playstation State of Play 2021", "description": "This new trailer for Five Nights at Freddy's: Security Breach (FNAF: Security Breach) shows off new gameplay as well as characters Roxane Wolf, Glamrock Chica, and more  Releases December 16, 2021", "link": "https://www.youtube.com/watch?v=krJGDwdcTEc", "date_published": "2021-10-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "N64 on Switch Has Some Issues | GameSpot News", "description": "In today’s episode of GameSpot News, Persia talks about what problems N64 games are having on the Nintendo Switch, how A Quiet Place will be adapted to video games, what’s in the Phasmophobia Haloween update, and how Far Cry 6 is laying on the guilt.\n\nIt’s another episode with Persia covering what you need to know about video games today. Nintendo Switch Online has released a bunch of N64 titles that you can play on the go, such as The Legend of Zelda: Ocarina of Time, and there have been some issues with the games. The largest problem is button mapping, with the N64’s six buttons having to be laid over the Nintendo Switch controller, which only has four. That is creating awkward and, for some, unplayable control schemes for titles such as Sin and Punishment. Some games also lack features that used to be available using the N64 controller pack, which was a device inserted into the older controller that acted as a memory card. That means the games are seeing missing functionality, such as the ability to race against your own ghost driver in Mario Kart 64. \n\nA Quiet Place is becoming a single-player, story-driven horror game. Paramount’s movie about a family trapped in a future where aliens hunt down anyone who makes a sound is now being adapted into a game by Saber Interactive, iLLOGIKA, and EP1T0ME. The development team has also pulled in employees who worked on Rainbow Six and Far Cry. The story will not focus on the family seen in the movie, but instead will tell its own story. If there’s one thing we learned from the movie, it’s that you should definitely go chasing waterfalls… if you want to have any conversations with other characters, anyway.  \n\nPhasmophobia is releasing a huge “Nightmare” update for Halloween, and it includes the new Maple Lodge Campsite map. There are four new ghost types as well: Onryo, The Twins, Obake, and Raiju, which players will run into more frequently during the Halloween event. The update also adds weather, Nightmare-level difficulty, mini-map changes, and balance tweaks.\nFinally, if you dropped off of Far Cry 6, the game might have something to say about it. Players have reported getting emails from antagonist Anton Castillo telling them they can do better. For more news head on over to GameSpot.com and YouTube.com/GameSpot.", "link": "https://www.youtube.com/watch?v=V6HChf16kM0", "date_published": "2021-10-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "PlayStation State of Play | October 27, 2021 Livestream", "description": "Tune in for the Sony PlayStation State of Play on Wednesday, October 27 at 2pm PT. This State of Play will focus on announcements and updates for third-party PS4 and PS5 games.\n\n#PlayStation #StateofPlay", "link": "https://www.youtube.com/watch?v=b3JaHoWZKbg", "date_published": "2021-10-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Playstation State of Play 10.27.21 Full Presentation", "description": "Watch the Playstation (Sony) State of Play full presentation from 10.27.21 showing off some of the third party games coming to Playstation consoles including games like Deathverse and Five Nights at Freddy's Security Breach.", "link": "https://www.youtube.com/watch?v=Im9hgpj7610", "date_published": "2021-10-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]