[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCHnyfMqiRRG1u-2MsSQLbXA", "title": "How Hidden Technology Transformed Bowling", "description": "Bowling has been reinvented many times over the past seven thousand years but especially in the last 30. This is the fascinating physics of balls, oil, lane and pins. A portion of this video was sponsored by Salesforce. Go to https://salesforce.com/veritasium to learn more.\n\nHuge thanks to Steve Kloempken and all of Storm Bowling for letting us visit and get a glimpse into the crazy world of bowling.\nHuge thanks to legends Chris Barnes and Pete Weber for taking the time to bowl with us.\nHuge thanks to Creative Electron for their help with getting the bowling balls X-rayed. Check out their work here: https://creativeelectron.com/\nThanks to Ron Hatfield and James Freeman for their help with research. Check out their great book, Bowling Beyond the Basics: https://ve42.co/HatfieldFreeman\nThanks to the United States Bowling Congress (USBC) and Professional Bowlers Association (PBA) for their help with accessing archival data and footage.\nSpecial thanks to Rod Cross for physics consultation.\nThanks to Bill Guszczo for giving us the idea to make this video in the first place.\n\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nReferences:\nFreeman, James, and Ron Hatfield. Bowling beyond the Basics: What's Really Happening on the Lanes, and What You Can Do about It. BowlSmart, 2018. -- https://ve42.co/HatfieldFreeman\nN. Stremmel, P. Ridenour and S. Sterbenz. “Identifying the Critical Factors That Contribute to Bowling Ball Motion on a Bowling Lane.” United States Bowling Congress, 2008. -- https://ve42.co/BallMotionASQ\nUSBC Equipment Specifications and Certification Team. “Ball Motion Study: Phase I and II Final Report.” United States Bowling Congress, 2008. -- https://ve42.co/USBCBallMotion\nBrettingen, Patrick, and Nicki Mours. “USBC static weight limits remain relevant.” United States Bowling Congress, 2011. -- https://ve42.co/USBCStaticWeight\nArticle on lane oil origins -- https://ve42.co/OilOrigins\nLuna, Richard. “Bruce Pluckhahn says there's a little bit of bowling…” United Press International Archives, 1984. -- https://ve42.co/BowlingHistory\nJohnson, Brody D. “The Physics of Bowling: How good bowlers stay off the straight and narrow.” St. Louis University. -- https://ve42.co/JohnsonPhysicsPpt\nTalamo, Jim. “The Physics of Bowling Balls.” -- https://ve42.co/TalamoPhysicsPpt\nThompson, Ted. “Breakdown and Carrydown - Then and Now.” Kegel. 2012. -- https://ve42.co/ThompsonKegel\nFrohlich, Cliff. “What Makes Bowling Balls Hook?” American Journal of Physics, vol. 72, no. 9, 2004, pp. 1170–1177., https://doi.org/10.1119/1.1767099. -- https://ve42.co/FrohlichHook\nArticle on bowling’s ranking in participatory sports -- https://ve42.co/BowlingRank\nSperanza, Dan, and Dave Nestor. “Initial Oil Absorption Results.” United States Bowling Congress, 2016. -- https://ve42.co/USBCOilAbsorption\nD. Benner, N. Mours, and P. Ridenour. “Pin Carry Study: Bowl Expo 2009.” United States Bowling Congress, 2009. -- https://ve42.co/USBCPinCarry\nHopkins, D. C., and J. D. Patterson. “Bowling Frames: Paths of a Bowling Ball.” American Journal of Physics, vol. 45, no. 3, 1977, pp. 263–266., https://doi.org/10.1119/1.11005. -- https://ve42.co/HopkinsPath\nNormani, Franco. “The Physics of Bowling.” Real World Physics Problems. -- https://ve42.co/NormaniPhysics\nHoraczek, Stan. “The insides of pro bowling balls will make your head spin.” Popular Science, 2020. -- https://ve42.co/HoraczekSpin\nHouse shot oil pattern -- https://ve42.co/HouseOil. Licensed under Creative Commons: By Attribution 4.0.\n\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nSpecial thanks to Patreon supporters: Andrew, Diffbot, Micah Mangione, MJP, Gnare, Nick DiCandilo, Dave Kircher, Edward Larsen, Burt Humburg, Blake Byers, Dumky, Evgeny Skvortsov, Meekay, Bill Linder, Paul Peijzel, Mac Malkawi, Michael Schneider, Big Badaboom, Ludovic Robillard, Jim buckmaster, fanime96, Juan Benet, Ruslan Khroma, Robert Blum, Richard Sundvall, Lee Redden, Vincent, Marinus Kuivenhoven, Alfred Wallace, Clayton Greenwell, Michael Krugman, Cy 'kkm' K'Nelson, Sam Lutfi, Ron Neal \n\nWritten by Derek Muller and Emily Zhang\nAnimations by Mike Radjabov and Ivy Tello\nFilmed by Derek Muller, Trenton Oliver, and Emily Zhang\nEdited by Trenton Oliver\nSFX by Shaun Clifford\nAdditional video supplied by Getty Images\nMusic from Epidemic Sounds\nProduced by Derek Muller, Petr Lebedev, and Emily Zhang", "link": "https://www.youtube.com/watch?v=aFPJf-wKTd0", "date_published": "2021-09-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]