[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Full Overwatch 2 Push Map Gameplay with Pro Players (with Commentary)", "description": "Watch a full Overwatch 2 Push match between some of the pro players in the Overwatch League. You'll get to see different heroes in action in the new 5v5 fast paced Push game mode. Watch Reinhardt, Sombra, and more in this latest gameplay clip during Overwatch Leagues halftime. The match is shoutcasted by Matt Morello and Mitch Leslie.\n\nFor the latest on what’s happening at Activision Blizzard with regard to the ongoing legal action taken by the California Department of Fair Employment and Housing, take a look at our timeline of events: https://www.gamespot.com/articles/act...\n\n#overwatch2", "link": "https://www.youtube.com/watch?v=RYjuthNJPCk", "date_published": "2021-09-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Games Ranked", "description": "With Halo Infinite set to release in December for the Xbox Series X, we’re looking back at the Halo series overall and ranking the mainline FSP franchise. From Halo: Combat Evolved to Halo Reach to Halo 5: Guardians, we’re pitting the classic Bungie and 343 Industries games against each other to see who comes out on top. The Master Chief and Cortana may dominate the charts, but how do the adventures of Noble 6 and Spartan Locke stack up to Spartan 117.\n\nIn this video, we are going to analyze each Halo game’s campaign, from the haunting explorations of Halo 3: ODST to the classic exploration of the alien Covenant’s culture in Halo 2. At the same time, we also take a look at the Halo games' most defining feature: multiplayer. From Warzone to Firefight to Invasion to Grif Ball, Halo has constantly set the bar for multiplayer, both in split-screen and on Xbox Live, and no discussion of the series can ignore the importance of Halo’s impact on online gaming. \n\nFor this ranking, we’re not including the Halo Wars series or the offshoots like Spartan Strike or the arcade game Fireteam Raven, though they are great games for those who want more story context on Halo Infinite. And while Halo: The Master Chief Collection is absolutely the best way to play Halo in 2021, it’s also not featured on this list because it is ultimately a compilation package instead of one game. You can also sign up for Game Pass Ultimate to play every mainline Halo game as well as numerous spin-offs. \n\nAnd don’t forget to check out how Halo, the franchise that defined Xbox, almost wasn’t an Xbox game at all in this video! https://youtu.be/noE49iZ9Reg\n\nHalo Infinite is right around the corner with it’s Microsoft confirmed December 8th, 2021 release date looming this holiday season. Halo Infinite is now available for pre-order. You can check out our pre-order guide on gamespot.com.\n\n#halo #haloinfinite", "link": "https://www.youtube.com/watch?v=YWTvIuHCgUE", "date_published": "2021-09-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Kena: Bridge of Spirits 10 Combat Tips You Need To Know", "description": "Don’t let the cute appearance of Kena Bridge of Spirits deceive you, combat in this game is tougher than it looks, especially on its harder difficulties. So I’m here to give you a few general strategies and tips as you progress through the game to help you out. And we will be spoiler friendly.\n\nIn this video we teach you different combat tips including: making sure to use your bow, jumping to dodge, parrying, rot infused bombs, and much more. Watch as Max gives you these high level combat tips and the best way to use them.\n\n#kena #bridgeofspirits", "link": "https://www.youtube.com/watch?v=aglhW3G1WJY", "date_published": "2021-09-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Overwatch 2 Sombra and Basion Rework Full Presentation", "description": "Overwatch 2 is making changes to both Sombra and Bastion learn more about both of their changes with the Overwatch League hosts and Geoff Goodman. Sombra's hack ability has been tweaked. Bastion has a new ultimate as well as some tweaks to his sentry mode. Learn more about both of their reworks in Overwatch 2\n\nFor the latest on what’s happening at Activision Blizzard with regard to the ongoing legal action taken by the California Department of Fair Employment and Housing, take a look at our timeline of events: https://www.gamespot.com/articles/act...\n\n#overwatch2 #owl", "link": "https://www.youtube.com/watch?v=tBrNEfPyl24", "date_published": "2021-09-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Death Stranding Director's Cut Video Review", "description": "While the new features and missions are nice, the world around us has made Death Stranding better.\n\nJustin Clark spent 40 hours on Death Stranding Director's Cut, half from the beginning, half with his imported PS4 clear save. He is currently accepting applications for babies to carry around in a clear container on his stomach for Halloween. A code was provided by the publisher.\n\n#deathstranding", "link": "https://www.youtube.com/watch?v=rfmb_tv52L4", "date_published": "2021-09-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To MORE Rainbow Six Siege Guns", "description": "Firearms Expert Reacts To MORE Rainbow Six Siege Guns\nBy popular demand, Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down EVEN MORE weapons and gadgets from Rainbow Six Siege, including the C8-SFW, the V308 Vector and the infamous BOSG.12.2.\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of Rainbow Six Siege and compares them to their real-life counterparts.\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\n#firearms #expertreacts #rainbow6siege", "link": "https://www.youtube.com/watch?v=TQlpXtv-IN4", "date_published": "2021-09-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Infinite Weapons & Super Punch Glitch Leak | GameSpot News", "description": "Halo Infinite’s multiplayer beta is live once again and with it comes the leak of new weapons and a similar glitch to an old Halo 2 one. Gameplay footage from Battlefield Mobile is spotted online. And The Last of Us is getting new content.\n\nIn this video, DeVante talks about Halo Infinite’s newest weapons that were revealed by accident in the current multiplayer beta. Alongside the weapons are a new glitch, reminiscent of an old “BXB” glitch from Halo 2. 343 Industries have also given more details on the future of Infinite’s bots. \n\nLater in the video, DeVante goes over new Battlefield Mobile gameplay footage that surfaced online after EA soft launched the game in Philippines and Indonesia. Battlefield Mobile does not have a release date yet. \n\nOn September 26, 2021, Naughty is planning to reveal “all new content”, however at this time it is unclear what exactly that content will be. Fans can expect the announcement at 9am PT / 12pm ET on Sunday.\n\nTIME STAMPS:\n00:00 - Intro\n00:14 - New Halo Weapons Leak\n00:57 - Halo Infinite Glitch Spotted\n01:23 - Halo Infinite Bots Getting Smarter\n02:06 - Battlefield Mobile Gameplay Footage \n02:49 - Perfect Dark Reboot Being Co-Developed By Crystal Dynamics\n03:15 - The Last of Us Getting New Content\n\n#halo #haloinfinite #superpunch", "link": "https://www.youtube.com/watch?v=Iwl28_HQaIU", "date_published": "2021-09-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]