[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Biggest PC Games to Play in 2021 and Beyond", "description": "Plenty of PC games are lined up for 2021 and even include some Xbox and PlayStation console exclusives. Look forward to Humankind, Halo: Infinite, Deathloop, Persona 5 Strikers, and so much more.\n\nEven as consoles begin to transition to a new generation, PC is still its own standout platform for gaming with plenty going for it. All Xbox console exclusives and a few PlayStation console exclusives will be made available on PC, and most (if not all) big name multiplatform games also find their way to PC. On top of that, you get some truly unique experience that you can't find on consoles. And if you can get your hands on the latest wave of video cards from Nvidia and AMD, PC games can even exceed the graphical fidelity and performance of the new-gen systems. So, as we look into 2021 in the video above, we highlight the biggest PC games going into the new year.\n\nSome of the notable multiplatform games we're looking forward to include Hitman 3, Nier: Replicant, Back 4 Blood, Far Cry 6, Resident Evil: Village, and Hogwarts Legacy, and so much more. PC also stands out for featuring console exclusives from both PlayStation and Xbox. For example, The Medium, Scorn, and Halo: Infinite are games that'll boast the power of Xbox Series X|S but will simultaneously launch on PC. And games such as Deathloop (timed), Guilty Gear Strive, Kena: Bridge of Spirits are marquee PlayStation titles that'll launch on PC, too. It's like having the best of both worlds. Another surprising game that will land on PC is Persona 5 Strikers, given that the original RPG remains a PlayStation exclusive. One PC exclusive to pay attention to is Humankind, which looks to shuffle around the traditional formula of the 4X strategy genre that we've seen domination by the Civilization franchise.\n\nThe roster is much bigger than that and there's plenty to be excited for in 2021 if you have a gaming PC, so be sure to check everything out in the video above, and take note of which ones strike your fancy. These are just the games that currently have a release date or release window in 2021, so there may be more surprises throughout the year. For a full list of the upcoming PC games in 2021 and beyond, be sure to check it out on GameSpot.com.\n\n0:00 Introduction\n0:31 Hitman 3\n0:47 The Medium\n0:58 Little Nightmares II\n01:12 Persona 5 Strikers\n01:24 Prince of Persia: The Sands of Time Remake\n01:37 Disco Elysium: The Final Cut\n01:49 Guilty Gear Strive\n02:04 NIER Replicant Ver.1.22474487139\n02:16 Deathloop\n02:30 Back 4 Blood\n02:42 Kena: Bridge Of Spirits\n02:57 Mass Effect: Legendary Edition\n03:09 Halo Infinite\n03:23 Axiom Verge 2\n03:36 12 Minutes\n03:50 Far Cry 6\n04:03 Ghostwire: Tokyo\n04:18 Gotham Knights\n04:32 Hogwarts Legacy\n04:47 The Lord of the Rings: Gollum\n05:02 Psychonauts 2\n05:15 Resident Evil: Village\n05:29 Shadow Warrior 3\n05:42 S.T.A.L.K.E.R. 2\n05:55 Rainbow Six Quarantine\n06:09 Vampire: The Masquerade - Bloodlines 2\n06:22 Oddworld: Soulstorm\n06:38 Humankind\n06:50 Lego Star Wars: The Skywalker Saga\n07:03 Ruined King: A League of Legends Story\n07:16 Scorn\n07:35 Unknown 9: Awakening", "link": "https://www.youtube.com/watch?v=3n3VYfXBiIA", "date_published": "2021-01-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]