[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "10 Outriders Tips You Need To Know", "description": "Outriders changes quickly as you progress in the early hours, so we gathered 10 essential tips to get you on your feet and get better loot!\n\n Outriders is now out for Xbox Series X|S, Xbox One, PS5, PS4, PC, and Stadia. For the most part, the loot shooter/RPG hybrid is pretty straightforward, but a few of its mechanics and systems could use a bit more clarification.\n\nIn the video above, Jordan Ramée details 10 tips for how to be a better Outrider in Outriders. Some of the advice is geared towards ensuring you're always finding the best loot, whether that's from chests hidden throughout the planet of Enoch or from World Tier rewards. Other tips should help you make Outriders a bit more approachable in terms of difficulty--if you take the time to understand how crafting and modding works, as well as when to raise and lower your World Tier, you'll have a much easier time making it through the game.\n\nOutriders has managed a rather popular launch despite the assortment of server issues that are pretty much an expected part of the experience for any brand-new, online-only game at this point. So far, we've been enjoying it too.\n\nIn GameSpot's Outriders review, Phil Hornshaw wrote, \"[Outriders'] story is often funny but similarly intense; its combat requires you to take cover and to charge; its abilities make you phenomenally powerful but prone to overestimating yourself. If you can find the balance in Outriders, People Can Fly's RPG-shooter finds ways to combine well-worn video game ideas into something new and fun.\"", "link": "https://www.youtube.com/watch?v=lfGMQnLP_ds", "date_published": "2021-04-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "7 Things We Want In Starfield", "description": "We don't know much about Bethesda Game Studios' next game, but it sounds ambitious. Here are seven things we want to see in Starfield.", "link": "https://www.youtube.com/watch?v=40TEb3gsaCI", "date_published": "2021-04-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Battlefield 4’s Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the insane weaponry of Battlefield 4, including the FN F2000 rifle, the UTS 15 shotgun, and the Chinese QBB Type-95 automatic rifle.\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of Battlefield 4, and compares them to their real-life counterparts.\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\nYou can purchase Jonathan’s book here - https://www.headstamppublishing.com/bullpup-rifle-book", "link": "https://www.youtube.com/watch?v=aIN7OP63lvs", "date_published": "2021-04-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "2021: AAA Gaming’s Weirdest Year?", "description": "2021 is shaping up to be another weird year for gaming, with the release calendar looking sparse, and events up in the air. Is gaming finally feeling the full knock-on effect of 2020? Lucy, Jordan, and Tamoor discuss.\n\nYou've probably felt it: things are a bit out of whack in the video game industry. The past year has been difficult for a variety of reasons and it seems like the knock-on effects of working from home, as well as the challenges that presents to game development and hosting traditional events, is becoming more and more apparent.\n\nWhat's most evident is that the traditional release cycle, in terms of the rhythm of new games being launched, is off. At the same time, events that had been permanently marked on our calendars for years now are either being penciled in or rubbed out entirely. 2021 feels like it's becoming a weird year for video games and those of us that enjoy them. \n\nThat is the subject of discussion this week's episode of Console Crew, in which Lucy, Jordan, and Tamoor look at how the industry has changed, what the future holds, and also what we can look forward to for the rest of the year. Naturally, there's a discussion about games that have been delayed as a result of recent challenges, and the same goes for events like E3. \n\nThere's also a discussion about the opportunities that this strange new cadence of releases provides us. As noted in the episode, indie games are more abundant and more interesting than ever, and with fewer major blockbusters from mega-publishers eating up the oxygen in the discussion of games, there's more opportunity for them to shine.\n\nConsole Crew is your weekly Friday roundup of the biggest news from PlayStation, Xbox, and Nintendo, hosted by Lucy James, Tamoor Hussain, and Jordan Ramée. Subscribe to youtube.com/GameSpot​ to never miss an episode.", "link": "https://www.youtube.com/watch?v=0nSSTLn52RY", "date_published": "2021-04-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Icarus: No Rescue Reveal Trailer", "description": "Filmed in a vivid documentary style with live actors, Icarus: No Rescue is told from the perspective of the earliest prospectors to come to planet Icarus after its terraforming failed, looking back twenty years later. Their search for exotic matter pushed them to their limits as they survived off the land in this brutal alien world. Those who missed their dropship’s return to orbit were left behind forever, while others grew rich crafting exotic matter into new technologies.", "link": "https://www.youtube.com/watch?v=9cJd_UXfTug", "date_published": "2021-04-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Outriders Review In Progress", "description": "People Can Fly's Outriders mixes a lot of well-worn shooter and RPG elements to create something that feels fresh, if you can get used to its balance.", "link": "https://www.youtube.com/watch?v=nq1ckL2RzCA", "date_published": "2021-04-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]