[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCW0gH2G-cMKAEjEkI4YhnPA", "title": "Maps of Middle-earth: The Second Age | Tolkien Explained", "description": "Covering the lands of Middle-earth during the Second Age, region by region.  With Beleriand sunk into the sea, the world is changed.  The elves create new realms for themselves, while the men of the First Age are given the island of Númenor by the Valar.  As the Second Age begins and a new Dark Lord rises, alliances and enemies are made that will shape the world for ages to come.\n\n*Hit subscribe - and the bell - so you never miss a video from Nerd of the Rings!*  \n\nNerd of the Rings on PATREON: https://www.patreon.com/NerdoftheRings\n\n-------------- \nAll content falls under fair use: any copying of copyrighted material done for a limited and “transformative” purpose, such as to comment upon, criticize, or parody a copyrighted work. Such uses can be done without permission from the copyright owner.   If your artwork appears and you are not listed here, please let me know! I want to make sure all artists are credited for their amazing work.\n\nTo purchase artist work, I highly recommend checking out these amazing artists online!\n\nTed Nasmith - https://www.tednasmith.com/shop/\nJerry Vanderstelt - https://store.vandersteltstudio.com/main.sc\n\nBeleriand Map - Lamarcana (translated by Nerd of the Rings)\nHurin Finds Morwen - Ted Nasmith\nBeren - Jenny Dolfen\nGaladriel and Celeborn at Lake Evendim - Ted Nasmith\nLossoth - Devon Cady-Lee\nMines of Moria - JC Barquet\nSauron - Jerry Vanderstelt\nFarewell to Fangorn - Luca Bonatti\nCelebrimbor and Annatar - WETA\nCelebrimbor and Narvi - Auta i Lome\nFangorn - Adam Burton\nHelm's Deep - Chris Rahn\nScouring of the Shire - Owen William Weber\nDunlending - John Howe\nNumenorean Port - Inacio Henrique\nPorto Numenor - Giovanni Calore\nNumenor - Issi Saeta Cabrera\nEldalonde - Matej Cadil\nAnnuminas - Ted Nasmith\nArmenelos - Nemanja Bubalo\nThe Ships of the Faithful - Ted Nasmith\nOathbreakers, Why Have Ye Come? - Abe Papakhian\nOrthanc in the Second Age - Ted Nasmith\nMinas Tirith - Alan Lee\nOsgiliath - Matej Cadil\nArgonath - Elaine Dezso\nArgonath - Ralph Damiani\nEdoras - Bakarov\n\nFor more information on the Second Age of Middle-earth, check out:\nThe Lord of the Rings (appendices)\nUnfinished Tales\nThe Silmarillion\nThe Atlas of Middle-earth by Karen Wynn Fonstad\nTolkienGateway.net\nThe Encyclopedia of Arda\n\n#tolkien #lordoftherings #lotronprime", "link": "https://www.youtube.com/watch?v=9A9Pg7nF1Xs", "date_published": "2021-04-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]