[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "You CAN'T make a \"Linux app\", because there is NO LINUX PLATFORM", "description": "The first 1,000 people to use this link will get a 1 month free trial of Skillshare: https://skl.sh/thelinuxexperiment11211 \n\nGet your Linux desktop or laptop here: https://slimbook.es/en/\n\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nI also do a Gaming Podcast: https://www.youtube.com/channel/UCbRPZ11S1quJ4ESoj42A3ug\nJoin us on our new Discord server: https://discord.gg/xK7ukavWmQ\nTwitter : http://twitter.com/thelinuxEXP\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\nFollow me on ODYSEE: https://odysee.com/@TheLinuxExperiment:e\nOr join ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\n\n00:00 Intro\n00:42 Sponsor: Skillshare\n01:47 What is a platform?\n02:57 Linux isn't a platform\n05:45 Linux has multiple platforms\n07:47 Why do we need app platforms?\n11:13 Parting Thoughts\n\nBut what's a platform, exactly? Basically, I'm talking about an application platform. \n\nThe best example that most people will be familiar with, will be in the smartphone world, with the iOS platform and the Android platform.\n\nProblem is, there is NO Linux platform, and there has never been one. \n\nThat's simply because there is no \"one Linux operating system\". You have what we call Linux distributions, which can be very different from each other, not including the same systems, desktop environments, packages or libraries.\n\nSo application developers can't really develop an app for the Linux platform. They can develop an application that runs on Linux based operating systems, and makes use of some Linux features and libraries, but they have to make A LOT OF choices along the way.\n\nDo they want to have a dependency on systemD, do they want to use GTK or Qt, or something else as the toolkit? Do they want to follow human interface guidelines for a desktop that uses this library? \nAnd once the app is done, they have to decide on the packaging format: do they want to try and get included in Debian's repos? In Fedora's? In Ubuntu's? Do you want to use AppImage packaging to ensure anyone can run your app? Do you want to have a flatpak version, or a snap one?\n\nLinux, instead, doesn't have a single, unified platform. It has multiple ones. \n\nWhat we have on Linux, is parts of platforms that developers can choose. And they already do so.\nThe best example, which I've already talked about, is elementary OS.\n\nThese guys have the operating system, the development tools, with a specific language, Vala, a graphical library, GTK, their own HIG and Granite, its associated library, one packaging format, Flatpak, and a way to distribute your app, the AppCenter.\n\nBut we also have other platforms in the making, and the main one is GNOME. And this is also why there is a lot of discussion currently about GNOME, theming, libadwaita, and all of that other stuff: because these are decisions and developments made to create a GNOME platform.\n\nGNOME doesn't want to be a simple desktop environment, that distributions can pick, tweak, arrange as they like, and ship to users. They want to be a platform that developers can target, and to ensure that GNOME can be a platform, they NEED to lock a few things down.\n\nBut why do we need platforms?\n\nWell, think about most people's complaints about using Linux: it's too fragmented, there are no third party applications, no one develops for linux, it's unstable, all that stuff.\n\nThese complaints are what platforms are trying to address.\n\nWith well defined platforms, developers can create apps that work well and look and feel the same in the hands of users. They can ensure they're stable. They have an enticing system and an easier, pre-defined path to start developing their application, and so, they are more likely to develop an application, period.\n\nIn the end, we can't really have it both ways: either we want to attract developers and for that, we need to offer compelling and stable development platforms, and that means limiting some choices, or we prefer to keep our existing model and all the user choice it allows, and that means that developers will still have a hard time developing for \"Linux\" as a whole, because there is no clear path to do so.", "link": "https://www.youtube.com/watch?v=MagNqxjKo-k", "date_published": "2021-11-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]