[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 Open Beta Trailer", "description": "Be among the first to experience the next generation of all-out warfare in the Battlefield 2042 Open Beta. Join the fight on Orbital with a diverse selection of Specialists, cutting-edge weaponry, and vehicles to choose from. Open Beta between October 8-9, 2021. Early access is available on October 6-7, 2021 for all players who pre-order the game or are current EA Play members. \n\nPreload starts Oct 5th, 2021 at 06:00 UTC on PC and 07:00 UTC on consoles.\n\n#battlefield #battlefield2042", "link": "https://www.youtube.com/watch?v=DGimZtGatZY", "date_published": "2021-09-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty Black Ops Cold War & Warzone Season Six Cinematic", "description": "The final showdown between Adler and Stitch is coming in Season Six of Call of Duty Black Ops Cold War and Warzone.\n\n#cod #callofduty #warzone", "link": "https://www.youtube.com/watch?v=qeLPa1b7iAY", "date_published": "2021-09-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Co-Creator Reacts to Infinite | GameSpot News", "description": "Join Persia as she talks about the Halo co-creator’s reaction to Halo Infinite so far, Resident Evil 4 VR launching on the Oculus Quest 2, and the reworks coming to Bastion and Sombra in the next Overwatch game. \n\nIn today’s episode of GameSpot News, Persia talks about the reaction of Halo’s co-creator to Halo Infinite after the recent beta. Marcus Lehto said he had a \"great time\" playing Infinite over the weekend, going on to praise its combat and map designs. The next Halo Infinite beta test begins September 30, and it will invite players to try Big Team Battle for the first time.\n\nPersia also goes over the details for the launch of Resident Evil 4 VR. This version completely reimagines the classic title and provides a brand-new way to experience it which will be coming to the Oculus Quest 2 on October 21.\n\nLastly, she talks about the big changes to Sombra and Bastion in the next Overwatch game as details were revealed during the Overwatch League Grand Finals. Sombra receives a series of tweaks while Bastion has gotten much more of an overhaul. \n\nFor more information on all of our topics today, visit gamespot.com\n\nTIMESTAMPS:\n\nIntro - 00:00 \nHalo Infinite - 00:15\nResident Evil 4 VR - 01:14\nOverwatch 2  - 02:20\nOutro - 04:20\n\n#halo #haloinfinite", "link": "https://www.youtube.com/watch?v=MiucvV0mmEc", "date_published": "2021-09-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Metroid Dread - 5 Minutes of Off-Screen Gameplay", "description": "We got a chance to check out Metroid Dread on the Nintendo Switch OLED ahead the October 8 release. Here's 5 minutes of gameplay for Metroid Dread that we shot off screen, focusing on the opening of the game. We also have our hands-on impressions up for Metroid Dread, which you can check on YouTube and GameSpot.com.\n\n#metroiddread #metroid #switch", "link": "https://www.youtube.com/watch?v=HzrGWR4cgt0", "date_published": "2021-09-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New World Launch Day Livestream", "description": "Join DeVante as he dives into the world of Aeternum. For thousands of years explorers have ventured to the island in search of its mysterious resource known as Azoth. This substance grants power and eternal life but often at a cost and has led to the corruption of the island as well as the island’s former masters to nearly go extinct. \n\nFind out which faction DeVante chooses and what his preferred style of play is.\n\n#newworld #newworldlivestream", "link": "https://www.youtube.com/watch?v=QSp1qSpMdc0", "date_published": "2021-09-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New World Server Issues - We Know You Want To Play! | GameSpot News", "description": "In today’s episode of GameSpot News, Persia talks about the massive popularity of New World causing problems for the game’s servers, Battlefield 2042 beta details, and Halo Infinite’s next beta being open to everyone on Xbox and friend’s of current Halo Insiders. \n\nNew World, Amazon Game Studios' long-delayed MMO, is finally live, and it has quickly become the #2 game on Steam with more than 700,000 concurrent players and counting. Due to this, the game is experiencing overloaded servers that is causing long queue times. The game is also seeing massive popularity on Twitch, which is owned by Amazon. Currently, more than 750,000 people are watching New World on the platform, and those watching certain channels and who link their Steam accounts can earn Twitch drops for in-game items.\n\nEA and DICE have officially announced the open beta dates for Battlefield 2042 and the beta officially begins on October 8, but people who preorder or subscribe to EA Play can start two days early, beginning October 6. Since EA Play is bundled with Xbox Game Pass Ultimate, subscribers to Microsoft's service can start on October 6 as well. Many other features including progression, cosmetics, and more will also be available during the open beta. \n\nXbox users can get access to the upcoming Halo Infinite multiplayer beta by downloading the Xbox Insider Hub app, which is free to download. Current Halo Insiders will also receive a “friend code” that can be redeemed for access to the beta on PC or Xbox.\n\nFor more information on all of today’s topics, visit gamespot.com\n\nTIMESTAMPS:\nIntro - 00:00\nNew World - 00:17\nBattlefield 2042 - 01:20 \nHalo Infinite  - 03:39\nOutro - 04:52\n\n#newworld #gamespotnews", "link": "https://www.youtube.com/watch?v=5HZPQpvRlWk", "date_published": "2021-09-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Nintendo Switch OLED Hands On Preview", "description": "The Nintendo Switch OLED version will release on October 8, and we recently got a chance to finally spend some time playing with the new device.\n\nThe new Nintendo Switch OLED is almost out, with its release date of October 8 only a matter of days away. I recently got some hands-on time with this new version during a preview session with the upcoming Metroid Dread, and I'm sure the question you're all asking is the same. Is the Nintendo Switch OLED version, which at $350 is $50 more expensive than the base Switch version, worth it?\n\n#nintendo #switch #switchOLED", "link": "https://www.youtube.com/watch?v=ZtCWMgPzIOQ", "date_published": "2021-09-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Legends: Arceus | New Gameplay Trailer", "description": "Check out the all new Pokemon Legends: Arceus trailer that dropped showing off some of the Noble Pokemon you'll experience in the game. Pokemon Legends: Arceus is coming in January 2022 to Nintendo Switch.", "link": "https://www.youtube.com/watch?v=CUhP8-uA5vc", "date_published": "2021-09-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Metroid Dread's Tension Is Relentless | Hands-On Preview", "description": "We went hands-on with the first sector of Metroid Dread and it's clear there will be a lot of tense moments with nearly indestructible EMMIs hunting you. Dread releases in October on Nintendo Switch.\n\nMetroid Dread doesn't waste any time in introducing what exactly there is to dread in the long-awaited sequel. Many of the game's trailers so far have featured the long-limbed, quadripedal robots known as EMMIs, who seem to be near impossible-to-kill sentries that series protagonist Samus Aran must simply avoid. EMMIs--or at least one version of them--are there right from the start of your adventure, and during my recent hands-on playthrough of the game's opening sector, EMMIs proved to be an effective, compelling way of instilling a healthy amount of panic to the series' tried-and-true core of action and exploration.\n\n#metroiddread #metroid", "link": "https://www.youtube.com/watch?v=Gy9LZ2sSnHM", "date_published": "2021-09-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New World - Everything You Need To Know", "description": "New World is an MMORPG from Amazon Games releasing exclusively on PC on September 28, 2021.Shipwrecked on the island of Aeternum, it is up to the player to uncover secrets, harvest Azoth and keep control of the island from falling into the wrong hands.\n\nNew World is an MMORPG from Amazon Games set on the mythical island of Aeternum. For thousands of years explorers have ventured to the island in search of its mysterious resource known as Azoth. This substance grants power and eternal life but often at a cost and has led to the corruption of the island as well as the island’s former masters to nearly go extinct. \n\nIn this video we talk about the 7 things you should know about New World before you start playing. We breakdown the setting and lore, the class system and progression, the combat and PvP system, as well as crafting and the different factions  \n\nNew world is releasing on PC on September 28, 2021.\n\n#newworld", "link": "https://www.youtube.com/watch?v=F1oRvqiS79o", "date_published": "2021-09-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The History Of Battlefield", "description": "Battlefield is one of the most iconic FPS games of the past few decades. From the humble beginnings of 1942 to EA's upcoming Battlefield 2042, we break down the history of Battlefield and its legacy over the years.\n\nBattlefield has released several games over the last two decades as one of the most recognizable franchises in the video game industry. With Battlefield 2042 just around the corner, now is the perfect time to take a look at the History of Battlefield. In this video, we'll start from the beginning with Battlefield 1942, and how it set such a significant foundation for future Battlefield games to build off of. \n\nBattlefield has an emphasis on land, air, and sea combat, creating a series that relishes chaotic and exciting gameplay, eventually expanding upon the core Conquest mode with other ways for players to engage each other. Every Battlefield game is notable in its own way, but Bad Company 2, Battlefield 4, and Battlefield 1 are standouts for various reasons, whether it's a greater emphasis on campaign modes, or taking the Battlefield destruction capabilities with the Frostbite engines to an all-time high. \n\nBattlefield 2042 is slated to release on October 22, 2021, on Xbox One, Xbox Series S|X, PS4, PS5, and PC. The game will increase the size of Battlefield matches to a massive 128 players, with customizable load-outs and the incorporation of brand new Specialists in place of character classes. We’ll have so much more to break down with Battlefield 2042 in the coming days, so stay tuned!\n\n#battlefield #battlefield2042", "link": "https://www.youtube.com/watch?v=yVii2aNhWUo", "date_published": "2021-09-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]