[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "Bannon's War (full documentary) | FRONTLINE", "description": "On Nov. 12, 2021, former Trump adviser Steve Bannon was indicted on two counts of contempt of Congress, after failing to comply with a subpoena issued by the U.S. House select committee investigating the Jan. 6 riot at the Capitol. Revisit FRONTLINE’s examination of Bannon’s worldview and his role in Donald Trump's campaign and administration. (Aired 2017)\n\nThis journalism is made possible by viewers like you. Support your local PBS station here: http://www.pbs.org/donate​.\n\nA bombastic figure on the far right who rose to prominence as a policy adviser and speech writer, Steven Bannon entered the White House determined to implement Trump’s campaign promises.  “Bannon’s War” details how the former Breitbart News editor also engineered the sweeping executive order that restricted Muslims from entering the United States, and held such sway over the former president that Time magazine dubbed him “Manipulator in Chief.” He left the White House in August 2017 amid fallout from Trump’s remarks about the violence that erupted during protests in Charlottesville, Va. but continued to promote the president and his agenda.\n\nLove FRONTLINE? Find us on the PBS Video App where there are more than 300 FRONTLINE documentaries available for you to watch any time: https://to.pbs.org/FLVideoApp​ \n\n#Documentary #BannonsWar\n\nSubscribe on YouTube: http://bit.ly/1BycsJW​\nInstagram: https://www.instagram.com/frontlinepbs​\nTwitter: https://twitter.com/frontlinepbs​\nFacebook: https://www.facebook.com/frontline\n\nFunding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Major funding for FRONTLINE is provided by the Ford Foundation. Additional funding is provided by the Abrams Foundation; the John D. and Catherine T. MacArthur Foundation; Park Foundation; and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation, and additional support from Koo and Patricia Yuen.", "link": "https://www.youtube.com/watch?v=UPkUrVj0VPc", "date_published": "2021-09-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]