[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "Ubuntu 21.10 Review - A risk-free transition release (+flavors)", "description": "Skip the hassle of Database Maintenance with DataBaseCare: https://bit.ly/3aBpa2y\n\n\nUbuntu 21.10 has been released. It's an interesting one, not because it adds many features that you've never seen before, but because it's a transition release. It introduces a bunch of new systems, that, while not enabled by default, will probably be in the next LTS. Let's take a tour of what you can expect in this new release.\n\n\n\n\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nJoin us on our new Discord server: https://discord.gg/xK7ukavWmQ\nTwitter : http://twitter.com/thelinuxEXP\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\nFollow me on ODYSEE: https://odysee.com/@TheLinuxExperiment:e\nOr join ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\n\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\n\n#Ubuntu #Impish #21.10\n\n\n00:00 Intro\n01:29 The Desktop\n04:18 Applications\n06:26 Installer\n07:47 Flavors\n09:13 Good or not?\n\n\n\nUbuntu 21.10 is codenamed Impish Idri. It moves to GNOME 40 with its horizontal workspaces.\nThe layout isn't standard, as Ubuntu kept its dock on the left hand side of the screen. When opening the activities view, you'll still see the dock, as well as the workspaces switcher, and all your currently open desktops.\n\nOn the Show applications button, you see a grid of your apps, no more \"recent\" or \"all\" tabs, and the workspace switcher on which you can drag and drop app icons to open them.\n\nUbuntu 21.10 doesn't land you on the Activities view after a clean boot, though, you'll still be dropped on the desktop itself.\n\nThe Ubuntu Dock also sees a few changes this time around, picking up a few features that were left to desktop icons before.\n\nThe trashcan is now pinned to the dock, separated from your apps by a divider. Running apps that aren't pinned will also appear behind this divided so you can more clearly tell what's pinned and what's not.\n\nRemoveable devices will also appear in the dock instead of on the desktop itself.\n\nVisually, Ubuntu drops the mixed dark and light theme option.\n\nAs always, Ubuntu ships a mix of GNOME 40 an GNOME 41 applications. And also 3.38 apps, like the terminal or the Cheese webcam app.\n\nThe System Monitor app is moved to its 41 version, for example, just like the Calendar, which gains support for importing .ics event and can FINALLY be set as the default calendar app. \n\nNautilus, now has the ability to show a \"creation date\" column in the list view, by right clicking on the column header, and this column can be used to sort the files. It can also autocomplete when you're typing a path in the URL bar.\n\nYou will also be able to extract password protected archives directly, and you'll have the ability to choose whether to run or edit a script file, in the right click menu: you now get to choose if you want to run a file, and it will open in a terminal so you can look at the output.\n\nGNOME Software isn't its nicely redesigned self, unfortunately.\n\nThe most important change here, though, will be the one that most regular users won't notice at all.\nFirefox is now shipped as a SNAP package. And when I say that most users won't notice, i'm lying, because it is extremely SLOW to open. Like, almost 10 seconds slow, on its first start.\n\nYou'll also get the usual updates to LibreOffice, which now sports the new command Hub to search through functions, a very useful feature.\n\nNow let's talk about the installer.\n\nIt hasn't changed a bit. That's right, the new installer isn't finished yet, which means that for now, you'll still get to use the old one, which is slow and looks very dated.\n\nThe new installer can be tested using special \"Canary\" daily builds. It's... disappointing. It basically looks exactly like the previous installer in terms of how it runs, and how it's presented.\nYou get to pick your language, keyboard layout, then choose between the complete or minimal install.", "link": "https://www.youtube.com/watch?v=SXfpbsCXUmE", "date_published": "2021-10-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]