[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Nicki Nicole: Tiny Desk (Home) Concert", "description": "From Sept. 15 through Oct. 15, Tiny Desk is celebrating Hispanic Heritage Month with an \"El Tiny\" takeover of the (home) concert series, featuring J Balvin, Camila Cabello and several more musicians from all corners of Latinidad.\n\nReanna Cruz | October 13, 2021\nSitting next to rapper Nicki Nicole, on a stack of books, you'll see an old Sony camcorder – throughout this six-song performance we cut back to its footage every now and again, the rough texture breaking from the pristine, offering a nostalgic sense of intimacy. It's a production choice that completely works and, in a way, reflects Nicki Nicole at large, as an artist born in 2000 and with a connection to sounds and styles beyond her years.\n\nAt multiple points throughout the performance, Nicki points and beckons to the audience, inviting them into her world, her lyrics, her sound. Every track carries a certain brand of swagger whether it be the intensity of her second song \"Mala Vida\" or her effortless, confident freestyle. Even when she slows it down, on \"Parte de Mi,\" strings and piano create an arresting connection between us and her – and her final song, \"Baby,\" is a bombastic head-bopper, enhanced by her deeply groove-oriented band, which includes everything from an accordion to a mandolin.\n\nFittingly, Nicki Nicole has a tattoo on her neck which, in English, reads \"bulls***.\" She has said before that the tattoo represents her need to break free of the labels applied by both her culture and industry as a young, Argentine female R&B artist. If her concert is any indication, Nicki Nicole is here to stay, while moving ever further away from any preconceived notions of her artistry – the \"bulls***.\"\n\nSET LIST\n* \"Colocao\"\n* \"Mala Vida\"\n* \"Wapo Traketero\"\n* \"Parte de Mi\"\n* Freestyle\n* \"Baby\"\n\nMUSICIANS\n* Nicki Nicole: vocals\n* Andres Cortes: electric guitar, mandolin, guitar\n* Ayelen Zucker: vocals, percussion\n* Camila Ibarra: vocals, percussion\n* Flor Iribarne: piano\n* Jeremias Segall: drums\n* Juan Gimenez Kuj: bass, double bass\n* Lautaro Greco: bandoneón\n* Alma Quiroga: I violín\n* Natalia Cabello: II violín\n* Carla Regio: viola\n* Jacqueline Oroc: cello\n\nCREDITS\n* Producer: Federico Lauria\n* Executive Producer: Matias Santoro, Tito Leconte / Dale Play Records\n* Video Director: Jess “La Polaca” Praznik AD: Mariana Point\n* Art Director: Juli Duich\n* Director of Photography: Patricio Deart \n* ST: Cucchi Pagani, Inés Pizarro, Mae Ludueña\n* Color: Guttcolor\n* Production and Musical Direction: Juan Gimenez Kuj, Pedro Pasquale\n* Arrangement for strings and piano \"Part of me\": Damian Mahler \n* Master and Mix Recording Engineer: Mariano Bilinkis\n* Recording and Editing Assistant: Manuel Cano\n* Technical Production: Martín JR Ranea\n* Monitor Engineer: Francisco Trillini\n\nTINY DESK TEAM\n* Producer: Anamaria Sayre\n* Video Producer: Kara Frame\n* Audio Mastering: Josh Rogosin\n* Alt.Latino 'El Tiny' Team: Felix Contreras, Reanna Cruz, Anaïs Laurent, Stefanie Fernandez\n* Tiny Production Team: Bob Boilen, Bobby Carter, Maia Stern, Sofie Hernandez-Simeonidis\n* Executive Producer: Keith Jenkins\n* Senior VP, Programming: Anya Grundmann\n\n#eltiny #tinydesk #nickynicole #nprmusic", "link": "https://www.youtube.com/watch?v=RG6O-Qq79G0", "date_published": "2021-10-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]