[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Back 4 Blood Review", "description": "Back 4 Blood recaptures the spirit of Left 4 Dead while introducing some engaging modern trappings.\n\nTurtle Rock Studios' Back 4 Blood is now available on PC, PS5, PS4, Xbox Series X/S, and Xbox One. You can read the full written Back 4 Blood review by Richard Wakeling on GameSpot: https://www.gamespot.com/reviews/back-4-blood-review-reanimated/1900-6417761/", "link": "https://www.youtube.com/watch?v=B8mhblXVHHY", "date_published": "2021-10-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 Hazard Zone Explained", "description": "Hazard Zone is a Battlefield 2042's high stakes game mode that releases alongside All-Out-Warfare and Portal. It involves squads landing on a map, hunting down Data Drives, and extracting. \n\nBattlefield 2042 will release on November 19 and will most notably not include a battle royale mode at launch. Instead developer DICE is focusing on a new competitive squad-based game type called Hazard Zone that focuses on multiple four person squads moving around a map and competing to collect Data Drives and get them to extraction points. As opposed to much larger player counts in popular battle royale titles, this game type will have 24 players (six total teams) on Xbox One and PlayStation 4 and 32 players (eight total teams) on Xbox Series X|S, PlayStation 5, and PC. \n\nHazard Zone does seem to draw plenty of elements from battle royale titles, such as the ability to spawn downed teammates back at Reinforcement Uplink points or using a Tactical Upgrade. Hazard Zone will be playable on all launch maps from All-Out-Warfare and will occasionally incorporate extreme weather such as tornadoes. Another large element to Hazard Zone will be squad makeup. Players can't use more than one of the same Specialist on their team encouraging teams to work together and rely on different Specialists throughout each match. Having mobility with an operator like Sundance might provide a key advantage during a different phase of the match in comparison to Falck's healing, for example. There is a ton more to know about Hazard Zone, including phases, currencies, tactical upgrades, and how to maximize points. Make sure to watch this video for the full breakdown.", "link": "https://www.youtube.com/watch?v=qsPTVbo-q9s", "date_published": "2021-10-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 | Hazard Zone Official Trailer", "description": "Check out the all new Battlefield 2042 Hazard Zone reveal trailer! \n\nBattlefield 2042 is available on November 19, 2021\n\nDiscover Battlefield Hazard Zone – A tense, squad-focused survival experience combining edge-of-your-seat gameplay with the best of the Battlefield sandbox. Inserted as a four-member squad, you must locate and retrieve critical Data Drives scattered throughout the battlefield, while competing against opposing squads with the same objective and local militias. Succeed by gathering the Data Drives and choosing when to extract before a storm overtakes the area in this high-stakes, one-life experience. Every bullet, every skirmish, and every decision counts.", "link": "https://www.youtube.com/watch?v=sKO8Mwz8Ymk", "date_published": "2021-10-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty Cheaters Hit With Ricochet | GameSpot News", "description": "In this GameSpot News Update, we’re talking about Activision revealing the details for it’s new Call of Duty anti-cheat system Ricochet, the Ghost Recon: Frontline beta getting hit with a delay, and FIFA asking for $1 Billion from EA.\n\nIn this video, DeVante talks about Activision revealing details for Call of Duty’s Ricochet anti-cheat system that will launch alongside Call of Duty: Vanguard on November 5. These new security features will also arrive with the Vanguard-themed Pacific map coming to Call of Duty: Warzone later in the year\n\nDeVante also explains FIFA and EA’s ongoing negotiations following reports that FIFA wants wants \"more than double\" what it currently gets from EA, and is asking for $1 billion for each four-year World Cup cycle.\n\nLater in the video, Ghost Recon: Frontline’s beta is delay indefinitely, Solar Ash is delayed to December 2 and PS Plus members will get 3 extra free games to celebrate the 5th birthday of PSVR. \n\nTIMESTAMPS:\n00:00 - Intro\n00:19 - Call of Duty anti-cheat system\n01:07 - FIFA wants $1 billion from EA\n02:15 - Ghost Recon: Frontline beta delayed\n03:02 - Solar Ash delayed\n03:18 - Extra PS Plus games \n04:07 - Outro", "link": "https://www.youtube.com/watch?v=KXjIRO2vEy8", "date_published": "2021-10-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Vanguard | Zombies Reveal Trailer", "description": "Check out the all new Zombies reveal trailer for Call of Duty: Vanguard Your mission: Stop the undead army with a new set of Dark Aether skills.\n\nWelcome to Call of Duty: Vanguard Zombies.\n\n#CallofDutyVanguard", "link": "https://www.youtube.com/watch?v=LOg40ytzIa4", "date_published": "2021-10-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Infinite Competitive Gameplay and Settings Reveal", "description": "Check out gameplay of Halo Infinite competitive and ranked multiplayer settings for the first time. The gameplay will have commentary from Lead Multiplayer Designer, Andrew Witts, and former Halo pro and member of the 343 Competitive Insights team, Sal \"El Town\" Mohanan, with host Andy “Bravo” Dudynsky. \n\nGameplay Starts at: 1:30\n\n#HaloInfinite", "link": "https://www.youtube.com/watch?v=BrlRRL5Oa_k", "date_published": "2021-10-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "8 Minutes of Demon Slayer: The Hinokami Chronicles Spider-Demon Boss Fights Gameplay", "description": "Check 8 minutes of action in Demon Slayer: The Hinokami Chronicles story mode gameplay in the Spider Forest. Here we take on the Spider-Demon Elder Brother as Zenitsu. Then we take on the Spider-Demon Father as Inosuke, and finally we take on Rui the head of the Spider Family as Tanjiro. Rui is one of the Twelve Kizuki and is the most feared member of his family, as well as the strongest. See how we fair against all these different bosses and mini bosses as Zenitsu, Inosuke and Tanjiro in Demon Slayer Kimetsu no Yaiba The Hinokami Chronicles. \n\nTimeStamps:\n0:00 Intro\n0:05 Zenitsu takes on Spider-Demon Elder Brother\n3:40 Inosuke takes on Spider-Demon Father\n5:56 Tanjiro takes on Rui\n\n#DemonSlayer", "link": "https://www.youtube.com/watch?v=0BXUbDyCusI", "date_published": "2021-10-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "9 Things I Wish I Knew Before Starting Back 4 Blood", "description": "Back 4 Blood, the co-op zombie survival game, and spiritual successor to Left 4 Dead, is now available for everyone and we've got a few tricks and other things of note that will improve your experience in the fight against the ridden hordes.\n\nBack 4 Blood is now available on PC, PS4, PS5, Xbox One, and Xbox Series Consoles. Game Pass owners get access to the game on both PC, Xbox, and the cloud. The game also has crossplay support, but please make sure your DualSense mics are turned off PlayStation 5 players.\n\n#Back4Blood", "link": "https://www.youtube.com/watch?v=Rj8XT_R3BJw", "date_published": "2021-10-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Final Fantasy XIV Endwalker Reaper & Sage Hands-On Preview", "description": "Ben Janca got hands on time with the new Reaper and Sage jobs coming in Final Fantasy XIV's latest expansion Endwalker.\n\nFinal Fantasy 14’s latest expansion, Endwalker, is almost here! Releasing on November 23rd (or the 19th if you are a fan of early access) it is set to finish up a massive storyline spanning over 10 years and is the game’s 4th expansion after it was reworked for A Realm Reborn. Ben Janca got invited to a preview event being held to get some early hands-on time with the new Reaper and Sage jobs. Of course, it is important to note that everything here is based on an in-development build of the Final Fantasy XIV: Endwalker, and any content is subject to change before we all get our hands on the final version of the expansion.", "link": "https://www.youtube.com/watch?v=H9YvKzKeMK0", "date_published": "2021-10-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Last Chance To Get The Original GTA Trilogy | GameSpot News", "description": "In this episode of GameSpot News, we talk about the original GTA trilogy being unlisted from digital stores, Fortnite handling returns in a new way as well as teasing a collab with Among Us, and Riot Games removing All chat from League Of Legends. \n\nIn this video, DeVante talks about the original GTA trilogy being delisted from digital stores following the announcement of the GTA Trilogy: The Definitive Edition. This new bundle comes with updated and improved versions of GTA III, Vice City or San Andreas and will be available on PS4, PS5, Xbox One, Xbox Series X|S, Nintendo Switch, and PC.\n\nDeVante also talks about Fortnite teasing an upcoming collab with Among Us. The tease came in the form of a Twitter exchange after Fortnite released it’s update 18.20 patch notes. The update also includes a new return system for unwanted cosmetic purchases. \n\nLater in the video, League Of Legends All Chat is removed from the game after reported of abuse over the past year. \n\nTIMESTAMPS:\n00:00 - Intro\n00:15 - Original GTA Trilogy Being Removed\n01:02 - Fortnite teases Among Us collab \n01:58 - Fortnite refund changes\n02:41 - League of Legends removes All Chat\n03:37 - Try Riders Republic on PC today only \n03:55 - Outro", "link": "https://www.youtube.com/watch?v=qnIMcER_DkI", "date_published": "2021-10-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Brilliant Diamond and Shining Pearl Look To Evolve Upon The Originals' Mechanics", "description": "The remakes for Pokémon Generation IV seem to be aimed at addressing Diamond/Pearl's most obvious shortcomings.\n\nAhead of the release for Pokemon Brilliant Diamond/Shining Pearl, developer ILCA and publisher Nintendo have marketed the two remakes as faithful adaptations of the original Generation IV games. I recently attended a preview event for the duo where I got to see B. Diamond in action, and although these remakes look faithful to the original games, I'm not so sure that they'll feel as faithful. If anything, the changes made in these remakes seem to make for a far more approachable experience--I think players are going to find these games to be a lot easier to get through than the original Diamond/Pearl.\n\nIn terms of overall structure and presentation, yes, B. Diamond/S. Pearl are faithful adaptations of the original Diamond/Pearl. Unlike Sword/Shield with its over-the-shoulder perspective, realistically proportioned characters, and occasional free camera moments, B. Diamond/S. Pearl is presented in Pokemon's traditional top-down isometric perspective with a more chibi-like visual style and no free camera.", "link": "https://www.youtube.com/watch?v=0mePFpBEa4w", "date_published": "2021-10-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]