[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Insecure Takeover Part 2: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nBobby Carter | December 17, 2021\nFrom Hilltop Coffee + Kitchen in Inglewood, California, our second and final Insecure Tiny Desk takeover is a total Los Angeles affair. The spot where B.K. Habermehl, Nnena, and TeaMarrr gather is also co-owned by series creator and star, Issa Rae. Our first collaboration with Insecure was an experiment just a few weeks into the Tiny Desk (home) experiment last year. We took what we learned and decided to run it back. Hilltop was featured on the show and the addition of L.A.'s own 1500 or Nothin' as the backing band made the refinement complete.\n\nSouthern California's B.K. Habermehl is no stranger to Issa Rae's world. She landed three songs on season four of the HBO show, including the jam that introduced me to her, \"Right on Time.\" Here she kicks off the showcase with \"Time Off.\" Next, B.K. takes us downstairs to usher in some \"Fun\" via newcomer Nnena. \"Fun\" was featured at the end of the first episode of Insecure's current season, and completely set the tone for the episodes that followed. The Nigerian-American singer-rapper dives deep into her low range and the result gives me goosebumps. We cap things off with a tea party, courtesy of Insecure fav TeaMarrr. Waving an incense stick, she conjures some seductive \"Pipe Dreams.\"\n\nSET LIST\n\"Time Off\"\n\"Fun\"\n\"Pipe Dreams\"\n\nMUSICIANS\nB.K. Habermehl: vocals\nNnena: vocals\nTeaMarrr: vocals\nDamien \"Dammo\" Farmer: bass\nQuintin \"Q\" Gulledge: drums\nLamar \"MyGuyMars\" Edwards: keys\nChris Payton: guitar\nAllen “Bizkit” Arthur: saxophone\nLarrance \"Rance\" Dopson: music director\n\nCREDITS\nVideo: Lia B\nAudio: Cole Nystrom\nDirector: Lia B\nEngineer: Cole Nystrom\nExecutive Producers: Joseph Boyd and Brittany Bell\nDirector of Photography: Evan Avtal\nSteadicam: Thor\nCamera Operators: Benjamin Meserve, Taylor Randall\nGaffer: Jahn Beadle\nLead Production Assistant: Sofia Ribeiro\nEditor: Wayan Palmieri\n\nTINY DESK TEAM\nProducer: Bobby Carter\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Kara Frame, Joshua Bryant, Sofie Hernandez-Simeonidis\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #insecure #teamarrr #nnena #bkhabermehl", "link": "https://www.youtube.com/watch?v=C2BxIBlJUAE", "date_published": "2021-12-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]