[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCyl5V3-J_Bsy3x-EBCJwepg", "title": "PERFECT Gift Ideas for Conservative Children", "description": "Looking for a great gift that screams personal responsibility and limited government? Look no further than this list!\n\nBecome a premium subscriber:  https://babylonbee.com/plans\n\nThe Official The Babylon Bee Store:  https://shop.babylonbee.com/\n\nFollow The Babylon Bee:\nWebsite: https://babylonbee.com/\nTwitter: https://twitter.com/thebabylonbee\nFacebook: https://www.facebook.com/TheBabylonBee\nInstagram: http://instagram.com/thebabylonbee", "link": "https://www.youtube.com/watch?v=JEBLA0yaSqQ", "date_published": "2021-12-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCyl5V3-J_Bsy3x-EBCJwepg", "title": "THE BEE WEEKLY: Reformed Dating For Catholics and The California Bacon Apocalypse", "description": "The Babylon Bee guys are joined by Joe Baldwin from Strategic Swine Solutions to talk about how California is soon going to run out of bacon, leaving them in a post-apocalyptic nightmare straight from Satan. The guys also set up a dating profile for Catholic Patrick on a Reformed dating site. The Weekly News gets a revamp with Adam Yenser taking the lead and there’s the latest Heroes of the Faith featuring Canadian nudist bombers. \n\nThis episode is brought to you by Issues, Etc. Radio Show and Podcast. To see their interview with Kyle Mann and Joel Berry, go to https://issuesetc.org/babylonbee/\n\nBe sure to check out Adam’s Cancelled News Segment on his YouTube channel: https://www.youtube.com/user/adamyenser\n\nAlso be sure to buy pork products to make Joe Baldwin happy.\n\nIn the subscriber lounge, the guys finish Patrick’s Reformed dating profile with a video they coach him through, there are subscriber headlines of the week, bonus hate mail, and Joe Baldwin answers the Ten Questions!", "link": "https://www.youtube.com/watch?v=4EfsUm3F76k", "date_published": "2021-12-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]