[{"source": "https://www.theguardian.com/rss", "title": "Deforestation making outdoor work unsafe for millions, says study", "description": "<p>Rise in temperatures and humidity linked to forest loss has reduced safe hours for working in the tropics</p><p></p><p></p><p>Deforestation has made outdoor work unsafe for millions of people in the tropics over the past 15 years, a study has found.</p><p>The rise in temperatures and humidity caused by tree loss has reduced the number of safe hours in the day for people to work, especially for those performing heavy labour.</p> <a href=\"https://www.theguardian.com/environment/2021/dec/17/deforestation-making-outdoor-work-unsafe-for-millions-says-study\">Continue reading...</a>", "link": "https://www.theguardian.com/environment/2021/dec/17/deforestation-making-outdoor-work-unsafe-for-millions-says-study", "date_published": "2021-12-17 16:00:32+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "One-month old baby rescued after Typhoon Rai hits Philippines – video", "description": "<p>A month-old baby has been rescued from flood waters in the Philippines after southeastern parts of the country were hit by Typhoon Rai. Nearly 100,000 people have been evacuated after the typhoon registered sustained\nwinds of 195km/h while gusts up\nto 270km/h were recorded.</p> <a href=\"https://www.theguardian.com/world/video/2021/dec/17/one-month-old-baby-rescued-after-typhoon-rai-hits-philippines-video\">Continue reading...</a>", "link": "https://www.theguardian.com/world/video/2021/dec/17/one-month-old-baby-rescued-after-typhoon-rai-hits-philippines-video", "date_published": "2021-12-17 05:04:24+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Can theatres survive another Christmas of covid cancellations?", "description": "<p>Theatres are battling to stay open as they contend with staff shortages and slumping tickets sales in what is usually their busiest time of year. For the cast of a pantomime in Corby, Northamptonshire, the show goes on – for now</p><p>For many regional theatres, their Christmas pantomime is the biggest show of the year. Its particularly British mixture of slapstick humour, double entendres and gender switching continues to delight audiences across generations. And a successful panto season can set a theatre up for the rest of the year to produce more experimental and creative dramas that are a foundation stone of Britain’s performing arts industry. After last year’s wipeout of Christmas shows, many had hoped for a return to packed theatres this December, but that is now looking an ever more precarious prospect. West End shows are postponing and even cancelling their Christmas shows as cast members and theatre staff fall ill.</p><p><strong>Nosheen Iqbal </strong>visits the cast of Sleeping Beauty at the Cube theatre in Corby, Northamptonshire, during their rehearsals for a show still hoping to welcome a full audience for its opening night tonight. But growing concerns about the spread of the Omicron variant and advice from government scientists to limit social interactions have cast doubt on the chances of completing a full run of performances.</p> <a href=\"https://www.theguardian.com/news/audio/2021/dec/17/can-theatres-survive-another-christmas-covid-cancellations-podcast\">Continue reading...</a>", "link": "https://www.theguardian.com/news/audio/2021/dec/17/can-theatres-survive-another-christmas-covid-cancellations-podcast", "date_published": "2021-12-17 03:00:16+00:00", "persistent": false, "user": null, "language": "en-UK"}]