[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Call Of Duty: Warzone’s Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of Call Of Duty: Warzone, including a gold sniper rifle, a variety of MP5s, and the British EM-2 assault rifle.\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of Call Of Duty: Warzone and compares them to their real-life counterparts.\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\nYou can subscribe to the Armax Journal that Jonathan Associate Edited here: https://www.armaxjournal.org/", "link": "https://www.youtube.com/watch?v=QLNWal-8fv8", "date_published": "2021-12-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Every GameSpot Game of the Year Up to 2021", "description": "Since the late '90s, GameSpot has awarded Game of the Year to the one game each year that stood above the rest. After crowning our Game of the Year 2021, we decided to look back on our history and reflect on every game we decided was the best of the best.\n\nFrom classics like Diablo and The Sims and blockbuster action titles like Resident Evil 4 and Gears of War, to peaceful meditations like Journey and competitive shooters like Overwatch--our GOTY award is an annual celebration of the diverse experiences video games can offer us. Which games did you enjoy the most in these 25 years.\n\nHere's every game we've awarded Game of the Year in GameSpot's entire history.\n\n0:00 Introduction\n0:28 Diablo (1996)\n0:50 Total Annihilation (1997)\n01:13 The Legend of Zelda: Ocarina of Time(1998)\n01:30 Grim Fandango (1998)\n01:48 Soulcalibur (1999)\n02:05 Everquest (1999)\n02:21 Chrono Cross (2000)\n02:39 The Sims (2000)\n02:58 Grand Theft Auto 3 (2001)\n03:13 Serious Sam First Encounter (2001)\n03:31 Metroid Prime (2002)\n03:51 The Legend of Zelda: The Winder Waker (2003)\n04:11 World of Warcraft (2004)\n04:33 Resident Evil 4 (2005)\n04:51 Gears of War (2006)\n05:15 Super Mario Galaxy (2007)\n05:41 Metal Gear Solid 4: Guns of the Patriots (2008)\n06:08 Demon's Souls (2009)\n06:29 Red Dead Redemption (2010)\n06:52 The Elder Scroll V: Skyrim (2011)\n07:10 Journey (2012)\n07:33 The Legend of Zelda: A Link Between Worlds (2013)\n07:51 Shadows of Mordor (2014)\n08:09 The Witcher 3: Wild Hunt (2015)\n08:27 Overwatch (2016)\n08:47 The Legend of Zelda: Breath of the Wild (2017)\n09:10 Red Dead Redemption 2 (2018)\n09:34 Sekiro: Shadows Die Twice (2019)\n10:01 Half-Life: Alyx (2020)\n10:43 Deathloop (2021)", "link": "https://www.youtube.com/watch?v=AUjVNcnV-QM", "date_published": "2021-12-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Infinite Co-Op Is Playable With A Glitch, But Beware | GameSpot News", "description": "In this episode of GameSpot News, we talk about Halo Infinite’s co-op campaign is now playable with a glitch, Halo TV series having its own canon, and S.T.A.L.K.E.R 2’s NFT backlash. \n\nIn this video, DeVante talks about a glitch allowing players to enable Halo Infinite’s co-op campaign with a number of caveats. Player two has no HUD. The game's FOBs (Forward Operating Bases) are completely busted, and if either player dies, the game locks up. Trying to enable co-op may also break Halo Infinite game saves. \n\nDeVante also talks about how the upcoming Halo TV series will not play around within any of the established canon and will instead tell its story in what it calls the \"Silver Timeline.\"", "link": "https://www.youtube.com/watch?v=KLHpbxa4v3o", "date_published": "2021-12-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "I Played the GTA Trilogy 20 Years Later...", "description": "The GTA Trilogy: Definitive Edition is finally out, and not quite what everyone was hoping for. Dave Klein of DaveControl took the opportunity to play all three games - GTA 3, GTA: Vice City, and GTA: San Andreas in order to see how they held up today. Or... how much the GTA Trilogy: Definitive Edition botched the execution on the Grand Theft Auto Trilogy.\n\n#GTA", "link": "https://www.youtube.com/watch?v=MvDXaoz95uk", "date_published": "2021-12-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]