[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "Is KDE/Plasma User Friendly for beginners, Windows, or macOS Users?", "description": "Download Safing's Portmaster for FREE and take control of your network traffic: https://safing.io/portmaster\n\n\n\nGet your Linux desktop or laptop here: https://slimbook.es/en/\n\n\n\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nJoin us on our new Discord server: https://discord.gg/xK7ukavWmQ\nTwitter : http://twitter.com/thelinuxEXP\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\nFollow me on ODYSEE: https://odysee.com/@TheLinuxExperiment:e\nOr join ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\n\n\n\nLinux Scoop video: https://www.youtube.com/watch?v=DX_gQTQLUZc\n\n\nThe default Plasma layout is simple: you only get a taskbar at the bottom of the screen, with a menu, a few application icons, and a few system indicators, plus a clock.\nThe rest of the desktop is completely empty out of the box, so any user would normally have their attention drawn to the taskbar.\n\nThe presence of the 3 classic window buttons is also easy to understand.\n\nThe KDE / Plasma application style isn't coherent: some apps will display a menu, like the Terminal, some only have a simple header, like Discover, and some have toolbars and a hamburger menu, like Dolphin and Gwenview.\n\nNow, in terms of installing applications, the default App Store, Discover, is OK. It has clearly laid out sections for updates, applications, or what's already installed, and the Install/ Uninstall buttons are clear enough. \n\nKDE Plasma is mainly known for its customization options, and for beginners, these will be pretty hard to get to grips with. While the Settings app regroups most of the settings a user can change, these are very, very numerous. Like, there are tons and tons of settings panels, sub sections, and tabs.\n\nSo, for complete beginners that have no experience with computers, I'd say KDE Plasma is an OK choice.\n\nWindows User\nThe default layout won't be hard to understand, as it's virtually the exact same that Windows has used since Windows 10. The menu is reminiscent of the Start menu, the way apps are opened, minimized and closed, and how they appear in the taskbar is identical, and the placement of the notification tray and the clock is the same.\n\nIn terms of default user experience, some apps use menubars, and some don't, much like on Windows, so a user used to that proprietary OS shouldn't be lost at all.\n\nThe store won't be confusing either. Even though Discover isn't really up to par visually with the Store experience Windows 11, or even Windows 10 users might expect, the base concepts are very similar.\n\nIn terms of settings, the KDE Plasma settings app kinda looks like what's available in Windows 10, in a general layout sense, but after that, all bets are off.\nSure, there is a search feature, but here again the abundance of options, subsections, tabs inside of settings panels, and complimentary pop-ups will definitely be overwhelming for a Windows user.\n\n\n\n\n\nmacOS User\n\nFirst, the default layout has virtually nothing in common with macOS: you don't get a top panel or a dock, at least out of the box. While the dock's functionality is contained in the main panel, it doesn't look like the macOS dock, and it will be confusing.\n\n\nIn terms of applications, the non descriptive names probably will be just as much of an issue for macOS users.\nThe apps themselves won't be too problematic though, as, apart from a few remaining exceptions, the menubars aren't super present anymore, and the use of mainly toolbars + titlebars combos is relatively similar to what macOS does.\n\nSo, out of the box, KDE Plasma is just NOT that friendly to macOS users. The whole layout, window controls, and lack of global menubar, just won't work for them.\n\nThankfully, KDE Plasma is also the most customizable desktop environment, and the one that can get the closest to the real thing as possible.\n\nYou can have a dock, a top panel with global menu, a sidebar with your widgets, a full screen launcher, have a spotlight-like runner, and even match the exact icons, and look and feel of macOS Big Sur.", "link": "https://www.youtube.com/watch?v=XzdEHrPbYiE", "date_published": "2021-10-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]