[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "History of Grand Theft Auto", "description": "Grand Theft Auto is one of the most venerated video game series of all time, so let's take a look at its history.\n\nGrand Theft Auto has left a mark on the pop culture landscape that few franchises have done before  or since. To mark the 20th anniversary of GTA 3, and the announcement of GTA Trilogy: The Definitive Edition, let’s take a look at the History of Grand Theft Auto\n\n00:17 - Grand Theft Auto (1997)\n03:37 - Grand Theft Auto: London 1969 (1999)\n05:05 - Grand Theft Auto: London 1961 (1999)\n05:23 - Grand Theft Auto II (1999)\n07:01 - Grand Theft Auto III (2001)\n10:08 - Grand Theft Auto: Vice City (2002)\n12:20 - Grand Theft Auto: San Andreas (2004)\n14:17 - Grand Theft Auto Advance (2004)\n14:45 - Grand Theft Auto: Liberty City Stories (2005)\n15:22 - Grand Theft Auto: Vice City Stories (2006)\n15:52 - Grand Theft Auto IV (2008)\n19:13 - Grand Theft Auto IV: The Lost And Damned (2009)\n19:59 - Grand Theft Auto: Chinatown Wars (2009)\n20:50 - Grand Theft Auto IV: The Ballad Of Gay Tony (2009)\n21:17 - Grand Theft Auto V (2013)\n24:00 - Grand Theft Auto Online (2013)\n25:06 - The Gamechangers (2015)", "link": "https://www.youtube.com/watch?v=_lpeJCpRs6A", "date_published": "2021-10-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 Has A Specialist Problem", "description": "Battlefield 2042's open beta has passed and the community has plenty of thoughts to share. DICE recently revealed a good chunk of improvements they made, but we take things a step further and look at what else could use improvements.\n\nBattlefield 2042 recently dropped a new specialist trailer showing off five more specialists, which will excite those ready for the game's launch. However, not everyone is sold, as specialists have been just one of many points of discussion surrounding the recent open beta. We've taken a look at specialists, optimization, and what else we want to see improved upon by the game's launch. Hopefully, fans will be excited again if even more fixes for these issues come through!\n\nThis video breaks down improvements we want, such as a greater incentive to stick with your squad and use teamwork. Battlefield 2042 encouraged a lot of lone wolves in its beta, which is not what the series is known for. There are also persisting bugs and glitches that need ironing out, which only worsen if you're playing on older consoles. \n\nThe hope is that Battlefield 2042 can package as many fixes as possible before launch. The fixes detailed so far are encouraging, but with the release window so close, it's not sure what state the game will be in when it releases. Fingers crossed for the best! Battlefield 2042 will come out on early access on November 12, with a worldwide launch on November 19 for PC, Xbox One, Series S|X, PS4, and PS5.", "link": "https://www.youtube.com/watch?v=cyJA1IoiyIc", "date_published": "2021-10-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To ARMA 3’s Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of ARMA 3, including the AKM, the Tavor 21 assault rifle, and a long-barrelled FN P90.\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of ARMA 3 and compares them to their real-life counterparts.\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020", "link": "https://www.youtube.com/watch?v=4whDtQ2jktw", "date_published": "2021-10-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil 4 VR Review", "description": "Capcom's survival horror classic shines on Oculus Quest 2, making it a must play version for fans that can.\n\nCapcom and Armature Studios' Resident Evil 4 VR is now available on Oculus Quest 2. You can read the full written Resident Evil 4 VR review by Kurt Indovina on GameSpot: https://www.gamespot.com/reviews/resident-evil-4-vr-review-a-selection-of-good-things-stranger/1900-6417767/", "link": "https://www.youtube.com/watch?v=DpnQXNchXPs", "date_published": "2021-10-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]