[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "2 Chainz: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nNPR Music's Tiny Desk series will celebrate Black History Month by featuring four weeks of Tiny Desk (home) concerts and playlists by Black artists spanning different genres and generations each week. The lineup includes both emerging and established artists who will be performing a Tiny Desk concert for the first time. This celebration highlights the beautiful cornucopia of Black music and our special way of presenting it. We hope you enjoy.\n\nLaTesha Harris | February 17, 2021\n\"There are a lot of people who have been moving the needle forward for Black people. And they have been for some time,\" says an earnest, almost plaintive 2 Chainz. In a heart-filled sermon, he cites Martin Luther King Jr., Tyler Perry and Puffy as trailblazers, practicing gratitude for Black leaders who inspire him and the world at large. It's a sober moment of euphoria — and a drastic shift from the first 17 minutes of the Grammy winner's flashy Tiny Desk.\n\nColored in royalty, neon hues of lavender, fuchsia and violet, in his high-end nail studio Pamper (yes, he owns it, and he's not shy about letting you know), 2 Chainz is feeling himself throughout his five-song set. Getting a champagne-soaked pedicure, rolling one and periodically shouting out his sixth and latest studio album, So Help Me God!, the rapper exudes Black excellence in the way of luxurious comfortability. His unbridled braggadocio so clearly comes from the freedom of security after being denied opportunities, not just individually but generationally.\n\nAnd he's worked for it. First coming up from Atlanta's hip-hop scene as one half of Playaz Circle, 2 Chainz landed a solo record deal and guest verses on Kanye West's \"Mercy\" and Nicki Minaj's \"Beez in the Trap'' in 2012. And, through guest verses and singles, his music's been dominating the charts ever since. For his Tiny Desk (home) concert, he rewinds the clock and samples that stacked discography (\"Good Drank,\" \"I'm Different\") and performs three new hits (\"Grey Area,\" \"Southside Hov,\" \"Vampire\"). Alternating between earnest vulnerability and well-deserved conceit, 2 Chainz offers up his best: leaning into the dynamism of life and practicing gratitude.\n\nSET LIST\n\"Southside Hov\"\n\"Vampire\"\n\"Good Drank\"\n\"I'm Different\"\n\"Grey Area\"\n\nMUSICIANS\n2 Chainz: vocals\nTyler Sherard: bass\nAlex Turner: drums\nJosh Sneed: guitar\nMark Polynice: keys\n\nCREDITS\nVideo: Howard Ross, Shanika Boyd\nAudio : Willis Polk II, William \"Willy Will\" Hodge, Amond \"AJ\" Jackson, Brian \"Change\" Penny\n\nTINY DESK TEAM\nProducer: Bobby Carter\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nArt Director: CJ Riculan\nAssociate Producer: Bobby Carter\nTiny Production Team: Kara Frame, Morgan Noelle Smith\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann", "link": "https://www.youtube.com/watch?v=3ZLP8QMVse8", "date_published": "2021-02-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Rick Ross: Tiny Desk (Home) Concert", "description": "NPR Music's Tiny Desk series will celebrate Black History Month by featuring four weeks of Tiny Desk (home) concerts and playlists by Black artists spanning different genres and generations each week. The lineup includes both emerging and established artists who will be performing a Tiny Desk concert for the first time. This celebration highlights the beautiful cornucopia of Black music and our special way of presenting it. We hope you enjoy.\n\nAbby O'Neill | February 16, 2021\nRick Ross’ Tiny Desk takes place in the gallery space of Miami artist Rich B Caliente, The Boss’ longtime collaborator and friend. Even though the MIA street dignitary is now living in Atlanta, Ross insisted that his Tiny Desk (home) concert get captured in the city where his roots are anchored and where he rose to rap stardom. \n\nThis Tiny Desk marks just the second time Ross has performed with a live band. On \"Super High,\" from his Teflon Don album, drummer Rashid Williams and bassist Thaddaeus Tribbett lay down the foundation for Ross’ smooth cadence and signature nonchalance. Background singer and Ne-Yo protege Troy Tyler projects the lead vocal lines originally sung by his mentor. \n\nNext, vocalist Elijah Blake steps up on Ross' smash hit \"B.M.F. (Blowin’ Money Fast) and “Aston Martin Music.” On the latter, Monty Reynolds drops in with the sparse, yet catchy key melody that made it the contagious hit single it was in 2010.\n\nAt one point, Ross pauses between songs to speak on his inspirations. \"So many inspired the Boss,” he says. “I could look at any brother on the street and get some inspiration from them, regardless of how many followers you got on social media, regardless of what you're riding in. I could learn something from you. I ain't scared to. Let's make sure we keep building.\" \n\nSET LIST\n\"Super High\"\n\"B.M.F. (Blowin' Money Fast)\"\n\"Aston Martin Music\"\n\"I'm Not A Star\"\n\"F*ckwithmeyouknowigotit\"\n\"Tears of Joy\"\n\nMUSICIANS\nDJ Sam Sneak: DJ, vocals\nThaddaeus Tribbett: bass\nMonty Reynolds: keys\nElijah Blake: vocals\nTroy Tyler: vocals\nRashid Williams: drums\n\nCREDITS\nVideo: Bob Metelus, Antwan Reid, Webber Charles, William Graydon, Andres Ramirez, Laz Mendez, Edward Burke, Jorge Torres, Ron Gesualdo, Rich B Caliente\nAudio: Joe Liederman, Glenn Wexo, ITLLC\nGeneral Manager: Yvette Dávila for Maybach Music Group\n\nTINY DESK TEAM\nProducer: Abby O'Neill\nVideo Producer: Morgan Noelle Smith\nAudio Mastering: Josh Rogosin\nArt Director: CJ Riculan\nAssociate Producer: Bobby Carter\nTiny Production Team: Bob Boilen, Kara Frame, Maia Stern\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann", "link": "https://www.youtube.com/watch?v=A7dobkCQj74", "date_published": "2021-02-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]