[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Animal Crossing Super Mario Bros. Update | Nintendo Direct", "description": "In celebration of Super Mario's 35th anniversary, Animal Crossing is getting a free update filled with loads of Mario themed items.", "link": "https://www.youtube.com/watch?v=Z1KKgWhrCAM", "date_published": "2021-02-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Baldurs Gate 3 Panel From Hell 2 - New Content Livestream", "description": "Tune into the second Panel from Hell stream for Baldur's Gate 3, where you'll learn about the biggest updates coming to the game, get a peek at improved cinematics, Tieflings, spells and... cows. Watch to see some of the latest content coming to Baldur's Gate 3 in its biggest update so far.", "link": "https://www.youtube.com/watch?v=G02RWopfs3M", "date_published": "2021-02-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Baldur’s Gate 3 - New Druid Gameplay", "description": "In Larian’s Panel From Hell 2, the studio showed off their biggest patch yet, with the latest addition coming to the game being the new Druid class and with it their wild shape ability allowing players to take the form of a plethora of beasts both in combat and while exploring the world.\n\nBut there are also several other changes coming along with the patch, namely big cinematic improvements, shinier speak with dead animations, quality of life changes, multiplayer and more!\n\nLarian just got done showing off its biggest Baldur’s Gate 3 patch to date in its second Panel From Hell. \nThe biggest addition coming to the game of course being the new Druid class and with it their wild shape ability allowing players to take the form of a plethora of beasts both in combat and while exploring the world. \n\nDruids feature heavily in the first act of the story in the early access version of BG3 so we can expect to see some changes whenever the world of wilderness and druids are concerned. \n\nPlayers will be able to choose from druidic circles of the moon and the land, using their class abilities to shapeshift into anything from a badger, wolf, dire raven and more. \n\nBut there are also a number of other changes coming along with the patch, namely big cinematic improvements, shinier speak with dead animations, quality of life changes, multiplayer and more!", "link": "https://www.youtube.com/watch?v=2j41-ToF9lA", "date_published": "2021-02-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Capcom Arcade Stadium | Nintendo Direct", "description": "Your favorite classic Capcom games have been compiled into the Capcom Arcade Stadium, launching today! Watch the trailer here!", "link": "https://www.youtube.com/watch?v=FGWRUYkX2PE", "date_published": "2021-02-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Guilty Gear Strive Beta: All Overdrives", "description": "Take a look at all the Overdrives from the main roster of the upcoming fighting game, Guilty Gear Strive. Captured from the beta on PS5. Includes Ky Kiske, Sol Badguy, Nagoriyuki, Axl Low, Faust, May, Millia Rage, Chipp Zanuff,  Zato-1, Leo Whitefang, Potemkin, Ramlethal Valentine, and Giovanna.", "link": "https://www.youtube.com/watch?v=HZM-eIFJWIA", "date_published": "2021-02-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Knockout City - Action-Packed Gameplay Highlights From The Closed Beta", "description": "Here are the most action-packed gameplay moments from our time with Knockout City's closed beta, an all-new dodgeball inspired multiplayer game.\n\nKnockout City is EA's take on what a high-energy and high-flying take on dodgeball would be in the far future. Coming from Velan Studios, the game is a tactical team-based arena brawler that takes the concept of dodgeball and amps it up by several degrees. Described as a \"dodge-brawler\" by the developers, Knockout City puts you in the role of a newcomer to the big city who joins a gang and has to defend their new territory from rivals looking to take over. These engagements take place on several dodgeball arenas across the city, set in construction sites, rooftops of skyscrapers, and even on the busy streets of downtown.\n\nWe had the chance to get some hands-on time with Knockout City's upcoming closed beta, which will occur on February 20th through the 21st. In the beta, players will be able to customize their \"dodge-brawler\" and join other crew members to face off against rivals in the Team KO match type, which is Knockout City's take on the classic 3v3 team deathmatch mode. In this gameplay video, you can see all the different types of moves, team cross-ups, and tricks you can pull on your enemies to score a hit. \n\nComing to PC, PS4, PS5, Xbox One, Xbox Series X, and Nintendo Switch on May 21st, Knockout City is shaping up to be a fun and accessible take on classic multiplayer combat. We'll have more on Knockout City coming up as we approach its launch in the months ahead.", "link": "https://www.youtube.com/watch?v=5hckauYFPYQ", "date_published": "2021-02-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Mario Golf Super Rush | Nintendo Direct", "description": "A little birdie told us Mario Golf is coming to Nintendo Switch for a brand new tournament! Watch the reveal trailer from the Nintendo Direct!", "link": "https://www.youtube.com/watch?v=3E32wrE45wk", "date_published": "2021-02-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Monster Hunter Rise | Nintendo Direct", "description": "The latest trailer of Monster Hunter Rise shows off new gameplay mechanics like grappling and swinging through vast landscapes, taking control of giant monsters, battling it out kaiju style. Coming to the Nintendo Switch in March 2021.", "link": "https://www.youtube.com/watch?v=qm1ByY3Lhiw", "date_published": "2021-02-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Neon White | Nintendo Direct", "description": "Exterminate Demons in... heaven? From Annapurna Interactive, is a face paced first person shooter, where you slay demons in heaven.", "link": "https://www.youtube.com/watch?v=TX-RIpB6bng", "date_published": "2021-02-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Plants Vs. Zombies: Battle For Neighborville  | Nintendo Direct", "description": "The endless fued between plants and zombies is making its way to the Nintendo Switch in Plants Vs. Zombies: Battle For Neighborville", "link": "https://www.youtube.com/watch?v=AWA0XtaLnHY", "date_published": "2021-02-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Project Triangle Full Presentation | Nintendo Direct", "description": "The Nintendo Switch is getting another epic strategy RPG from Square-Enix! Watch the reveal presentation for Project Triangle Strategy from the Nintendo Direct!", "link": "https://www.youtube.com/watch?v=tNRzx4Ap_Fo", "date_published": "2021-02-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pyra and Mythra Super Smash Bros. Ultimate Reveal | Nintendo Direct", "description": "Pyra and Mythra from Xenoblade Chronicles 2 have been invited to fight in Super Smash Bros. Ultimate. Pyra and Mythra will be joining the Super Smash Bros Ultimate lineup coming in March 2021!", "link": "https://www.youtube.com/watch?v=VCCo8BT1p84", "date_published": "2021-02-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Splatoon 3 Reveal Trailer | Nintendo Direct", "description": "They saved the slimiest for last--Splatoon 3 was revealed at the Nintendo Direct, heading to Nintendo Switch in 2022!", "link": "https://www.youtube.com/watch?v=sIvmvfFHvks", "date_published": "2021-02-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Legend Of Zelda: Skyward Sword Full Presentation | Nintendo Direct", "description": "The motion control classic, The Legend of Zelda: Skyward Sword, is getting an HD remaster for the Nintendo Switch. The original motion controls are still in the game using the individual Joy Cons. The HD remaster also includes a new motion control-free button-based configuration as well.", "link": "https://www.youtube.com/watch?v=eaVeSwPn-gs", "date_published": "2021-02-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Legend Of Zelda: Skyward Sword Official Trailer | Nintendo Direct", "description": "The motion control classic, The Legend of Zelda: Skyward Sword, is getting an HD remaster for the Nintendo Switch. The original motion controls are still in the game using the individual Joy Cons. The HD remaster also includes a new motion control-free button-based configuration as well.", "link": "https://www.youtube.com/watch?v=670HDvvW9pg", "date_published": "2021-02-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "World's End Club | Nintendo Direct", "description": "From the creators of the Danganronpa  and  Zero Escape series, comes a new game that combines side scrolling action with a compelling narrative in the World's End Club.", "link": "https://www.youtube.com/watch?v=PXHw7dwjbmI", "date_published": "2021-02-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Magic: Legends - Exclusive Gear And Loot System Breakdown Video", "description": "GameSpot has an exclusive video that showcases an in-depth look at the loot and gear system for Magic: Legends, a new action RPG set in a fantasy universe inspired by the popular Magic The Gathering card game. Blending strategic deck-building with class-based action-RPG combat, Magic: Legends incorporates the many tenets of high-fantasy action into a new game coming from developers Cryptic Studios and Perfect Worlds.\n\nJust ahead of its open beta launching on March 23 for PC, the developers offered insight into the different approach Magic: Legends' takes to collecting loot, and how it aims to make the grind stress-free for players. In this video, Cryptic Studios design lead Adam Hetenyi explains how the new gear system came to be. Following the round of alpha tests, the developers responded to fan feedback and incorporated a new loot and gear system to complement the existing deck-building and action-RPG combat.\n\n\"Through our closed alpha test in 2020, we gathered a lot of player feedback that [noted] while our spell and artifact systems were an interesting approach to player progression in the Magic multiverse, these features couldn't fully replace a gear system in an action-RPG,\" stated Hetenyi. \"So we took another pass at our itemization to develop a gear system that makes defeating enemies and completing missions that much more rewarding, without avoiding overbearing loot drops and inventory management.\"\n\nBefore this update, Magic: Legends leaned heavily into its suite of cards that added new skills and modified the abilities for each class, along with a set of relics that added buffs and changes as well. The inclusion of a new gear system adds in a layer of customization and refinement for each of these playable characters. In addition to the deck-building system, you can now add six different gear types to your character, which amplifies their stats, skills, and attributes. While the loot doesn't flow as common as in other action-RPG games, Magic: Legends players will be able to acquire these pieces of loot from completing quests or by slaying elite foes tied to key missions.\n\nFor more on Magic: Legends, be sure to check back with GameSpot for more updates. If you're also looking to jump into the open beta starting on March 23, or if you want to know more about how equipment works, check out the game's official website at PlayMagicLegends.com.", "link": "https://www.youtube.com/watch?v=BnvY1ZmTdjk", "date_published": "2021-02-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Season Two Cinematic Trailer | Call of Duty: Black Ops Cold War & Warzone", "description": "Check out the Season Twi Cinematic Trailer for Call of Duty: Black Ops Cold War & Warzone!", "link": "https://www.youtube.com/watch?v=0r_Qf_pFc-8", "date_published": "2021-02-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Xbox Wireless Headset - Launch Trailer", "description": "Game loud and clear with the all-new Xbox Wireless Headset, featuring auto-mute and voice isolation for crystal-clear chat, intuitive design, and direct pairing to your console.", "link": "https://www.youtube.com/watch?v=PdJetAikJcw", "date_published": "2021-02-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]