[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Biggest Games Releasing November 2021", "description": "Here are the biggest games releasing November 2021. FPS fans will definitely have a lot to look forward to, with the annual installment of Call of Duty and Battlefield both releasing this month.\n\nNovember 2021 sees the release of:\nJust Dance 2022, November 4\nCall of Duty: Vanguard, November 5\nForza Horizon 5, November 9\nShin Megami Tensei V, November 12\nPokemon Brilliant Diamond and Shining Pearl, November 19\nBattlefield 2042, November 19\nFinal Fantasy XIV: Endwalker, November 23", "link": "https://www.youtube.com/watch?v=f93OPlWDxC8", "date_published": "2021-10-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Brilliant Diamond & Shining Pearl | Team Galactic Trailer", "description": "Check out the Team Galactic Trailer for the Pokemon Brilliant Diamond and Shining Pearl games which are remastered versions of fan favorites Pokemon Diamond & Pearl. Pokemon Brilliant Diamond & Shining Pearl launches on November 19th, 2021.", "link": "https://www.youtube.com/watch?v=m89EvTCQdJQ", "date_published": "2021-10-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Legends: Arceus | Hisuian forms of Zorua and Zoroark Trailer", "description": "Check out the all new trailer for Pokemon Legends: Arceus showing off the new Hisuian forms of Zorua and Zoroark.", "link": "https://www.youtube.com/watch?v=ZCmDF-43V7s", "date_published": "2021-10-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The State of Call of Duty: Warzone", "description": "Call of Duty: Warzone has made strides as one of the largest free-to-play games ever. Over the last year and a half, Warzone's success has fluctuated with integrations both from Black Ops Cold War and Vanguard, hacker accounts, and more. Let's reflect on Warzone and see where it started, where it's at, and where it could go next. \n\nTIMESTAMPS:\n00:34 - Where it Started\n02:12 - Where it's Been\n05:03 - Where it's Going\n\nIn less than 2 years, Call of Duty: Warzone has left its impact on the Battle Royale gaming space. After the successful launch, the free-to-play title soared in popularity with fans from all walks of FPS and in mere months, player count rose to the multi-millions. Today, well after the initial hype has come and gone, we’ve seen the good and bad size of Warzone. With plans to eliminate hackers and an all new Vanguard Pacific map on the way, what does the future of Warzone look like?    \n\nIn the beginning, Warzone was undeniably a runaway success. Unfortunately, when issues like hacker accounts and overpowered weapons began to plague the game, the experience quickly became unfavorable. With continued balancing, Warzone remains a somewhat stable experience. Events like “The Haunting” and “Know Your History” served as short distractions that mixed up gameplay and even had players working together, but only time will tell if the overall success of warzone can hold.    \n      \nFor more videos about your favorite first-person shooters like Call of Duty, Halo, and Battlefield, stay tuned to GameSpot’s YouTube page and GameSpot.com for all the latest updates.", "link": "https://www.youtube.com/watch?v=iGPWhgXWFys", "date_published": "2021-10-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Apex Legends: Escape Gameplay Trailer (Season 11)", "description": "Check out the all new gameplay trailer for Apex Legends: Escape (Season 11) featuring the new legends Ash, new map Storm Point, and new weapon the C.A.R SMG. Apex Legends: Emergence (Season 10) will end on November 2nd, which is to be shortly followed by Apex Legends: Escape (Season 11).", "link": "https://www.youtube.com/watch?v=R1SxsWUIZQw", "date_published": "2021-10-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Infinite - Campaign Overview", "description": "Check out the Halo Infinite Campaign Overview which launches on December 8th. \n\nThe Banished have defeated UNSC forces and taken control of the mysterious Zeta Halo, threatening the survival of humankind. When all hope is lost and humanity’s fate hangs in the balance, the Master Chief returns to confront the most ruthless foe he’s ever faced. Here’s a fresh look at the Halo Infinite campaign that introduces players to true Spartan freedom in the biggest, most wide open and adventure-filled Halo experience yet.", "link": "https://www.youtube.com/watch?v=xk-vmqqgUp4", "date_published": "2021-10-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Infinite Campaign Looks Way Better Now | GameSpot News", "description": "In today’s episode of GameSpot News, Persia talks about the new Halo Infinite Campaign gameplay reveal, more details on Horizon Forbidden West combat and abilities, and the deep-rooted backstories of four operators from Call Of Duty: Vanguard. \n \nNew Halo Infinite campaign footage has been released and showcased Master Chief working with a new AI, the campaign’s wide-open level structure, and more. We also get a look at the RPG system for suit upgrades, new enemy types, and other story details to come. Halo Infinite's campaign and multiplayer are separate, standalone products that launch on December 8th.\n\nIn a blog post, lead systems designer David McMullen spoke about how the sequel gives Aloy a number of new options for how she can move through the world. Aloy will be able to climb freely on and across huge sections of rocky terrain and make use of new weapons such as the Resonator Blast and the Spike Thrower.\n\nSledgehammer Games' narrative lead Stephen Rhodes and senior narrative designer Robert Lo provided more details on some of Call of Duty: Vanguard's operators. Backstories were shared for campaign operators Arthur Kingsley and Polina Petrova, along with two new operators for multiplayer, Daniel Take Yatsu and Padmavati Balan. \n\nFor more information on all of our topics today, please visit gamespot.com", "link": "https://www.youtube.com/watch?v=NgoieN-pEi0", "date_published": "2021-10-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Marvel's Guardians of the Galaxy Review", "description": "Eidos-Montréal's Guardians of the Galaxy digs into the weird side of Marvel comics to deliver a fulfilling story about the titular heroes.\n\nJordan enjoyed his time blasting baddies and cracking wise as Peter Quill (though, moreso the latter than the former) in Marvel's Guardians of the Galaxy, completing the campaign in 16 hours. He played on PlayStation 5 using a code provided by publisher Square Enix.", "link": "https://www.youtube.com/watch?v=7bvJK9dF_jk", "date_published": "2021-10-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]