[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Ed Sheeran: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nBobby Carter | October 26, 2021\nDecked in a hoodie, cargo pants and coveted sneakers, a slimmed-down and clean-shaven Ed Sheeran stands surrounded by bookshelves and a host of world-class musicians. He’s flanked by music director to the stars, Adam Blackstone, who assembled the band and handled bass guitar duties. After opening this Tiny Desk (home) concert with his latest single, “Shivers,” Sheeran introduces himself and proceeds with more hits, new tunes, and a surprise throwback. \n\nThe English singer-songwriter may appear acclimated to a live band, but it’s a pretty rare occasion. For more than a decade, Sheeran’s become revered for ripping down stadiums, but usually (and remarkably) it’s just him, a guitar and loop pedals.\n\nThe material released so far from his upcoming album, = (out Oct. 29), leans heavily into the ’80s pop sphere and provides glimpses into Sheeran’s personal life during his time away. Here, he debuts “Overpass Graffiti,” an uptempo ode to the endurance of long love. “Visiting Hours” is a heartfelt dedication to his close friend and mentor, Australian record executive Michael Gudinski, who passed away in March. \n\nAlthough most of the setlist honors =, Sheeran veers momentarily to take us to church with 2014’s “Make It Rain” from the TV show Sons of Anarchy. The choir only takes up a smidgen of physical real estate, but their voices manage to engulf the entire space, propelling the song to another stratosphere. He closes the performance with a quiet storm version of his summer single “Bad Habits.”\n\nSET LIST\n* “Shivers”\n* “Make It Rain”\n* “Overpass Graffiti”\n* “Visiting Hours”\n* “Bad Habits”\n\nMUSICIANS\n* Adam Blackstone: musical director/bass\n* Terence Vaughn: keys\n* Tim Stewart: guitar\n* Clay Sears: guitar\n* Brian Frasier-Moore: drums\n* Rayfield Holloman: pedal steel guitar\n* Whitney Smith: vocals\n* Raphael Smith: vocals\n* Melissa Best: vocals\n* Antia Coach: vocals\n* Melany Watson: vocals\n* Kyron Elcock: vocals\n* Raymond Mason: trombone\n* Michael Leonhart: trumpet\n* Sam Greenfield: saxophone\n\nCREDITS\n* Video: Chadrick Fellers, Jeremy Ivory-Chambers, Porous Porousfreak\n* Audio: Tyrell Ace Clark, James Hardy-Martin, Douglas Touré Harris\n\nTINY DESK TEAM\n* Producer: Bobby Carter\n* Video Producer: Kara Frame\n* Audio Mastering: Josh Rogosin\n* Tiny Production Team: Bob Boilen, Bobby Carter, Maia Stern, Sofie Hernandez-Simeonidis\n* Executive Producer: Keith Jenkins\n* Senior VP, Programming: Anya Grundmann\n\n#tinydesk #nprmusic #edsheeran", "link": "https://www.youtube.com/watch?v=4MsoqUv5gv4", "date_published": "2021-10-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Circuit des Yeux: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nLars Gotrich | October 25, 2021\nHaley Fohr's voice is built for cathedrals, but we'll take a funeral chapel. In Circuit des Yeux's Tiny Desk (home) concert — recorded amid the sepia-toned stained glass of the historic May Chapel at the Rosehill Cemetery and Mausoleum — Fohr's operatic, four-octave vibrato contains a wondrous terror, but also an illumination of being.\n\nThis unique setting is not merely a venue for the Chicago experimental music scene that Fohr calls home, but also a reflection of Circuit des Yeux's latest album, -io. In it, Fohr explores how grief not only shapes people but transforms them — that death (of self, of a loved one, of an idea) is not a finality, but an opening. On \"Vanishing,\" she brandishes a 12-string acoustic guitar distorted to disastrous peaks, matched only by blown-out drum fills and a string trio searing Fohr's ecstatic arrangements into sublime chaos. \"Dogma\" follows with a spaghetti-western riff, like an existential biker gang grooving to chirping synths and Fohr's deep howl: \"Tell me how to feel real / Talk talk talk talk talk talk about what's real.\"\n\nMuch of -io was written on the organ and piano, instruments that allowed Fohr to expand her sonic universe. This set closes on the balcony's organ with \"Stranger,\" a song ultimately about empathy, and accompanied only by Andrew Scott Young, who bows an upright bass behind the pews. At the climax, Fohr's voice rips across the vaulted ceiling as if to split the chapel in half, and we're left in the wailing's wake.\n\nSET LIST\n\"Vanishing\"\n\"Dogma\"\n\"Stranger\"\n\nMUSICIANS\nHaley Fohr: vocals, guitar, bass, organ\nWhitney Johnson: viola\nAndrew Scott Young: bass, guitar\nAshley Guerrero: drums\nBillie Howard: violin\nOli Harris: cello\n\nCREDITS\nVideo Rudy Rubio, Marisa Gesualdi\nAudio: Cooper Crain, Cooper Crain Recording\nDirector of Photography: Rudy Rubio\nEditor: Marisa Gesualdi\nAssistant: Margaret McCarthy\nGaffer: Mike Weldon\n\nTINY DESK TEAM\nProducer: Lars Gotrich\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Bobby Carter, Kara Frame, Sofie Hernandez-Simeonidis\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #circuitdesyeux", "link": "https://www.youtube.com/watch?v=WEkXiSfnZpE", "date_published": "2021-10-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]