[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "COD Warzone On Mobile - Coming in 2022? | GameSpot News", "description": "In this episode of GameSpot News, we talk about reports of Call of Duty Warzone coming to mobile in 2022, how Halo Infinite once had a Zelda-Like open world and GTA Online adding story DLC featuring Dr. Dre. \n\nIn this video, DeVante talks about reports that Call of Duty Warzone is coming to mobile devices in 2022. Currently, Call of Duty Mobile has a battle royale mode available within it, but the game is a broader slice of multiplayer influenced by the mainline series.\n\nDeVante also talks about how Halo Infinite’s campaign had a Breath of the Wild like open-world before 343 Industries cut two thirds. The cut was a result of the team running into development issues due to its development suite known as Faber, which was old and challenging to use.\n\nLater in the video, DeVante goes over GTA Online’s adding story DLC featuring GTA 5’s Franklin and hip hop legend Dr. Dre. The expansion is called \"The Contract,\" and it releases on December 15.", "link": "https://www.youtube.com/watch?v=TNs0-zqQAFA", "date_published": "2021-12-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "PSA: Don't Use Xbox Quick Resume With Halo Infinite Right Now | GameSpot News", "description": "In today’s GameSpot News, Persia talks about a major Halo Infinite campaign bug that could make you lose your cosmetics, a new Halo trademark that has been filed, and more. \n\n343 Industries has advised players to not use the Xbox Quick Resume feature for Halo Infinite's campaign because doing so could cause players to lose multiplayer content. Unfortunately, when players are offline or become disconnected from the network, the cosmetics will not appear in multiplayer. Using Quick Resume is known to boot players from the network, which is also affecting the multiplayer mode, prompting players to have to close the game entirely and reboot each time.\n\nLater in the video, Persia talks about Microsoft filing a trademark for \"Halo: The Endless\", as well as \"The Endless\", with few details to help determine what it might be referring to. Halo Infinite has been described by Microsoft as its platform for Halo for the foreseeable future, so it's not out of the question to assume this might be the name of the first planned content expansion for the game or maybe an entirely new media venture such as the Halo TV series coming to Paramount+.\n\nLastly, Persia talks about Halo Infinite winning the Player’s Voice Award at the Game Awards which will officially be going live tonight, December 9th at 4:30 PM PT.\n\nFor more information on all of our topics, please visit gamespot.com.\n\nTimestamps:\nIntro - 00:00\nHalo Quick Resume Bug - 00:07\nHalo: The Endless Trademark - 00:56\nHalo Infinite Player's Voice Award - 02:08\nThe Game Awards & Outro - 02:41", "link": "https://www.youtube.com/watch?v=fzbgDs0__AU", "date_published": "2021-12-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "THE GAME AWARDS 2021 Livestream", "description": "Tune in to THE GAME AWARDS 2021, video game's biggest night live on Thursday, December 9! Join us from Microsoft Theater in Los Angeles for awards, world premieres, and musical performances from Sting, Imagine Dragons and The Game Awards Orchestra. Geoff Keighley hosts a spectacular showcase with special guests and appearances to be announced. \n\nLast year's Game Awards livestream featured big announcements across all the major studios including Nintendo, Playstation, and Xbox. This year's Game Awards Livestream is sure to be as big or even bigger with trailers and world premieres throughout the event. \n\nThe Game Awards and Keighley himself have been teasing what's to come at this year's event via their social media accounts. Presenters confirmed for the event so far include Shang-Chi star Simu Liu, former Nintendo president Reggie Fils-Aime, and Keanu Reeves and Carrie-Ann Moss from the upcoming Matrix: Resurrections. Musicians confirmed for live performances include Imagine Dragons and music legend Sting, the latter performing \"What Could Have Been\" from the Netflix series Arcane: A League Of Legends Story. We'll also see the return of The Game Awards orchestra led by famous composer Lorne Balfe.\n\nGame Award winners will be announced from over 30 categories across general gaming and esports including Game of the Year, Best Game Direction, Esports Team of the Year, and Esports Player of the Year. The event will also feature announcements involving \"40 to 50 games\" according to an Epic Games interview with Keighley, with the number of brand-new titles announced being \"probably in the double digits.\" Keighley says there will be four or five game announcements on the same scale as Elden Ring.\n\n#GameAwards #TheGameAwards #Livestream #GameAwards2021 #TheGameAwards2021 #TheGameAwardsLivestream", "link": "https://www.youtube.com/watch?v=cG1mCfeu88w", "date_published": "2021-12-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 Battle Royale On The Way? | GameSpot News", "description": "In today’s GameSpot News, Persia goes over reports of a battle royale mode that might be coming to Battlefield 2042 soon, Assassin’s Creed Valhalla getting a possible god-of-war styled expansion and more.\n\nA battle royale mode for Battlefield 2042 is said to be arriving \"in the very near future” according to longtime games journalist, Tom Henderson. Although it is on the way, no official dates were announced but it’s said that it won't surface \"in the next six months.\"\n\nThere were also reports of the next game in the Battlefield franchise to be even more like an Overwatch-Styled shooter and Assassin’s Creed Valhalla getting another story expansion. However, this new expansion could be the biggest yet with 40 hours of additional content.\n\nLater in the video, Persia goes over Ubisoft Quartz - Ubisoft’s first dive into the NFT market. Quartz will wrap up in-game cosmetics into their own NFT's, each of which will have a unique serial number and history of owners. The Quartz Beta is only currently supported by Ghost Recon: Breakpoint on PC, and is only available in certain regions despite using a decentralized blockchain called Tezos which leads Ubisoft to call its venture \"energy-efficient\". In case you didn’t know, it can cost an extreme amount of energy to produce an NFT and comes with a major cost to the environment which may be why Ubisoft is stressing the energy-efficient angle of Tezos.\n\nLastly, Persia goes over the most recent teaser for the Halo TV show that is set to launch on Paramount+ in 2022.", "link": "https://www.youtube.com/watch?v=VgqcCYob9W8", "date_published": "2021-12-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Warzone New Pacific Map Livestream", "description": "Verdansk is gone and Caldera is here! Join Richie as he checks out the all-new Call of Duty: Warzone Pacific map 24 hours early.", "link": "https://www.youtube.com/watch?v=D_Gm_xp7HP4", "date_published": "2021-12-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "GTA Online: The Contract Trailer Featuring Franklin & Dr. Dre", "description": "Check out the all new Grand Theft Auto Online trailer for the upcoming expansion called The Contract which is coming December 15th. This update brings the launch of the \"GTA Online Story\" featuring characters from GTA V as well as Dr. Dre.", "link": "https://www.youtube.com/watch?v=9tJBrGc8oGc", "date_published": "2021-12-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "God of War PC Features 4K Trailer", "description": "God of War, coming to PC on January 14, 2022.\n\nEnter the Norse realm\nHis vengeance against the Gods of Olympus years behind him, Kratos now lives as a man in the realm of Norse Gods and monsters. It is in this harsh, unforgiving world that he must fight to survive… and teach his son to do the same. \n\nPC FEATURES\nHigh Fidelity Graphics\nStriking visuals enhanced on PC. Enjoy true 4K resolution, on supported devices, with unlocked framerates for peak performance. Dial in your settings via a wide range of graphical presets and options including higher resolution shadows, improved screen space reflections, the addition of GTAO and SSDO, and much more.\n\nNVIDIA® DLSS and Reflex Support\nQuality meets performance. Harness the AI power of NVIDIA Deep Learning Super Sampling (DLSS) to boost frame rates and generate beautiful, sharp images on select Nvidia GPUs. Utilize NVIDIA Reflex low latency technology allowing you to react quicker and hit harder combos with the responsive gameplay you crave on GeForce GPUs.\n\n#GodofWar", "link": "https://www.youtube.com/watch?v=-iA7GuaK3pY", "date_published": "2021-12-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Brilliant Diamond & Shining Pearl | Post-Game Guide", "description": "In this video we break down everything you can still do in Brilliant Diamond & Shiny Pearl after you defeat the Elite Four and roll credits on the game for the first time. \n\nPokemon Brilliant Diamond & Shining Pearl might have a different endgame than their Gen 4 counterparts, but there is still a lot to do. Some like the Stark Mountain quest will be familiar to veterans of Diamond & Pearl, but new additions like the Underground area and Ramanas Park are worth an extra look at. There are also quite a few easter eggs like obtaining the sounds of the original Gen 4 games!\n\nIn this video we break down 7 key things you can do as soon as you are crowned champion from taking part in Super Contests and making Poffins, to taking your best battle team into the Battle Tower to properly min/max your Pokemon to the best of your ability. Be sure to subscribe to GameSpot for more Pokemon guides, tips, and breakdowns!", "link": "https://www.youtube.com/watch?v=LGtJiquq8uU", "date_published": "2021-12-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]