[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Arooj Aftab: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nTom Huizenga | December 8, 2021\nIf you've been feeling a little overwhelmed with the world lately, you're not alone. Arooj Aftab is right there with you. The Brooklyn-based Pakistani musician transforms her worries into tranquil music. \"The way things have been unfolding, it's just madness,\" she told NPR recently. The songs she offers here, at a decrepit, yet generously resonant convent in Brooklyn, sound like an antidote for stressful times. Aftab's melodies float delicately and meander amid a chamber ensemble that includes Celtic harpist Maeve Gilchrist, classical guitarist Gyan Riley (yes, Terry Riley's son), violinist Darian Donovan Thomas and Shahzad Ismaily on bass and synth. And then there's Aftab's voice, smoky yet smooth, caressing words in the Urdu language.\n\nAftab inherited her native South Asian musical roots and then replanted them on U.S. soil, studying jazz at the Berklee College of Music in Boston. While her interests in music are broad – ambient, minimalism, reggae – her style is distinctively her own. \"After all these years, those things have all come together and are holding hands, a statement to someone who has roots in multiple places,\" she told NPR.\n\nThese songs are from Vulture Prince, which landed in the top 10 of NPR Music's best albums of 2021. \"Suroor,\" with its propulsive groove, speaks of the intoxicating nature of love (\"It has made me a drunk, you being the drink\"), while \"Mohabbat,\" as its polar opposite, features Aftab's elastic embellishments, lamenting over lost love. \"Saans Lo\" is solemn, like a prayer. \"Breathe,\" Aftab sings, \"gather the scattered pieces of your heart.\" This is surely one of the most beautifully rendered Tiny Desk performances.\n\nSET LIST\n\"Suroor\"\n\"Mohabbat\"\n\"Saans Lo\"\n\nMUSICIANS\nArooj Aftab: vocals\nDarian Donovan Thomas: violin\nShahzad Ismaily: bass, synth\nGyan Riley: guitar\nMaeve Gilchrist: harp\n\nCREDITS\nVideo: Sofian J. Khan / Capital K Pictures, Jessie Mailings, Isioma Chukwuani\nAudio: Joshua Valleau\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bobby Carter, Kara Frame, Joshua Bryant, Sofie Hernandez-Simeonidis\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #aroojaftab", "link": "https://www.youtube.com/watch?v=ZUYJ8_tBSSQ", "date_published": "2021-12-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]