[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Evolution of Halo's Magnum in PvP", "description": "From Combat Evolved to Halo Infinite PvP, the pistol has changed many times over the years. In this video, we look at the evolution of the iconic Magnum throughout every Halo game in the series.\n\nIn this video, Persia takes a trip through memory lane by revisiting every Halo to take a closer look at how the Magnum has evolved throughout the last two decades in PvP. From Halo: Combat Evolved to Halo Infinite, the Magnum goes through quite the rollercoaster of changes and tweaks. After the Halo Infinite Technical Preview, there is a little more insight on where the newest iteration of the Magnum is heading and how it stands against its predecessors.\n\nPersia also talks about other various factors like the scopeless days of the Magnum in Halo 2 and Halo 3 courtesy of dual-wielding and even how other mechanics in titles such as Halo 4's removal of the descope hindered the Magnum's overall performance. It can be interesting to see how the Magnum had to adjust to every new idea introduced to the series with each new title.\n\nHalo Infinite releases is set to release during the 2021 Holiday Season but you can play future technical previews by signing up for the Halo Insider program on HaloWaypoint.com\n\n#haloinfitite #halo", "link": "https://www.youtube.com/watch?v=mWjzXTszy6E", "date_published": "2021-08-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "27 MORE Things You STILL Didn't Know In Zelda Breath Of The Wild", "description": "Another round of secrets you probably don't know about in Breath of the Wild! This time we explain the secret launch properties of regular Chuchu jellies, special NPC's that react to the Gerudo disguise, and alternative sources of fuel for updrafts.\n\nIn the video above, we cover 27 tips and tricks that aren’t quite as well known, ranging from secrets to glitches, some that are pretty simple and others that are fairly complex. Breath of the Wild has been out for four years at this point, and players have found some amazing things, intended or not, that keep the game and its sense of discovery feeling fresh.\n\n0:00 Intro\n0:14 Dubious Food That's Not Bad\n0:31 Quince Tries To Hit On You\n0:48 Satty Is The Only Named Dog\n0:58 Many Ways To Smuggle\n1:19 Active Arrow Smuggling\n1:38 Auto Dodge A Lynels Triple Slash\n2:00 Trade Stalnox Eyes With Each Other\n2:19 Stalnox Can Kill Themselves\n2:32 Campfire Updraft Secret 1\n2:39 Campfire Updraft Secret 2\n2:48 Premade vs. Homemade Campfire\n2:57 Stand Weapons Upright\n3:13 Enemies Need To Reach The Handle\n3:27 Oil Friends\n3:42 Crab Dance\n3:50 Epona Co.\n4:01 Lasers Are Beamos\n4:18 Speedrun Categories\n4:45 These Rocks Represent Races\n5:03 Jelly Bouncing\n5:21 Launch Lynels\n5:40 Nightmare Fuel\n5:46 Keese Get Distracted\n5:55 Camp Lanterns\n6:06 Biggest Plastic Shader\n6:33 Easy Launch\n6:53 How To Disarm Shielded Enemies\n7:11 Bonus Fact About Me\n7:24 Outro\n\n#botw #Zelda #BreathofTheWild", "link": "https://www.youtube.com/watch?v=SaTHVCz8gDM", "date_published": "2021-08-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]