[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Gabriel Garzón-Montano: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nBobby Carter | January 19, 2021\nIf Gabriel Garzón-Montano's solo Tiny Desk back in 2017 was an exercise in restraint and vulnerability, his home set is the polar opposite. It beams ingenuity and unveils multiple layers, figuratively and literally. Taking advantage of of the rare opportunity to gather musicians in quarantine times, he says \"It's like being a child who's allowed to do what they always wanted to do when they didn't wanna get up for school, and it's also felt like an adult who didn't know what to do at 3 p.m. on a Tuesday afternoon. I'm focusing on oscillating between those states with ease.\"\n\nThat sounds like the same approach he applied to his latest album, last year's genre-snubbing Agüita. In this performance he brought the full band, sporting all white from mask to toe and bringing to life all the sonics we hear on the record. Garzón-Montano morphs into three different characters from Agüita and stretches the boundaries even more, adding salsa flavor to \"Muñeca\" and delivering some bonus bars on the set opener, \"With A Smile.\"\n\nSET LIST\n\"With A Smile\"\n\"Muñeca\"\n\"Tombs\"\n\nMUSICIANS\nGabriel Garzón-Montano: vocals, guitar, piano\nLenny \"The Ox\": drums\nNicholas Semrad\" Wurlitzer, synth\nJustin \"Jhawk\" Hawkins: guitar, synth\nItai Shapira: bass, synth, guitar\nGracie Sprout: harp\nDaniel Rodriguez: drums, percussion\nKROMA Quartet: strings\n\nCREDITS\nVideo: July Holdings, Tommy Nowels\nAudio: Ed McEntee, Brittney Orinda, Josh Pleeter\nAssistant Producers: Jackson Perry, Stephanie Hanson\nDirector of Photography: Andrew Fronczak\nProduction Designer: Greg Yaro\nSpecial Thanks: Gold Diggers Sound, Andrekza, Jagjaguwar and Esteban Cortazar\n\nTINY DESK TEAM\nProducer: Bobby Carter\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Kara Frame, Morgan Noelle Smith\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann", "link": "https://www.youtube.com/watch?v=bMN99gLK424", "date_published": "2021-01-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Nora Brown: Tiny Desk (Home) Concert", "description": "Every January, I attend globalFEST at a New York City nightclub and see some of the most fantastic music I'll experience all year. Now, given the pandemic's challenges and the hardening of international borders, NPR Music and globalFEST moved the 2021 edition from the nightclub to your screen of choice and shared the festival with the world. We called it Tiny Desk Meets globalFEST. We presented 16 artists in intimate settings (often behind desks donning globes) representing more than a dozen countries.\n\nThirty feet below the surface in Brooklyn, 10th grader Nora Brown brings incredible, surprising depth to the Appalachian music she plays. Over the course of her Tiny Desk Meets globalFEST concert, surrounded by innumerable globes and instruments, she infuses new life and energy into the traditional songs of Addie Graham, Virgil Anderson and Fred Cockerham. Nora weaves together songs and storytelling, speaking of the great history of the music that came before her and at which she excels. This performance took place on the second night of our 2021 festival. --globalFEST\n\nSET LIST\n\"The Very Day I'm Gone\"\n\"Miner's Dream\"\n\"Little Satchel\"\n\nMUSICIANS\nNora Brown: vocals, banjo\n\nCREDITS\nProducer: Nora Brown\nProducer: Benton Brown\nVideo: Benton Brown\nAudio: Joseph \"joebass\" DeJarnette at Studio808A\nPost Supervisor: Peter McCabe Pictures\nTiny Desk Meets globalFEST\n\nTINY DESK TEAM\n\nProducer: Bob Boilen\nVideo Producer: Morgan Noelle Smith\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Kara Frame, Maia Stern\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann\n\nGLOBALFEST TEAM\n\nCo-Directors: Shanta Thake, Isabel Soffer, and Bill Bragin\n2021 Curators: Shanta Thake, Isabel Soffer, Bill Bragin, and Viviana Benitez\nEvent Producer: Ian Thake\nHost: Angélique Kidjo\nSocial Media Manager: Valerie French\nPublicity: Brendan Gilmartin, Chart Room Media\nLegal Services: Tamizdat\nLegal Services: Duane Morris\nProducer: THE OFFICE performing arts + film\nVideo Production: MODEMA Studios", "link": "https://www.youtube.com/watch?v=GxjyFQS2nIY", "date_published": "2021-01-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "TH1RT3EN: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nAbby O'Neill | January 18, 2021\nTH1RT3EN, an irreverent and inflammatory new trio conceived by hip-hop star and lyrical savage Pharoahe Monch, has been in the works for five years. Co-conspirators include Daru Jones, a monster on the drums best known for his work with Jack White, and guitar mercenary Marcus Machado. Both the moniker and supergroup were born out of a frustration with the veneer of American society that underestimates the darkness of white supremacy.\n\n\"I knew 5 years ago where we headed,\" Monch shared over the phone. \"Sure, we've always done socially and politically aware music, but I'm tired of this \"love will win\" nonsense. Love may be the most powerful vibrating force, but consciousness is spreading and it's impossible not to be more aware of the evil that has kept the world in complete darkness. TH1RT3EN is the musical personification of me and my comrades at combat.\"\n\nShot in a padded \"panic\" room, this Tiny Desk (home) concert reflects the rage felt by this three-man battalion of rhythm and verbal artillery, shattering genre boundaries in the process. While TH1RT3EN recorded this set in August 2020, as evidenced by Monch's interlude, this four-song set still channels the discontent outside our windows today.\n\nSET LIST\n\"The Magician\"\n\"Cult 45\"\n\"Scarecrow\"\n\"Fight\"\n\nMUSICIANS\nPharoahe Monch: vocals\nMarcus Machado: guitar\nDaru Jones: drums\n\nCREDITS\nVideo: Get a Grip Productions, Arianna Thibodeau, Rashad Frett, Josh Therriault\nAudio: King of Chill\n\nTINY DESK TEAM\nProducer: Abby O'Neill\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Bob Boilen, Kara Frame, Morgan Noelle Smith\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann", "link": "https://www.youtube.com/watch?v=gUaAOpVvbVY", "date_published": "2021-01-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]