[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "26 MORE Things You STILL Didn't Know In Zelda Breath Of The Wild", "description": "Still at it with more things you still probably don't know about Breath of the Wild! This time we dive into how enemies can wield the legendary Master Sword against you, go for a lovely swim in some lava, and how to trigger some mechanics to absolutely collapse the game.\n\nIn the video above, we cover 26 tips and tricks that aren’t quite as well known, ranging from secrets to glitches, some that are pretty simple and others that are fairly complex. Breath of the Wild has been out for four years at this point, and players have found some amazing things, intended or not, that keep the game and its sense of discovery feeling fresh.\n\n0:00 Intro\n0:13 Blizzard Rods Disable Flame Pillars\n0:32 Swim In Lava\n0:58 Secret Way To Ignite Cannons\n1:16 Lizalfos Arms Flipout\n1:27 Moblin's Spaz Attack\n1:36 Vah Ruta's Ceiling Fights Back\n1:52 Enemies With The Master Sword\n2:16 Windlaunch Chuchu Jellies\n2:31 Hijack Bokos Off Their Highhorse\n2:47 Typhlo Ruins Blood Moon\n2:55 These Bokoblins Are Dumb\n3:13 Mount Agaat Platform\n3:24 T-Posing Moblin\n3:43 Map Return\n3:55 Lizalfos Momentum\n4:15 Lockup Backroom History\n4:56 Remote Bomb Pin\n5:18 Crab Island\n5:25 Tanagar Canyon Is Shield Surf Friendly\n5:45 Divine Beast Subdesign\n5:56 Disable Pebblits\n6:11 Horse Protection During Ganon Battle\n6:40 Block Shock Attacks\n6:48 Fireblights Sword Is Hot\n7:02 Dodge Waterblight 4 Times\n7:14 Walk On Waterblight's Spear\n\n#BOTW", "link": "https://www.youtube.com/watch?v=HkR-mYvHf3g", "date_published": "2021-10-31 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "13 Games That Defined Horror", "description": "From Resident Evil and Silent Hill to Amnesia and PT, these games stand out as genre defining. While the horror genre was one of the earlier game genres, it has evolved over the years with new ideas and ways to spook players. These are the 13 games that defined horror.\n\nDave takes a look at a horror timeline, from the origins of horror with Mystery House to how Sweet Home and Alone in the Dark would inspire Resident Evil. Whether it be The 7th Guest inspiring the likes of D and Phantasmagoria or how Amnesia would inspire games like SOMA, Outlast, and Layers of Fear.", "link": "https://www.youtube.com/watch?v=Bcm6jvWP438", "date_published": "2021-10-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Back 4 Blood’s Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of Back 4 Blood, including the M14, the Super 90 shotgun assault rifle, and a zombie slaying Desert Eagle.\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of Back 4 Blood and compares them to their real-life counterparts.\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020", "link": "https://www.youtube.com/watch?v=6C2NSRtvkm8", "date_published": "2021-10-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]