[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "Obama's War (full documentary) | FRONTLINE", "description": "In this 2009 documentary, FRONTLINE producers Martin Smith and Marcela Gaviria travel across Afghanistan and Pakistan to see firsthand how President Obama’s strategy took shape, delivering vivid, on-the-ground reporting from the war's many fronts.\n \nThis journalism is made possible by viewers like you. Support your local PBS station here: http://www.pbs.org/donate​.\n\nIn “Obama’s War”, Correspondent Martin Smith interviews top generals, diplomats and government officials to understand the internal debates over President Obama's grand attempt to combat terrorism at its roots. With the brunt of the work falling on rank-and-file soldiers in the unforgiving landscape of Helmand province, the Taliban stronghold in southern Afghanistan, FRONTLINE embedded with Echo Company of the 2nd Marines, 8th Battalion. Since the Marines' arrival that July, Helmand had become the most lethal battlefield in Afghanistan. But FRONTLINE found the Marines trying to act as armed diplomats, attempting to build the necessary trust for badly needed economic development.\n\nLove FRONTLINE? Find us on the PBS Video App where there are more than 300 FRONTLINE documentaries available for you to watch any time: https://to.pbs.org/FLVideoApp​ \n\n#Documentary​ #ObamasWar\n\nSubscribe on YouTube: http://bit.ly/1BycsJW​\nInstagram: https://www.instagram.com/frontlinepbs​\nTwitter: https://twitter.com/frontlinepbs​\nFacebook: https://www.facebook.com/frontline\n\nMajor funding for FRONTLINE is provided by the Ford Foundation. Additional funding is provided by the Abrams Foundation; the John D. and Catherine T. MacArthur Foundation; Park Foundation; and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation, and additional support from Koo and Patricia Yuen.", "link": "https://www.youtube.com/watch?v=v3-FDWSRabM", "date_published": "2021-08-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "As Taliban Sweeps Into Power, Look Back at How the U.S.-led War Began | FRONTLINE", "description": "As the U.S. withdraws from Afghanistan and the Taliban seizes control of the country, an excerpt from FRONTLINE’s upcoming film “America After 9/11” reveals how the roots of defeat go back two decades.\n\nSubscribe on YouTube: http://bit.ly/1BycsJW\n\nThe night of the September 11, 2001, attacks that killed nearly 3,000 people, then-President George W. Bush addressed the United States. He said, “Today, our nation saw evil, the very worst of human nature.”\n\nWithin the U.S. government, a plan took shape to go after the figure behind the attacks: Al Qaeda’s leader Osama bin Laden. He was operating out of Afghanistan, harbored by the extremists running the country — the Taliban.\n\nA small CIA strike force arrived in Afghanistan two weeks after the 9/11 attacks and used money to buy the cooperation of the Taliban’s enemies, rival militias and warlords. American aerial bombardments allowed Afghan fighters to push the Taliban out of the country’s capital, Kabul. But bin Laden, the CIA’s primary target, disappeared.\n\nThe post-9/11 U.S.-led invasion of Afghanistan would embroil the United States in what would become the longest war in American history.\n\nPremiering on PBS and online Tuesday, Sept. 7, 2021, \"America After 9/11\" traces the U.S. response to the terrorist attacks and devastating consequences across three presidencies.\n\nFrom the wars in Afghanistan and Iraq to the January 6th insurrection, “America After 9/11” exposes the legacy of September 11 – and the ongoing challenge it poses for the president and the country.\n\nWatch \"America After 9/11\" in full starting Sept. 7, 2021.\n\nFind FRONTLINE on the PBS Video App, where there are more than 300 FRONTLINE documentaries available for you to watch any time: https://to.pbs.org/FLVideoApp\n\nSubscribe on YouTube: http://bit.ly/1BycsJW Instagram: https://www.instagram.com/frontlinepbs Twitter: https://twitter.com/frontlinepbs Facebook: https://www.facebook.com/frontline\n\nFRONTLINE is produced at GBH in Boston and is broadcast nationwide on PBS. Funding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Major funding for FRONTLINE is provided by the Ford Foundation. Additional funding is provided by the Abrams Foundation; the John D. and Catherine T. MacArthur Foundation; Park Foundation; and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation and additional support from Koo and Patricia Yuen.", "link": "https://www.youtube.com/watch?v=u-jeTXRcRCE", "date_published": "2021-08-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "President Obama’s Unsuccessful Bid to End the Afghanistan War | FRONTLINE", "description": "As Afghanistan falls to the Taliban, FRONTLINE’S upcoming documentary “America After 9/11” shows how hopes for victory had been abandoned as far back as the Obama administration.\n\nSubscribe on YouTube: http://bit.ly/1BycsJW\n\nPresident Barack Obama was focused on ending in the war in Afghanistan. He brought in a general who said a surge of tens of thousands of U.S. troops was necessary to turn the war around.\n\nThe general designed a test case: 15,000 troops would try to rout the resurgent Taliban from their stronghold in Marjah. American forces couldn’t hold the territory. They faced ambushes and roadside bombs from the Taliban. The general who recommended the surge called the conflict a “bleeding ulcer.”\n\nWith Marjah, once again an American president was being forced to concede. There would be no easy victory in Afghanistan.\n\nPremiering on PBS and online Tuesday, Sept. 7, 2021, \"America After 9/11\" traces the U.S. response to the terrorist attacks and devastating consequences across three presidencies.\n\nFrom the wars in Afghanistan and Iraq to the January 6th insurrection, “America After 9/11” exposes the legacy of September 11 – and the ongoing challenge it poses for the president and the country.\n\nWatch \"America After 9/11\" in full starting Sept. 7, 2021.\n\nFind FRONTLINE on the PBS Video App, where there are more than 300 FRONTLINE documentaries available for you to watch any time: https://to.pbs.org/FLVideoApp\n\nSubscribe on YouTube: http://bit.ly/1BycsJW Instagram: https://www.instagram.com/frontlinepbs Twitter: https://twitter.com/frontlinepbs Facebook: https://www.facebook.com/frontline\n\nFRONTLINE is produced at GBH in Boston and is broadcast nationwide on PBS. Funding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Major funding for FRONTLINE is provided by the Ford Foundation. Additional funding is provided by the Abrams Foundation; the John D. and Catherine T. MacArthur\n\nFoundation; Park Foundation; and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation and additional support from Koo and Patricia Yuen.", "link": "https://www.youtube.com/watch?v=4a6m5DIHQCM", "date_published": "2021-08-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "The Man Who Knew (full documentary) | FRONTLINE", "description": "When the Twin Towers fell on September 11, 2001, among the thousands killed was the one man who may have known more about Osama bin Laden and Al Qaeda than any other person in America: John O'Neill.\n\nThis journalism is made possible by viewers like you. Support your local PBS station here: http://www.pbs.org/donate​.\n\nThis 2002 FRONTLINE documentary chronicles John O'Neill's struggle to convince the FBI to pay attention to the threat posed by Al Qaeda and Osama bin Laden. The former head of the FBI's flagship antiterrorism unit in New York City, O'Neill had investigated the bombings of the U.S. embassies in Africa and the USS Cole in Yemen. For five years, he led the fight to track down and prosecute Al Qaeda operatives throughout the world. But he was a controversial figure inside the buttoned-down world of the FBI. O'Neill's critics contend that his personal failings proved fatal to his FBI career. His supporters, however, believe his main failing was refusing to conform to the standard-issue FBI mold.\n\nLove FRONTLINE? Find us on the PBS Video App where there are more than 300 FRONTLINE documentaries available for you to watch any time: https://to.pbs.org/FLVideoApp​ \n\n#Documentary​ #TheManWhoKnew\n\nSubscribe on YouTube: http://bit.ly/1BycsJW​\nInstagram: https://www.instagram.com/frontlinepbs​\nTwitter: https://twitter.com/frontlinepbs​\nFacebook: https://www.facebook.com/frontline\n\nMajor funding for FRONTLINE is provided by the Ford Foundation. Additional funding is provided by the Abrams Foundation; the John D. and Catherine T. MacArthur Foundation; Park Foundation; and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation, and additional support from Koo and Patricia Yuen.", "link": "https://www.youtube.com/watch?v=pbXPqWGGQ5U", "date_published": "2021-08-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]