[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "Zorin OS 16 - The BEST DISTRO to move to LINUX?", "description": "Get your powerful, secure desktop that you can take anywhere: https://www.shells.com/l/en-US/pricing\n\nGet your Linux desktop or laptop here: https://slimbook.es/en/\n\nZorin OS 16 was just released a few days ago. This distro gets a ton of praise from beginners and windows switchers, and this new release, in my opinion, cements its place as the go-to recommendation for new Linux users. Let's see what's new and if Zorin can earn a nice \"Linux beginner\" seal of approval.\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nJoin us on our new Discord server: https://discord.gg/xK7ukavWmQ\nTwitter : http://twitter.com/thelinuxEXP\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\nFollow me on ODYSEE: https://odysee.com/@TheLinuxExperiment:e\nOr join ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\n\n\nAs always, Zorin OS come with 4 variants: a Core and Core Lite edition, respectively using GNOME and XFCE, and free of charge, and a PRO and PRO Lite edition, which are paid for.\n\nThis review is specifically of the Pro version of Zorin OS.\n\n## Basics\nSo let's start with the basics.\n\nZorin OS uses GNOME for its main editions, and XFCE for the Lite editions. It's now based on Ubuntu 20.04 LTS, which is an older base, but shouldn't be an issue, as Zorin OS now includes flathub out of the box.\n\nIt seems to be using GNOME 3.38, but a few apps are stuck in their 3.36 version, for example the File manager and the software center. Zorin touts performance improvements, probably linked to the move to a newer version of GNOME than what was available in Zorin OS 15, and a newer kernel as well, version 5.11 out of the box.\n\n## Desktop\n\nOn the desktop, you're greeted with a familiar, windows 10 like layout. Of course, you can change it in one click with the Zorin appearance app.\nZorin ships layouts imitating Windows 10, Windows 7, with a shorter taskbar with application names on it, or older versions of windows, with a simpler menu, which is just a list of categories.\n\nYou'll also find a brand new Windows 11 layout, with centered menu, overview, and app shortcuts, on a taskbar that occupies the whole bottom of the screen. The menu is also changed in this layout, with just a list of apps, although it lacks the \"favorites\" section that windows 11 boasts. \n\nYou also find layouts that imitate macOS, with a dock at the bottom and a simple list menu on the top, a default GNOME layout without a dock and the classic GNOME 3 top bar, a Unity-like layout that imitates how Ubuntu is setup, or a hybrid layout with a centered list of app shortcuts in the task bar, a menu in the bottom left corner, and no top bar at all.\n\nThe Windows 11 layout is specific to the Pro version, as are the Ubuntu, macOS, and older windows layout.\n\n\n## Look and feel \n\nThe theme itself has been revamped, and looks even more minimalistic. It's a look I really like, with flat white or dark colors, and the smallest bit of gradient over the accent color. Icons are nice and flat, and they even managed to round all the window and menu corners.\n\nZorin OS 16 also comes with the ability to turn on \"jelly mode\", which is just a fancy name for these good old wobbly windows.\n\n## Default apps\nNow, in terms of applications, Zorin OS PRO adds a LOT of apps out of the box. You can opt for a \"minimal\" install option if you're not interested in these, but if you want an install full of various programs, get prepared.\nZorin OS Pro goes wayyyy overboard.\n\nOther notable additions that are preinstalled on Zorin OS Pro are the Barrier app, which we'll talk in a bit, and the network display app, that will let you cast your display onto any wifi display or miracast compatible devices.\n\nNow in terms of the apps you can get, Zorin OS 16 ships with Flathub out of the box, plus Snap, and all the apps in the Ubuntu repos. They also added their own PPAs for more up to date drivers,  applications, and for their own tools like Zorin Connect or Zorin appearance.\n\n## Gestures\n\nZorin OS 16 also ships with gestures support, and they're 1:1 gestures, even on X.org, which is still the default on this distro. They're basically the GNOME gestures, with a 3 finger pinch to get to the activities, and 4 finger swipes up and down to move virtual desktops.\n\n## Barrier app\n\nZorin OS Pro also comes preinstalled with the barrier app, which you can get from flathub on any other distro. This thing lets you share your mouse and keyboard with any other computer that has Barrier installed.", "link": "https://www.youtube.com/watch?v=pgjHCGgitiU", "date_published": "2021-08-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]