[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "The Isley Brothers: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nBobby Carter | Aug. 18, 2021\nBefore the Isley Brothers played \"That Lady\" during this Tiny Desk (at Home) concert, lead singer and founding member Ronald Isley shared two stories about the song that perfectly encapsulates the scope of their nearly seven-decade career. \"It reminds me of going way back, when we had Jimi Hendrix living at the house and playing. We went on to meet a young fellow by the name of Kendrick Lamar who sampled the record and we got a Grammy award for it.\" At the Tiny Desk, we've hosted shows from superstars and legends – but our home concert series has now officially reached new heights.\n\nShot at their home studio in St. Louis, Mo., Ronald and his brother Ernie stand front and center, performing just a slice from a catalog overstuffed with classic anthems. (These four songs alone have been sampled or covered by over three hundred artists.) They kick things off with 1983's quiet storm essential, \"Between the Sheets.\" As a nod to the late Notorious B.I.G., Mr. Biggs opens with, \"I like it when you call me Big Poppa\" – from there, they fire off three more hits, including the immortal \"Footsteps in the Dark\" and \"For the Love of You.\" The Isley Brothers have eclipsed legendary status – their music is an intrinsic, indelible part of American culture. Watching Ron and Ernie play with as much enthusiasm as they did 30, 40, 50 years ago is an awe-inspiring sight to cherish.\n\nSET LIST\n\"Between the Sheets\"\n\"Footsteps in the Dark\"\n\"For the Love of You\"\n\"That Lady\"\n\nMUSICIANS\nRonald Isley: vocals\nErnest Isley: guitar\nKandy Isley: vocals\nKimberly Johnson: vocals\nCalvin Rodgers: drums\nChris Payton: guitar\nQuintin \"Q\" Gulledge: keys\nMaurice Fitzgerald: bass\n\nCREDITS\nVideo: Morgan Glenn, Josh Brickey\nCamera Operators: Brandon Brinkley, Isaac Sinason\nAdditional Production: Mary Meadows, Bryan Weddle, Jonathan Becker, Marcos Machado\nAudio: Adam Edmonds, Quintin \"Q\" Gulledge\nGuitar Tech: Sam Mays\n\nTINY DESK TEAM\nProducer: Bobby Carter\nVideo Producer: Kara Frame\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Maia Stern, Gabrielle Pierre\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#isleybrothers #tinydesk #nprmusic", "link": "https://www.youtube.com/watch?v=uQvdcfosF5A", "date_published": "2021-08-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]