[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Warzone And Vanguard - Everything We Know So Far", "description": "Call of Duty: Warzone's new Pacific map has a release date and a few surprises like a dogfighting mode! Here are the event dates and times to play.\n\nCall of Duty: Vanguard is making it's way to consoles and PC on November 5th. In the meantime, Activision shared a massive blog post surrounding the events at launch, pre-season, as well as news on the all-new pacific map. In this video, Richie Bracamonte breaks down the blog post to give you all the dates, event info and more.\n\nWarzone's new Vanguard pacific map arrives on December 2nd. Players who already own Vanguard will have 24 hours of early access. As we part ways with Verdansk for the last time, Call of Duty announced a few events leading to the map's sendoff. They also hinted that we'll probably leave Verdansk amid another doomsday scenario saying, \"Bombs away – see what happens to Verdansk before Warzone goes dark to prepare for Caldera and Season One.\"\n\nSeveral other updates were revealed surrounding season one of Vanguard. This includes the full list of multiplayer maps, modes and more. 12 operators are confirmed, all with customizable skins that can be acquired via in-game challenges or by unlocking them in the season 1 battle pass. Long time fans of the franchise will also see the return of \"Shipment\"- a map that dates back all the way to Call of Duty 4: Modern Warfare. \n\nStay tuned to GameSpot for our upcoming review of Call of Duty: Vanguard, as well as continued coverage with gameplay, livestreams and more.   \n\n#COD #CoDVanguard", "link": "https://www.youtube.com/watch?v=i8SlW_sTKCE", "date_published": "2021-10-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "How To Play New Warzone Map Early | GameSpot News", "description": "In this episode of GameSpot News, we talk about how you can play the Warzone Pacific map early, a mobile game being accused of copying Modern Warfare 2019, and physical GTA on Switch requiring a download.\n\nIn this video, Persia talks about the Call of Duty: Vanguard's integration with Warzone on December 2, 2021.Warzone Pacific will also bring the arrival of the recently revealed RICOCHET Anti-Cheat System to hopefully help cut back on Warzone's ongoing cheating problem on the same day it launches. \n\nPersia also talks about a mobile game called Combat Master being accused of copying Modern Warfare 2019's gameplay and UI. As of October 28, Combat Master Online FPS is still available to download and play, but it is uncertain how long Activision will let this apparent clone slide by without any legal action. \n\nLater in the video, the physical version of the GTA Trilogy on Switch will reportedly still require a download. On the eShop, The Definitive Edition appears as a bundle containing the three GTA games as separate products, each with a \"not available to purchase\" alone notice. However, it seems that Grand Theft Auto: Vice City will need a separate download, both when bought physically and digitally.", "link": "https://www.youtube.com/watch?v=jmS6SGSfZiU", "date_published": "2021-10-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "November’s Free Games For PS Plus And Xbox Games With Gold | GameSpot News", "description": "In today’s GameSpot News, Persia goes over all of November’s free games for PlayStation Plus and Xbox Games With Gold, Oculus Quest being renamed to Meta Quest, and the two Tomb Raider games coming to Nintendo Switch in 2022.\n\nThe free games that you can redeem this November for PlayStation Plus are Knockout City, First Class Trouble, Kingdoms of Amalur: Re-Reckoning, The Persistence, The Walking Dead: Saints and Sinners, and Until You Fall.\n\nIf you have Xbox Games with Gold, you’ll be able to claim four titles throughout November. These free games are Moving Out, Lego Batman 2 DC Super Heroes, Rocket Knight, and Kingdom Two Crowns.\n\nThe Oculus Quest is getting a new name to be more in line with Facebook’s rebranding. The Oculus Quest will now be known as the Meta Quest. In other Oculus news, users will no longer be required to sign in the Facebook for use and new login options are coming in 2022.\n\nThe Tomb Raider series will make its debut on Nintendo Switch in 2022, Crystal Dynamics has announced as part of the franchise's 25th-anniversary celebration. Lara Croft and the Guardian of Light and Lara Croft and the Temple of Osiris will be released on Switch beginning in 2022.", "link": "https://www.youtube.com/watch?v=bQeFipoptE0", "date_published": "2021-10-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Apex Legends: Escape - Everything To Know About Season 11", "description": "In this video, Persia goes over all of the big changes heading to the newest season of Apex Legends. Apex Legends: Escape introduces the new battle royale map called Storm Point, Ash who is the newest legend, and the C.A.R. SMG which is also a new weapon. A variety of other changes are also coming to other weapons, legends, and the ranked playlist.\n\nStorm Point is the fourth and largest battle royale map to be added to Apex Legends and the first to be developed after the release of the game. There will be 15% more playable space on Storm Point, natural wildlife that can attack you, and gravity cannons to boost you around the map. \n\nAsh will provide exclusive intel to her and her squad with her passive that can scan deathboxes to find its attackers and slow enemies down with her tactical Arc Tether. Ash's ultimate is called dPhase Breach and it creates a one-way portal that can help your team get in or out of fights quickly.\n\nThe C.A.R. SMG is a hybrid weapon that can use both light and heavy ammo and attachments. This helps with inventory management and gives you a wider variety of loot options.\n\nThere are also changes to Wattson and overall weapon balancing for season 11's arsenal. Ranked playlists will also see changes to their point system to make games more rewarding for those who obtain kills and get kills on opponents of a higher rank. \n\nTimestamps:\nIntro - 00:00\nStorm Point - 00:21\nAsh - 02:35\nWattson - 05:03\nC.A.R. SMG - 05:51\nWeapon, Crafting, & Hot Zone Changes - 06:26\nRanked Playlist Changes - 08:42\nOutro - 09:46", "link": "https://www.youtube.com/watch?v=45fVhZ2CcWQ", "date_published": "2021-10-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 Gameplay - First Look At Renewal, Breakaway and Discarded Maps", "description": "Battlefield 2042 is available on November 19, 2021 with early access starting November 12, 2021.\n\nFrom Egypt’s giant wall to Singapore’s maze-like cargo containers, get your first look at gameplay on three of the seven maps coming at launch: Renewal, Breakaway and Discarded.\n\nThe maps in Battlefield 2042 allow for all-new gameplay experiences, with unprecedented scale and choices in gameplay. With the introduction of 128 players*, each map is specifically designed to provide a unique experience that directly impacts strategy for you and your squad. Battlefields have multiple distinct combat areas housed in a single playspace and this extra space means more variety and more meaningful vehicle gameplay.\nBattlefield 2042 is made up of three distinct multiplayer experiences – All-Out Warfare features the next generation of fan-favorite modes Conquest and Breakthrough; Battlefield™ Portal allows players to discover battles from the past, present and future as well as to creating and change the rules of war; while Battlefield™ Hazard Zone brings a tense, squad-focused survival experience. Adapt and overcome on dynamically-changing battlegrounds with the help of your squad and a cutting-edge arsenal.\n\n#Battlefield2042", "link": "https://www.youtube.com/watch?v=2_rL1p-P37o", "date_published": "2021-10-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Vanguard File Size Revealed | GameSpot News", "description": "In this episode of GameSpot News, Call Of Duty: Vanguard file size might spare you from deleting other games, change your Battle.net handle for free, BlizzCon is cancelled, and there’s another Pikmin game.\n\nHere’s what you need to know in video games today. Call Of Duty: Vanguard’s install sizes are reportedly 30%-50% smaller at launch than previous games in the series on PlayStation 5, PS4, Xbox Series X/S, Xbox One, and PC. That’s not to say it’s a small install--it'll still require 56 to 93 gigs free, depending on the system. It might finally be time for you to uninstall Modern Warfare or Cold War to make space. Don’t forget to plan for more Warzone installs when the new Pacific map launches. \n\nBlizzard's is still seeing the fallout of toxic workplace allegations against it, with the latest developments being the cancellation of BlizzCon this year, and Overwatch character McCree's name changing to Cole Cassidy. McCree previously carried the name of an employee who was ousted from the company amid sexual harassment and discrimination allegations at Activision Blizzard. To go along with Cole's new name, players can now change their BattleTags for Battle.net for free for a limited time. \nFinally, Division 2 post-launch content has been delayed to February 2022 and Nintendo and Niantic have announced their next mobile app, Pikmin Bloom, coinciding with the 20th anniversary of Nintendo's nature-based franchise.\n\nTo find out what you need to know tomorrow, head on over to GameSpot.com and YouTube.com/Gamespot for more news.", "link": "https://www.youtube.com/watch?v=OBGkQYNJmKc", "date_published": "2021-10-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Mario Party Superstars - N64 vs. Switch Graphics Comparison", "description": "With Mario Party Superstars bringing back boards and minigames from the N64 titles, we put Mario Party 2 head-to-head with Superstars to see the graphical differences.\n\nMario Party Superstars is the newest entry in the Mario Party series, and with it, five classic boards from the Nintendo 64 titles return. Those five boards are Peach’s Birthday Cake and Yoshi’s Tropical Island from the original Mario Party, Space Land and Horror Land from Mario Party 2 (which are showcased in this video), and Woody Woods from Mario Party 3. Superstars also contains 100 minigames from across the entire series, including the GameCube, Wii, and Wii U entries. \n\nA few things to note about this video: The original version of Mario Party 2 is an N64 game, but the capture used in this video is the N64 version running on Wii U Virtual Console, while Mario Party Superstars was captured on a Nintendo Switch. Also, Mario Party 2 is running at 30fps, while Mario Party Superstars runs at 60fps, so you’ll notice one is smoother than the other.\n\nMario Party Superstars releases for Nintendo Switch on October 29, 2021. As of right now, the N64 Mario Party games are not scheduled to be released as a part of Nintendo 64 - Nintendo Switch Online, but hopefully some of them will be in the future. If you’re looking for more Mario Party Superstars videos, we’ve got you covered here on GameSpot.\n\nVideo Review: https://youtu.be/rNStB_1EtWs\n18 Minutes of Gameplay: https://youtu.be/QkswF9VuxgM", "link": "https://www.youtube.com/watch?v=6Jom434UcNo", "date_published": "2021-10-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Mario Party Superstars Review", "description": "Mario Party Superstars delivers on the nostalgia, but at the cost of feeling fresh.\n\nNintendo's Mario Party Superstars will be available on Nintendo Switch on October 29, 2021. You can read the full written Mario Party Superstars review by Randolph Ramsay on GameSpot: https://www.gamespot.com/reviews/mario-party-superstars-review-the-fault-in-our-stars/1900-6417771/\n\nIf you’re looking for more Mario Party Superstars videos, we’ve got you covered here on GameSpot.\n\nN64 vs. Switch Graphics Comparison: https://youtu.be/6Jom434UcNo\n18 Minutes of Gameplay: https://youtu.be/QkswF9VuxgM", "link": "https://www.youtube.com/watch?v=rNStB_1EtWs", "date_published": "2021-10-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]