[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Sara Watkins: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nBob Boilen | May 13, 2021\nThis is so enchanting. The painted scrim, the scenery trees are not only a setting for Sara Watkins and her bandmates, but we also discover a \"magic desk.\" And as Sara lifts the desk's top, we hear a guitar playing an alluring melody; in fact, it's Harry Nilsson's dreamy song \"Blanket For a Sail.\"\n\nI admired Sara's talents first as a fiddler, guitarist and singer playing in Nickel Creek, then her solo work, and much later with the trio I'm With Her. However, none of her music, even her solo recordings, ever sounded quite like the music on this Tiny Desk (home) concert. The songs are from her new album, Under the Pepper Tree.\n\n\"It's a children's record, largely inspired by thinking back on the music that meant so much to me as a kid,\" she says. \"I've got a daughter now, and so much of the music that I heard as a kid has stayed with me and served me well.\"\n\nOne of music's magical properties for Sara is the way it can ease transitions. Maybe it's from childhood to adolescence, or falling in and out of love, or simply getting your child to sleep. For this Tiny Desk, we hear old cowboy tunes via the Sons of the Pioneers or Rogers and Hammerstein's \"You'll Never Walk Alone.\" Yet, even Sara's original songs have that feeling of serenity and grace, like a world with a magical desk or curling up in a blanket under a pepper tree.\n\nSET LIST\n\"Tumbling Tumbleweeds\"\n\"Blanket For a Sail\"\n\"Under the Pepper Tree\"\n\"You'll Never Walk Alone\"\n\"Night Singing\"\n\nMUSICIANS\nSara Watkins: fiddle, guitar, vocals\nDavíd Garza: guitar, vocals\nAlan Hampton: bass, vocals\n\nCREDITS\nVideo: Caitlin Gerard\nAudio: Sam Weber\nCreative Director: Jacob Boll\nCinematographer: Indeana Underhill\nEditor: Robin Gonsalves\nCamera Operator / G&E: Stas Bondarenko\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Kara Frame\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#sarawatkins #tinydesk #nprmusic", "link": "https://www.youtube.com/watch?v=1aq9WjdCUik", "date_published": "2021-05-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]