[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Why LMGs Usually Suck In COD & FPS Games", "description": "Light machine guns are a weapon category that constantly struggles for identity in multiplayer shooters like Call Of Duty, Battlefield, and standalone battle royale titles. We look at the iconic weapon type’s struggle with nerfs, buffs, and finding a purpose.  \n\nMultiplayer shooters like Call Of Duty and Battlefield have a large number of weapon classes including assault rifles, submachine guns, sniper rifles, shotguns, and even rocket launchers. In-game weapons often channel the spirit of their real-world counterparts, such as SMGs being high rate-of-fire weapons that are great at close range but weak at a distance. One gun in particular has a lot of challenges translating to video games. The light machine gun is a weapon primarily designed to keep opponents’ heads down and instill fear. With the ability to respawn and try again, players in multiplayer shooters are generally not afraid to stick their head out, leading developers to explore creative solutions for what role the LMG should serve.\n\nIn this video, we’re going to look at what a light machine gun is, why they often don’t translate to games, types of suppression developers have tried, what happens when LMGs stray into other classes and get nerfed, how they fare in battle royale modes, and some creative implementations of the weapon. We’ll show off some of your favorites such as the M60 from Battlefield Bad Company and the RPD from Modern Warfare 2. We’re also going to explore why Lord Tachanka was the absolute worst character in Rainbow Six Siege until he was reworked recently.\n\nMake sure to head on over to GameSpot’s YouTube page for ongoing coverage of Call Of Duty: Warzone seasons and announcements around the release of the next Battlefield game.", "link": "https://www.youtube.com/watch?v=RUO3xBsO36c", "date_published": "2021-05-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "37 Minutes of Resident Evil Village PC Demo Gameplay", "description": "We try out the Resident Evil Village Demo on PC. We go through both the Village and the Castle since both demos are available. Players will have 1 hour to explore as much of both as they want. The Demo starts on May 1st at 5PM PDT and will last until May 9th at 5PM PDT. Resident Evil Village releases on May 7th.\n\nThe PC specs for this gameplay capture include a 2070 Super, an i7 10700K, and 32gb of Ram.  Played on High settings.", "link": "https://www.youtube.com/watch?v=-CYDtRVzyHw", "date_published": "2021-05-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Mass Effect Lore: Krogan And The Genophage", "description": "On this week's deep dive into Mass Effect lore, Jordan discusses the warmongering Krogan, and the Genophage designed to keep them in check.\nWhile many long-term fans are excited to dig back into Mass Effect with Mass Effect: Legendary Edition, there are also plenty of new players picking up the beloved trilogy for the first time. There's no shortage of lore in the series—it's incredibly dense with it—so if you're new to Mass Effect, here's a primer to get you started. Or, if you're a veteran fan, a way to refresh your memory before you play the remaster.\n\nIn the above video, Jordan Ramée discusses the fascinating history of the ferocious Krogan: a species bred for war. From the unusual anatomy that makes them almost impossible to kill to their warmongering nature, the Krogan are regarded as the brutes of the galaxy, always spoiling for a fight.\n\nTheir nature made them very useful to the Citadel Council when faced with the Rachni, a species threatening to conquer the galaxy. Unfortunately, the Krogan ran rampant, conquering numerous planets and breeding faster than they could be killed. The solution: a genetic mutation called the Genophage, which was designed to cut birth rates among Krogan dramatically in order to keep them in check.\n\nThe Genophage plays a huge role throughout the Mass Effect trilogy and informs some of the biggest decisions the player has to make throughout the games. For more lore videos, make sure to subscribe to gamespot.com/gamespot. Mass Effect: Legendary Edition launches on May 14 on PS4, Xbox One, and PC.", "link": "https://www.youtube.com/watch?v=Ow_epYDY-zs", "date_published": "2021-05-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]