[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCSiPjfAJBgbFlIUsxOWpK0w", "title": "drivers license // Olivia Rodrigo // POMPLAMOOSE", "description": "Gardenview out now, listen on Spotify (https://sptfy.com/gardenview) or wherever you listen to music.\n\n Ok so when I first heard Olivia Rodrigo's drivers licence, I couldn't believe that a breakup ballad had topped the charts all over the world! Probably shouldn't surprise me so much with artists like Billie Eilish paving the way. It's silly to take comfort in this, but it makes me so happy anytime a singer-songwriter makes it to the top of the charts. There is hope for us lyric-and-melody-loving people after all! :)\n\nSave this song on Spotify: https://spoti.fi/2r3Yqkh\nFollow us on instagram: https://instagram.com/pomplamoosemusic\nBecome a patron of our music (to vote on the songs we cover and get merch and stuff like that): http://www.patreon.com/pomplamoose\n\nA cover of Olivia Rodrigo's \"drivers license\" by Pomplamoose.\n\nMUSICIAN CREDITS\nLead Vocals: Nataly Dawn\nKeys: Jack Conte\nBass: Nick Campbell\nDrum Pad: Ben Rose\nBackground Vocals: Loren Battley\n\nAUDIO CREDITS\nEngineer: Bill Mims\nMixing/Mastering: Joey Genetti\nProducer: Ben Rose\n\nVIDEO CREDITS\nDirector: Dom Fera\nDP: Merlin Showalter\nCamera Operator: Isaac Park\nEditor: Athena Wheaton\nColorist: Charlene Gibbs\nProduction Designer: Susannah Honey\nWardrobe: Elle Olsen\nPA/Covid Safety Officer: Chris Modl\n\nRecorded at Cielo Galleries/Studios in Los Angeles.\n\n#Pomplamoose #IndieRock #DriversLicense #OliviaRodrigo\n\nLYRICS\n\nI got my driver's license last week\nJust like we always talked about\n'Cause you were so excited for me\nTo finally drive up to your house\nBut today I drove through the suburbs\nCrying 'cause you weren't around\nAnd you're probably with that blonde girl\nWho always made me doubt\nShe's so much older than me\nShe's everything I'm insecure about\nYeah, today I drove through the suburbs\n'Cause how could I ever love someone else?\n\nAnd I know we weren't perfect but I've never felt this way for no one\nAnd I just can't imagine how you could be so okay now that I'm gone\nGuess you didn't mean what you wrote in that song about me\n'Cause you said forever, now I drive alone past your street\n\nAnd all my friends are tired\nOf hearing how much I miss you, but\nI kinda feel sorry for them\n'Cause they'll never know you the way that I do, yeah\nToday I drove through the suburbs\nAnd pictured I was driving home to you\n\nAnd I know we weren't perfect\nBut I've never felt this way for no one, oh\nAnd I just can't imagine how you could be so okay, now that I'm gone\nI guess you didn't mean what you wrote in that song about me\n'Cause you said forever, now I drive alone past your street\n\nRed lights, stop signs\nI still see your face in the white cars, front yards\nCan't drive past the places we used to go to\n'Cause I still fuckin' love you, babe (ooh, ooh, ooh, ooh)\nSidewalks we crossed\nI still hear your voice in the traffic, we're laughing\nOver all the noise\nGod, I'm so blue, know we're through\nBut I still fuckin' love you, babe (ooh, ooh, ooh, ooh)\n\nI know we weren't perfect but I've never felt this way for no one\nAnd I just can't imagine how you could be so okay, now that I'm gone\n'Cause you didn't mean what you wrote in that song about me\n'Cause you said forever, now I drive alone past your street\nYeah, you said forever, now I drive alone past your street", "link": "https://www.youtube.com/watch?v=5AZAWL0dv0E", "date_published": "2021-03-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]