[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Battlefield 5’s Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of Battlefield 5, including the FP-45 Liberator pistol, the Boys AT Rifle, and the M3 Carbine complete with Infrared Sniper Scope.\n\nBattlefield V sees EA’s shooter franchise enter the Second World War, and naturally, the game includes a range of period weaponry, including the M1 Garand, the MP28 2, and the distinctive Fliegerfaust rocket launcher.\n\nIn this video, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of Battlefield V and compares them to their real-world counterparts.\n\nIf you're interested in seeing more of Jonathan, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can purchase Jonathan’s book here - https://www.headstamppublishing.com/bullpup-rifle-book", "link": "https://www.youtube.com/watch?v=-Pz7l-_AxKg", "date_published": "2021-03-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "It’s Time To Say Goodbye To Call Of Duty: Modern Warfare", "description": "Call Of Duty: Black Ops Cold War is probably going to nuke the Warzone map and put a final end to the era of Modern Warfare while forcing some players to choose which game to fit on their hard drive. \n\nCall Of Duty: Modern Warfare 2019 had a massive impact on the Call Of Duty formula by delivering a mil-sim-inspired game. Large maps, a thoughtful attachment system, and the inclusion of vehicles attracted lapsed Battlefield players and gamers who didn't traditionally enjoy the arcade feel of Call Of Duty. Modern Warfare fans were upset when Cold War took over the season pass, in-game store, and added over 30 Cold War guns into Warzone. Now with Cold War Season 2, Treyarch is taking the series, including Warzone, in a different direction, and it involves a lot of zombies. \n\nIn this video we talk about how recent unconfirmed reports say that the Warzone map introduced by Modern Warfare, Verdansk, will finally get nuked sometime in Season 2 to bring it in line with Black Ops Cold War. To make matters even tougher for some Modern Warfare players, the game may no longer fit on a base PS4's 500 gig hard drive with Cold War also installed. In this video, we talk over the pros and cons of this final switch and check in on how you're feeling about it.\n\nCall Of Duty: Black Ops Cold War is now in Season 2 and available on PlayStation 4, PS5, Xbox One, Xbox Series X/S, and PC.", "link": "https://www.youtube.com/watch?v=X3jLlvFr5PA", "date_published": "2021-03-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Silent Hills PT vs Evil Inside Comparison", "description": "Evil Inside is a new psychological-horror game by JanduSoft, and it has some remarkable similarities to the infamously canceled Silent Hill sequel, P.T. Check out this side-by-side comparison of the two games in action.\n\n\nIt's been nearly seven years since the release of P.T., and it's still left a massive impression on fans and developers alike. Though the ill-fated demo for Silent Hills is now just a specter in the gaming world, that hasn't stopped other developers from trying to rekindle the same sense of dread and horror with their attempts at paying homage to the minimalist horror game. The latest game paying tribute to P.T. is Evil Inside, an indie psychological horror game that tasks you with exploring a seemingly empty home to commune with the spirits that reside there.\n\nWith a trailer for the game being released, we put together a comparison video that shows off a side-by-side gameplay of P.T. and Evil Inside. In this video, we show off a number of the similarities between the two games--which there are many. In addition to similar-looking gameplay that focuses on walking down seemingly empty hallways and exploring rooms, we also get a look at the few jump scares that happen in both games. However, Evil Inside takes place in a much larger setting, and it's fair to say that there's much more to the game that we haven't yet seen.\n\nIn addition to this comparison between horror games, we've also put together several other side-by-side looks at other games, including how the Mass Effect Legendary Edition remaster compares to its original counterparts. For more on what's happening in the gaming world, be sure to keep up with GameSpot.", "link": "https://www.youtube.com/watch?v=lYXs4Fga3aY", "date_published": "2021-03-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "10 Things We Want In Elden Ring", "description": "We know next to nothing about Elden Ring, but that won’t stop us from listing off some things we’d love to see in From Software’s next outing. Here are 10 things we'd love to see!\n\nWe still know very little about Elden Ring, From Software's upcoming open-world game. But we have a lot of Demon's Souls, Dark Souls, Bloodborne, and Sekiro: Shadows Die Twice fans among us, so there are plenty of things we hope to see in Elden Ring.\n\nIn the video above, we detail 10 mechanics, features, and characters we hope to see in Elden Ring. We have no context for these dreams of ours beyond that Elden Ring is going to be an open-world game where different kingdoms are each ruled by a powerful entity, and that it features lore created in collaboration with Game Of Thrones author George R.R. Martin.\n\nElden Ring has most recently made the news after a gameplay trailer for the game leaked online. Don't worry, we won't be showing off the leaks in the video nor using it as the basis for any of our hopes and dreams. Frankly, leaks suck, and the trailer in question appears to be of an old build, so it's entirely possible that referencing it would be misleading.\n\nElden Ring doesn't yet have a release date, so we're unsure if we'll even get to see the game by the end of 2021.", "link": "https://www.youtube.com/watch?v=9901tyIy5Es", "date_published": "2021-03-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Elden Ring Leaks Suck For Everyone | Console Crew", "description": "This week on Console Crew, the gang discuss why game leaks suck for everyone, what they’d like to see from a Switch Pro, and what the future of PlayStation handhelds could look like.\n\nThis week on Console Crew the gang finally get to talk about Elden Ring, because goodness knows they’ve never talked about a From Software game before on the show. We’re not going to show any footage of the leaked Elden Ring trailer, but we do discuss it--specifically, we talk about why video game leaks suck for everyone involved.\n\nWith numerous reports that the Switch Pro is on the way, they also talk about what improvements they’d like to see to the Nintendo Switch, including better performance and battery life. Finally, the PlayStation Vita is getting a new physical game for the first time since 2019, which begs the question: What does the future look like for Sony handhelds? \n\nConsole Crew is your weekly roundup of the biggest PlayStation, Nintendo, and Xbox news, hosted by Lucy James, Tamoor Hussain, and Jordan Ramée. Catch it every Friday at youtube.com/GameSpot. \n\n00:00 - Intro\n00:53 - Elden Ring leak: why it sucks for everyone\n07:43 - Nintendo Switch's 4th Anniversary & is it time for the Switch Pro?\n13:22 - PS Vita lives, and the future of PlayStation handhelds\n18:08 - Outro", "link": "https://www.youtube.com/watch?v=R_jReBgFIPo", "date_published": "2021-03-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Last of Us Part 2's Shannon Woodward on Playing Dina and Working with Naughty Dog", "description": "On this week's episode of #GameSpotAfterDark, Shannon Woodward from #TheLastOfUsPart2 joins us to talk about her experiences with Naughty Dog. Check out the full interview here: https://open.spotify.com/show/5qmuPYfpj7R7yHXEtKBocG?si=Au1mZdHzTgOSHACMg50irA \n\n00:00 - Intro\n00:24 - Getting Into Acting In Video Games\n02:21 - First Time Walking On Set For LOU2\n04:08 - Differences In Acting For TV and Video Games\n07:57 - How Much Story Did You Know In Advance?\n09:47 - Creative Freedom In Scenes", "link": "https://www.youtube.com/watch?v=91R5s7a1Rtk", "date_published": "2021-03-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]