[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Zelda BOTW Expert Breaks Down High Level Combat", "description": "Max “RinHara5aki” Blumenthal with over 2300+ hours experience with Breath of the Wild combat, breaks down a battle sequence so the technicals can be shown and explain the complexities of what is happening. His combat glossary in progress explains a great deal about the vastness of advanced combat in Breath of the Wild. https://docs.google.com/document/d/1qtYT06sxweRW3tRnovcCc-f4xIOGFNsD02pG1TzloHc/edit?usp=sharing\n\nBreath of the Wild still to this day continues to have new discoveries of techniques and secrets in combat, so we get our in-house expert to completely breakdown this crazy Lynel fight and explain what is going on.\n\nIn the video above Max runs down quick explanations of difficult techniques such as Daruk’s Shield Block Reset, Thunderclap Rushes, Perfect Daruk’s Rushes, and more. And also a bit of homework so you can do some simpler techniques for yourself at home.\n\nAs Peter Brown stated in The Legend of Zelda: Breath of the Wild’s review back in 2017, “Given the myriad enemies and weapons you're up against, mastery feels almost unattainable even with substantial practice. However, that also means you are constantly learning in the face of unforeseen challenges.”, giving Breath of the Wild a 10 out of 10.", "link": "https://www.youtube.com/watch?v=99iUK141o2o", "date_published": "2021-01-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Hacking Expert Reacts To Hacking Clips In Games", "description": "Sean Melia, an ethical hacker, breaks down the hacking mechanics of some of our favorite games to tell us how realistic - or unrealistic - they really are.\n\nFrom Cyberpunk 2077 to Watch Dogs: Legion, many games feature hacking mechanics to let the player conduct covert espionage, steal important data or turn technology against their enemies. But how close do these games get to the way hacking works in real life?\n\nIn the above video Sean Melia, an ethical hacker, breaks down the hacking mechanics in some of our favorite games to tell us how realistic - or unrealistic - they really are.\n\nCheck out more of our Expert Reacts series right here - https://www.youtube.com/watch?v=-BeJdQfEp40&list=PLpg6WLs8kxGMgYb13XjPgOKbm5O-CDq7R", "link": "https://www.youtube.com/watch?v=BZU_KrlaGJk", "date_published": "2021-01-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]