[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCl2mFZoRqjw_ELax4Yisf6w", "title": "Why mainstream media's slander of wallstreetbets pisses me off regarding GME.", "description": "https://tinyurl.com/rossmatrix\nLet's get Right to Repair passed! https://gofund.me/1cba2545\nTo be clear, I disagree with a lot of the people posting there and some of the investing decisions I see made there are insane. They have actually deleted posts I've made with suggestions that would've helped people not FOMO & make more money. This is not an endorsement of WSB, but an explanation of why the people criticizing them in bad faith are full of shit, in my opinion.\n\nThis video references an opinion and is for information purposes only. It is not intended to be investment advice. Seek a duly licensed professional for investment advice. I am not a licensed professional for investments, or any kind of financial services.\n\nWe are not financial services or investment professionals and this is not investment advice. Do your own Research\nOur content is intended to be used and must be used for entertainment purposes only. It is very important to do your own analysis before making any investment based on your own personal circumstances. You should take independent financial advice from a professional in connection with, or independently research and verify, any information that you find in these videos and wish to rely upon, whether for the purpose of making an investment decision or otherwise.\n\nNo Investment Advice\nOur Youtube channel is an opinion/podcast platform. We are not a broker/dealer, we are not an investment advisor, we have no access to non-public information about publicly traded companies, and this is not a place for the giving or receiving of financial advice, advice concerning investment decisions or tax or legal advice. We are not regulated by the Financial Services Authority.\n\nThe value of shares and investments and the income derived from them can go down as well as up;\nInvestors may not get back the amount they invested - losing one's shirt is a real risk;\nPast performance is not a guide to future performance.", "link": "https://www.youtube.com/watch?v=4EUbJcGoYQ4", "date_published": "2021-01-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]