[{"source": "https://www.theguardian.com/rss", "title": "Fauci says he was the 'skunk at the picnic' in Trump's Covid team", "description": "<p>Public health expert says he could not resign as someone had to push back against ‘nonsense’</p><ul><li><a href=\"https://www.theguardian.com/world/series/coronavirus-live/latest\">Coronavirus – latest updates</a></li><li><a href=\"https://www.theguardian.com/world/coronavirus-outbreak\">See all our coronavirus coverage</a></li></ul><p>Dr Anthony Fauci was the “skunk at the picnic” in Donald Trump’s White House coronavirus taskforce, the top US public health expert told the New York Times in a candid interview on Sunday.</p><p> <span>Related: </span><a href=\"https://www.theguardian.com/world/2021/jan/24/deborah-birx-trump-white-house-covid-deniers\">Deborah Birx says Covid deniers in Trump White House 'derailed' response</a> </p> <a href=\"https://www.theguardian.com/world/2021/jan/24/fauci-says-he-was-the-skunk-at-the-picnic-in-trumps-covid-team\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2021/jan/24/fauci-says-he-was-the-skunk-at-the-picnic-in-trumps-covid-team", "date_published": "2021-01-24 23:37:11+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Terrorism watchdog to open inquiry into radicalisation in prison", "description": "<p>Prison officers have suffered a ‘steady drumbeat’ of attacks by terrorists, says Jonathan Hall QC</p><p>An inquiry into the way prisons deal with convicted terrorists is being launched by the independent terror watchdog amid concerns of growing radicalisation behind bars.</p><p>Jonathan Hall QC said there had been a succession of terror attacks on prison officers while other inmates were coming under the influence of “high status” terrorist prisoners.</p> <a href=\"https://www.theguardian.com/politics/2021/jan/24/terrorism-watchdog-to-open-inquiry-into-radicalisation-in-prison\">Continue reading...</a>", "link": "https://www.theguardian.com/politics/2021/jan/24/terrorism-watchdog-to-open-inquiry-into-radicalisation-in-prison", "date_published": "2021-01-24 23:13:48+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Trump plots revenge as Democrats push on with second impeachment trial", "description": "<ul><li>President mulls third party amid impeachment debate</li><li>Conviction over US Capitol attack still seems unlikely</li><li><a href=\"https://www.theguardian.com/commentisfree/2021/jan/24/donald-trump-twitter-facebook-corporate-sedition\">Robert Reich: Don’t believe corporate anti-Trump hype</a></li><li><a href=\"https://www.theguardian.com/commentisfree/2021/jan/22/will-trump-start-his-own-political-party\">Lloyd Green: Will Trump really start his own party?</a></li></ul><p>Republican divisions over Donald Trump’s <a href=\"https://www.theguardian.com/us-news/2021/jan/22/trump-impeachment-trial-articles-sent-house-senate\">second impeachment trial</a> came into clearer focus on Sunday, as the former president spent his first weekend out of office plotting revenge against those he says betrayed him.</p><p> <span>Related: </span><a href=\"https://www.theguardian.com/us-news/2021/jan/24/donald-trump-richard-nixon-elizabeth-drew-washington-post\">Can Trump do a Nixon and re-enter polite society? Elizabeth Drew doubts it</a> </p> <a href=\"https://www.theguardian.com/us-news/2021/jan/24/donald-trump-impeachment-trial-senate-republican-party-romney-rubio\">Continue reading...</a>", "link": "https://www.theguardian.com/us-news/2021/jan/24/donald-trump-impeachment-trial-senate-republican-party-romney-rubio", "date_published": "2021-01-24 22:30:40+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Eileen Pollock obituary", "description": "<p>My friend and colleague, the actor Eileen Pollock (Polly), has died aged 73. She was best known for playing Lilo Lil in the BBC sitcom Bread (1986-91), about the Liverpudlian Boswell family. The role was originally written as native Liverpool, so Polly tried out her Scouse on her taxi driver. When he asked what part of Australia she came from, she decided to stick to Irish. She loved playing the character, but other work meant more to her.</p><p>I first met Polly in the heady days of late-1970s feminism and ructions between the right and left in our union, Equity. Alternative theatre was booming. Polly worked with the political group Belt &amp; Braces, but the lack of women’s roles led her to co-found the feminist companies <a href=\"http://www.unfinishedhistories.com/history/companies/bloomers/\">Bloomers</a> and Camouflage, and write much of their material. In 1989, she was a fiery Mother Jones in Fight Like Tigers, about the Irish-American union activist. Polly was an articulate, passionate campaigner and outspoken socialist-feminist. As a friend said, she “could make the toughest of activists cower for an unguarded remark”. However, she was hugely generous and would give her last penny to anyone who was down on their luck.</p> <a href=\"https://www.theguardian.com/stage/2021/jan/24/eileen-pollock-obituary\">Continue reading...</a>", "link": "https://www.theguardian.com/stage/2021/jan/24/eileen-pollock-obituary", "date_published": "2021-01-24 18:03:04+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Johnson being urged to impose blanket Covid border controls", "description": "<p>Cabinet ministers and scientists say more protection needed against unknown variants entering UK</p><ul><li><a href=\"https://www.theguardian.com/world/series/coronavirus-live/latest\">Coronavirus – latest updates</a></li><li><a href=\"https://www.theguardian.com/world/coronavirus-outbreak\">See all our coronavirus coverage</a></li></ul><p>Boris Johnson is facing increasing pressure from cabinet ministers and scientists to impose blanket border control measures against Covid instead of his preferred option of a targeted approach as experts warned that this may not protect the UK from importing further mutations.</p><p>Ministers are to meet on Tuesday to weigh up the merits of a border policy that could require all new arrivals, including British citizens, to quarantine at their own expense in government-supervised hotels.</p> <a href=\"https://www.theguardian.com/world/2021/jan/24/boris-johnson-urged-blanket-covid-border-controls-uk\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2021/jan/24/boris-johnson-urged-blanket-covid-border-controls-uk", "date_published": "2021-01-24 17:54:25+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Swathes of England's vital flood defences ‘almost useless’", "description": "<p>Data from Environment Agency shows thousands of people and businesses ‘at risk from ruined assets’</p><p>Thousands of England’s vital flood defences were in such a state of ruin last year they would fail to protect communities from extreme weather, an investigation has found.</p><p>More than 3,400 of England’s “high consequence” flood assets, defined as those where there is a high risk to life and property if they fail, were judged by the Environment Agency to be in such a bad condition they were almost useless.</p> <a href=\"https://www.theguardian.com/environment/2021/jan/24/england-vital-flood-defences-almost-useless\">Continue reading...</a>", "link": "https://www.theguardian.com/environment/2021/jan/24/england-vital-flood-defences-almost-useless", "date_published": "2021-01-24 17:41:08+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "'The release of six decades of fear': Egypt's lost revolution", "description": "<p>25 January 2011 marked the start of Hosni Mubarak’s fall but also moves by the military to take over</p><p>In the centre of the place where it all began, Mansour Mohammed manned a tarpaulin-covered stall on the only green grass among miles of concrete and asphalt. For 10 days he ate and slept huddled with strangers bound together by burgeoning rage and revolt all around. Enormous crowds heaved and surged – roaring their demands for change in a call that resounded through Tahrir Square in Cairo. “I’ll never forget that sound,” he said. “It was the most powerful noise I’ve ever heard. It was louder than 10 jumbo jets. It was the release of six decades of fear.”</p><p>A decade on, the launchpad of Egypt’s revolution – a seminal part of the uprisings which became known as the Arab spring – is a very different place, as is the country. The strip of grass has been concreted over and on it stands a newly erected obelisk, pointing skywards in a trenchant reminder of times of staid certainty. Traffic moves sedately around a roundabout now free of protesters or attempts at defiance. Secret police are positioned, not so secretly, nearby. There is little talk of revolution, and attempts to stir the ghosts of Tahrir Square are met with the heavy hand of the invigorated military state that entrenched itself in the revolution’s wake.</p> <a href=\"https://www.theguardian.com/world/2021/jan/24/egypt-lost-revolution-hosni-mubarak-military-takeover\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2021/jan/24/egypt-lost-revolution-hosni-mubarak-military-takeover", "date_published": "2021-01-24 15:22:51+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Burns Night goes virtual: 'It might be even bigger this year'", "description": "<p>Thousands join events in Scotland and far afield, and post-a-haggis service is in high demand</p><p>It’s the night when Scots emerge from mid-winter hibernation, says the Burns scholar Pauline Mackay. On the poet’s birthday, 25 January, or thereabouts, thousands of societies, clubs and groups of friends across Scotland and around the world gather to celebrate the life and work of the national bard Robert Burns. </p><p>The ritual elements of a Burns supper – addressing those gathered with his poem To a Haggis, completing several rounds of toasts and reading from the funny, sexy, radical diversity of his work – have remained constant since the first event was held by nine friends in 1801, five years after his death.</p> <a href=\"https://www.theguardian.com/uk-news/2021/jan/24/burns-night-goes-virtual-it-might-be-even-bigger-this-year\">Continue reading...</a>", "link": "https://www.theguardian.com/uk-news/2021/jan/24/burns-night-goes-virtual-it-might-be-even-bigger-this-year", "date_published": "2021-01-24 15:00:01+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "All work and low pay: are we too devoted to our jobs?", "description": "<p>Employment today is atomised, casual and unequal, argues US author Sarah Jaffe in her book Work Won’t Love You Back. Here she discusses why the way we look at work needs to change<br /></p><p>If the past year has made us ask one question, it must surely be: how is it that our society so often chooses to place the least value on the work it needs the most?</p><p>One effect of the pandemic has been to strip away some of the mythologies of the labour market to reveal its bare essentials, what we have come to know as our “key workers”: that extraordinary frontline army in the NHS, the indispensable “caring professions”, the teachers who have tried to manage their children at home and our children on Zoom, the refuse collectors and transport workers and shop assistants and delivery drivers who have risked their health to keep it all going. How can it be that these jobs, that none of us can do without and not all of us would be able or prepared to do, are routinely among the lowliest in terms of reward? Should it really only be the market that decides what work is worth? How can we continue to justify a world in which Dido Harding’s <a href=\"https://www.theguardian.com/politics/2020/oct/16/uk-government-spending-on-covid-consultancy-contracts-rises-to-pounds-175m-investigation\">management consultants</a> pocket in a couple of days what an ICU nurse might earn in a month or where Jeff Bezos makes many, many times more in a second than one of his warehouse workers takes home in a year?</p> <a href=\"https://www.theguardian.com/books/2021/jan/24/all-work-and-low-pay-are-we-too-devoted-to-our-jobs-sarah-jaffe-work-wont-love-you-back\">Continue reading...</a>", "link": "https://www.theguardian.com/books/2021/jan/24/all-work-and-low-pay-are-we-too-devoted-to-our-jobs-sarah-jaffe-work-wont-love-you-back", "date_published": "2021-01-24 13:00:46+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Who’s a good boy? The unbreakable bond between humans and dogs", "description": "<p>Our centuries old love of dogs has never been stronger. So what does a study of ‘man’s best friend’ say about us?</p><p>Why is he here? Why is my dog lying at my feet in the shape of a croissant as I write this? How have I come to cherish his warm but lightly offensive pungency? How has his fish breath become a topic of humour when friends call round for dinner? Why do I shell out more than £1,000 each year to pay for his insurance? And why do I love him so much?</p><p>Ludo is not a special dog. He’s just another labrador retriever, one of approximately 500,000 in the UK (he’d be one in a million in the United States, the most popular breed in both countries). Ludo has a lot in common with all these dogs. He loves to play ball; obviously he’s an expert retriever. He could eat all the food in the universe and leave nothing for the other dogs. He is prone to hip dysplasia. He looks particularly attractive on a plush bed in a centrally heated house very far from the Newfoundland home of his ancestors.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2021/jan/24/who-is-a-good-boy-the-unbreakable-bond-between-humans-and-dogs\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2021/jan/24/who-is-a-good-boy-the-unbreakable-bond-between-humans-and-dogs", "date_published": "2021-01-24 13:00:46+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Sturgeon: SNP will hold Scottish independence vote if it wins in May", "description": "<p>First minister says she will hold advisory referendum, whether Westminster consents or not</p><p>Nicola Sturgeon has said she will hold an advisory referendum on independence if her Scottish National party wins a majority in May’s Holyrood elections, regardless of whether Westminster consents to the move.</p><p>Her party is setting out an 11-point roadmap for taking forward another vote, which was to be presented to members of the SNP’s national assembly on Sunday.</p> <a href=\"https://www.theguardian.com/politics/2021/jan/24/scotland-independence-referendum-nicola-sturgeon-snp-wins-may-\">Continue reading...</a>", "link": "https://www.theguardian.com/politics/2021/jan/24/scotland-independence-referendum-nicola-sturgeon-snp-wins-may-", "date_published": "2021-01-24 12:14:12+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "As birth rates fall, animals prowl in our abandoned 'ghost villages'", "description": "<p>Human populations are set to decline in countries from Asia to Europe – and an unusual form of rewilding is taking place</p><p>For many years it seemed that overpopulation was the looming crisis of our age. Back in 1968, the Stanford biologists Paul and Anne Ehrlich infamously predicted that <a href=\"https://www.theguardian.com/cities/2018/mar/22/collapse-civilisation-near-certain-decades-population-bomb-paul-ehrlich\" title=\"\">millions would soon starve to death</a> in their bestselling, doom-saying book <em>The Population Bomb</em>; since then, neo-Malthusian rumblings of imminent disaster have been a continual refrain in certain sections of the environmental movement – fears that were recently given voice on David Attenborough’s documentary <em><a href=\"https://www.theguardian.com/film/2020/sep/25/david-attenborough-a-life-on-our-planet-review-climate-emergency-documentary\" title=\"\">Life on our Planet</a></em>.</p><p>At the time the Ehrlichs were publishing their dark prophecies, the world was at its peak of population growth, which at that point was increasing at a rate of 2.1% a year. Since then, the global population has ballooned from 3.5 billion to 7.67 billion.</p> <a href=\"https://www.theguardian.com/world/2021/jan/24/as-birth-rates-fall-animals-prowl-in-our-abandoned-ghost-villages\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2021/jan/24/as-birth-rates-fall-animals-prowl-in-our-abandoned-ghost-villages", "date_published": "2021-01-24 11:15:44+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "‘They decided the jury wouldn’t believe me’: CPS accused of secret change to rape policy", "description": "<p>In a landmark hearing this week, rape victims aim to discover if their complaints failed due to a covert move to drop ‘weak cases’</p><p>Over the course of four days in 2017, Kat Araniello was raped three times, once at knifepoint, by a man she had briefly dated.</p><p>“Ben* was attentive, charming and attractive,” said Araniello, a 44-year-old HR professional. “He showed me his Metropolitan police warrant card when we first met. Because he was a police officer I immediately felt safe with him.”</p> <a href=\"https://www.theguardian.com/society/2021/jan/24/they-decided-the-jury-wouldnt-believe-me-cps-accused-of-secret-change-to-policy\">Continue reading...</a>", "link": "https://www.theguardian.com/society/2021/jan/24/they-decided-the-jury-wouldnt-believe-me-cps-accused-of-secret-change-to-policy", "date_published": "2021-01-24 10:30:43+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "The big picture: Roy Mehta's love letter to the London borough of Brent", "description": "<p>The photographer captures the community spirit of one of Europe’s most multicultural urban areas<br /></p><p>Roy Mehta took this photograph of a barbershop in Harlesden, north-west London, in 1991. He was an art student at the time, and the picture was one of thousands of images he took in the borough of Brent, where he grew up. Brent was the most multicultural district of any city in Europe, but Mehta understood it more as a single community. His father had a one-man GP practice in Harlesden for many years and as a kid Mehta would sit after school in the waiting room, already intrigued by the faces.</p><p>In the 30 years of his photography career since then, he’d hardly looked at those formative pictures – he had boxes of negatives that he had never printed. When Brent was nominated as borough of culture for 2020, however, Mehta was invited to put together images from that archive for an exhibition and book. He had originally taken the pictures in houses, churches, shops and on the street, wandering with his portrait camera, knocking on doors, or sometimes trailing around with a Catholic priest as he did his house calls. In that pre-internet era, once it had been established he wasn’t from the Inland Revenue, people were happy, as here, for him to stand in a corner and snap away.</p> <a href=\"https://www.theguardian.com/artanddesign/2021/jan/24/the-big-picture-roy-mehtas-love-letter-to-the-london-borough-of-brent\">Continue reading...</a>", "link": "https://www.theguardian.com/artanddesign/2021/jan/24/the-big-picture-roy-mehtas-love-letter-to-the-london-borough-of-brent", "date_published": "2021-01-24 07:00:40+00:00", "persistent": false, "user": null, "language": "en-UK"}]