[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Idaho crisis, Ivermectin clarification", "description": "Idaho, crisis standards of care\n\nPopulation, 1.8 million\n\nhttps://www.washingtonpost.com/nation/2021/09/16/covid-delta-variant-live-updates/\n\nHospitals allowed to ration care\n\nExpands its “crisis standards of care” criteria\n\nIdaho Department of Health, Dave Jeppesen\n\nThe situation is dire \n\nWe don’t have enough resources to adequately treat the patients in our hospitals, whether you are there for COVID-19 or a heart attack or because of a car accident\n\nAllows prioritization\n\nPotentially deny care, based on who they think will benefit most\n\nIn other words, someone who is otherwise healthy and would recover more rapidly may get treated or have access to a ventilator before someone who is not likely to recover\n\nFDA discission on US booster doses\n\nImmunocompromised, 2 million already boosted", "link": "https://www.youtube.com/watch?v=r_Et4PUyS94", "date_published": "2021-09-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "UK comparisons, Uganda update", "description": "Monitoring Incidence of COVID-19 Cases, Hospitalizations, and Deaths, by Vaccination Status — 13 U.S. Jurisdictions, April 4–July 17, 2021\n\nhttps://www.cdc.gov/mmwr/volumes/70/wr/mm7037e1.htm?s_cid=mm7037e1_w\n\nTo email Wefwafwa, wefandrew@gmail.com\n\nCheck out his channel, https://www.youtube.com/channel/UCzsLklGgOttU3Se-WGLp7ow\n\nTo donate to his work,\n\nUSE SENDWAVE/ WorldRemit /Western Union\nMobile money number:+256785698803\nCountry: Uganda\nRegistered name : Wefwafwa Andrew\nState: Eastern uganda\nZip code:0000\nWallet Service provider:MTN\nCity: Mbale city\nemail me when you send on wefandrew@gmail.com\n\n\n\nUK over two seasons\n\nhttps://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1017676/2021-09-14_COVID-19_Press_Conference_Slides__for_publication_.pdf\n\n\nZoe update from 16th September\n\nhttps://covid.joinzoe.com/post/with-the-highest-cases-in-europe-uk-should-trigger-plan-b-now\n\nBased on PCR and LFT test data from up to 11th September, (n = 32,409)\n\nAverage of 47,276 new symptomatic cases per day for UK\n\nPrevious 7 days was 51,876 (down 9%)\n\nIn the New daily cases in the fully vaccinated\n\n15,493 new daily symptomatic cases\n\n(previous 7 days t was 17,674)\n\nAcross the different age groups\n\nDaily new cases in18-35s down sharply\n\nDaily new cases in 0 - 18s up (as schools return)\n\nAcross the regions\n\nMany of the English regions, falling or stable \n\nScotland cases have stopped rising, although hospitalisations still increasing\n\nPrevalence\n\n1 in 95 in UK currently have symptomatic COVID\n\nUK R = 0.9\n\nWales, 1.0 (only rising region)\n\nScotland, 1.0\n\nSymptoms for longer than 12 weeks\n\n781 people a day will go on to experience this longer covid\n\nReduced commensurate with reduced symptomatic cases\n\nTim Spector\n\nAfter calling for a plan for several weeks I’m pleased to see the government has launched a booster vaccine programme. \n\n(To give boosters to everyone over 50)\n\nthe winter plan fails to introduce the current symptoms to the list\n\nnow most people experience symptoms like sore throat, headache and sneezing rather than fever or cough\n\nI also don't understand why we are waiting for the situation to get worse and the NHS is pressured further before implementing simple measures that would help to bring down the number of new cases and save lives. \n\nWith such high levels of virus in the population we should also still be wearing masks and keeping our distance in crowded public places, as in major European cities where cases are much lower than ours.", "link": "https://www.youtube.com/watch?v=vULYDSJAzPs", "date_published": "2021-09-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Ivermectin in Australia", "description": "New restrictions on prescribing ivermectin for COVID-19\nhttps://www.tga.gov.au/media-release/new-restrictions-prescribing-ivermectin-covid-19\n(10 September 2021)\n\nTGA, acting on the advice of the Advisory Committee for Medicines Scheduling\n\nplaced new restrictions on the prescribing of oral ivermectin. \n\nGeneral practitioners are now only able to prescribe ivermectin for TGA-approved conditions - scabies and certain parasitic infections\n\nCertain specialists will be permitted to prescribe ivermectin for other unapproved indications if they believe it is appropriate for a particular patient\n\nIvermectin is not approved for use in COVID-19 in Australia\n\ncurrently strongly discouraged by the National COVID Clinical Evidence Taskforce, the World Health Organisation and the US Food and Drug Administration\n\nhttps://www.covid19treatmentguidelines.nih.gov/therapies/antiviral-therapy/ivermectin/\n\nRecommendation\n\nThere is insufficient evidence for the COVID-19 Treatment Guidelines Panel (the Panel) to recommend either for or against the use of ivermectin for the treatment of COVID-19. \n\nFirstly\n\nthere are a number of significant public health risks associated with taking ivermectin in an attempt to prevent COVID-19 infection rather than getting vaccinated\n\nIndividuals who believe that they are protected from infection by taking ivermectin may choose not to get tested or to seek medical care if they experience symptoms. \n\nDoing so has the potential to spread the risk of COVID-19 infection throughout the community.\n\nSecondly\n\nthe doses of ivermectin that are being advocated for use in unreliable social media posts and other sources for COVID-19 are significantly higher than those approved and found safe for scabies or parasite treatment. \n\nThese higher doses can be associated with serious adverse effects, including severe nausea, vomiting, dizziness, neurological effects such as dizziness, seizures and coma.\n\nhttps://bnf.nice.org.uk/drug/ivermectin.html\n\nhttps://shop.amh.net.au/products/digital\n\nhttps://www.tga.gov.au/sites/default/files/auspar-ivermectin-131030-pi.pdf\n\nBMJ\n\nhttps://bestpractice.bmj.com/topics/en-gb/3000110\n\nUntreated paracetamol poisoning may cause varying degrees of liver injury over the 2 to 4 days following ingestion, including fulminant hepatic failure.\n\nFinally\n\nthere has been a 3-4-fold increased dispensing of ivermectin prescriptions in recent months, leading to national and local shortages for those who need the medicine for scabies and parasite infections\n\nIt is believed that this is due to recent prescribing and dispensing for unapproved uses, such as COVID-19. \n \nSuch shortages can disproportionately impact vulnerable people, including those in Aboriginal and Torres Strait Islander communities.\n\nThere is only one TGA approved oral ivermectin product, Stromectol ivermectin 3mg tablet blister pack\n\nIndicated for the treatment of river blindness (onchocerciasis), threadworm of the intestines (intestinal strongyloidiasis) and scabies.\n\nAll medical practitioners can continue to prescribe oral ivermectin for the approved indications. \n\nHowever, prescribing of oral ivermectin for indications that are not approved is now limited to certain specialists.\n\n\n \n\n\nOnchocerciasis\n\nhttps://www.who.int/news-room/fact-sheets/detail/onchocerciasis\n\nMore than 99% of infected people live in 31 African countries. The disease also exists in some foci in Latin America and Yemen.", "link": "https://www.youtube.com/watch?v=_gndsUjgPYo", "date_published": "2021-09-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]