[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New Nintendo Switch Controller In Development | GameSpot News", "description": "Join Persia for your daily GameSpot News as she talks about Nintendo’s new Switch controller in development, Overwatch 2 details, and gameplay being revealed on September 25, Valheim’s Hearth & Home update is live, and the Battlefield 2042 open beta that might not arrive this month.\n\nIn this video, Persia goes over an FCC filing from Nintendo that may point to a new Switch controller in development. The only information that can currently be found in the filing is that the controller will be wireless, connecting to the Switch via Bluetooth. Everything else is confidential at Nintendo’s request.\n\nAnnounced on Twitter, more details and gameplay are on the way for Overwatch 2 and will be showcased during the Overwatch League Grand Finals pre-show and halftime show on September 25. It will begin at 5 PM PT/8 PM ET on the official Overwatch Twitch channel.\n\nPersia also talks about Valheim’s much-anticipated Hearth and Home update that includes an overhaul of the food system, new building elements, and a \"steamy Viking hot tub.\" The update is available now. \n\nLastly, she covers how Battlefield 2042 being delayed to November 19 impacts a number of other particulars about the game, including its early access release date and the open beta.\n\nFor more information on all of these topics, visit gamespot.com.\n\nTIMESTAMPS:\nIntro - 00:00 \nNintendo - 00:24\nOverwatch 2 - 01:10 \nValheim  - 01:54\nBattlefield 2042 - 03:08\nOutro - 04:15\n\nYou can read more about all of today’s topics on gamespot.com\n\n#nintendoswitch #switchcontroler", "link": "https://www.youtube.com/watch?v=1yiym7vG1Qk", "date_published": "2021-09-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New SpongeBob SquarePants Game Announced! | GameSpot News", "description": "SpongeBob SquarePants: The Cosmic Shake has been announced, we’ve got more details as to why God of War: Ragnarok will be the final entry in the Norse saga, Sega is announcing a new RPG at Tokyo Game Show, and Mega Man's robo-dog Rush is coming to Monster Hunter Rise. Join Persia for your daily GameSpot News update. \n\nIn this video, Persia talks about the announcement of SpongeBob SquarePants: The Cosmic Shake from the THQ Nordic 10th Anniversary stream. The game will have unlockable platforming skills and costumes and will take you to 7 distinct Wishworlds like Wild West Jellyfish Fields and Halloween Rock Bottom.\n\nPersia also goes over God of War: Ragnarok and why it will be the second and final entry in Sony Santa Monica's Norse saga according to a recent interview with Cory Barlog. \n\nSega has also announced that a brand new RPG will be revealed during its showcase at Tokyo Game Show on October 1st at 6AM PT/ 9AM ET.\n\nLastly, Persia goes over the newest crossover in Monster Hunter Rise that will be Rush from the Mega Man series to the game in the form of a Palamute skin. \n\nFor more information on all of our topics, visit gamespot.com. \n\nTIMESTAMPS:\nIntro - 00:00\nSpongebob - 00:22\nGod of War - 01:38\nSEGA - 03:02\nMonster Hunter Rise - 04:00\nOutro - 04:57\n\n#SpongeBob #SquarePants #SpongeBobSquarePants", "link": "https://www.youtube.com/watch?v=Mqd1QVRS-oI", "date_published": "2021-09-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "THQ Nordic 10th Anniversary Digital Showcase", "description": "THQ Nordic is celebrating their 10th anniversary with their THQ Nordic digital showcase event on September 17th at 9 PM CEST / 12 PM PST / 8 PM BST / 10 PM MSK.\n\n#thqnordic", "link": "https://www.youtube.com/watch?v=KxEA4VkLD3E", "date_published": "2021-09-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Glitches That Made Halo", "description": "The Halo franchise defined a generation for console gamers. Halo 2 had one of the biggest influences on the shooter space even though it was riddled with glitches. But rather than being rejected or patched, Halo glitches were embraced and became a required skill in the PVP scene and competition. Join Persia as she goes over some of the best glitches that made Halo 2 truly unique with former Halo pro, Eli the Ninja.\n\nIn this video, Persia talks about iconic glitches in Halo 2 that added to the skill-ceiling of competitive multiplayer with former Halo pro, Eli the Ninja. From BXR to BXB and more, these unintentional glitches lead to combos that are used far and wide by many Halo 2 players and pros to this day.\n\nWith Halo having many different titles within the franchise, Halo 2 stands out due to these glitches and you can still perform them in the Master Chief: Collection’s Halo 2: Classic playlist.\n\nHalo: Infinite is right around the corner after its release date of December 8th, 2021 was confirmed by Microsoft at Gamescom Opening Night Live and is now available for pre-order. You can check out our pre-order guide on gamespot.com.\n\n#halo #haloglitch", "link": "https://www.youtube.com/watch?v=kcYp3ZzrLPw", "date_published": "2021-09-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Vanguard - Crossplay Early Access Beta", "description": "Call of Duty: Vanguard enters its first crossplay beta with Xbox and PC early access players joining the fight. Tune in as Richie returns to check out what's new and what's improved since the previous build of the game. Call of Duty Vanguard releases on November 5th.\n\n#cod #codvanguard #callofduty", "link": "https://www.youtube.com/watch?v=EOmcfPnk8w8", "date_published": "2021-09-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Destiny 2 Players Need To Play Trials of Osiris Now", "description": "We officially live in a reality where Destiny's Trials of Osiris is no longer half baked. The pinnacle end game PvP activity is rewarding as ever and is the most popular weekend activity in Destiny 2. Here's why every Destiny 2 and FPS gamer needs to check it out. \n\nTrials of Osiris relaunched during Destiny 2’s Season of the Lost with lots of new changes, and the revamp is a major triumph for developer Bungie. The mode used to be a bit of a waste of time for all but the best Destiny players, but that’s no longer the case -- although there have been some rough passages for solo players. \n\nTrials of Osiris requires players to duke it out in a high stakes Elimination PvP mode where teamplay and callouts are just as important as individual skill level, and the stakes grow with each successive match. Players hope to go “Flawless” where they win 7 matches in a row without losing any, in hopes of reaching the Lighthouse, an exclusive social space that is open only to Flawless players  and that provides exclusive \"adept\" rewards. \n\nNot too long ago, going flawless in Trials felt like an insurmountable task but we’re at an unprecedented time now where skill-based matchmaking, crossplay, a new rewards track, and an incredible amount of interest in the game mode has led to easily one of the best Trials weekends in Destiny history. In this video we break down all the major changes and why everyone, not just PvP addicts or Destiny superfans, should hop in and see just what Trials is all about now.\n\n#destiny2", "link": "https://www.youtube.com/watch?v=dcwHqnhzY3A", "date_published": "2021-09-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Lost Judgment Video Review", "description": "Detective Yagami returns for another scintillating mystery that suffers from the same problems as before.\n\n#lostjudgment", "link": "https://www.youtube.com/watch?v=0MbU4S52GyY", "date_published": "2021-09-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]