[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Most omicron hospitalisations incidental", "description": "Around 80% of English hospital admissions with coronavirus are admitted for other reasons\n\nUK, 24th December\n\nOmicron hospital patients, 366\n\nTotal omicron deaths, 29\n\nUK, 27th December\n\nOmicron hospital patients, 407\n\nTotal omicron deaths, 39\n\nOmicron cases + 45,307 \n= 159,932\n\nUK, 29th December\n\nOmicron hospital patients, \n+ 261 + 98 = 766\n\nTotal omicron deaths, \n+ 10 + 4 = 53\n\nUK data\nhttps://www.gov.uk/government/publications/covid-19-omicron-daily-overview\n\nhttps://covid.joinzoe.com/data#levels-over-time\n\nhttps://coronavirus.data.gov.uk\n\nSA data\n\nSA hospital data\n\nhttps://www.nicd.ac.za/diseases-a-z-index/disease-index-covid-19/surveillance-reports/daily-hospital-surveillance-datcov-report/\n\nhttps://www.worldometers.info/coronavirus/country/south-africa/\n\nUS cases and deaths data\n\nhttps://covid.cdc.gov/covid-data-tracker/#trends_dailycases\n\nIsolation down to 5 days is asymptomatic\n\n20% of covid admissions caused by viral complications\n\nhttps://www.telegraph.co.uk/news/2021/12/28/covid-hospital-data-should-treated-caution-many-patients-admitted/\n\nDecember 21, England\n\nCovid patients in hospital \n= 6,245\n\nUp 259 from previous week\n\nOf the 259, just 45 admitted because of the virus\n\nOf the 259, admitted, 214 for other conditions but having also tested positive\n\n“incidental Covid” admissions\n \n\nPrevious week, December 7 to December 14\n\nMajority of hospitalisations were still delta\n\nPrimary covid cases were 59% of the 289 weekly rise\n\n\nPeople currently in hospital with Covid\n\n“incidental” cases, 1,813 out of 6,245\n\nHighest so far\n\n\nSir John Bell, regius professor of medicine, Oxford University\n\nThis is not the same disease we were seeing a year ago\n\nThe horrific scenes that we saw a year ago – \n\nintensive care units being full, \n\nlots of people dying prematurely – \n\nthat is now history in my view and I think…that’s likely to continue\n\nChris Hopson, the chief executive of NHS Providers\n\nWhat our guys are saying is that incidental cases are making around 25 to 30 per cent of cases that are arriving, \nbut that will vary from place to place\n\nIn London you would expect to see higher levels\n\nlower in somewhere like the South West, where community infections are lower\n\nThey are seeing an increase in the number of hospital admissions\n\nbut it's not precipitous. \n\nIt's not going up in an exponential way \n\nAs the number of cases in the community rises, there are significant levels of incidental cases\n\nBut we mustn't forget that having those people in hospital causes complications because of infection control measures\n\nunder significant amounts of pressure and are struggling with high numbers of staff absences\n\n \n\nMore cases of incidental Covid compared to previous waves\n\nDr Raghib Ali, consultant in acute medicine at Oxford University Hospitals, \n\nThere is certainly a smaller proportion of people ending up with Covid pneumonia in intensive care \nProbably half the cases I’ve seen are incidentals\n \nYou’ve got completely incidental cases, \n\nsomeone coming in with a broken leg, who also tests positive for Covid, \n\nthen a third category of older people who have comorbidities. \n\nMaybe they’ve had a fall or chest pain and also test positive and it's unclear if the virus is having some sort of impact.\n\nAnd when the prevalence of a virus with relatively mild symptoms is high in the community then you will see higher incidentals\n\nSimilar to Gauteng, with 52% incidentals\n\n\n\nReport from Intensive Care National Audit and Research Centre (May 1 to Dec 24)\n\n \n\nhttps://www.dailymail.co.uk/news/article-10348763/Most-pregnant-women-ventilators-Covid-havent-jab.html\n\nhttps://www.icnarc.org/our-audit/audits/cmp/reports", "link": "https://www.youtube.com/watch?v=OM2VgBm9pTI", "date_published": "2021-12-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Omicron, so far so good", "description": "As cases and infections surge, hospital admissions do not\n\nUK, 24th December\n\nOmicron hospital patients, 366\n\nTotal omicron deaths, 29\n\nUK, 27th December\n\nOmicron hospital patients, 407\n\nTotal omicron deaths, 39\n\nOmicron cases + 45,307 \n= 159,932\n\nUK data\n\nhttps://www.gov.uk/government/publications/covid-19-omicron-daily-overview\n\nhttps://covid.joinzoe.com/data#levels-over-time\n\nhttps://coronavirus.data.gov.uk\nIn hospital patients, UK\nIn hospital patients, London\n \nA testing site, Upper West Side of Manhattan\n\nSunday 4pm local  time\n\nThey are getting a 50% hit rate\n\nHit rate has doubled each of the past three days\n\nMichael\n \nVery mild symptom sets, not even as bad as a normal cold for me, \n\nand it seemed to be the same for everyone on line.\n \nI tested positive and I was surprised, given how mild the symptoms are. \n\nSlightly blocked feeling, feeling of being  a little ill for one day, slight  headache, no cough or runny nose.  \n \nThis  surprised me  because I havebeen   practicing  \nextreme isolation. \n\nI live alone (by choice), and only visited the supermarket during off  hours, twice in the past 7-10 days. \n \nAmazing that I got this.\n \nI started with 4000 IU of D per day about three or four weeks ago. \n\nAnd 15 mcg daily of zinc. \n\nWho knows this may explain the mild symptom set. \n\nUS cases and deaths data\n\nhttps://covid.cdc.gov/covid-data-tracker/#trends_dailycases\n\nIsolation down to 5 days is asymptomatic\n\nhttps://www.cdc.gov/media/releases/2021/s1227-isolation-quarantine-guidance.html\n\nFollowed by 5 days mask wearing\n\nOne to two days before day one, then 2 to 3 days after this\n\nDr. Rochelle Walensky\n\nThe Omicron variant is spreading quickly and has the potential to impact all facets of our society. \n\nCDC’s updated recommendations for isolation and quarantine balance what we know about the spread of the virus and the protection provided by vaccination and booster doses. \n\nThese updates ensure people can safely continue their daily lives. \n\nPrevention is our best option: get vaccinated, get boosted, wear a mask in public indoor settings in areas of substantial and high community transmission, and take a test before you gather.\n\nUS hospitalizations\n\nhttps://covid.cdc.gov/covid-data-tracker/#hospitalizations\n\nUS, Health and Human Services\n\nhttps://protect-public.hhs.gov/pages/hospital-utilization\n\nSA data\n\nSA hospital data\n\nhttps://www.nicd.ac.za/diseases-a-z-index/disease-index-covid-19/surveillance-reports/daily-hospital-surveillance-datcov-report/\n\nhttps://www.worldometers.info/coronavirus/country/south-africa/\n\nAustralia\n\nhttps://www.health.gov.au/health-alerts/covid-19/case-numbers-and-statistics\n\nhttps://www.youtube.com/watch?v=6ZeJVfcobhc\n\nREVISION TO CONTACT TRACING, QUARANTINE AND ISOLATION PROTOCOLS: 23.12.2021\n\nhttps://sacoronavirus.co.za/2021/12/24/circular-revision-to-contact-tracing-quarantine-and-isolation-protocols-23-12-2021/\n\nProportion of people with some immunity from infection and/or vaccination is high,\n\nPast infection in 60-80% in several sero-surveys\n\nContainment strategies are no longer appropriate – mitigation is the only viable strategy\n\nNew knowledge about the virus\n\nHigh proportion of asymptomatic disease\n\nHigh degree of asymptomatic and pre-symptomatic spread\n\nAerosol spread\n\nOnly a small proportion of cases are diagnosed\n\nTesting\n\nTesting skewed towards symptomatic (minority)\n\nNot all symptomatic people test\n\nNot all negative tests are true negatives\n\nQuarantine has been costly\n \nThus, the following is applicable with immediate effect:\n \nAll contact tracing be stopped with immediate effect,\n\nexcept in congregate settings and cluster outbreak situations or self-contained\n\nAll contacts must continue with their normal duties with heightened monitoring\n\n(daily temperature testing, symptom screening) of any early signs. \n\nIf they develop symptoms then they should be tested and be managed according to the severity of the symptoms\n\nAll contacts must not be tested unless if they develop symptoms\n \nQuarantining for contacts of confirmed cases of Covid -19\n\nAll quarantine is to be stopped with immediate effect\n\nThis applies to both vaccinated and unvaccinated contacts\n\nNo testing for Covid -19 is required irrespective of the risk exposure unless the contact becomes symptomatic\n \nIsolation\n\nAsymptomatic Individuals\n\nNo isolation period required\n\nSelf-observation for 5-7 days,\n\nMild disease\n\nFever, cough, sore throat, malaise, headache, muscle pain, nausea, vomiting, diarrhoea, loss of taste and smell.\n\nIsolation period is maintained at 8\n\nThere is no need for Covid-19 test (either PCR or antigen test) be performed prior to returning to work\n\nSevere disease\n\nExacerbated symptoms, shortness of breath, dyspnoea, chest pain, abnormal chest imaging, require hospitalisation", "link": "https://www.youtube.com/watch?v=2HN6cIfp5T4", "date_published": "2021-12-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]