[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 Review", "description": "Although some specialists can feel a bit useless at times, tweaks to the formula with Battlefield 2042 add a lot of interesting gameplay variety.", "link": "https://www.youtube.com/watch?v=bNuhnHEDPYo", "date_published": "2021-11-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Infinite Multiplayer Review in Progress", "description": "Though it has an unfulfilling progression grind, Halo Infinite hosts a welcome assortment of multiplayer modes that offer a rewardingly fun experience.", "link": "https://www.youtube.com/watch?v=VZ4wysoKdtk", "date_published": "2021-11-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Brilliant Diamond & Shining Pearl Review", "description": "Pokemon Brilliant Diamond and Shining Pearl are comfortably nostalgic, with just enough modern tweaks to smooth over the rough edges.\n\nNintendo and ILCA's Pokémon Brilliant Diamond & Shining Pearl are now available on Nintendo Switch. You can read the full written Pokémon Brilliant Diamond & Shining Pearl review by Steve Watts on GameSpot: https://www.gamespot.com/reviews/pokemon-brilliant-diamond-shining-pearl-review/1900-6417790/\n\nIf you’re looking for more Brilliant Diamond and Shining Pearl videos, we’ve got you covered here on GameSpot:\n\nDS vs. Switch Graphics Comparison: https://youtu.be/ZQwOMVwRJws \nFirst 24 Minutes Of Shining Pearl Gameplay: https://youtu.be/8jAXbh-05kI\n14 Things I Wish I Knew Before Starting Pokémon Brilliant Diamond & Shining Pearl: https://youtu.be/5v2AJzD_Ok4", "link": "https://www.youtube.com/watch?v=Om2yXWX0A04", "date_published": "2021-11-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Infinite Co-Op Campaign - Why You Have To Wait | GameSpot News", "description": "In today's GameSpot News, DeVante goes over Halo Infinite co-op delays, December's free Games With Gold, and more. \n\nHalo development boss Joseph Staten has commented on the delay of Halo Infinite's campaign co-op feature, saying Halo and co-op are synonymous, so it was \"very, very hard\" to choose to delay the feature, but it was essential so the team could prioritize other areas and get the game out the door this holiday.\n\nLater in the video, DeVante talks about which free games Xbox players can look forward to playing next month. Starting December 1, Xbox gold members can grab The Escapists 2 and Orcs Must Die, with the latter only being available until December 15. Starting on the 16th, members can grab Tropico 5: Penultimate Edition as well as Insanely Twisted Shadow Planet.\n\nLastly, in other Xbox-related news, the Series X Mini Fridge is reportedly louder than most would like. Our very own Gabe Gurwin recently set up his fridge and found that it is “easily as loud or louder than the actual Xbox Series X or PS5 when they have discs spinning.”\n\nFor more information on all of our topics, please visit gamespot.com.\n\nTimestamps:\nIntro - 00:00\nHalo Infinite - 00:06\nGames With Gold - 01:30\nXbox Mini Fridge - 02:06\nOutro - 02:52", "link": "https://www.youtube.com/watch?v=hOL7gnTn-r0", "date_published": "2021-11-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Highs And Lows Of One Year All Digital", "description": "Marching into this new generation, Kurt made a conscious choice to go all-digital with the Xbox Series S and the Playstation 5. And the result has been, well, rather unexpected.\n\nGoing all-digital can be a troubling prospect for some gamers. No selling/trading in games? No borrowing or lending them? What if your favorite series just disappears off the digital marketplace? They're all valid points. But still, Kurt Indovina marched bravely, or maybe naively, into an all-digital future with the Xbox Series S and PlayStation 5 Digital Edition. \n\nJoin Kurt on the highs and lows of his digital future, including his unexpected appreciation for past games. \n\nThe digital future can feel like a brittle one. Games like Jump Force will cease to exist on digital storefronts come February 2022; Metal Gear Solid 2 & 3 have pulled due to licensing issues over archival footage; and Rockstar Games delisted GTA 3, Vice City, and San Andreas weeks before the release of Grand Theft Auto: The Trilogy -- The Definitive Edition. On the flipside, however, there's a lot for what digital features offer, like Xbox's Quick Resume, and the digital service Game Pass.\n\n#PS5 #XBOX", "link": "https://www.youtube.com/watch?v=6_1l_FHym7I", "date_published": "2021-11-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]