[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Rising Storm 2: Vietnam’s Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of Rising Storm 2: Vietnam, including the M79 grenade launcher, the M9A1 flamethrower, and the M60 light machine gun.\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of Rising Storm 2: Vietnam and compares them to their real-life counterparts.\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can purchase Jonathan's book here - https://www.headstamppublishing.com/bullpup-rifle-book", "link": "https://www.youtube.com/watch?v=o0m9NLPEncc", "date_published": "2021-05-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Animal Crossing Island Games with Persia", "description": "(Presented by truth) Persia leads four intrepid Animal Crossing enthusiasts through a myriad of teamwork based challenges designed to teach us the value of having a support system to get you through the hard times in life in this Truth inspired, escape room-styled livestream!", "link": "https://www.youtube.com/watch?v=cwlpDW1DzrI", "date_published": "2021-05-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Final Fantasy VII Remake Intergrade - Final Trailer", "description": "Check out the all new Final Fantasy VII Remake Intergrade final trailer coming to PS5! \n\nFINAL FANTASY VII REMAKE is coming to PlayStation 5 on June 10th 2021 as FINAL FANTASY VII REMAKE INTERGRADE; a visually enhanced edition of the critically acclaimed and award winning game, featuring FF7R EPISODE INTERmission - a brand new episode which follows Yuffie Kisaragi as the main character, and numerous gameplay additions for players to enjoy.\n\n#FFVII #PS5 #FinalFantasyVII", "link": "https://www.youtube.com/watch?v=H1zdXNCTZOU", "date_published": "2021-05-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Hardcore Difficulty Is Resident Evil Village’s Sweet Spot", "description": "If you’re a seasoned Resident Evil player, then you should consider playing on Hardcore difficulty for your first Resident Evil Village playthrough.\n\nAs someone who plays way too much Resident Evil and knows all the series’ tricks, one of the few issues I had with RE Village was that I thought it was a bit too easy on Standard mode, and it's easy to feel a little too comfortable while playing. Hardcore demands you learn and master the game, weigh the cost benefit of crafting, scavenge everything, and make every bullet count. If a bit of an uphill struggle is the kind of experience your looking for out of a Resident Evil game, you can’t go wrong with Hardcore.", "link": "https://www.youtube.com/watch?v=gLQ96GL8eiE", "date_published": "2021-05-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Surviving Resident Evil Village: Tips and Tricks", "description": "Resident Evil Village isn’t your average horror game. Managing your resources, knowing how to fight, and how to make money are all important to your survival. If you’re new to the genre, this is the survival guide for you.\n\nIn this video, veteran survival horror player and Resident Evil aficionado, Kurt Indovina, shares some vital tips and tricks in order to ensure your survival in Resident Evil Village. If you’ve spent some time in the shoes of Leon Kennedy, blasting your way through the Los Plagas-controlled villagers of Resident Evil 4, then you should have no problem adapting to Village’s combat, inventory management, treasure hunting, and merchant. But if you’re new to the franchise, it can be a lot to take in. \n\nKurt breaks it down into three categories: combat, exploration, and the Duke.  Kurt gives tips on fighting the game's werewolf-like enemies, Lycans, how to look for treasure, the importance of hunting animals, killing crows for pocket change, and best practices when selling your loot as well as upgrading your weapons. While it’s easy to be distracted by Lady Dimitrescu’s empowering demeanor, don’t be fooled, there’s plenty more the game offers in terms of frights and thrills to pay attention too.\n\nWhile Village takes a lot of cues from its previous installment Resident Evil 7, the many environments of the game can be far more daunting than the Baker house Ethan Winters slithered through all those years back. In Resident Evil Village, Ethan must rescue his daughter Rose from the grasp of Mother Miranda, and it's up to you as the player to be prepared for the dangers that await.  \n\nOur review: https://youtu.be/Kmkm-LQbcDo\nResident Evil's Complete Timeline Explained: https://youtu.be/QkPgowr-T9g\n\nTimestamps:\nIntro 0:00\nCombat\nTip 1 - Go for the knees 0:32\nTip 2 - Time your counters 1:31\nTip 3 - It's okay to run 1:54\nExploration 2:50\nTip 1 - Always check your map before leaving a room 3:09\nTip 2 - Backtrack 3:55\nTip 3 - Go hunting 4:44\nThe Duke\nTip 1 - Check that treasure before you sell it 5:24\nTip 2 - Sell your guns 5:57\nOutro 6:29", "link": "https://www.youtube.com/watch?v=9bL1ehw394E", "date_published": "2021-05-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]