[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC1gVCrX5uEFc0s_8TIYGqmw", "title": "Streets of New York in 1911 - [60FPS - Color - 4K] - Old footage restoration with AI", "description": "This documentary travelogue of New York City was made by a team of cameramen with the Swedish company Svenska Biografteatern, who were sent around the world to make pictures of well-known places. (They also filmed at Niagara Falls and in Paris, Monte Carlo, and Venice, although New York 1911 is the only selection in the Museum’s collection.) Opening and closing with shots of the Statue of Liberty, the film also includes New York Harbor; Battery Park and the John Ericsson statue; the elevated railways at Bowery and Worth Streets; Broadway sights like Grace Church and Mark Cross; the Flatiron Building on Fifth Avenue; and Madison Avenue. Produced only three years before the outbreak of World War I, the everyday life of the city recorded here—street traffic, people going about their business—has a casual, almost pastoral quality that differs from the modernist perspective of later city-symphony films like Paul Strand and Charles Sheeler’s Manhatta (1921). Take note of the surprising and remarkably timeless expression of boredom exhibited by a young girl filmed as she was chauffeured along Broadway in the front seat of a convertible limousine.\n\nOriginal video was processed with Deep Learning algorithms to achieve modern look and quality. Here is the process:\n\n1. Footage stabilization and noise/dust/scratches removal with After Effects and Neat Video ✔️\n🔗 https://www.neatvideo.com/?linkID=p7845\n2. Restoration with DeepRemaster, removing scratches and film damage ✔️\n🔗 https://github.com/satoshiiizuka/siggraphasia2019_remastering\n3. Frame interpolation to get smooth look using DAIN method. Result is 60 FPS video ✔️\n🔗 https://github.com/baowenbo/DAIN\n4. Colorization using DeOldify with NoGAN. Colors are not accurate, only for ambient mood ✔️\n🔗 https://github.com/jantic/DeOldify\n5. Upscaling using Topaz Video Enhance AI, upscale preserving detail and reducing noise ✔️\n🔗 https://topazlabs.com/video-enhance-ai/ref/755/\n⭐⭐⭐ 15% DISCOUNT CODE: oldendays15\n6. Automation with Python scripts and AWS Thinkbox Deadline as queue manager ✔️\n🔗 https://www.awsthinkbox.com/deadline\n7. RTX 2070 Super 8GB, 32GB RAM, Ryzen 9 3900X 12-core. Approx 48hrs/10min video processing.\n\nSocial Media:\nhttps://www.facebook.com/oldendayschannel\nhttps://www.twitter.com/OldenDaysYT\nhttps://www.instagram.com/oldendayschannel\nhttps://www.pinterest.ca/OldenDaysYT/old-footage-restoration\nhttps://www.patreon.com/oldendays\n\n#deoldify #colorize #upscale #topazlabs #veai #dain #60fps #4k", "link": "https://www.youtube.com/watch?v=Ka1dw8HA0Sc", "date_published": "2021-05-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]