[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Jagged Little Pill: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nJosh Rogosin | Oct. 21, 2021\nJagged Little Pill, the Broadway musical based on Alanis Morissette’s 1995 album of the same name, reopens Thursday night after a 19-month hiatus due to COVID. The cast assembled at the D’Angelico Guitars showroom in Manhattan to record this Tiny Desk (home) concert, finally able to celebrate their long-awaited return to the stage. \n\nLauren Patten kicks off the set with “Hand In My Pocket.” She won a Tony for her portrayal of Jo and spent two years developing the role. Diablo Cody, known for writing the movie Juno, also won a Tony for best book. She was able to adapt the iconic songs for the zeitgeist, covering topics ranging from substance abuse, sexual identity, adoption, sexual assault and more. The show received the most Tony nominations of the season with a total of 15.\n\nAs cast member Heidi Blickenstaff (Mary Jane) explains, the show is “about an American family in crisis, and I think a lot of people can relate to that.” She sings “Uninvited,” which has been reimagined to express her character’s struggle with opiate addiction. \n\nThe song “Predator” wasn’t on the original album, but was co-written by Morissette and composer Michael Farrell just for this production. Its haunting melody depicting the emotional scars associated with sexual assault is emotionally engaging, both on stage and in this Tiny Desk performance.\n\nIt comes as no surprise that the show ends with the unapologetically optimistic “You Learn.” It’s hard not to be optimistic watching these talented Broadway performers, seeing how gleeful they are doing what they love -- especially after waiting nearly two years for the ultimate privilege of performing in front of a live audience again.\n\nIf you need substance abuse treatment and referral information, call the National Helpline: 1-800-662-HELP (4357). You can reach the National Sexual Assault Hotline 24/7: 1-800-656-4673\n\nMUSIC BY\n* Alanis Morisette\n* Glen Ballard\n* Michael Farrell\n\nSET LIST\n* \"Hand In My Pocket\"\n* \"Uninvited\"\n* \"Predator\"\n* \"You Learn\"\n\nCAST\n* Heidi Blickenstaff (Mary Jane Healy)\n* Morgan Dudley (Frankie Healy)\n* Kathryn Gallagher (Bella)\n* Derek Klena (Nick Healy)\n* Sean Allan Krill (Steve Healy)\n* Lauren Patten (Jo)\n* Wren Rivera (Ensemble)\n* DeAnne Stewart (Ensemble)\n\nBAND\n* Bryan Perri: Keyboard, Harmonica\n* Damien Bassman: Drums\n* Eric Davis: Guitar\n* Tom Kitt: Music Supervisor\n\nCREDITS\n* Video: Jeremy Michaels\n* Audio: Mike Tracey\n* Camera Operators: Savva Svet, David Holmes, Nakeia Taylor\n* Special Thanks: D'Angelico Guitars, Vivacity Media Group\n\nTINY DESK TEAM\n* Producer: Josh Rogosin\n* Video Producer: Kara Frame\n* Audio Mastering: Josh Rogosin\n* Tiny Production Team: Bob Boilen, Bobby Carter, Maia Stern, Sofie Hernandez-Simeonidis\n* Executive Producer: Keith Jenkins\n* Senior VP, Programming: Anya Grundmann\n\n#tinydesk #jaggedlittlepill #alanismorissette", "link": "https://www.youtube.com/watch?v=1OVXpy4Rws4", "date_published": "2021-10-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]