[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCmKurapML4BF9Bjtj4RbvXw", "title": "The Piano Guys - CHILL (Full Album)", "description": "Stream CHILL, BUY the Album, Get Sheet Music! https://smarturl.it/chilllalbumlanding\nWE’RE ON TOUR: https://smarturl.it/the10tour | Subscribe: https://bit.ly/2XH4GCF\nOur NEWEST videos: https://youtube.com/playlist?list=PL7j5iXGSdMwdfnzc8Faa-HJITq9hPEEdI&playnext=1&index=2\n\nTrack Listing:\n1. My Girl - 0:00\n2. Wake Me Up Before You Go-Go - 03:56\n3. Someone Like You - 07:52\n4. Stressed Out - 11:52\n5. Sweet Child O' Mine - 14:54\n6. I Will Always Love You - 19:14\n7. Jupiter - 22:22\n8. Abraham Lincoln Tribute - 25:35\n9. Before You Go - 30:09\n10. You Are The Reason - 34:03\n11. Unchained Melody - 37:58\n12. Grow As We Go - 40:59\n13. Anyone - 45:18\n\nLearn about our beliefs here: https://smarturl.it/TPG_Beliefs \n\nFear. Doubt, worry, stress. Uncertainty. They took their best shot at owning us all this\npast year. And we did our best to put mind over matter and power our way through it. The human mind is a marvelous thing. It has limitless capacity for thought, creativity, wonder, and resilience. It is like a musical instrument -- expressive, emotional, expansive, and transformatively challenging to master. And yet, it can only truly hold tightly to one thing at a time -- like a cello can draw out a thousand different feelings from focusing on one note at a time. That’s why fear can’t coexist with faith, doubt crowds out hope, worry pushes away peace, and uncertainty won’t share any space with contentment.\n\nWe believe music is one of the most powerful forces in the universe. We’ve always insisted on how underestimated it can be. Music can persuade the mind to change moods, trade mental despair for motivation, or even push our physical frames beyond a presupposed capacity.\n\nBefore this album project began we were sitting around a table together ruminating over all that has happened this past year. As we talked about what was “next” for TPG, we went through several scenarios. Then, suddenly, there was this tidal wave of insistent ideas. A rush of collective revelation. We knew what kind... Read More here: https://smarturl.it/chilllalbumlanding\n\nFollow The Piano Guys:\nInstagram: https://instagram.com/thepianoguys\nFacebook: https://facebook.com/ThePianoGuys\nTwitter: https://twitter.com/thepianoguys\n\nWatch More of The Piano Guys: \nCovers: https://youtube.com/playlist?list=PL7j5iXGSdMwc7n8Tsjl-I8zEOEZsjWydx&playnext=1&index=2 \nOfficial Music Videos: https://youtube.com/playlist?list=PL7j5iXGSdMwfDukj_bIIB_1JhbYtaWRYg&playnext=1&index=2 \nNewest Videos: https://youtube.com/playlist?list=PL7j5iXGSdMwdfnzc8Faa-HJITq9hPEEdI&playnext=1&index=2\nMost Popular: https://youtube.com/playlist?list=PL7j5iXGSdMweXm56WEjskhCT5oAeEZJQF&playnext=1 \n\nListen to The Piano Guys: \nSpotify: https://open.spotify.com/artist/0jW6R8CVyVohuUJVcuweDI?si=8GgyFRhiTz6POs8b0ir2IA&dl_branch=1 \nApple Music: https://music.apple.com/us/artist/the-piano-guys/498030399 \nAmazon Music: https://amazon.com/The-Piano-Guys/e/B00BXLTTI4 \n\nAbout The Piano Guys:\nPaul, a Yamaha dealer who dabbled in videography, Jon, a professional pianist, Al, a music producer and studio engineer, and Steve, a cellist with a creative superpower called ADHD, all serendipitously joined forces to create the most successful YouTube instrumental music group in history. The Piano Guys’ mission is to inspire and spread hope through incomparably imaginative piano music videos filmed all over the world. On this channel you can regularly find piano covers of music from genres like top 40, pop, classic rock, R&B, hiphop, country, and more. Make sure to subscribe and enable all post notifications. For instant updates, check out The Piano Guys via their social media accounts linked above.\n\n#NewMusic #FullAlbum #ThePianoGuys", "link": "https://www.youtube.com/watch?v=8wrDC_3EQIE", "date_published": "2021-10-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]