[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "GTA: The Trilogy – The Definitive Edition ... It's A Bit Complicated | GameSpot News", "description": "In this episode of GameSpot News, the first trailer for Grand Theft Auto: The Trilogy - The Definitive Edition, the delay of Advance Wars 1+2: Re-Boot, ConcernedApe’s next game Haunted Chocolatier, and the announcement of a new State of Play. \n\nIn this video, DeVante talks about the first trailer for Grand Theft Auto: The Trilogy - The Definitive Edition. Digital versions of the three game package will be released on November 11. on PS4, PS5, Xbox One, Xbox Series X|S, Nintendo Switch, and PC through the Rockstar Games Launcher.\n\nDeVante also talks about the delay of Advance Wars 1+2: Re-Boot and Eric “ConcernedApe\" Barone’s next game, titled Haunted Chocolatier. \n\nLater in the video, Sony announces an October 27 State of Play and Xbox Series X consoles get dark mode and a native 4K dashboard.\n\nTIME STAMPS\n00:00 - Intro\n00:11 - GTA Trilogy Trailer\n01:59 - Advance Wars Delay\n02:28 - Haunted Chocolatier Trailer\n03:03 - October 27 State of Play Announced\n03:43 - Xbox October Update\n04:05 - Outro", "link": "https://www.youtube.com/watch?v=BHEqhTP2aGM", "date_published": "2021-10-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Grand Theft Auto: The Trilogy – The Definitive Edition Trailer", "description": "Check out the all new Grand Theft Auto: The Trilogy definitive edition trailer. The trailer shows off the updated graphics for the remastered games in the fan favorite series. Grand Theft Auto: The Trilogy The Definitive Edition is slated to launch on November 11th.", "link": "https://www.youtube.com/watch?v=mtyOXKB0M5o", "date_published": "2021-10-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Guardians of the Galaxy’s Combat Explained", "description": "Learn the tips and tricks you need to work as a team in Guardians of the Galaxy's Combat System.\n\nMarvel’s Guardians of the Galaxy puts you in the hover boots of Star-Lord and asks you to lead a team of the Galaxy’s deadliest heroes, Drax, Rocket, Gamora, and Groot. You might not get to control the rest of the guardian’s directly, but don’t be fooled, you have to work as a team in order to make the most of the game’s combat.\n\nThere’s a lot of different attack properties and status effects at play and I found it took me a while to really get the hang of it. I’m here to lay it all down for you, so that you’ll have more of a leg up than I did when you start the game.\n\n#GuardiansoftheGalaxy", "link": "https://www.youtube.com/watch?v=Poege-0-fLc", "date_published": "2021-10-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Marvel's Guardians of the Galaxy Things You Need To Know", "description": "Marvel's Guardians of the Galaxy comes out October 26th, so here are some things to know to get you caught up with Star-Lord and his crew before the game releases.\n\nThe era of Marvel video games is looking bright, as multiple developers and publishers have several games in development. The next game is Marvel's Guardians of the Galaxy, a new title from developer Eidos Montreal and publisher Square Enix. With the team behind this decade's Deus Ex games and Shadow of the Tomb Raider at the helm, expectations are naturally high for this cosmic caper starring the galaxy's most recognizable A-holes, so here’s everything you need to know about the game. \n\nYou won't have to wait too long to start assembling your favorite gang of escaped Kree experiments and deadly assassins. The game arrives on October 26 for Xbox Series X, Xbox One, PS5, PS4, and PC.", "link": "https://www.youtube.com/watch?v=cubwtR1XOpE", "date_published": "2021-10-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Dark Pictures Anthology: House of Ashes Review", "description": "House of Ashes offers cinematic horror and surprising character moments amidst the conflict of the Iraq War.\n\nThe Dark Pictures Anthology, House of Ashes released on October 21, 2021 on PlayStation 4, PlayStation 5, Xbox One, Xbox Series X and Series S, and Microsoft Windows.", "link": "https://www.youtube.com/watch?v=tYin1pMpGTI", "date_published": "2021-10-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The First 30 Minutes of Marvel's Guardians of the Galaxy (4K)", "description": "See the opening of Guardians of the Galaxy running on the Xbox Series X in 4K.\n\nYou won't have to wait too long to start assembling your favorite gang of escaped Kree experiments and deadly assassins. The game arrives on October 26 for Xbox Series X, Xbox One, PS5, PS4, and PC.\n\n#GuardiansoftheGalaxy", "link": "https://www.youtube.com/watch?v=W5Ynvmd5uns", "date_published": "2021-10-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "21 Things Every Battlefield Player Should Know", "description": "Over the years veteran Battlefield players have developed a lot of knowledge, tricks, and some unspoken rules. It’s time to pass those skills on to a new generation of Battlefield 2042 players. Here are things every Battlefield player knows that can make you better at the game.\n\nBattlefield 2042 releases in November and may attract a lot of new players, including those coming over from Modern Warfare 2019, who aren’t familiar with the series. Battlefield is a franchise that doesn’t hold your hand as much as Call Of Duty and will let you get yourself into bad situations easily so it’s important to know what you’re doing. The sandbox nature of the game opens up a lot of clever tips and tricks and unexpected things you can do with class gadgets, weapons, vehicles, and destruction. It’s even more complex now that the new specialist system, with things like turrets and grappling hooks, has upended the older class system that itself evolved and changed from 1942, Battlefield 2, 2142, Bad Company 2, Battlefield 3 or 4, and World War settings. \n\nIn this video we’re rounding up some of the tips, tricks, and knowledge that Battlefield veterans have gathered over the last two decades in order to catch you up ahead of 2042’s launch. You’ll learn about clever ways to use vehicles, how players use C4 to grief their opponents, why certain gear is misunderstood, how to increase your chances of bailing from a bad situation successfully, odd ways players might try to communicate with you, how to not fall for mind games people play, and why you should try sticking everything to everything. \n\nThese skills will probably come in handy across the three modes coming out at launch which include All-Out-Warfare, Hazard Zone, and Portal. We have only begun to dig into specialists and gadgets with many more releasing over the course of four Battle Passes. Make sure to tell us about your experiences with the Battlefield 2042 Open beta and head on over to GameSpot.com for ongoing coverage.", "link": "https://www.youtube.com/watch?v=l6wbQ8n5c4U", "date_published": "2021-10-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Apex Legends: Escape Official Trailer", "description": "Apex Legends: Escape is the brand new season in Apex Legends featuring a brand new tropical paradise. This launch trailer shows off the new character, Ash expecting to join as well as a new gun. Apex Legends: Escape opens up a tropical paradise full of various creatures with a gameplay trailer releasing on 10/25/21 showing off more of what to expect in the new season.\n\n#ApexLegends #Ash #ApexLegendsEscape", "link": "https://www.youtube.com/watch?v=4aqbKuAurdk", "date_published": "2021-10-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 Gameplay Trailer | First Look At New Specialists", "description": "Check out the Battlefield 2042 gameplay trailer showing of the first look at the new specialists coming to the game. Battlefield 2042 is available on November 19, 2021 with early access starting November 12, 2021.\n\nGet your first look at the 5 remaining Specialists of 10 coming at launch: Navi Rao, Santiago “Dozer” Espinoza, Emma “Sundance” Rosier, Ji-Soo Paik and Constantin “Angel” Anghel.\nInspired by Battlefield’s traditional Classes, Specialists have a unique Speciality and Trait that defines their playstyle, with the rest of the loadout being fully customizable.\nSelect your role on the battlefield and build your squad through the new Specialist system. Choosing and equipping your Specialist allows you to build synergies within your squad and empower your team to take on any battle situation!", "link": "https://www.youtube.com/watch?v=MEM2q4OV2uc", "date_published": "2021-10-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Tiny Tina's Wonderlands Stabbomancer and Brr Zerker Class Trailer", "description": "In Tiny Tina's Wonderlands you can play as the Stabbomancer, the Brr Zerker and more. Get ready to use your weapons and magical powers to earn all that sweet, sweet loot. Learn more about both of these characters in this latest reveal trailer for the game. Get a glimpse of the Stabbomancers skills including the Ghost Blade, From the Shadows, and more. The Brr Zerker can use skills like Feral Surge, Dreadwind and more!\n\n#TinyTinasWonderland", "link": "https://www.youtube.com/watch?v=YaKnHCR6cwI", "date_published": "2021-10-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "UNCHARTED Official Trailer (2022) Featuring Tom Holland, Mark Wahlberg, Sophia Ali", "description": "Check out the official trailer for the Uncharted movie featuring Tom Holland, Mark Wahlberg, and Sophia Ali. Uncharted the movie is based off the hit game series native to Playstation Consoles, Uncharted which starred protagonist Nathan Drake, a professional treasure hunter.\n\nUncharted, directed by Ruben Fleischer, arrives in theaters on February 18, 2022.\n\n#Uncharted #UnchartedMovie #TomHolland", "link": "https://www.youtube.com/watch?v=h31qRuvEsVo", "date_published": "2021-10-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Uncharted Movie Gets A Trailer & Sully Still Doesn't Have His Mustache | GameSpot News", "description": "In this episode of GameSpot News, we talk about the Uncharted movie trailer, a Halo infinite PC overview trailer, a Battlefield specialist trailer and the trailer for the upcoming season of Apex Legends.\n\nIn this video, DeVante talks about the first trailer for the upcoming Uncharted Movie that stars Tom Holland, Antonio Banderas and Mark Wahlberg. The film will release in theaters in February 2022. \n\nDeVante also talks about the Halo Infinite PC overview trailer that touches on a huge range of other elements of the PC edition, including ultra-wide support, frame rate settings, and a variety of other PC options like triple key bindings and many different control configurations.\n\nLater in the video, DICE reveals the final five Specialist characters that will be featured in Battlefield 2042 and Respawn announces a new Apex Legends map in the new trailer for the game's upcoming season, Escape.\n\nTIME STAMPS\n00:00 - Intro\n00:27 - Uncharted Movie Trailer\n01:06 - Halo Infinite PC Overview Trailer\n02:14 - Battlefield 2042 Specialist Trailer\n03:16 - Apex Legends Season 11 Trailer\n04:07 - Outro", "link": "https://www.youtube.com/watch?v=oWiVSTavIuI", "date_published": "2021-10-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]