[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "How I customize my KDE Plasma Desktop", "description": "Wanna get your own Linux server? Visit https://www.linode.com/linuxexperiment for a 100$ credit ! \n\n\n\nGet your Linux desktop or laptop here: https://slimbook.es/en/\n\n\n\nToday, by popular demand, we're going to look at how I customized my Plasma desktop: panels, docks, themes, window controls, icons, widgets, login screen... It's probably nothing too crazy compared to other user's setups, but it's mine, and I'm proud of it.\n\n\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nJoin us on our new Discord server: https://discord.gg/xK7ukavWmQ\nTwitter : http://twitter.com/thelinuxEXP\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\nFollow me on ODYSEE: https://odysee.com/@TheLinuxExperiment:e\nOr join ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\n\n🔗 USEFUL LINKS FOR THIS VIDEO\nInstall instructions for Kvantum: https://github.com/tsujan/Kvantum/blob/master/Kvantum/INSTALL.md\nLayan theme: https://www.pling.com/p/1325246/\nInstall Latte Dock: https://github.com/KDE/latte-dock/blob/master/INSTALLATION.md\nLatte layout: https://nextcloud.thelinuxexp.com/index.php/s/FXYGNiP9QJZiWpW\n\n\n00:00 Intro\n01:40 Theme\n04:20 Widgets\n04:46 Layout\n08:54 Final Details\n\n\nI moved to a theme called layan, it's a Kvantum theme. Layan has a GTK variant.\n\n\nTo install it, click the \"Configure GNOME / GTK application styles\" in the Application Style panel, then \"Get new GNOME- GTK Application styles\". Search for Layan, and click \"install\".\n\nFor the icons, I use the \"Inverse-blue-dark\" icons, which you can get from the \"Get new icons\" button.\n\nThe plasma theme is also the \"Layan\" theme, you can get it from the \"Get new plasma styles\" button.\n\nThe window decorations I use are called Layan. You can get them from the \"'Get New Window decorations\".\n\nThe widgets I use are called \"Window title applet\", \"Latte separator\", \"Better Inline clock\", and \"latte spacer\". \n\nI have a top bar with a global menu, and a dock to run and manage running apps. I don't use the regular Plasma panels to get that result, though, I use latte dock.\n\nLatte can import layouts: Then, right click on the dock, and select \"Edit dock\", then right click on it again, and select \"Layouts - edit layouts\". Here, you have an \"Import\" button, select \"Import from local file\" and go select my layout.\n\n\n\nIf you'd prefer to see each tweak I made, here we go:\n\n- The main dock, I haven't changed much. I removed every applet there that wasn't latte tasks, and every separator.\n\nIn the Appearance settings, I set an absolute size of 48, disabled zoom on hover. I added a 10% margin, with 15% thickness, and added 8px between the dock and the screen edge.\nThe background is 50% opaque, with a 34% radius and 29px shadow. I also enabled blur and shadows.\n\nNow, for the top panel.\n\n- Right click on the dock, and select \"edit dock\", then right click again and select \"Ad dock / panel\", then \"Empty panel\"\n\nIn that panel, I added the following widgets:\n- Application launcher: I configured the applet by changing its icon, I used the draw-circle icon that's available from the \"All\" icons drop down menu.\n\n- Window Title widget. I configured it to only display the application name, and not to show the icon. The name is written in bold.\n\n- Latte separator, and the global menu\n\n- I then added a latte spacer, followed by the better inline clock widget. I configured it to have a font size of 16px, and show the date and separator, using a 24h clock.\n\n- Finally, there's another latte spacer and finally, the system tray widget from the base Plasma desktop.\n\nHaving both latte spacers use the setting \"fill available space\" makes the clock centered.\n\nIn terms of how the panel is laid out, I set it to appear on the top edge, and checked the \"Hide floating gap for maximized windows\" box.\n\nIn the Appearance tab, I set it to be 28px, with a max length of 98% so it doesn't extent to the full length of the display. I added an 8px gap from the screen edge, and no margins at all on the panel.\n\nIt's 50% opaque, with blur and shadows enabled, and has a 34% radius, with 29px shadows. I didn't change the Effects tab, but here it is just in case.", "link": "https://www.youtube.com/watch?v=A0LiFu1eaMs", "date_published": "2021-10-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]