[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Biggest Battlefield 6 Rumors", "description": "Battlefield 6 has a release date sometime around Holiday 2021. The game was confirmed in an investor call that used vaguely worded statements like the game having a never-before-seen scale, ambitious ideas, and a next-gen vision. Rumors have since started spilling out about what in-game mechanics those statements might translate to. \n\nIn this video, we're looking at what those rumors--such as fully destructible cities, 128-player matches, free-to-play elements, a battle pass, cosmetics, and cross-play--could mean for the game. Specifically, we're going to explore why some of these ideas might be good or bad and compare them to what past Battlefield games have tried.  \n\nThe next Battlefield game is set to release on next-gen PS5, Xbox Series X/S, and PC around late 2021. We expect to get the first real details at a reveal event slated for this spring.", "link": "https://www.youtube.com/watch?v=h6XJasvC_Ro", "date_published": "2021-02-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Bowser’s Fury: 9 Things I Wish I Knew Before Playing", "description": "Bowser’s Fury combines the gameplay of Super Mario 3D World and Super Mario Odyssey into a brand new open-world Mario title, and while it may seem daunting at first we have some useful tips to get you started on your adventure in Lake Lapcat.\n\nLake Lapcat is full of different islands to explore and each have their own Cat Shines to collect in an attempt to defeat Fury Bowser. But what if you search the entire island and can’t find another shine? What if the Fury Bowser fights are giving you trouble? Are your amiibo useful? This video covers all that and more with some tips and tricks to help get you started.\n\nIn GameSpot's Super Mario 3D World + Bowser’s Fury review, Steve Watts writes, “Put together, Super Mario 3D World + Bowser's Fury is a spectacular package. Super Mario 3D World is an absolute joy of classic platforming excellence, and this is the best version of it thanks to some well-calibrated improvements. Bowser's Fury is peculiar and less polished, but it dares to poke fun at its own oddities and it has a wild creative streak. The two share thematic similarities, but more importantly, they work hand-in-hand to show the full extent of versatility in what a Mario game can be.”\n\nBowser’s Fury is included with the Nintendo Switch re-release of Super Mario 3D World which is now available. If you’re interested in more coverage on Super Mario 3D World + Bowser’s Fury then check out our Wii U vs. Switch comparison and our review, both of which are listed below.\n\nWii U vs. Switch comparison: https://youtu.be/V2H511E96Eg\n\nReview: https://youtu.be/OHTEMPbhxE0\n\n00:00 - Intro\n00:28 - Tip 1: Looking for more shines? Leave an area and come back!\n01:25 - Tip 2: Don't forget to get the power-ups on the towers!\n02:07 - Tip 3: Not ready to fight Fury Bowser? No problem!\n02:40 - Tip 4: Having trouble fighting Fury Bowser? Look for the bells!\n03:21 - Tip 5: The Bowser amiibo is actually helpful?\n04:15 - Tip 6: Don't forget about Bowser Jr.\n05:09 - Tip 7: Don't worry about dying.\n05:31 - Tip 8: Also don't worry about getting all the shines before the end.\n06:01 - Tip 9: But maybe don't save the hardest ones for last\n06:45 - Outro", "link": "https://www.youtube.com/watch?v=xGupfvFAbdg", "date_published": "2021-02-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty’s Most Broken Akimbo Weapons", "description": "Let’s take a look back at some of the most overpowered and infamous Akimbo guns that Call of Duty has ever offered.\n\nFor well over a decade, the Call of Duty games have featured the Akimbo system, letting you dual-wield weapons in order to absolutely litter your enemies with bullets and look very cool while doing it. Most of the time, this has worked as the designers intended, but there have been several instances where a weapon’s Akimbo form made it way too powerful. \n\nWe rounded up some of the most broken Akimbo weapons in the history of Call of Duty--including that infamous lever-action shotgun. These weapons strike fear into the hearts of your enemies, especially if you run into them up close. \n\nBroken Akimbo weapons don’t seem to be going away, either, as we’ve seen them in nearly every entry in the series. This even includes a few weapons in the most recent game, Call of Duty: Black Ops Cold War.\n\nTimestamps:\n00:26 - G18\n01:06 - Fennec\n01:53 - .44 Magnum\n02:31 - Saug 9mm\n03:05 - XMG\n03:54 - Model 1887\n04:41 - M93R\n05:17 - Rangers\n06:03 - HVR\n06:44 - FMG9\n07:33 - UMP45", "link": "https://www.youtube.com/watch?v=dNfeRR6Vztk", "date_published": "2021-02-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Chivalry 2 - Beta Announce | Release Date | Dev Diary | Epic Games Store Spring Showcase", "description": "Check out this video on Chivalry 2 and its beta announcement coming to the Epic Games store featuring developer comments and reactions!", "link": "https://www.youtube.com/watch?v=GhzVwJEzot0", "date_published": "2021-02-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]