[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Young Thug: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nSidney Madden | July 27, 2021\nYoung Thug looks right at home in the lush, almost regal, gardens of The Houdini Estate in Los Angeles. The serenity of the chosen location might seem too delicate for the punk-rock raps Thug and his crew reverberate through the grounds, but as hip-hop's impactful oddball, oxymoronic magic has always been his strong suit.\n\nFor the last decade, the world of rap has lived, learned and been liberated while under the influence of Young Thug. His contorted cadence, visionary fashion sense and freaky, frantic wordplay have inspired an entire generation of artists to no end. And now, the Atlanta iconoclast is evolving yet again. Not only is he wading through the waters of punk with his forthcoming album, Punk — Thug is using his Tiny Desk debut to usher in his next era, one that's meant to represent \"authenticity, consciousness and overall purity.\" Premiering songs off his long-teased album (due out Oct. 15), the Grammy winner's rhymes slither along smoothly no matter how rough the music, taking fans on a journey of energy and emotion.\n\n\"I'm just seeking for God's soul 'cause I know something's missing,\" a peach-haired Thug admits on his opener, \"Die Slow,\" before divulging specific hardships that shape his music. It's a small sample of the tests in life that inspire lines like, \"You gotta go through this s*** with your heart / You can't snooze on it\" and prompt him to celebrate even the smallest wins with VVS diamonds and exotic vacations. By the time the sun sets and the crew is joined by famed drummer Travis Barker for a fresh rendition of the chart-topping \"Ski,\" the surge of triumphant excitement is almost too much for him to contain. But then again, why would he want to?\n\nSET LIST\n\"Die Slow\"\n\"Droppin Jewels\"\n\"Hate The Game\"\n\"Tick Tock\"\n\"Ski\"\n\nMUSICIANS\nYoung Thug: vocals\nTim Stewart: guitar\nJonny Goood: bass\nTosh Peterson: drums\nTravis Barker: drums\n\nCREDITS\nVideo: Hidden Road Studios\nAudio: Demetrius Moore and Angad \"Bainz\" Bains\nCreative Director: Meggan Mckenzie\nDirector: Tom Kirk\nCinematography: John Barrett\nManagement & A&R: Geoffrey Ogunlesi\nProduction Manager: Paul Lovell Butt\nCamera Operator: Erick Turcios\nTour Director: JP Firmin\nBand Fixer: Adam Blackstone\nGaffer: Marc Patterson\n1st AC: Melissa Martine\nKey Grip: Christian Guerrero\nProduction Assistant: Duane Avery\nAssistant Mix Engineer: Aresh Banaji\nAssistant Engineering: Bernard Chavez\n\nTINY DESK TEAM\nProducers: Sidney Madden, Bobby Carter\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Kara Frame, Gabrielle Pierre\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#youngthug #tinydesk #nprmusic", "link": "https://www.youtube.com/watch?v=SAROJPnd_s8", "date_published": "2021-07-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]