[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "Do we have too many Linux distros, and is it really an issue?", "description": "Wanna get your own Linux server? Visit https://www.linode.com/linuxexperiment for a 100$ credit ! \n\n\nGet your Linux desktop or laptop here: https://slimbook.es/en/\n\n\nToday, I'd like to tackle something that is very often cited as one of the major problems of the Linux ecosystem.\n\"Linux is too fragmented, there are too many distros, people don't know what to choose, time and efforts are wasted.\"\nLet's see if that opinion has any truth to it!\n\n\nBecome a channel member to get access to a weekly patroncast and vote on the next topics I'll cover:\nhttps://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nSupport the channel on Patreon: \nhttps://www.patreon.com/thelinuxexperiment\n\nFollow me on Twitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\nFollow me on ODYSEE: https://odysee.com/@TheLinuxExperiment:e\nOr join ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\nThe Linux Experiment merch: get your goodies there! https://teespring.com/en-GB/stores/the-linux-experiment\n\n00:00 Intro\n01:31 Is Linux Fragmented?\n02:28 \"One single distro\" won't happen\n03:15 Fallacy of Added Time\n05:40 It's confusing for users\n08:59 Is it an issue?\n\n## Too many distros\n\nIt's undeniable that the Linux world is fragmented into many, many distributions. There is a list called the LWN.net list, that lists 275 distributions. They do have Alma Linux and Rocky Linux in there, which are relatively recent, so the list must be at least somewhat reliable. \nDistrowatch lists 273 distros as well, so let's assume the number is in that ballpark.\n\nhttps://lwn.net/Distributions/\n\nThat's an enormous number. People are right to assume that newcomers wouldn't know where to look or where to start.\n\n## That won't happen\n\nExcept that won't happen. We can get that out of the way immediately: the very nature of Linux and the open source community means that anyone that is so inclined can fork anything and make their own stuff, including gathering a bunch of packages, and releasing a new distribution, based on something else.\n\n## The \"addition of time\" fallacy\n\nOne of the main arguments to defend the \"we have too many distros\" opinion is that it's wasting valuable developer time and resources, that could be put to better use if they were pulled into a single project.\n\nAnd this is untrue, in my opinion.\n\nFirst, there is the fact that a lot of people who create their own distros are unpaid volunteers, so you can't force them to do anything. They have to be willing to contribute to an existing project.\n\nSecond, there is the common idea that more people working on the same set of tasks, will always make things faster. This is untrue as well, as anyone who has ever worked in software development will be able to assess.\n\nThird, people who create distros don't necessarily have the skills to contribute to something else.\n\n## It's confusing\n\nAnother argument is \"newcomers don't know what to choose, and that prevents them from trying out Linux\".\n\nThis argument has a lot of truth to it. Too many choices can lead to choice paralysis, and no choice at all.\nA newcomer to Linux can definitely be lost when deciding to move to Linux. Once they have understood that the Linux desktop isn't a unified, single system, and that there are tons of choices, they'll generally go around the internet asking \"what is the best distribution\".\n\nThis question of course, isn't the right one. It should be \"What is the best Linux distro for MY NEEDS\".\n\nBecause this is one of the main reason why we have so many distros: a lot of them answer to completely different needs, in terms of stability, updates, user interface, default programs, what packages are available, what kernel they use... There is no one size fits all.\n\nAnd that's even more confusing, because in the proprietary world, this is the way it's done. You have a single OS, that tries to answer ALL the users' needs, which means that all users will get the same default experience, and will have to choose the tools they want to use to customize it afterwards.\n\n## So, do we have too many Linux distros?\n\nSo, do we have too many distributions?\n\nYes, definitely. It's Linux's biggest blessing, and biggest curse. It provides a ton of choice and tons of ways to make your personal computer be personal. But for newcomers, it adds a huge burden of seeking out information, wasting time looking for answers, trying stuff out, and failing along the way.\n\nDoes it prevent the major Linux distros to move along at a rapid pace? Of course not. The Arches, OpenSUSEs, the Manjaros, Ubuntus, Fedoras, Mints, elementary OSs of the world would surely love some more contributors to help. Would restricting Linux to just these distros mean that they would explode in popularity and that they'd progress even faster? Nope.", "link": "https://www.youtube.com/watch?v=UPy1JvCzdyI", "date_published": "2021-07-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]