[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "Incognito mode doesn't protect you: but THIS does!", "description": "Improve your online privacy with Startpage: https://www.startpage.com/?segment=startpage.referral&utm_source=the.linux.experiment\n\nYour browser’s “Private browsing” or “Incognito” mode is often seen as a magic bullet that allows you to stay safe and private. It’s time to debunk that myth, and explain what “private browsing” really does, and what it doesn’t.   \n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nJoin us on our new Discord server: https://discord.gg/xK7ukavWmQ\nTwitter : http://twitter.com/thelinuxEXP\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\nFollow me on ODYSEE: https://odysee.com/@TheLinuxExperiment:e\nOr join ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\n#privacy #startpage #sponsored\n\n00:00 Intro\n00:58 Why use Private browsing?\n01:47 What does it really do?\n02:37 How do you stay private?\n04:18 Anonymous View\n05:43 How is it better than a VPN?\n\nWhy use a “Private browsing mode\"\n\n“Private browsing” has been created to offer a more reassuring browsing experience, and has popped up on all browsers these days. Chrome, Firefox, Edge, all have access to it, even good old Internet Explorer.\n \nWith everything going on the internet, like the collection of data on anything you do, and the aggregation of this data into big, comprehensive user profiles, that are made accessible for advertisers to serve you targeted ads, it’s understandable that users would want to find a more private way of browsing.\n\nThe issue here is that “Incognito” mode does not prevent data collection at all. Let’s see what it really does.\n\nWhat does “Private browsing” or “incognito” mode do?\n\nIncognito mode, does not, in fact, make you “incognito” nor invisible on your device. Unfortunately, your identity or activity is still clearly visible by the websites you’re browsing. Your internet service providers, or the company at which you work if you’re browsing on a work device, can still know what websites you’ve accessed.\n\nWhat “Private browsing” and “incognito mode” does, is browsing without saving cookies and browsing history on your computer or phone. Your browsing session just won’t store anything on your device, unless you explicitly download a file.\n\n\nHow Startpage can help\n      \nThe first step is to use a safer search engine.\n\nStartpage has a multi step process to anonymize your search query. When you hit “Enter” after you’ve typed your query, it goes through 2 filters:\n   \nThe first one are the Premise servers. They’re owned by Startpage, and they remove IP addresses and other personal information. They also anonymize any additional fields that might help you be identified by a third party.\n\nOnce that’s done, the query is passed on to the cloud servers, which are responsible for obtaining the search results. They call on Google, for example, to get the results, and populate the webpage before displaying it to you.\n\nThis method ensures no personal data from your search could be used to identify you. As a result, your search queries are not tailored to what you like, or dislike online, they’re just the purest form of answer to what you’ve been searching for. No filter bubble here.\n\nThis is extremely safe, since all personal information is destroyed immediately after being stripped from your query by the premise servers. \n      \nAnonymous view\n“Anonymous View” demo Anonymous view is a Startpage only feature. You can notice it right next to all search results. What it does, is allow you to browse an entire website without it knowing where you come from, or who you are.\n\nThe website will only see Startpage’s IP address instead of yours, and information about your location is changed. Your language will always appear as English to the website, and your clock will show the time as UTC. Even your browser and operating system are hidden, so the company can’t track that, or adjust how the site looks, or even the prices of their products.\n\n“Anonymous View” also lets you avoid fingerprinting, which is a way for websites to establish a unique fingerprint from your time zone, location, Ip address, and browser and OS information.\n\n# How is that different than a VPN    \nYou might think “Anonymous View” is a form of one-time VPN, which it kinda is, but it has advantages over a system-wide VPN.\n\nA VPN can’t protect you from browser or device fingerprinting. These techniques use Javascript, and Javascript has access to some browser or device information, regardless of the fact that you use a VPN or not. Startpage’s “Anonymous View” passes false values to the various scripts, which stops them from being able to establish a fingerprint.\n\n\nThis video is sponsored by Startpage.", "link": "https://www.youtube.com/watch?v=AZIzf5ucJ0U", "date_published": "2021-09-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]