[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Mahani Teave: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nTom Huizenga | June 24, 2021\nOur Tiny Desk (home) concerts have visited many faraway places – from Lang Lang in China to Mdou Moctar in Niger – but none as far-flung as Easter Island. The 63-square-mile isle, called Rapa Nui by its residents, is located some 2,000 miles off the coast of Chile.\n\nAnd yes, classical music thrives there – thanks largely to Mahani Teave, the pianist who offers this engaging performance from the music school she co-founded. As a child, Teave saw the first piano brought to the island in 1992 and dreamed of becoming a world-class concert pianist. It was a dream she fulfilled, but just as she was poised to launch her international career, an even stronger dream tugged at her heart.\n\nIn 2014, she broke ground on the Toki School of Music, aiming to teach traditional and classical music to Easter Island's children. Constructed from over 2,500 used tires and 60,000 cans and bottles, the building, with its cisterns and solar power, is a testament to Teave's vision for sustainability.\n\nEven the straight-back yellow chair Teave uses as a piano bench in this performance seems repurposed from her kitchen. She begins with a sparkling Allemande by Handel, followed by a beguiling performance of a Chopin Nocturne. Teave closes with an ancestral song , featuring sisters Eva and Tama Tucki Dreyer. The story follows Rapa Nui's first king, whose reign coincided with a natural disaster. It's a metaphor, Teave says, for our planet, to \"leave this place a little bit better than how we found it.\" With her fine playing and her music school, Teave has done exactly that.\n\nSET LIST\nGeorge Frideric Handel: \"Suite No. 5 in E, II. Allemande\"\nFrédéric Chopin: \"Nocturne in B-flat minor, Op. 9, No. 1\"\nTraditional: \"I hē a Hotumatu'a e hura nei\"\nMUSICIANS\nMahani Teave: piano\nEva Tucki Dreyer: vocals\nTama Tucki Dreyer: vocals\n\nCREDITS\nVideo and Audio: Sergio Moya\n\nTINY DESK TEAM\nProducer: Tom Huizenga\nVideo Producer: Kara Frame\nAudio Mastering: Josh Rogosin, Andy Huether\nAssociate Producer: Bobby Carter\nTiny Production Team: Bob Boilen, Maia Stern, Gabrielle Pierre\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#mahaniteave #tinydesk #nprmusic", "link": "https://www.youtube.com/watch?v=R9gdI7TbLY0", "date_published": "2021-06-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Liz Phair: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nRobin Hilton | June 23, 2021\nLiz Phair's music was always meant to fill arenas. After a clever sleight-of-hand at the top of this Tiny Desk (home) performance, where it briefly seems we've returned to in-person sets behind Bob Boilen's desk, Phair and her backing band do their best to recreate the kind of set you'd see in a much larger space; everyone plugs-in, turns it up and rocks with an impressive light show.\n\nPhair highlights three tracks from Soberish, her first new album in more than a decade, and the most reflective and beautiful record she's made. She starts with \"Spanish Doors,\" a heartbreaking but hooky portrait of a marriage nearing its end. She follows with a song against loneliness called \"In There,\" followed by \"The Game,\" a meditation on the mind games that sabotage troubled relationships.\n\nNearly 30 years after her stunning debut, Exile In Guyville, Liz Phair's sound shines and shakes as much as it ever did – the ringing guitars, her deadpan delivery, the tight harmonies. But the themes have evolved from youthful defiance and indiscretions to wiser ruminations on the complications of growing older.\n\nBut Phair still finds joy and a playful sense of humor in her earliest work, closing her Tiny Desk with a generous version of \"Never Said,\" from Exile. \"Put your way-way-back hat on,\" she says as the band kicks in. When it's all over she asks for \"tiny clapping for the Tiny Desk... ...We enjoyed almost being there.\"\n\nSET LIST\n\"Spanish Doors\"\n\"In There\"\n\"The Game\"\n\"Never Said\"\n\nMUSICIANS\nLiz Phair: vocals, guitar\nBen Sturley: bass\nCody Perrin: guitar\nNeal Daniels: drums\nConnor Sullivan: guitar\n\nCREDITS\nVideo: Chris Huber\nAudio: Mark Woodcock\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Kara Frame, Gabrielle Pierre\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #lizphair", "link": "https://www.youtube.com/watch?v=NOG49BTdJLQ", "date_published": "2021-06-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]