[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCxt2r57cLastdmrReiQJkEg", "title": "How Countries Were INVENTED", "description": "Go to http://Surfshark.deals/tomnicholas and use code TOMNICHOLAS to get 83% off a 2-year plan and 3 extra months for free!\n\nWatch this video ad-free on Nebula: https://nebula.tv/videos/tom-nicholas-how-countries-were-invented\n\nA video about countries, maps and borders; where they came from and where they might be going in the future.\n\n* Chapters*\n\n0:00 Countries! Maps! Borders!\n02:09 1. What is a Country?\n09:27 2. The Slow Growth of the State\n15:23 Surfshark VPN Spot\n16:59 3. The Invention of Nations\n24:52 4. A World Without Countries?\n\n*Some Copy about the Video for the YouTube Algorithm*\n\nIn this month's video, we're exploring the origins of countries. What is a country? What was the first country? And how did the particular model of country which dominates in the present day, the nation-state, come to be so widely accepted as the organising principle for human politics and governance?\n\nWe're going to be taking a deep dive into the scholarship on states, nations and nationalism from the earliest states in Mesopotamia and Xin Dynasty China, through the emergence of the imagined community of the nation following the French Revolution and the American War of Independence during the 19th century and into the present day.\n\nSupport the channel on Patreon at http://patreon.com/tomnicholas\n\nIf you've enjoyed this video and would like to see more including my What The Theory? series in which I provide some snappy introductions to key theories in the humanities as well as video essays and more then do consider subscribing.\n\nThanks for watching!\n\nTwitter: http://twitter.com/tom_nicholas\nInstagram: http://instagram.com/tomnicholaswtf\nPatreon: http://patreon.com/tomnicholas\nWebsite: http://www.tomnicholas.com\n\n#countries #maps #borders", "link": "https://www.youtube.com/watch?v=f8rL9vgsT6g", "date_published": "2021-06-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]