[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Ya Tseen: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nSam Yellowhorse Kesler | November 9, 2021\n\"It's Indigenous Peoples' Month every month, don't you forget, mark your calendars,\" says Nicholas Galanin. \"I think it's important right now that we uplift and acknowledge Indigenous people beyond holidays or months, allocated time.\" Galanin, who's Tlingit and Unangax̂, leads Ya Tseen and brings his perspective as an Indigenous artist to every aspect of the band's music and artistry. Even the backdrop of their Tiny Desk (home) concert is a house screen — the largest of its kind in Southeast Alaska — carved by Will Burkhart and Galanin (as an apprentice). The video itself was filmed at the Sheet'ka Kwaan Naa Kahidi community house, which is modeled after customary Tlingit Long Houses.\n\nMinutes can quickly turn into an hour listening to Ya Tseen's music, which uses a combination of electronic and acoustic elements to create an inviting atmosphere. But his words are often far more cutting, literally so on \"Knives,\" which hides an ominous bent under an otherwise dreamy texture. It's the first song off the band's debut album, Indian Yard, though by no means Galanin's first foray into music; he's performed under other names like Silver Jackson and Indian Agent, and collaborated with the likes of Tanya Tagaq and Meshell Ndegeocello.\n\nGalanin is also a prolific visual artist, often focusing on political and anti-colonialist statements. His Tiny Desk brings all the elements of his work — music, video and artistry — together in a single package.\n\nSET LIST\n\"Knives\"\n\"Light the Torch\"\n\"Back in That Time\"\n\nMUSICIANS\nNicholas Galanin: vocals, keys, synthesizers, djembe\nBenjamin Verdoes: vocals, guitar, drums\nZak Dylan Wass: guitar, vocals\nQacung: Vocals, hand drum Jesse Hughey: vocals, electronics\n\nCREDITS\nVideo: Aaron Minks, Jesse Hughey\nAudio: Wilson Rahn, Bryan Lovett\n\nTINY DESK TEAM\nProducer: Sam Yellowhorse Kesler\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Bobby Carter, Kara Frame, Sofie Hernandez-Simeonidis\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #yatseen", "link": "https://www.youtube.com/watch?v=GatQYthTUKs", "date_published": "2021-11-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "William Prince: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nBob Boilen | November 8, 2021\nSeated in the comfort of his home in Winnipeg, singing his song \"Lighthouse,\" William Prince emanates thoughtful messages of redemption and love. \"I greet you today from Treaty 1 Territory, Winnipeg, Manitoba,\" he says. \"What a time it's been, I've been at home writing songs this past little while, and it really gave me some perspective on something ... confirmed something for me. You don't want to let a day go wasted.\" And with that, William Prince's baritone lulls us into his song \"Wasted,\" a song he wrote to his son but is full of advice for us all.\n\n\"What puts a shuffle in your shoes, babe?\n\nThat's the thing worth chasing.\n\nGotta love what you do, babe\n\nSo not a day goes wasted.\"\n\nWilliam Prince grew up the son of a preacher and a musician on Peguis First Nation. With two albums released in 2020, including a gospel album inspired by the grief caused by the pandemic, he's been quite prolific. This summer saw the release of a single, \"Run.\"\n\nWilliam Prince ends his Tiny Desk (home) concert with \"Breathless,\" the song that introduced him to the world in 2018; initially released in 2015, the later version we've come to know was produced by Nashville's famed producer Dave Cobb. \"Great songs will find a way; it ain't the singer; it's the song I was told.\" There's truth there, but for me, seeing him in Nashville in 2018, it was undoubtedly his voice that got me listening.\n\nSET LIST\n\"Lighthouse\"\n\"Wasted\"\n\"Breathless\"\n\nMUSICIANS\nWilliam Prince: vocals, guitar\n\nCREDITS\nVideo: Martin LaFrenière, Brad Crawford, Philippe Bellefeuille\nAudio: Jamie Sitar\nProduction by: Six Shooter Records\nProduction Assistant: Alyshia-Grace Hobday\n\nTINY DESK TEAM\nProducer: Sam Yellowhorse Kesler\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Bobby Carter, Kara Frame, Sofie Hernandez-Simeonidis\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #williamprince", "link": "https://www.youtube.com/watch?v=sJT5nBmKaZc", "date_published": "2021-11-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]