[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 - Everything To Know", "description": "Let’s get you caught up on Battlefield 2042 ahead of release. We’re here with a full overview of features like All-Out Warfare, Portal Mode, Hazard Zone, Specialists, when to play early, post-launch seasons, and more. \n\nBattlefield 2042 goes into early access on November 12 and fully releases on November 19. There is a massive amount of information to catch you up on. Even with a couple of preview events and an open beta, it’s hard for players to gauge exactly what the game will be like at launch. \n\nIn this video, we’re catching you up on everything. We have a full breakdown of the 10 Specialist characters available at launch, what classes they fit into, and what their Specialties and Traits are. Then we’ll go over what we know about the maps and how they are different or similar to past games in the franchise. Even though there isn’t a campaign, we’ll tell you the basics of the story, which involves a looming war between the United States and Russia and the \"No-Pat \"characters caught in the middle including Irish and Oz. After that, you’ll get a full breakdown of modes, including All-Out Warfare, Portal, and Hazard Zone. The latter, Hazard Zone, is probably the biggest departure from previous Battlefield games of the past--it's a squad-based competitive match consisting of phases, a battle-royale-inspired one-life system, and its own currency called Dark Market Credits. Finally, we’ll cover new gameplay mechanics like the Plus System and what we know about post-launch seasons, including their battle pass system. \n\nWe’re putting out tons of videos about Battlefield 2042, so while you’re waiting for a review, head on over to YouTube.com/Gamespot and watch our 21 Things Every Battlefield Player Should Know.\n\n#Battlefield2042", "link": "https://www.youtube.com/watch?v=vIYnbhijn-c", "date_published": "2021-11-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Oh No! Pokémon Brilliant Diamond And Shining Pearl Leaked! | GameSpot News", "description": "In this episode of GameSpot News, we talk about Pokémon Brilliant Diamond And Shining Pearl gameplay leaking, Back 4 Blood DLC roadmap being revealed, Elden Ring PC and console specs and how to watch the Xbox 20th Anniversary broadcast.\n\nIn this video, Persia talks about Pokémon Brilliant Diamond And Shining Pearl gameplay surfacing online. Leaks started popping up over the weekend when a Reddit user posted to the PokeLeaks subreddit claiming to have received a physical copy of the Nintendo Switch game early.\n\nPersia also talks about Bandai Namco has released detailed specs on its PC, PlayStation, and Xbox versions of the long-awaited Elden Ring.\n\nLater in the video, the Back 4 Blood DLC roadmap is revealed, a Mass Effect teaser image is released on N7 Day and we explain how to watch the Xbox 20th Anniversary broadcast.", "link": "https://www.youtube.com/watch?v=YtAjiafNchM", "date_published": "2021-11-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Lies of P Alpha Gameplay Teaser Trailer", "description": "Get your first look at gameplay for Lies of P, a fantastically baroque Action RPG inspired by the classic Italian novel Pinocchio from Carlo Collodi.  The ruined, but once beautiful city of Krat is on full display in the new video. Hideous and twisted automatons rule the landscape, and it’s up to P to find Mr. Geppetto and reverse the calamity that has befallen Krat.\n\nIn the video, fans should notice the reactive counter-attacks, the array of unique weapons to find and put to use, and that Pinocchio's own mechanical arm acts as an additional tool or weapon to give unique skills - such as a grappling hook and more.\n\n#LiesofP", "link": "https://www.youtube.com/watch?v=q-8ix2pSHrw", "date_published": "2021-11-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The 10 Best Pokémon Games", "description": "Pokemon is one Nintendo's most successful franchises. To date, we've seen Pokemon Anime, Pokemon Trading Cards, Pokemon merchandise, and more. Not only that - but several Pokemon spin-off games. But, what are the best Pokemon Games? Dave takes a look back at his 10 Best Pokemon Games to Play.\n\nTimestamps:\nIntro - 00:00\nPokémon Red and Blue - 00:30\nPokémon Snap - 02:32\nPokémon Go - 03:46\nPokémon Gold and Silver - 04:59\nPokkén Tournament DX - 06:42\nPokémon X and Y - 07:53\nPokémon Ruby and Sapphire - 08:38\nPokémon Sun and Moon - 09:18\nPokémon Black and White - 10:18\nPokémon Diamond and Pearl - 11:26\nOutro - 12:58", "link": "https://www.youtube.com/watch?v=qR49hsdfzHA", "date_published": "2021-11-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]