[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "New Pfizer drug and ivermectin", "description": "New Pfizer antiviral and ivermectin, a pharmacodynamic analysis\n\nNew Pfizer antiviral, PF-07321332, C₂₃H₃₂F₃N₅O₄\n\nPF-07321332 is designed to block the activity of the SARS-CoV-2-3CL protease,\n\nhttps://www.pfizer.com/news/press-release/press-release-detail/pfizers-novel-covid-19-oral-antiviral-treatment-candidate\n\nSo, what is a protease?\n\nSo what is a protease inhibitor?\n\nAnd, what is 3CL?\n\nChymotrypsin-like protease (3CL main protease, or 3CL Mpro)\n\nIdentification of SARS-CoV‑2 3CL Protease Inhibitors by a Quantitative High-Throughput Screening (3rd September 2020)\n\nhttps://pubs.acs.org/doi/abs/10.1021/acsptsci.0c00108#\n\nThe activity of the anti-SARS-CoV-2 viral infection was confirmed in 7 of 23 compounds\n\nMicroscopic interactions between ivermectin and key human and viral proteins involved in SARS-CoV-2 infection\n\nhttps://pubs.rsc.org/en/content/articlehtml/2021/cp/d1cp02967c\n\nthe strength and persistency of the interaction between IVE and the binding site of 3CLpro indicate that a partial inhibition of the catalytic activity could have place as the drug interacts with the main subdomains that define the enzyme binding pocket:\n\nIdentification of 3-chymotrypsin like protease (3CLPro) inhibitors as potential anti-SARS-CoV-2 agents\n\nhttps://www.nature.com/articles/s42003-020-01577-x\n\nas shown in Fig. 4, out of 13 OTDs only ivermectin completely blocked ( more than 80%) the 3CLpro activity at 50 µM concentration. \n\nDevelopment, validation, and approval of COVID-19 specific drugs takes years. Therefore, the idea of drug repositioning, also known as repurposing, is an important strategy to control the sudden outbreak of life-threatening infectious agents that spread rapidly.\n\nIlimaquinone (marine sponge metabolite) as a novel inhibitor of SARS-CoV-2 key target proteins in comparison with suggested COVID-19 drugs: designing, docking and molecular dynamics simulation study\n\nhttps://pubs.rsc.org/en/content/articlehtml/2020/ra/d0ra06379g\n\nFrom the docking analysis, ivermectin showed the highest docking score with an average energy of −8.5 kcal mol−1 among all the compounds. Remdesivir showed the lowest binding energy and highest docking score of −9.9 kcal mol−1\n\nhttps://bnf.nice.org.uk/medicinal-forms/remdesivir.html\n\nRitonavir, C37H48N6O5S2\n\nIvermectin, C48H74O14\n\nExploring the binding efficacy of ivermectin against the key proteins of SARS-CoV-2 pathogenesis: an in silico approach\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC7996102/\n \nWe have documented an intense binding of both ivermectin B1a and B1b isomer to the main protease with subsequent energy (ETot-) values of -384.56 and -408.6.\n\n PF-07321332 is designed to block the activity of the SARS-CoV-2-3CL protease,\n\nhttps://www.pfizer.com/news/press-release/press-release-detail/pfizers-novel-covid-19-oral-antiviral-treatment-candidate\n\nRisk of virus developing resistance to PF-07321332\n\nMolecular Docking Reveals Ivermectin and Remdesivir as Potential Repurposed Drugs Against SARS-CoV-2\n\nhttps://www.frontiersin.org/articles/10.3389/fmicb.2020.592908/full\n\nWith SARS-CoV-2 S Spike protein\n\nIvermectin showed high binding affinity to the viral S protein as well as the human cell surface receptors ACE-2 and TMPRSS2. \n\nIn agreement to our findings, ivermectin was found to be docked between the viral spike and the ACE2 receptor \n\nBinding Interactions of Selected Drugs With Human TMPRSS2 Protein (ACE2 protein)\n\nThe docking results revealed that ivermectin showed the highest binding affinity to the active site of the protein (MolDock score −174.971) and protein–ligand interactions \n\nBinding Interactions of Selected Drugs With Human ACE-2 Protein\n\nthat ivermectin showed the highest binding affinity to the active site of the protein (MolDock score −159.754) and protein–ligand interactions \n\nWith SARS-CoV-2 S Glycoprotein\n\nIvermectin showed the highest binding affinity to the predicted active site of the protein\n\nWith SARS-CoV-2 Nsp14 Protein\n\nivermectin showed the highest binding affinity (MolDock score −212.265) and protein–ligand interactions\n\nBinding Interactions of Selected Drugs With SARS-CoV-2 PLpro\n\nIvermectin showed the highest binding affinity to the predicted active site of the protein (MolDock score −180.765) and protein–ligand interactions \n\nA brief message to world leaders\n\nCome on ya all", "link": "https://www.youtube.com/watch?v=ufy2AweXRkc", "date_published": "2021-11-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]