[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Jack Ingram, Miranda Lambert, Jon Randall: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nLyndsey McKenna | June 21, 2021\nThe trio of country superstar Miranda Lambert, long-tenured recording artist Jack Ingram and acclaimed songwriter-producer Jon Randall have history together: After collaborating on \"Tin Man\" from Lambert's 2016 record The Weight Of These Wings and \"Tequila Does\" from 2019's Wildcard, the artists spent five days last November recording in Marfa, Texas. In this (home) concert, the trio turns its quarantine album, The Marfa Tapes, into a quarantine Tiny Desk set, complete with a well-appointed desk in the corner of the frame.\n\nThe Marfa Tapes was largely recorded outdoors with just a few mics and guitars, and that intimacy at the heart of these songs remains present under the bright lights and against the dark wooden palette panelling of this session. The set opens with a one-two gut punch of \"Waxahachie\" followed by \"Tin Man.\" (\"Our award-winning song,\" Lambert jokes. The track won the 2018 Academy of Country Music Award for song of the year.) At its conclusion, Lambert lets out a laugh and the trio exchange knowing glances before finishing the show with \"In His Arms.\"\n\nThroughout the set, there's clear chemistry and camaraderie, evident in the ease on display between songs (\"I like that,\" Lambert says as they conclude the first track. \"I love it,\" Ingram one-ups.) Even if we can't all make it to Marfa for a songwriting session, a (home) concert feels like an honorary invitation to Ingram, Lambert and Randall's world.\n\nSET LIST\n\"Waxahachie\"\n\"Tin Man\"\n\"In His Arms\"\n\nMUSICIANS\nJack Ingram: guitar, vocals\nMiranda Lambert: guitar, vocals\nJon Randall: guitar, vocals\n\nCREDITS\nVideo: CookHouse Media LLC\nAudio: Brandon Bell\n\nTINY DESK TEAM\nProducer: Ann Powers\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Bob Boilen, Kara Frame, Gabrielle Pierre\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #mirandalambert #jackingram #jonrandall", "link": "https://www.youtube.com/watch?v=AKK5FV6zPkY", "date_published": "2021-06-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]