[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Gang Beasts With Super Eyepatch Wolf and Hbomberguy", "description": "On today's Play For All Charity livestream, Hbomberguy and Super Eyepatch Wolf join Tamoor and Lucy to play some Gang Beasts for charity, and have a nice little chat about stuff—fun is mandatory. \n\nDonate to AbleGamers: https://tiltify.com/@playforall2021/playforall2021\nFollow Hbomberguy on Twitter: @hbomberguy\nFollow Super Eyepatch Wolf on Twitter: @eyepatchwolf\n\nIn 2020 GameSpot held Play For All, a multi-week event that encompassed covering the latest game reveals and announcements, but also involved a charity effort to raise money for causes that were important to us. We’re super excited about Play For All 2021, and have been working hard to put together something that you’ll have a blast watching. \n\nThis year we’ll be fundraising for AbleGamers to help its mission to enable play for everyone, in order to combat social isolation, foster inclusivity in the gaming community, and help provide specialized gaming equipment to those who need it. To find out more, head over to ablegamers.org.\n\n#playforall2021 #gangbeasts", "link": "https://www.youtube.com/watch?v=Dgp6jTmzXV4", "date_published": "2021-06-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Metal Gear Solid: Tactical Espionage Improvisation With Jake Baldino", "description": "On today's Play For All Charity livestream, Jake Baldino (Gameranx) joins Tamoor and Ben to play some Metal Gear Solid, but with a twist. During key conversations, Jake and Ben are not allowed to look at the screen. They will be given a prompt by Tamoor and, based on memory, will have to try and remember and recite the line or make something up. \n\nDonate to AbleGamers: https://tiltify.com/@playforall2021/playforall2021\nFollow Jake on Twitter @JakeBaldino \n\nIn 2020 GameSpot held Play For All, a multi-week event that encompassed covering the latest game reveals and announcements, but also involved a charity effort to raise money for causes that were important to us. We’re super excited about Play For All 2021, and have been working hard to put together something that you’ll have a blast watching. \n\nThis year we’ll be fundraising for AbleGamers to help its mission to enable play for everyone, in order to combat social isolation, foster inclusivity in the gaming community, and help provide specialized gaming equipment to those who need it. To find out more, head over to ablegamers.org.\n\n#playforall2021 #metalgearsolid", "link": "https://www.youtube.com/watch?v=xBQN3QJcORE", "date_published": "2021-06-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 - Even More Things To Know", "description": "More information about Battlefield 2042, releasing in October, has come out and we’re digging further into specialists, vehicles, gear, guns, progress, and maps. \n\nBattlefield 2042 has now shown off a cinematic reveal trailer and gameplay. An E3 q&a session with developers answered a lot of questions around specialists, gear, vehicle play, progress, maps, guns, and pacing. In this video, we’re clearing up confusion around new mechanics and looking at whether these changes are as different from previous Battlefield games as they first appeared to be.\n\nBattlefield 2042 is releasing October 22 for everyone and October 15 for certain editions of the game. There are also alphas and betas coming up, one of which will test DICE’s battle-royale alternative, titled Hazard Zone. EA is expected to show off a lot more information on July 22 at EA Play.\n\n#battlefield2042", "link": "https://www.youtube.com/watch?v=pMlgXmI57bY", "date_published": "2021-06-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Sea of Thieves - A Pirate's Life Showcase Livestream", "description": "Tune in June 20 at 11am PT for the Sea of Thieves A Pirate's Life showcase. Get a deep dive on the collaboration between Sea of Thieves and Disney on how they included Captain Jack Sparrow, and many other notable characters. You'll get first look at a few tales, and gameplay of those as well as some behind the scenes developer interviews.\n\n#seaofthieves #pirateslife", "link": "https://www.youtube.com/watch?v=jtVOOGszmJM", "date_published": "2021-06-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]