[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCFQMnBA3CS502aghlcr0_aw", "title": "Coffeezilla VS Billy Gene Debate! Fake Gurus, Fake News and Paid Courses", "description": "Billy Gene and Coffeezilla sit down to hash out our differences and talk about everything from Fake Gurus to Fake News, Paid courses and even Astrology!\nBilly Gene now has uploaded a video claiming he won this debate, as well as the other.  Part 3 of the debate between Billy Gene and Coffeezilla is available on the Drip\nNOTE: iHeart Radio copyright claimed a couple minutes of the hour stream so we had to totally reupload it. Sorry about the missing minute and a half or so. \ntwitter: https://twitter.com/coffeebreak_YT\ninstagram: https://www.instagram.com/coffeebreak_yt/\nthis video is an opinion and in no way should be construed as statements of fact. scams, bad business opportunities, and fake gurus are subjective terms that mean different things to different people. I think someone who promises $100K/month for an upfront fee of $2K is a scam. Others would call it a Napolean Hill pitch.\n#coffeezilla #billygene", "link": "https://www.youtube.com/watch?v=q4GDD0WoXXw", "date_published": "2021-02-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCFQMnBA3CS502aghlcr0_aw", "title": "Hedge Fund Manager Breaks Down GameStop - What now?", "description": "My idea for this interview was a post-mortem on GameStop. It was many people's first exposure to the market, and a rare moment of retail traders winning BIG. But it also could be a good catalyst for learning risk management, fundamentals and more basic finance principles. Today my guest is Patrick Boyle. \nPatrick Boyle is a fund manager, academic, and author. Boyle is the Founder of Palomar Capital Management, a UK-based hedge fund.\nFollow Patrick here: \nhttps://www.youtube.com/channel/UCASM0cgfkJxQ1ICmRilfHLw\n\nFollow Coffeezilla\ntwitter: https://twitter.com/coffeebreak_YT\ninstagram: https://www.instagram.com/coffeebreak_yt/\nthis video is an opinion and in no way should be construed as statements of fact. scams, bad business opportunities, and fake gurus are subjective terms that mean different things to different people. I think someone who promises $100K/month for an upfront fee of $2K is a scam. Others would call it a Napolean Hill pitch.", "link": "https://www.youtube.com/watch?v=F7TZV25_sL8", "date_published": "2021-02-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]