[{"source": "https://www.theguardian.com/rss", "title": "TikTok's Dark Academia trend criticised for 'whiteness'", "description": "<p>The successor to cottagecore has been called out for not challenging the status quo</p><p>The fashion and lifestyle trend of Dark Academia which revolves around classic literature from Europe, has been criticised for being non-inclusive and lacking in diversity.</p><p>Like<a href=\"https://www.theguardian.com/fashion/2020/jul/03/david-beckham-leads-the-way-as-men-flock-to-cottagecore-look\"> cottagecore</a> before it, the influence of the online trend is far reaching. It has 18 million views on TikTok, 100,000 posts on Instagram and Google reports that searches having jumped by<a href=\"https://graziadaily.co.uk/fashion/shopping/dark-academia/\"> 4,750%</a>. Even Hollywood is taking note with the costumes of <a href=\"https://twitter.com/CultureCrave/status/1359174221239226372\">Jared Leto’s Joker</a> in Zac Snyder’s Justice League and Timothée Chalamet as<a href=\"https://www.youtube.com/watch?v=nO4AOxyPzmE\"> Edward Scissorhands’ son</a> referencing the trend which takes a lead from<a href=\"https://www.theguardian.com/fashion/2020/nov/22/yindies-80s-wall-street-generation-z-gossip-girl-the-crown\"> preppy looks</a>, Donna Tartt’s Secret History, TV shows like Brideshead Revisited and films like The Talented Mr Ripley.</p> <a href=\"https://www.theguardian.com/fashion/2021/feb/10/tik-toks-dark-academia-trend-criticised-for-whiteness\">Continue reading...</a>", "link": "https://www.theguardian.com/fashion/2021/feb/10/tik-toks-dark-academia-trend-criticised-for-whiteness", "date_published": "2021-02-10 18:58:37+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "The model who made Instagram apologise: Alexandra Cameron's best photograph", "description": "<p>‘My first picture of Nyome Nicholas-Williams was removed by Instagram. This one was taken as a celebration after it agreed to change its policies’</p><p>When I noticed the model and activist <a href=\"https://www.instagram.com/curvynyome/?hl=en\">Nyome Nicholas-Williams </a> on social media early last summer, I felt hugely appreciative of how confident she was in her images. She was celebrating who she was. I base a lot of my work around photographing women and trying to encourage self-acceptance, which is motivated by my own low confidence. I lived through the 90s and 00s heyday of gossip mags and size zero. So when I saw Nyome, who is confident in front of the camera and boldly herself as a plus-size black woman – a marginalised and censored group of people – I reached out because I really wanted to capture her.</p><p>She came to visit me in Cambridge in July, when we were recently out of the first lockdown. I shoot only with natural light, in a barn that is open to the elements along one side. I hang my backdrops in there, and the light enters from one direction only, like in studio photos. I prefer it because it creates the most beautiful, diffused light, with depth and a soft feel to it. I would never have thought it possible to create photos like this – you don’t need a big fancy studio! Shooting out of a glorified shed is an ice-breaker, too. I have to move the bikes to one side and we’re looking out into the garden with the dogs running about, which makes everyone relax and that has an impact on the photo.</p> <a href=\"https://www.theguardian.com/artanddesign/2021/feb/10/model-instagram-apologise-nyome-nicholas-williams-alexandra-cameron-best-photograph\">Continue reading...</a>", "link": "https://www.theguardian.com/artanddesign/2021/feb/10/model-instagram-apologise-nyome-nicholas-williams-alexandra-cameron-best-photograph", "date_published": "2021-02-10 16:35:20+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Hundreds of millions in green grants for English homes pulled despite delays", "description": "<p>95% of £1.5bn set aside to improve houses unspent due to slowness in making grants and paying installers</p><p>The government’s flagship programme for a green recovery is in turmoil after it was revealed that hundreds of millions of pounds are being withdrawn from its green homes grant programme.</p><p>Ninety-five per cent of the £1.5bn pot provided for householders in England to make their homes less carbon intensive remains unspent due to long delays in giving out grants to householders and making payments to installers.</p> <a href=\"https://www.theguardian.com/environment/2021/feb/10/hundreds-of-millions-in-green-grants-for-english-homes-pulled-despite-delays\">Continue reading...</a>", "link": "https://www.theguardian.com/environment/2021/feb/10/hundreds-of-millions-in-green-grants-for-english-homes-pulled-despite-delays", "date_published": "2021-02-10 15:10:50+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Climate action could save 'millions of lives' through clean air, diet and exercise", "description": "<p>Meeting Paris goals would bring health benefits aside from tackling global heating, research says</p><p>Thousands of lives lost to air pollution, inactivity and unhealthy diets could be saved each year if the UK takes the action needed to tackle climate change, researchers have said.</p><p>Across the world, millions of lives could be saved if countries raise ambitions on cutting emissions to limit global heating to well below 2C above pre-industrial levels, as they have committed to in the global Paris climate accord.</p> <a href=\"https://www.theguardian.com/environment/2021/feb/10/climate-action-could-save-millions-of-lives-through-clean-air-diet-and-exercise\">Continue reading...</a>", "link": "https://www.theguardian.com/environment/2021/feb/10/climate-action-could-save-millions-of-lives-through-clean-air-diet-and-exercise", "date_published": "2021-02-10 12:53:31+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "From a vaccine manufacturer to an RAF clarinettist: meet four of the people working to vaccinate the nation", "description": "<p>Across the UK, people are coming together to help deliver the Covid-19 vaccine to those groups most at risk</p><p>When the first two Covid-19 vaccines were approved in the UK at the end of 2020, we were given a cautious glimmer of hope after almost a year into various lockdowns. Now, a diverse mix of professions across the four nations are coming together to vaccinate the most at-risk groups. Here, four of those people tell us about the roles they are playing in the effort.</p> <a href=\"https://www.theguardian.com/all-in-all-together/2021/feb/10/from-a-vaccine-manufacturer-to-an-raf-clarinettist-meet-four-of-the-people-working-to-vaccinate-the-nation\">Continue reading...</a>", "link": "https://www.theguardian.com/all-in-all-together/2021/feb/10/from-a-vaccine-manufacturer-to-an-raf-clarinettist-meet-four-of-the-people-working-to-vaccinate-the-nation", "date_published": "2021-02-10 10:37:01+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "My girlfriend rarely wants to have sex – but she won’t talk about why", "description": "<p>We have been together for five years and were once sexually active and adventurous, but my partner has become closed off<br /></p><p><strong>I’m a 27-year-old man and my girlfriend of </strong><strong>five years is 30</strong><strong>. When we started dating, we were sexually active and adventurous, but, as time has passed</strong><strong>, especially in the </strong><strong>past </strong><strong>few years</strong><strong>, </strong><strong>that’s changed. We now have sex </strong><strong>once every </strong><strong>five to six weeks</strong><strong>. She never initiates, and doesn’t really </strong><strong>seem present</strong><strong>. She recently alluded to getting a vibrator, which excited me, but I don’t know if she will follow through. She hates talking about our sex life and her sexuality, which I find worse than the lack of sex</strong><strong>.</strong></p><p><strong>In the past, there have been times when I have been insensitive and brought up this topic in the wrong way, but I’m no longer like th</strong><strong>at. I </strong><strong>feel as if I’</strong><strong>m better </strong><strong>at handling it, but </strong><strong>it </strong><strong>still makes me feel rejected and insecure, which puts a strain on </strong><strong>our relationship</strong><strong>. </strong><strong>I want her to feel </strong><strong>liberated to </strong><strong>speak about how she is feeling, but she’s closed off, </strong><strong>and it’s becoming an elephant in the room.</strong></p> <a href=\"https://www.theguardian.com/lifeandstyle/2021/feb/10/girlfriend-rarely-wants-to-have-sex-with-me-wont-talk-about-why\">Continue reading...</a>", "link": "https://www.theguardian.com/lifeandstyle/2021/feb/10/girlfriend-rarely-wants-to-have-sex-with-me-wont-talk-about-why", "date_published": "2021-02-10 10:27:10+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Underwater photographer of the year 2021 winners – in pictures", "description": "<p><a href=\"https://underwaterphotographeroftheyear.com/winners/upy-yearbook/\">Underwater photographer of the year</a>, a global annual competition based in the UK, celebrates photography beneath the surface of the ocean, lakes, rivers and even swimming pools</p> <a href=\"https://www.theguardian.com/environment/gallery/2021/feb/10/underwater-photographer-of-the-year-2021-winners-in-pictures\">Continue reading...</a>", "link": "https://www.theguardian.com/environment/gallery/2021/feb/10/underwater-photographer-of-the-year-2021-winners-in-pictures", "date_published": "2021-02-10 07:00:28+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "How the Queen lobbied for changes in the law to hide her wealth – podcast", "description": "<p>Government memos discovered in the National Archives reveal that the Queen lobbied ministers to alter proposed legislation. The Guardian’s David Pegg follows the trail and explains its implications for a monarchy which is supposed to stay out of politics</p><p>The Queen’s role in British politics is supposed to be one of studied neutrality. By convention, she doesn’t vote in elections nor make statements that could be construed as party political. As head of state she conducts the ceremonial opening of parliament as well as other symbolic roles, but in theory at least, she plays no role in government decision-making or the setting of policy. </p><p>However, documents discovered by the Guardian in the National Archives tell a different story. The Guardian’s <strong>David Pegg </strong>tells <strong>Anushka Asthana </strong>about a paper trail that shows how more than 1,000 laws have been vetted by the Queen or <a href=\"https://www.theguardian.com/uk/prince-charles\">Prince Charles</a> through a secretive procedure before they were approved by parliament. These laws include everything from social security, pensions, race relations and food policy through to obscure rules on car parking charges and hovercraft. But they also include draft laws that affected the Queen’s personal property such as her private estates in Balmoral and Sandringham – and anything involving the nature of her wealth, estimated to run into the hundreds of millions of pounds.</p> <a href=\"https://www.theguardian.com/news/audio/2021/feb/10/how-the-queen-lobbied-for-changes-in-the-law-to-hide-her-wealth-podcast\">Continue reading...</a>", "link": "https://www.theguardian.com/news/audio/2021/feb/10/how-the-queen-lobbied-for-changes-in-the-law-to-hide-her-wealth-podcast", "date_published": "2021-02-10 03:00:23+00:00", "persistent": false, "user": null, "language": "en-UK"}]