[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "KeiyaA: Tiny Desk (Home) Concert", "description": "NPR Music's Tiny Desk series will celebrate Black History Month by featuring four weeks of Tiny Desk (home) concerts and playlists by Black artists spanning different genres and generations each week. The lineup includes both emerging and established artists who will be performing a Tiny Desk concert for the first time. This celebration highlights the beautiful cornucopia of Black music and our special way of presenting it. We hope you enjoy.\n\nSidney Madden | February 11, 2021\nCornrows braided back with the precision of an architect. Stiletto nails commanding a sampling machine. Gold-glinted lids to match her light-up Beads Byaree earrings. With every move, KeiyaA shines so bright, it's impossible to look away. And while your eyes are fixated on her person, the music KeiyaA conjures inside Brooklyn's Electric Garden is what leaves you completely spellbound.\n\nJust like this awe-inducing Tiny Desk (home) concert, KeiyaA's debut album, Forever, Ya Girl, appeared last year with kismet timing, unveiling her as a fully formed star. The 2020 release is a meditation on the thin line between solitude and loneliness, one that KeiyaA traces and teeters on while defining her Black womanhood. Whether it's through jazzy woodwinds, heavy synths or prickly staccato, the singer-songwriter and multi-instrumentalist shares waves of anguish, depletion, love and elation in a swirling stream of consciousness.\n\n\"Gone for so long I prefer to spend time in my pain, hey / Gone for so long I can barely recall the last my phone rang,\" she sings on \"Hvnli.\"\n\nWhile the album version of these tracks boast much of KeiyaA's own production, affirmations and layered vocals in chorus, for this live version, the 28-year-old Chicago native communicates telepathically with her all-Black bandmates and cites her sources through the creative process.\n\n\"Most of the work that has carried me has been the writings of Black women,\" KeiyaA says before showing off hardcover copies of works by Jayne Cortez and Ntozake Shange. We love a queen who shares her curriculum!\n\nSET LIST\n\"Do Yourself a Favor\"\n\"Hvnli\"\n\"Finesse Without a Trace\"\n\"Rectifiya\"\n\nMUSICIANS\nKeiyaA: vocals, samplers and keyboard\nBuz: drums, vocals\nNelson Bandela: keyboard, synths and vocals\nKeenyn Omari: flute, saxophones and guitar\n13th Law: bass and vocals\n\nCREDITS\nAudio: Jaclyn Sanchez, Abigail Lewis, Jacob Powell\nVideo: Scott Perry, Solange Smith, Marisa Gesualdi\nProduction: Caroline Waxse, Naavin Karimbux\nSpecial thanks: Telsha Anderson, Meredith Menchel, and Beads Byaree\n\nTINY DESK TEAM\nProducer: Bobby Carter\nVideo Producer: Morgan Noelle Smith\nAudio Mastering: Josh Rogosin\nArt Director: CJ Riculan\nTiny Production Team: Bob Boilen, Kara Frame, Maia Stern\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann", "link": "https://www.youtube.com/watch?v=jCnrqmFSXuw", "date_published": "2021-02-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Meshell Ndegeocello: Tiny Desk (Home) Concert", "description": "NPR Music's Tiny Desk series will celebrate Black History Month by featuring four weeks of Tiny Desk (home) concerts and playlists by Black artists spanning different genres and generations each week. The lineup includes both emerging and established artists who will be performing a Tiny Desk concert for the first time. This celebration highlights the beautiful cornucopia of Black music and our special way of presenting it. We hope you enjoy.\n\nLauren Onkey | February 10, 2021\nMeshell Ndegeocello's Tiny Desk (home) concert feels like a narrative film. Shot in vivid black and white, the concert includes songs from throughout her career framed by her thoughts on the importance and influence of James Baldwin: \"He deserves flowers every day. Most of all because he was willing to discuss things that were painful, hard to look at, hard to see, hard to accept.\"\n\nThat description also applies to Ndegeocello's inventive and challenging work on display here. She opens with \"Step Into the Projects\" from her 1993 debut album, Plantation Lullabies, transformed from its original funky groove into a stark spoken word piece. \"Price of the Ticket,\" with her longtime guitarist Chris Bruce, is from Ndegeocello's recent project, Chapter & Verse: The Gospel of James Baldwin, \"a 21st century ritual toolkit for justice\" inspired by Baldwin's The Fire Next Time.\n\nShe moves next from these songs about communal life to two that dig into internal turmoil. \"Forget My Name\" from Comet Come To Me (2014) is stripped down from its original reggae arrangement and lays bare the haunting imagery in the lyrics. \"Fool of Me,\" from her acclaimed album Bitter (1999), ends the set with just vocals and guitar. This is one of the most intimate, focused and intense Tiny Desk concerts you'll find.\n\nSET LIST\n\"Step Into the Projects\"\n\"Price of the Ticket\"\n\"Forget My Name\"\n\"Fool of Me\"\n\nMUSICIANS\nMeshell Ndegeocello: vocals, bass\nChris Bruce: guitar\n\nCREDITS\nVideo: Chris Bruce, Meshell Ndegeocello and Morley Kamen\nAudio: Chris Bruce and Meshell Ndegeocello\n\nTINY DESK TEAM\nProducer: Abby O'Neill\nVideo Producer: Morgan Noelle Smith\nAudio Mastering: Josh Rogosin\nArt Director: CJ Riculan\nAssociate Producer: Bobby Carter\nTiny Production Team: Bob Boilen, Kara Frame, Maia Stern\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann", "link": "https://www.youtube.com/watch?v=I7db2X9RA2Y", "date_published": "2021-02-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]