[{"source": "https://lukesmith.xyz/rss.xml", "title": "Veganism Is the Pinnacle of Bugmanism", "description": "<p>People have quoted me as saying that. I forget where it comes from,\nprobably a livestream, but I definitely stand by it. Since a lot of\npeople labor under the assumption that my channel is about &quot;Linux,&quot;\nI've accumulated a lot of subscribers that are variously nerds,\nfurries, degenerates, coomers, libertarians, communists, trannies and\namong them are vegans. Some of them (I assume) are good people.</p>\n<p>There's a stereotype about vegans that they are annoying and can't\ntalk about anything but Veganism. This hurtful stereotype comes from the\nfact that it's true.</p>\n\n<figure class=\"resright\"><img src=\"https://lukesmith.xyz/pix/grill.gif\" title=\"I just wanna grill!\" /></figure>\n\n<h2 id=\"bugmanism\">Bugmanism</h2>\n<p>Firstly, what is Bugmanism? How do Vegans fit the bill?</p>\n<p>Long story short, a bugman is someone who rejects the purpose and role\nof humans in their natural environment. They reject tradition, religion,\ntheir family, gender roles, the expectation that a person should\ncontribute to their community, etc. They might do this for their\npersonal convenience (usually they just wanna coom outside of marriage)\nor for apparently rational reasons, but the effect is the same.</p>\n<p>If you want to sum up the esoterically evil goals of &quot;modernism&quot; or\nwhatever you want to call it, it is destroying the countervailing power\nof tradition and in its place, new social engineers attempt to dictate\nhuman values top down. If you separate people from their families, their\nraces, their traditions and <em>who they actually are</em>, you can engineer TV\nshows, sports teams, activist movements and a million other things for\nthem to identify with and worship. <strong>Modernism pretends to liberate\npeople from arbitrary traditions and authorities, when in reality is\nsubstitutes natural, emergent morals with controlled authorities.</strong></p>\n<p>Veganism has always been one of the most radical examples of this logic.\nEsoterically, <strong>Veganism forces one to abandon not just their own\ntraditions, but every human dietary tradition</strong> and leaves them at the\nwhims of processed grains and pharmaceutical supplements for a meager\nsurvival.</p>\n<p>That is, Veganism is highly disruptive: You can't have a normal life.\nYou can't have a normal meal. You can't wine and dine with people and\nmust make it an affair. You can't use traditional hand-made leather\nproducts. You can't hunt or trap for food or raise animals, even for\neggs.</p>\n<p>You become a nag at war with your family, the world around you. <strong>You\nare trapped</strong> <em>within</em> urbanite bugman society: you can't even eat in\nmost non-urban places or foreign countries because the insane concept of\nnot cooking with animal fats and eating and using animal products just\ndoesn't exist. You have to survive holding your breath from one hipster\ndowntown area to the next.</p>\n<p>On every point, you become more reliant on macro-society. Vegans try\nvery hard to give off &quot;organic&quot; vibes, but it's just a lie. Even\npeople on the internet who &quot;advertise&quot; their Vegan lifestyle spend\nhours processing a basic meal and of course predigesting indigestible\nplant matter with a blender. Try and find a non-urbanite Vegan in real\nlife. They exist, but they are an aberration.</p>\n<h2 id=\"the-larp-of-vegan-for-health\">The LARP of &quot;Vegan for Health&quot;</h2>\n<p>Vegans sometimes pretend to advertise Veganism because it's allegedly\nhealthy. This is just public relations; any true Vegan, when you really\npin them down thinks that Veganism at its core is a moralistic belief.\nVegans are Vegans because they believe that not being Vegan is morally\ndeficient: killing/eating animals and using their bodies is bad. That's\nit.</p>\n<p>So you have your moral principle and run with it. What magical force\nthen is making that moral principle necessarily good for your health? If\nVeganism <em>were</em> actually a good diet for humans, that would actually be\na massive coincidence. &quot;Vegans for health&quot; have to grapple with the\nbizarre claim that meat, exactly the food that has been viewed in all\nhuman cultures as superior and more desirable is somehow nutritionally\ndeficient.</p>\n<h3 id=\"the-standard-american-diet-sad-is-plant-based\">The Standard American Diet (SAD) is Plant-based.</h3>\n<p>The weirdest thing is when Veganism is held in opposition to the\nStandard American Diet, as if the American diet somehow represents\ntraditional or non-Vegan diets. <strong>The SAD is just Vegan-lite.</strong> SAD is a\npost-Vegan invention of the diet industry take over the past decades has\nbeen leading people into the most harmful parts of vegan diets: unstable\nplant-oils, processed grains as meat substitutes, etc.</p>\n<p>The pop-cultural idea of &quot;health&quot; is simply &quot;being skinny.&quot; Veganism\nis <em>great</em> at making people skinny because it is slow moving starvation\n(I have met some carbo-loading exceptions who fatten up).</p>\n<p>Veganism is just to starvation what waterboarding is to drowning. If you\nstick with it, you <em>will</em> eventually die, but it's so painful in the\nmeantime, you'll probably give up.</p>\n<h2 id=\"veganism-is-rational\">Veganism is rational.</h2>\n<p>Vegans are exceptionally &quot;rational&quot; in that they adopt the moral\nframework of modern society and follow it to its logical conclusion.</p>\n<p>When you're given for your acceptance some inane religious platitudes\nlike &quot;equality&quot; and &quot;rights&quot; along with vaguely Marxist notions of\n&quot;exploitation&quot; and &quot;slavery&quot; and &quot;oppressed classes,&quot; it seems\nperfectly reasonable to expand that language to the relationship between\npredators (humans) and their prey (many animals) (or maybe pets too).</p>\n<p>If you're raised in a time of extreme moral nihilism except for not\nliking the several historical events you're told that matter (usually\nslavery and the Holocaust), obviously you're going to glom on to what\nlooks most like them: chickens in chains and sheep being led to\nslaughter like sheep to slaughter.</p>\n<p>Honestly, Veganism by their own logic might not be far enough. There is\nsome circumstantial research to the effect that plants have nervous\nsystems that might feel pain as well: you could go one step further and\nsimply eat nothing living. The [Ctistae]{.dfn} of ancient Thrace refused\nto eat anything alive, eating only by-products/foodstuffs like milk and\nhoney. The Ctistae also refused to have sex, which might be something to\nconsider since Vegans eventually lose sexual function anyway.</p>\n<h2 id=\"veganism-is-rebellious\">Veganism is rebellious.</h2>\n<p>Veganism has the same kind of &quot;rebellion&quot; that all other forms of\nleftism share. It &quot;rebels&quot; against the system by perfectly\ninternalizing the system's values, extrapolating them to their logical\nconclusions and thus fighting the system when it fails to meet those\nobviously unworkable conclusions.</p>\n<p>Corporations started shilling vegetable oils (which originally were and\nfrankly still are just industrial by-products) as workable replacements\nfor butter and lard. Seventh-Day Adventists lobbied for them because of\ntheir own religion beliefs. Jews lobbied for them because they hate\nunkosher lard. Years later, now we know that vegetable oils are highly\nunstable and have contributed to the massive rise in heart disease.</p>\n<p>Veganism is a leftist phenomenon. The psychological type of a leftist is\nsuch that they will always subordinate their direct experience to\nideology. It doesn't matter if not eating meat or wearing leather or\nusing animal products sounds hard, their suffering is more proof of a\ngreater moral superiority.</p>\n<p>Non-leftists can simply not become Vegans for longer than extremely\nbrief periods. Even if a Vegan wins an argument with them, a normal\nperson is just going to say, &quot;I'm sorry, I like animals and all, but I\ncan't not eat them, that's just crazy.&quot;</p>\n<h2 id=\"veganism-only-makes-sense-in-a-bugman-environment\">Veganism only makes sense in a bugman environment.</h2>\n<p>Ask a vegan why he doesn't eat eggs. He will probably tell you a spooky\nstory about how terrible it must be for a chicken to live in a coop\nlaying eggs all day. That might even bring a tear to a sentimental\nperson's eye.</p>\n<p>Out where I live, people have their chickens wandering in their yards\nand garden pecking scraps. They return to their coops at night to be\nsafe from coyotes. Is there really something &quot;unethical&quot; in the mind\nof a Vegan about picking up an unfertilized egg lain by one of these\nchickens and eating it?</p>\n<p>A lot of the moral logic behind Veganism falls flat outside of bugman\ncapitalism. Fundamentally, it's another manifestation of general angst\nfrom lack of connection to the real natural world.</p>\n<p>I say this because most Vegans are Vegans because they are softies who\nhave literally no connection to animals whatsoever until as a teenager\nthey watched a PETA documentary with chickens getting their heads buzzed\noff or pigs walking around in their own poop.</p>\n<p>Literally think about the animals. When wild animals die in nature, they\ndon't slowly slip away in the night surrounded by their family. They\ndie of starvation, or by being ripped apart alive by packs of coyotes.\nWould you rather die by getting your brains blown out instantaneously or\ndie a &quot;natural&quot; death <a href=\"https://www.youtube.com/watch?v=Fg9_ZnojxmU\">like\nthis</a>?</p>\n<p>But to the original question, it really makes no sense even for a Vegan\nto not eat or distribute the eggs a chicken lays... You're going to\nhave to get deep into Marxist analysis to think that's somehow\nunethical. And once a chicken has living a long life of egg laying, why\nnot quickly and painlessly <a href=\"https://poultrykeeper.com/general-chickens/how-to-kill-a-chicken/\">dislocate its\nneck</a>\nand eat it for dinner? If you don't, your cat will eventually gore it\nand it'll be a mess.</p>\n\n<figure class=\"resright\"><img src=\"https://lukesmith.xyz/pix/kill_chicken.gif\" title=\"Boomer attempts to kill chicken.\" /></figure>\n\n<h2 id=\"animals-live-to-be-eaten\">Animals live to be eaten.</h2>\n<p>This isn't even a metaphysical claim. Domesticated cows and pigs and\nchickens do not and cannot live as they exist in the wild. They have\nevolved symbiotically with us as sources of food. They can go feral and\nbreed with wild boar and the like, but their composition is based on\ntheir domesticated state.</p>\n<p>Wild game like deer have lived alongside human hunters for centuries.\nTheir breeding habits and evolutionary development is based in the fact\nthat a <a href=\"http://archive.jsonline.com/sports/outdoors/study-sheds-light-on-top-causes-of-deer-mortality-b99190938z1-241992741.html\">sizeable\nportion</a>\nof their population will be hunted by humans every season.</p>\n<p>If you actually care about &quot;the environment&quot; (1) you would care for\nhumans, whose natural diet is meat and (2) you would be terribly worried\nabout the unintended consequences of severing one of the most important\nlinks in the food chain.</p>\n<h2 id=\"dumb-vegan-sayings\">Dumb Vegan sayings</h2>\n<h3 id=\"you-wouldnt-kill-it-yourself\">&quot;You wouldn't kill it yourself!&quot;</h3>\n<p>They say this whenever someone turns their eyes away from an animal\nbeing killed in one of their Vegan propaganda videos.</p>\n<p>Guess what, I also might turn away if I see a video of a sanitation\nworker wading through human feces it in a sewer. That doesn't mean that\nI'm a hypocrite for taking dumps in a toilet connected to city sewage.</p>\n<p>I turn away when I see depictions of amputations of gangrenous limbs in\nmovies too. That doesn't mean I don't think it's not medically\nnecessary.</p>\n<p>Killing animals is actually a bad example of this because while all\ncultures are disgusted by feces and amputations, in most times and\nplaces (including this country before Bambi), killing animals was\nnothing any self-respecting grown man would react to. It goes without\nsaying that there are many countries where people recreationally torture\ndogs and cats.</p>\n<p>I don't say that to say that I'd be okay with killing dogs and cats,\nmerely that the trained moral responses we have for them are very\nlocalized and subjective in our own modernist viewpoint. But Millenials\nhave now been raised in a Disney fantasy-land where animals think and\ntalk like us and therefore must share the same feelings. Vegans absurdly\n&quot;imagine what it'd be like&quot; to live in industrial farming as if a\nchicken's birdbrain is having an existential crisis while living in a\ncage.</p>\n<h3 id=\"veganism-is-minimal-or-more-self-sufficient\">&quot;Veganism is minimal or more self-sufficient.&quot;</h3>\n<p>Vegans have been fruitlessly trying to meme this one on me for forever.\nStarvation and death is minimal, I suppose, so it is at least true in\nthat sense. <strong>Veganism is ultimately the diet of only eating inedible\ngarnish that looks &quot;good&quot; on Instagram.</strong></p>\n<p>Raising most animals is easier and more efficient than raising\nvegetables. If it's too hot, potatoes don't naturally know to go move\nto the shade. Yams don't eat your overgrown grass. Onions don't poop\nout fertilizer. Tomatoes can't pull a simple tractor. You can't skin\ndead okra and make leather out of it. You can't grind up old mustard to\nmake bonemeal (that's not just something in Minecraft, by the way).</p>\n<p>Animals are an absolutely necessary portion of any homestead in life and\ndeath. Listen, I like growing stuff. I like growing vegetables. But\nvegetables are just not real food... They are garnish. They are sides.\nThey are only enjoyable insofar as they elevate your enjoyment of real\nfood: meat.</p>\n<h3 id=\"veganism-is-more-efficient-or-environmental\">&quot;Veganism is more efficient or environmental.&quot;</h3>\n<p>People say that eating plants is more &quot;efficient&quot; because they saw an\nenergy pyramid diagram as a kid, which shows how many prey animals are\nneeded to maintain carnivorous animals. If we actually lived in a place\nwhere there was a calorie shortage, like a desert planet where greens\ncouldn't grow, that might be an issue. It frankly just isn't here.\nWe're not exactly running out of grass to feed cows. Most people are\nmowing their grass and throwing it away.</p>\n<p>There are people who make really absurd environmentalist arguments\nagainst meat as well, for example, methane from cows warms the globe.\nOkay. Fine. So what does Veganism do about that? Are Vegans going to\nkill the cows for us? Should we just let them starve in the woods since\nwe can't harvest them for meat or even milk? What about all the game we\nwon't be hunting? Those 50% of deer annually that we won't be\nkilling&mdash;won't they me causing pollution with the huge amount of\ncalories they need to frolic in the woods all days? Same will all other\ngame. Most of those arguments are cute just-so stories and they fall\napart after examination. Anyone can play that game.</p>\n<h2 id=\"lets-just-laugh-at-this-for-a-minute\">Let's just laugh at this for a minute...</h2>\n<p>Alright class, look at this commonly posted vegan meme and tell me why\nit's retarded:</p>\n\n<figure class=\"titleimg\"><a href=\"https://lukesmith.xyz/pix/vegan_protein.jpeg\"><img src=\"https://lukesmith.xyz/pix/vegan_protein.jpeg\" /></a></figure>\n\n<p>&quot;Per 100 calories&quot; shows a deception so insane you should laugh.\nWhoever made this image wants you to <em>believe</em> that the piece of steak\non the fork is equivalent to the tiny broccoli head on the right.</p>\n<p>You can compare the nutrition of both\n<a href=\"https://www.calorieking.com/us/en/foods/f/calories-in-fresh-or-dried-vegetables-broccoli-raw/uhZAljTASPuU9YnkyCZdFA\">broccoli</a>\nand\n<a href=\"https://www.calorieking.com/us/en/foods/f/calories-in-beef-ground-beef-80-lean-20-fat-pan-browned/MJPo9HnUSnGiV2-9eBsCBw\">beef</a>\nat those links yourself.</p>\n<p><strong>In order to get the protein in a single large bite of steak, you'll\nhave to eat more than half a pound of broccoli.</strong> Good luck. Now you\nknow why those poor impressionable girls who go vegan bloat up. And\nthat's only 100 calories. 2000 calorie diet? Have fun. If you're\nfamished, it's pretty easy to eat a big steak with 2000 calories\n(around a pound and a half of matter) and it will fill you up without\nany bloating or stomach pains. You'd have to eat <em>twelve pounds</em> more\nor less of broccoli or equivalent greens for that. And with all that\nfiber, you're going to just be pooping it all out.</p>\n<p>Honestly, the human disgust response will stop you way before that.\nIt's easy to eat a juicy steak without or without sauce, salt and\npepper, but you'd nearly have to put a gun to someone's head to make\nthem eat their daily 13 pounds of indigestible garnish.</p>\n<h2 id=\"noootruits-dont-actually-matter-anyway\">Noootruits don't actually matter anyway</h2>\n<blockquote>\n<p>&quot;Plants don't have over fifteen micro-nooootrients...&quot;\n&mdash;<a href=\"https://www.youtube.com/user/TheGenreDoesntMatter\">sv3rige</a>, at\nthe end of every video</p>\n</blockquote>\n<p>A lot of Vegan autism gets focused on replicating the consumption of\nknown nutrients and minerals using only plants. The image above, in\naddition to being deceptive is based on a flawed idea that human\nnutruition is about <em>consuming particular amounts of particular\nsubstances</em> as if we are a perfectly predictable machine or a videogame.\nThis <strong>isn't just a Vegan problem</strong>, basically everyone implicitly has\nthis idea.</p>\n<p>The reality is that those nutrients on the Nutrition Facts are a narrow\nrealm of what might actually be relevant for the complex organ of our\nbodies. Additionally, there are many types of proteins and vitamins and\nminerals that the back-of-the-box doesn't account for. The Vegan game\nof saying, &quot;we can get that too&quot; is utterly pointless when you realize\nwe have nowhere close to a full idea of how the human body works, only\nsome plausible theories about the relationships between certain\nnutrients and what they seem to do. As in the case of some nutrients,\nlike the falsely-maligned cholesterol is a good example of something two\ngenerations of people were told to fear and reduce only for us to later\nrealize that our ideas about how it interacted in the body were arguably\nliterally backwards.</p>", "link": "https://lukesmith.xyz/articles/veganism-is-the-pinnacle-of-bugmanism/", "date_published": "2021-02-11 00:00:00+00:00", "persistent": true, "user": null, "language": "en-US"}]