[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "Who REALLY OWNS Linux?", "description": "Wanna get your own Linux server? Visit https://www.linode.com/linuxexperiment for a 100$ credit ! \n\nGet your Linux desktop or laptop here: https://slimbook.es/en/\n\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nI also do a Gaming Podcast: https://www.youtube.com/channel/UCbRPZ11S1quJ4ESoj42A3ug\n\nJoin us on our new Discord server: https://discord.gg/xK7ukavWmQ\n\nTwitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\n\n00:00 Intro\n00:37 Sponsor: get 100$ on your Linux Server\n01:49 Who owns the Linux kernel?\n05:44 Do distros own anything, really?\n08:40 Does ownership even matter for open source?\n\n\n\nSo, first, let's talk about the Linux kernel. The code for the Linux kernel is licensed under the GPL v2,\nThis means that anyone can view, download, edit, and redistribute the Linux kernel source code, or an executable version of it.\nThis also means that no one can really own the Linux kernel, right?\n\nThat's both right, and wrong. No one person or entity owns the Linux kernel, but all its contributors do. Basically, every contributor retains the copyright for the code they've added to the Linux kernel, so it's owned by everyone who has ever contributed to it.\n\nMost changes are  generally decided by the person who's in charge of the project, namely, Linus Torvalds.\n\nHe's the creator of the Linux kernel, obviously, and while he doesn't OWN the entirety of the code of that kernel, he still owns the trademark for it. The name \"Linux\" isn't something you can use for your products as you want: it's held by the Linux mark Institute, and through that, by Linus Torvalds.\n\nIt IS possible to apply for a license to use the name, though, and it's free, so most big projects that want to use the name \"Linux\" in their communications, marketing, or product names, can do so without being too limited.\n\nThis gets more complicated. Linux, as in \"a linux based operating system\", is a stack of multiple open source projects.\n\nThere are hundreds of these operating systems, which we call \"distributions\", and each of these is owned by different structures.\n\nYou might know that Canonical is the Company behind Ubuntu, Red Hat is behind Fedora, Novell owns SUSE, but you might not know that a lot of other distros have a company behind them: elementary OS, Manjaro, or Zorin OS, for example.\n\nSome other distros aren't backed by a company, but still have trademarks, owned by the founders of the distributions, for example Arch Linux is a trademarked name, just as its logo is, and its slogan.\n\nMost distros use the Linux kernel, the GNU system tools, the X.org display server, or something based on the wayland protocol, and a desktop environment that another team develops. A lot of distributions don't develop their own specific software, and simply add a custom layout, theme, icons, and installer. A lot of distributions do contribute to the code of the various projects they ship, though.\n\nFor example, Ubuntu contributes code to GNOME, just like Fedora does.\n\nSince they mainly use code that's been written by other people, these distributions don't own that code: whatever the open source license used by the project, it's rare that it weaves copyright.", "link": "https://www.youtube.com/watch?v=zNx-L5_urMs", "date_published": "2021-12-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]