[{"source": "https://lukesmith.xyz/rss.xml", "title": "We Want Our 4 Causes Back!", "description": "<figure class=\"titleimg\"><img src=\"https://lukesmith.xyz/pix/aris_med.webp\" /><figcaption>Artistotle, a medieval depiction.</figcaption></figure>\n\n<p>Aristotle, in his <em>Physics</em> argued that there are four causes behind\neverything that exists. These causes answer the question of &quot;How&quot; or\n&quot;Why&quot; something is the way it is.</p>\n<dl>\n<dt>The Material Cause</dt>\n<dd>The material from which something is made. E.g. the stone of a\nstatue.</dd>\n<dt>The Efficient Cause</dt>\n<dd>The external force that causes something to be made. E.g. the\nartisan and his tools who make a statue.</dd>\n<dt>The Formal Cause</dt>\n<dd>The form or plan of the thing made that define it. E.g. the\nartisan's written or thought blueprints or sketch of plans for how\nto make the statue.</dd>\n<dt>The Final Cause</dt>\n<dd>The goal and reason of the thing. E.g. the purpose for which the\nartisan is making the statue.</dd>\n</dl>\n<p>If the statue lacks any one of the four causes, it will not be made.</p>\n<h2 id=\"the-demise-of-the-formal-and-final-causes\">The Demise of the Formal and Final Causes</h2>\n<p>If you want to point your finger at a single philosophical change that\ndefines the shift from the Aristotelean worldview of antiquity and the\nMiddle Ages to the materialism of modernity, it is the rejection of the\nFormal and Final Causes in the early Enlightenment.</p>\n<p>Just ask your modern brain: &quot;Does everything <em>really</em> have a purpose?&quot;\nYou will probably reflexively think back &quot;No,&quot; therefore, you do not\nbelieve in a Final Cause to everything. The same is true of the Formal\nCause, both of them seeming to assume that there is a kind of conscious\nagency behind the action. That isn't strictly speaking how Aristotle\nintended them, but that's how they are interpreted through modern\ngoggles.</p>\n<p>You can see their rejection as early as the 1600's: Francis Bacon in\n<em>Novum Organum</em> pushed aside the Final Cause as only being only suitable\nfor inter-human behavior. The Formal Cause, he dismissed merely as\n<em>desperata</em> &quot;hopeless.&quot; He actually dismissed the vocabulary of the\nother two causes as being superficial and an irrelevant distinction too,\nbut philosophically, they are still retained in his philosophy by other\nterms.</p>\n<p>In any case, modern people do not believe in Final and Formal Causes, or\nif they do, not for everything in the cosmos. For Aquinas and others in\nthe Aristotelean world, the question of whether the universe has a\npurpose or a formal plan is a kind of tautology. Of course it does!\nEverything non-random does in Aristotelianism.</p>\n<h2 id=\"the-final-cause-in-nature\">The Final Cause in Nature?</h2>\n<p>Now our post-materialist view of the Final Cause is sort of different\nfrom Aristotle's original view. We have to remember that Aristotle\nviewed grammar and cognition as something that in some way was directly\nreflective of reality itself. Compare this view shared with the\nso-called &quot;Speculative Grammarians&quot; of the Middle Ages,\n&quot;speculative&quot; coming from the Latin word <em>speculum</em> &quot;mirror&quot;, since\ngrammar reflects reality. This common strand stretches from Aristotle to\nthose influenced by his work like Priscian and Bacon (Roger (who was\nbased), not Francis (who was p. cringe)).</p>\n<p>Nowadays we atomize questions like &quot;Why&quot; to the point that even\ncausality itself doesn't mean anything and is a mere human cognitive\nconvention, but for Aristotle, the linguistic existence of &quot;Why&quot;\nquestions means that there is a legitimate logical equivalent to &quot;Why&quot;\nin reality.</p>\n<p>Aristotle originally had argued that it is appropriate to refer to the\nFinal Cause of something whenever it is not due to randomness or\nspontaneity. The example he uses is the growth of human teeth: there is\nno variance in where the molar and incisors grow within the human mouth.\nEverything appears where it's &quot;supposed to&quot; and we can assume that\nthere is some kind of Final Cause behind this.</p>\n<p>If different shapes and sizes teeth grew in different locations of the\nmouth, then it would be appropriate to talk of them as lacking a Final\nCause. Things that appear randomly and inconsistently do not necessarily\nhave Final Causes, but if something happens invariably, we can trust\nthat it has a Final Cause.</p>\n<h2 id=\"darwin-got-it-wrong-too\">Darwin &quot;Got It Wrong&quot; too?</h2>\n\n<figure class=\"resright\"><img src=\"https://lukesmith.xyz/pix/wdgw.jpg\" /></figure>\n\n<p>So how far are moderns willing to take the rejection of the Formal and\nFinal Causes?</p>\n<p>One of my old Ph.D. advisors, Massimo Piatelli-Palmarini wrote a book\nwith Jerry Fodor called <em>What Darwin Got Wrong</em>. You can withhold your\nkneejerk reactions; it's not a creationist book or anything, but it\nalmost ended up being as controversial&mdash;it's a critique of Darwinian\nnatural selection on &quot;philosophic&quot; grounds.</p>\n<p>I will stultify one of the main arguments for brevity's sake: &quot;How can\nwe reasonably talk about evolution as a goal oriented process when we\nhave admitted already that speaking of Final Causes is illegitimate?&quot;\nMassimo and Fodor do not use the Aristotelian terms, (instead they talk\nof Gould's spandrels) but that's what they mean.</p>\n<h3 id=\"evolution-would-only-have-been-scientific-in-medieval-europe\">Evolution would only have been &quot;scientific&quot; in Medieval Europe.</h3>\n<p>Darwinian natural selection is actually a kind of cheat idea for\nmaterialism. In order to understand how humans have arisen from common\ndescent with other animals, we <em>want</em> to have a narrative of why we\nspeak, why we are bipedal, why our bodies are mostly hairless, etc. etc.\nNatural selection offers an answer without reference to a conscious\nincremental designer (God), but it smuggles back in the Final Cause:\n&quot;<em>This</em> evolved to do <em>that</em>.&quot;</p>\n<p>But if we actually limit ourselves from talking in\npurpose-driven/Final-Cause statements, the most communicative\n&quot;scientific&quot; thing we can say is &quot;Humans share a common ancestor with\nother animals, but we became different.&quot; The issue of &quot;Why&quot; is\ndreaded &quot;metaphysics.&quot; In truth, <strong>we actually <em>need</em> a Final Cause to\nunderstand anything.</strong> The Final Cause, as Aristotle notes, is really\nthe most important cause, because understanding it is key to\nunderstanding something in its greater context. <strong>Understanding\nsomething intuitively largely amounts to knowing its Final Cause.</strong>\nDarwinism came to be accepted as a theory because it cleverly smuggled\nin illegal metaphysics that we were having withdrawal symptoms for. When\nyou really think about it, this totally withdraws Darwinian selection\nfrom the ledger of supposedly scientific topics if you took such\nstandards seriously (I don't).</p>\n<p>The funny thing is that people can easily be made to become\nhyper-material anti-metaphysicians or lax on everything depending on\ncircumstances. Fodor and Massimo partially wrote their book as a critic\nof &quot;adaptationism&quot; and evolutionary psychology, which were and still\nare bugaboos to the political left because they seek to explain minutiae\nof human social life, including hot-button issues like gender\ndifferences and race, in the light of Darwinian natural selection.\nLeftists like Gould and Lewontin would dismiss such explanations as\n&quot;just-so stories,&quot; as would science-popularizers and the press, but\nFodor and Massimo argue that this is an argument you cannot avoid\ngeneralizing once you make it. It applies to all of evolution: if it is\nphilosophically illegitimate to talk about human sexual dimorphism\nbecause that reads a Final Causes into evolution, then it is equally\nillegitimate to talk about any other kind of change as being purpose\ndriven by &quot;selection.&quot;</p>\n<p>This book was received with mostly hostile confusion by the mainstream\npress and I suspect most biologists which mostly missed the argument and\nwere languishing in the culture wars of the Bush Years. Mind you, I\ndon't <em>agree</em> with the book, but it's mostly because I don't care to\nendorse this kind of materialism, but most people do indeed at least\nclaim to abide by it, so these arguments would be important to address\nfor them.</p>\n<h3 id=\"just-a-linguistic-argument\">Just a &quot;linguistic&quot; argument?</h3>\n<p>At the end of it, any evolutionary biologist will be tempted to throw up\ntheir hands and say &quot;So what‽&quot; to that philosophical objection. After\nall, it sure feels like some kind of technicality or argument from the\nway we linguistically <em>talk</em> about evolution. <strong>And they're right!</strong> In\ntruth, Darwinian evolution is a useful theory <em>specifically because</em> it\nis a method of giving us a Final Cause for gradual evolutionary changes.\nThat's the whole point afterall. If it didn't give us a Final Cause,\nit wouldn't be an explanation. Striking the Formal Cause from\nscientific vocabulary is only a recipe for the typical postivistic\nscience status quo of denying any &quot;metaphysics&quot; to your science while\njust tacitly assuming it all.</p>\n<h2 id=\"return-of-the-formal-cause\">Return of the Formal Cause?</h2>\n\n<figure class=\"resright\"><img src=\"https://lukesmith.xyz/pix/jellyfish.jpg\" /></figure>\n\n<p>What about the Formal Cause? That is, what about the idea that\neverything must have a form/plan behind its creation? If we are willing\nto concede that a <em>Final Cause</em> can arise from natural selection, what\nabout a Formal Cause?</p>\n<p>While I'm on Fodor and Massimo's book (who again, are not talking in\nAristotelian terms themselves), they actually do end up resuscitating the\nFormal Cause as well, albeit in a more purposeful way. While the book\nbeats around the bush, I can say that in my conversations with Massimo\nat Arizona, he really does think of evolution as not being an issue of\nnatural selection. Instead he (and Noam Chomsky as well) has the view\nthat complex features in biology evolve from in-built genetic parameters\nwhose complex interactions can also produce fully-formed design. This is\nthe kernel of Minimalism in linguistics.</p>\n<p>Now in presentations, Massimo always loves to talk about those species\nof jellyfish which with a single simple genetic change, develop highly\ncomplicated proto-eyes even without a direct need. <a href=\"https://www.pnas.org/content/107/32/14263\">One minor genetic\ndevelopment</a> can produce\nstructure as complicated as a primitive eye. This is not uncommon in\nbiology because many complex structures are simple derivatives of simple\nprinciples. The general name for this is <em>emergent properties</em> and\nare said to be based on so-called <em>Laws of Form</em>.</p>\n<p>Laws of Form are actually a big topic of conversation in linguistics\nnowadays, Chomsky's idea approaching the idea that one single and very\nsimple cognitive change could be enough to produce the human language\nfaculty. (This is totally contrary to the pop-idea of language abilities\nslowly arising from behavioristic cave-man grunting complexifying over\ncenturies).</p>\n<p>It should be obvious that Laws of Form, Fibonacci spirals, golden\nratios, apparent ordering and other emergent properties arise naturally\nfrom the universe without the obvious need of conscious planning. This\nis not a rejection of the Formal Cause, but states the truth that it is\nuniversal. &quot;Form&quot; needn't just be a conscious plan like the\nsculptor's plan for a hunk of marble, but a form that emerges from\nnatural principles.</p>\n<h2 id=\"even-a-materialistic-universe-generates-formal-and-final-causes\">Even a Materialistic Universe Generates Formal and Final Causes</h2>\n<p>In trying to escape the Formal and Final Causes, modern science has\nreally made them more irreplaceable. Laws of Form emerge from very\nsimple computational operations and define the formal structure of\nthings that arise in nature. At the same time, any kind of selective\npressure or survival mechanism like Darwinian selection will naturally\nproduce structure arranged to a goal. Understanding anything is quite\nimpossible without referring to its Formal and Final Causes.</p>\n<p>For the Aristotelian up until Newton (the last of the magicians in J.M.\nKeynes' terms), this is us <em>uncovering the Mind of God</em>. While words\nlike &quot;God&quot; make moderns queasy, it's legitimate to ask why the Formal\nand Final Causes as concepts should. Final Causes are by definition\nuniversal where unchecked spontaneity occurs. A conscious human mind is\nnot a prerequisite for them, neither for Formal Causes.</p>\n<p>You actually can keep even a very clumsy materialism while accepting\nthese traditional notions. Indeed, to understand something's Final and\nFormal Causes is to truly understand it such that the Material and\nEfficient Causes seem like mere details.</p>", "link": "https://lukesmith.xyz/articles/we-want-our-4-causes-back/", "date_published": "2021-02-13 00:00:00+00:00", "persistent": false, "user": null, "language": null}, {"source": "https://lukesmith.xyz/rss.xml", "title": "Wanna Learn LaTeX?", "description": "<figure class=\"titleimg\"><img src=\"https://lukesmith.xyz/pix/animalibus.png\" /></figure>\n\n<h2 id=\"table-of-contents\">Table of Contents</h2>\n<ol>\n<li><a href=\"https://lukesmith.xyz/rss.xml#intro\">What is LaTeX?</a></li>\n<li><a href=\"https://lukesmith.xyz/rss.xml#install\">Installing LaTeX</a></li>\n<li><a href=\"https://lukesmith.xyz/rss.xml#tutorials\">LaTeX Video Tutorials</a></li>\n</ol>\n<p><strong>I have a full video tutorial series on learning LaTeX, broken into\nsmall sensible parts,\n<a href=\"https://videos.lukesmith.xyz/videos/watch/playlist/48a02be8-115a-4842-9ebf-6e3c6245f290\">here</a>.</strong></p>\n<h2 id=\"intro\">What is LaTeX?</h2>\n<p>Basically, it's how big boys write and format documents. Every public\nbrief, scientific article, book, cryptocurrency whitepaper or even\noutline written by people who know what they're doing is written in\nLaTeX.</p>\n<p>If you want to see examples of documents made with LaTeX, you can see\n<a href=\"https://lukesmith.xyz/dox/luke_thesis.pdf\">my Master's thesis here</a> or <a href=\"https://lukesmith.xyz/dox/prelim2.pdf\">another\npaper here</a> that shows some diagrams and\nother features you can have in LaTeX. Of course, LaTeX documents can be\ninfinitely customized.</p>\n\n<figure class=\"titleimg\"><img src=\"https://lukesmith.xyz/pix/write.gif\" /></figure>\n\n<h3 id=\"is-it-hard\">&quot;Is it hard?&quot;</h3>\n<p>No. It's sort of like learning vim. People complain about how hard it\nis until they take the bare minimum of time to learn it and realize how\nmuch more effective they are with it. The return on investment is\nmassive. I wrote the thesis above in LaTeX in around a week of learning\nfrom the bare minimum.</p>\n<h3 id=\"how-is-latex-different\">&quot;How is LaTeX different?&quot;</h3>\n<p>LaTeX is a markup language, meaning that you write documents in whatever\ntext editor of your choosing and instead of manually moving margins and\nplacing things yourself, everything is optimally placed when you compile\nthe document into a .pdf.</p>\n<p>Markup languages are great because they separate the task of writing\nfrom the task of formatting. It's somewhat similar to the difference\nbetween HTML (a markup language) and CSS (which does styling) and\nJavascript (which does scripting). LaTeX does the equivalent of all\nthree, but it allows you to do them all separately so you can easily\nextend documents.</p>\n<h3 id=\"why-is-latex-better-than-microsoft-word-and-friends\">&quot;Why is LaTeX better than Microsoft Word and friends?&quot;</h3>\n<ul>\n<li>Bibliographies are done <em>totally automatically</em>. For all the\nresearch papers I've written in the past 5 years, I have never\nwritten a bibliography page. You just tell LaTeX, &quot;Oh, APA style,\nplease&quot; and it's done.</li>\n<li>Section/page numbering and cross referencing is done automatically.\nThat means if you refer people to a chart on page 52 multiple times\nor figure 5 or chapter 4, then you move pages or figures or chapters\naround, the references continues to refer to the page, figure or\nchapter you originally meant. That also means you can literally copy\nand paste text out of your document into a larger document and LaTeX\nwill automatically reconfigure all cross-referenced numbers to be\ncorrectly referring to what you actually want them pointing to.</li>\n<li>Text can easily be copied to a new format. I've written many term\npapers that latter became monographs or books and with LaTeX, you\ncan just copy the raw text and it takes on the formatting of the\ndocument it is inside of.</li>\n<li>It is scriptable. You can use coreutilities and other programs to\nsearch, modify and move text. This seems <em>useless</em> if you've never\ndone it, but it makes a world of difference when you realize you\ncan. You could use this, for example, to automatically take customer\ninformation on your computer and automatically-generate professional\nitemized invoices in LaTeX or the like. Also, being able to use\n<code>sed -i</code> and <code>grep</code> with <code>.tex</code> files is fantastic.</li>\n<li>For more advanced users, LaTeX is more than a markup language too:\nand also has basic logic and tests (if statements and the like) that\nallow you to react dynamically to unknown content.</li>\n<li>You can write LaTeX in literally anything. I write it in vim for its\nextensibility, but you can easily design your own workflow, instead\nof having to rely on the ever-changing idiosyncracies of Microsoft\nWord.</li>\n</ul>\n<h4 id=\"but-word-has-some-of-those-things\">&quot;But Word has some of those things!&quot;</h4>\n<p>Niche features that basically no Word-user uses. Also they change with\nevery new update. This is the primary operating structure of LaTeX.</p>\n<h2 id=\"install\">Installing LaTeX</h2>\n<p>The core LaTeX package (<code>texlive</code>) is fairly small, but I highly\nrecommend you download <em>all</em> the LaTeX packages out there at the\nbeginning (a big download). This is nice because as you learn more\nthings, you won't have to manually download new packages. You'll be\nable to experiment with new LaTeX abilities through new packages\nseamlessly. Here's how you get them:</p>\n<ul>\n<li>GNU/Linux\n<ul>\n<li>Arch-based (Artix, Manjaro, Parabola):\n<code>pacman -S texlive-most texlive-lang</code></li>\n<li>Debian-based (Ubuntu/Linux Mint): <code>apt-get install texlive-full</code></li>\n<li>Some distros (like Void) use <code>tlmgr</code> to install TeX packages\ninstead of the main package manager.</li>\n</ul>\n</li>\n<li>Windows:\n<a href=\"https://miktex.org/download/#collapse264\">Here</a>.\n(Choose the net install to be able to install all packages.)</li>\n<li>MacOS: <a href=\"https://tug.org/mactex/\">Here</a>.</li>\n</ul>\n<p>Once you've downloaded and installed that, you have a fully-featured\nLaTeX engine on your machine! You can make lots of amazing things that\nyou don't even fully realize yet.</p>\n<h2 id=\"tutorials\">LaTeX Video Tutorials</h2>\n<h3 id=\"basics\">Basics</h3>\n<p>First thing to learn is how to compile documents with <code>pdflatex</code> and the\nbasic principles of the TeX lanugage. In this first video, I talk about\nhow basic text, paragraphs, titles, headings and more work. This in\nitself is enough to make a professional write-up.</p>\n<details>\n    Click to reveal video.\n\n\n</details>\n\n<h3 id=\"numbering-and-cross-referencing\">Numbering and cross-referencing</h3>\n<p>As you make more complex documents, you'll want to automatically number\nand interrelate section, figure and other numbers together. LaTeX makes\nthis super simple, and make it even easier to copy your file into a new\nfile where it will automatically update all cross-referenced numbers.</p>\n<details>\n    Click to reveal video.\n\n\n</details>\n\n<h3 id=\"bibliographies-with-biber-and-biblatex\">Bibliographies with Biber and BibLaTeX</h3>\n<p>Bibliography management is a huge plus in LaTeX through biber. I\nhaven't written a bibliography in more than half a decade due to the\nfact that LaTeX only needs a bibliography file of metadata and\nautogenerates citations for any needed source.</p>\n<details>\n    Click to reveal video.\n\n\n</details>\n\n<h3 id=\"images-and-figures\">Images and Figures</h3>\n<p>TeX isn't all text either. You can insert and nicely format images in a\nway that they are optimally placed without too much human interference.</p>\n<details>\n    Click to reveal video.\n\n\n</details>\n\n<h3 id=\"macros-to-make-things-easy\">Macros to make things easy</h3>\n<p>As you do more specific things, you might want to make your own macros\nand functions. This really makes things easier, and you can do very\ncomplex things very elegantly.</p>\n<details>\n    Click to reveal video.\n\n\n</details>\n\n<h3 id=\"slide-presentations-with-beamer\">Slide Presentations with Beamer</h3>\n<p>LaTeX isn't <em>just</em> for printable documents either. You can change your\ndocument into a Beamer presentation, allowing you to present it as a\nslide show similar to Microsoft PowerPoint's.</p>\n<details>\n    Click to reveal video.\n\n\n</details>\n\n<h3 id=\"making-a-professional-résumé\">Making a Professional Résumé</h3>\n<p>Here, I also give some extra pointers while I make a résumé.</p>\n<h4 id=\"part-1\">Part 1</h4>\n<details>\n    Click to reveal video.\n\n\n</details>\n\n<h4 id=\"part-2\">Part 2</h4>\n<details>\n    Click to reveal video.\n\n\n</details>", "link": "https://lukesmith.xyz/articles/wanna-learn-latex/", "date_published": "2021-02-12 00:00:00+00:00", "persistent": false, "user": null, "language": null}]