[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Pastor T.L. Barrett & the Royal Voices Of Life: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nMitra Arthur | September 9, 2021\nPastor T.L. Barrett comes to this Tiny Desk (home) concert from his spiritual home, the Chicago church he has pastored for over 40 years. His choir, the Royal Voices of Life, and the band are positioned in front of a dazzlingly lit stained glass window. A tambourine is at the ready. The sight is familiar to anyone familiar with churches that anchor their neighborhood.\n\nStarting in 1971, Pastor Barrett released a series of albums that integrated soul and funk elements, all backed by a 45-member ensemble. Some of those former youths still perform with him today. At one point, his congregation included Donny Hathaway and members of Earth, Wind & Fire. Barrett's music has had a resurgence of late — his records have been sampled by Kanye West and DJ Khaled, songs have been featured in movies and commercials, and the label Numero Group will soon release a career-spanning box set.\n\nPastor Barrett opens this Tiny Desk (home) concert with \"I Shall Wear a Crown,\" reminding the choir, \"Let the people know you like it!\" His most well-known song, \"Like a Ship,\" retains the groove of the 1971 original; the song encourages that, despite the pain, you can shake it. In the rolling, soul-drenched take on \"Nobody Knows,\" Barrett cautions: \"This is a mean world to try to live in / But you've got to stay ahead until you die.\" A church member sitting in the front pew, decked out in a wide brim hat, raises her hands in praise. This is not a concert; this is worship.\n\nSET LIST\n\"I Shall Wear A Crown\"\n\"Like A Ship\"\n\"Nobody Knows\"\n\nMUSICIANS\nPastor T.L. Barrett: vocals & piano\nWayne Barrett: lead guitar\nCarlos Patterson: organ\nTimothy Fullerton: bass guitar\nQuinn Anderson: drums\nMinister Ykheera, Minister Jahaira, Vera Sharp: choir (sopranos)\nDeborah Thomas, Barbara Blake, Doresse Scott, Rosalind Thomas, Steve Lucas, T.L. Barrett, III: choir (tenors)\nChristine Robinson, Ceceria Robinson, Jeanette Reynolds, Michele Marshal, Zelma Evans: choir (altos)\n\nCREDITS\nVideo and Editing: Adam Luksetich\nCameras: Alex Pennacchia, Chris Vanderwall, Ed Bornstein\nProducers: Stephen Arndt, Rob Sevier, Ken Shipley, Ed Bornstein\nAudio: Kenneth Klemaier\nMusic Director: Dwayne Barrett\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bobby Carter, Kara Frame, Gabrielle Pierre\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #pastortlbarrett", "link": "https://www.youtube.com/watch?v=2nFGD1-cmns", "date_published": "2021-09-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Yebba: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nBobby Carter | September 8, 2021\nAs the camera slowly rises to the room, we see Yebba in the center of a circle, complete with band members, background singers and a string quartet. The room is part of Electric Lady Studios, where her debut album, Dawn, was recorded. The album bears the name of Yebba's mother, whom she tragically lost in 2016, and its songs find the Memphis native delving inward to process it all.\n\nThe singer is a bit of a live wire, rarely giving the same performance twice, and that's on display during most of this Tiny Desk (home) concert. The songs differ slightly or not so little compared to the studio sessions from Dawn, especially on the swelling interpretation of the lead single, \"Distance.\" In between each song, Yebba shares unfocused and playful banter that just feels like she's family, and that feeling persists throughout this entire set, right down to the eye contact she shares with keyboardist and co-writer James Francies when speaking candidly about the final song, \"How Many Years.\"\n\nThis Tiny Desk concert has been in the works since the spring of 2020, when the album was completed but shelved until Yebba (and the rest of the world) was in a better place. It was worth the wait.\n\nSET LIST\n\"Stand\"\n\"Distance\"\n\"All I Ever Wanted\"\n\"How Many Years\"\n\nMUSICIANS\nYebba: vocals\nJames Francies: keys\nBurniss Travis: bass\nStro Elliot: MPC drums\nCharles Myers: guitar\nNiya Norwood: vocals\nSchadrack Pierre: vocals\nBrandon Pain: vocals\nMarta Bagratuni: cello\nFrancesca Dardani: violin\nSulamit Gorski: violin\nNicole Wright: viola \n\nCREDITS\nProducer: Abbey Smith \nVideo: Andy Swartz, Bo Zhang, Ina Ubaite \nAudio: Gosha Usov, Brandon Bost\nAssistant Engineers: John Muller, Daniel Perez\nGaffer: AJ Holden\nKey Grip: Hunter Herrick\n\"A\" Camera Operator: Andy Poland\n1st Assistant Camera: Rob Ko\n\"B\" Camera Operator: Alan Jensen\nDolly Grip: Tom Sarvello\nElectric: Greg Deseve\nProduction Assistant: Styven Jeune\nManagement: Ross Michaels, David Lai, Ina Ubaite\n\nTINY DESK TEAM\nProducer: Bobby Carter\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Kara Frame, Gabrielle Pierre\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #yebba", "link": "https://www.youtube.com/watch?v=aBMGvHHkr9Y", "date_published": "2021-09-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]