[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Deathloop’s Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of Deathloop, including a pair of pistols that transform into a submachine gun, a shotgun with 2 magazines, and Colt’s trusty sidearm, the Limp-10.\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of Deathloop and compares them to their real-life counterparts.\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020", "link": "https://www.youtube.com/watch?v=E9UmB3r1Cf8", "date_published": "2021-10-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "God of War: Ragnarok Was Delayed - We Know Why | GameSpot News", "description": "The reason behind God of War: Ragnarok’s delay was revealed by the game’s voice actor Christopher Judge. The rumored GTA remastered collection is rated ahead of any official reveal or announcement. Sony acquires Bluepoint Studio and adds to its ever growing collection of first party studios.\n\nTimestamps:\n00:00 - Intro\n00:31 - God of War: Ragnarok Delayed\n01:00 - Geoff Keighley Announces TGA 2021\n01:41 - GTA Remastered Collection Gets Rating\n02:28 - Sony Acquires Blue Point Games\n\n#godofwar #ragnarok", "link": "https://www.youtube.com/watch?v=AknSSgWTLJc", "date_published": "2021-10-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New Metal Gear, Silent Hill, and Castlevania Games? | GameSpot News", "description": "In today’s GameSpot News, Konami might be working on new Metal Gear, Silent Hill, and Castlevania games, the PS5 now has an 8K game but with a catch, and the Stranger of Paradise demo is out now.\n\nIn this video, Persia talks about a recent report of Konami making new installments and remakes in some of its franchises such as Metal Gear, Castlevania, and Silent Hill. All of these new projects are said to be announced in 2022. \n\nPersia also goes over the only game to currently offer 8K on PS5, except there’s a catch. While The Touryst renders internally at 8K resolution, the PS5 doesn't actually support that output over HDMI 2.1 and the developer Shin'en Multimedia is using an extreme supersampling technique to downsample every pixel on any connected 4K TV. \n\nLastly, Team Ninja's new Final Fantasy game, Stranger of Paradise: Final Fantasy Origin, will launch in March 2022. A second demo is now available for PS5 and Xbox Series X and S. \n\nFor more information on all of these topics, please visit gamespot.com.\n\nTIMESTAMPS:\nIntro - 00:00\nKonami working on new Metal Gear, Silent Hill, and Castlevania games? - 00:15\nThe PS5 finally has an 8K game, but there's a catch - 01:14\nStranger of Paradise: Final Fantasy Origin demo out now - 02:27\nOutro - 03:14", "link": "https://www.youtube.com/watch?v=ilRlsdW_jZ4", "date_published": "2021-10-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New World Ultimate Beginner’s Guide", "description": "In this New World beginner’s guide, we give tips for fast leveling, making the most of gear in and out of combat, as well as how to make the most of trade skills.   \n\nNew World is an MMORPG from Amazon Games set on the mythical island of Aeternum. For thousands of years explorers have ventured to the island in search of its mysterious resource known as Azoth. This substance grants power and eternal life but often at a cost and has led to the corruption of the island as well as the island’s former masters to nearly go extinct. \n\nIn this video, DeVante talks about all the important things a beginner should know about New World before they start playing. He breaks down ways to maximize XP gain in order to level up faster as well as how to cut down on travel time in games. Later in the video, DeVante details New World’s combat, weapons, damage types and armor sets as well as discussing tips for trade skills like gathering and crafting.  \n\nNew World released for PC on September 28, 2021 and is now available via Amazon or Steam. \n\nTIME STAMPS\n00:00 - Intro\n00:49 - Early Questing  / Leveling Fast\n08:24 - Combat, Armor & Weapons\n12:18 - Trade Skills\n13:44 - Outro", "link": "https://www.youtube.com/watch?v=zbkybKHyew8", "date_published": "2021-10-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "SQUARE ENIX PRESENTS TGS2021 with (English subtitles）", "description": "Watch the  SQUARE ENIX PRESENTS TGS2021 for the latest news about our upcoming titles, along with the pre-announced information.\n\nLearn more about Actraiser Renaissance, Chocobo GP, FINAL FANTASY VII THE FIRST SOLDIER, FORSPOKEN, Marvel's Guardians of the Galaxy, STRANGER OF PARADISE FINAL FANTASY ORIGIN, TRIANGLE STRATEGY, Voice of Cards: The Isle Dragon Roars.\n\n#TGS", "link": "https://www.youtube.com/watch?v=ayzMeSaAixc", "date_published": "2021-10-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Square Enix Presents TGS 2021 Livestream", "description": "Tune in for SQUARE ENIX PRESENTS TGS2021 will give you the latest news about our upcoming titles, along with the pre-announced information.\n\nLearn more about Actraiser Renaissance, Chocobo GP, FINAL FANTASY VII THE FIRST SOLDIER, FORSPOKEN, Marvel's Guardians of the Galaxy, STRANGER OF PARADISE FINAL FANTASY ORIGIN, TRIANGLE STRATEGY, Voice of Cards: The Isle Dragon Roars.\n\n#TGS", "link": "https://www.youtube.com/watch?v=mpzBp7qrBKM", "date_published": "2021-10-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Stranger Of Paradise: Final Fantasy Origin Hands-On Preview", "description": "We played the second demo for Stranger of Paradise: Final Fantasy Origin, which shows off the game's extensive job system and takes players to a new mission.\n\nOne of the most notable and exciting things about Final Fantasy VII Remake was the way it updated the original game's combat system, merging the feeling of menu-based commands and action game controls. Stranger of Paradise: Final Fantasy Origin does something similar with a take on the jobs system that's a big part of Final Fantasy's history. The ability to switch between combat roles on the fly allows for a whole lot of interesting versatility, adding tactical considerations to protagonist Jack's angry shouting, slashing, and headbutting.\n\nWe recently got a chance to go hands-on with the second playable demo of Stranger of Paradise ahead of its release. This new look at the game includes everything that was in the first demo, with some added story context. It also included another section that gives a sense of Final Fantasy Origins' take on the series and how expansive the job system really is, as well as how the gear systems and mission-based approach seem like they'll work on a large scale.\n\n#strangerofparadise #finalfantasyorigin", "link": "https://www.youtube.com/watch?v=WM-rS3sFSqs", "date_published": "2021-10-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Elder Scrolls Online: Deadlands DLC Reveal Livestream", "description": "Tune to the ESO Gates of Oblivion Year-End stream at 1pm PT / 4pm ET and see the reveal of the latest DLC, Deadlands.", "link": "https://www.youtube.com/watch?v=VUKbP7pvx8s", "date_published": "2021-10-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]