[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "5 Secrets From the Elden Ring Network Test", "description": "Like Dark Souls, Demon's Souls, Bloodborne, and Sekiro before it, Elden Ring is filled with secrets. Even within this small taste of the Elden Ring Network Test, there were plenty of Elden Ring Secrets to discover. So, join Dave Klein of DaveControl as he goes over some of his favorite Elden Ring secrets he was able to find.\n\n0:00 - Intro\n0:29 - Spirit Tracks\n1:35 - Dragon Heart and Dragon Communion\n3:46 - A Glint in the Rock\n4:04 - Boc, the NPC\n5:24 - Pumpkin Head", "link": "https://www.youtube.com/watch?v=lM1IygouClU", "date_published": "2021-11-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Mass Effect Legendary Edition Coming Soon To Xbox Game Pass? | GameSpot News", "description": "In today’s GameSpot News, Persia talks about Mass Effect Legendary Edition possibly coming to Xbox Game Pass, some fighting game announcements, and more.\n\nAccording to Polish website XGP, and reported by VGC, the Mass Effect Legendary Edition might be heading to Xbox Game Pass as early as this week, according to an apparently accidental listing on the Xbox Store. \n\nLater in the video, Persia talks about some recent fighting game news starting with Riot Games revealing more information on Project L, a 2D fighting game set in Runeterra. As an assist-based fighter, players will build a team of two different champions that they can switch between during a match, and the game will reward \"strategic team building, on the fly decision-making, and strong fighting fundamentals.\"\n\nPeria also covers the addition of Ryu, Chun-Li, and Akuma from Street Fighter crossing over with Ubisoft's free-to-play fighting game Brawlhalla. This is the latest set of characters announces as a part of Brawlhalla's \"epic crossovers\" event.\n\nFor more information on all of our topics, please visit gamespot.com.", "link": "https://www.youtube.com/watch?v=3MrwTtlwkuU", "date_published": "2021-11-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Why Halo 3: ODST Is The Best Halo Game", "description": "From Halo: Combat Evolved to Halo Infinite, Xbox’s biggest franchise has been defined by battle rifles, explosions, and murdering Elites. Yet in 2009, Bungie delivered a more somber FPS experience with Halo 3: ODST. And, for producer Jessie Earl, Halo 3: ODST is far and away the best campaign in the entire Halo franchise. \n\nYes, better than Halo 2, Halo Reach, or especially Halo 5: Guardians. \n\nHalo 3 ODST is the game that should not be. Not only is ODST a complete tonal shift for the franchise, focusing on a more somber, small stakes story, it was also created out of the ashes of a completely different Halo project and made in basically a single year. This game should be a complete mess.\n\nYet, instead Bungie’s Halo 3: ODST is a masterclass in tone, storytelling, and game design that resonates, even more, today than it did back when it was released. So let’s break down why this underappreciated gem still holds up amidst its blockbuster siblings.\n\nAnd, if you want to see our full Halo Ranking from everyone at Gamespot, check out this video: https://youtu.be/YWTvIuHCgUE", "link": "https://www.youtube.com/watch?v=4Hw58JxXj-I", "date_published": "2021-11-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 - Top 11 Things We Had To Test", "description": "Want to know if healing darts can kill, if you can drop a supply crate on an enemy, if Dozer’s shield can eat a rocket, or if there’s backblast in Battlefield 2042? Join us for the top things we had to test, some of it might surprise you.", "link": "https://www.youtube.com/watch?v=NLQf4IxKU7o", "date_published": "2021-11-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]