[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Zelda BOTW Expert Reacts To Viral Reddit Clips", "description": "Max “RinHara5aki” Blumenthal with over 2300+ hours experience with Breath of the Wild combat, reacts and breaks down the complexity of some of the game's most viral Reddit clips. \n\nBe sure to also check out Max's breakdown of high-level BOTW combat: https://youtu.be/99iUK141o2o\n\nBreath of the Wild's complex mechanics and overlapping intricacies led players to push the game's boundaries, resulting in several gameplay clips that took the internet by storm. Some of these are so complex, it's hard for the average player to decipher exactly what's even happening. \n\nIn the above video, Max, our in-house BOTW expert, reacts to some of the most viral BOTW clips, and breaks down how techniques like Wind Bombs, Crouch Cancels, Bomb Flips, and many others are used to accomplish some of these mind-boggling clips.\n\nAs Peter Brown stated in The Legend of Zelda: Breath of the Wild’s review back in 2017, \"Given the myriad enemies and weapons you're up against, mastery feels almost unattainable even with substantial practice. However, that also means you are constantly learning in the face of unforeseen challenges.\"", "link": "https://www.youtube.com/watch?v=8LntT_fN_74", "date_published": "2021-02-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "We Found Master Chief In Cyberpunk 2077: Worst Way To Play Ep. 2", "description": "Jake and Rob return to boot up the Xbox One disc with the 1.0 version of Cyberpunk 2077, continuing their journey to try and beat the game through the bugs and glitches.\n\nRound 2! Jake and Rob fight through Cyberpunk 2077 bugs and glitches as they attempt to play through the game on a base Xbox One, with no updates--version 1.0 all the way!\n\nAs you’re probably well aware of by now, CD Projekt Red’s role-playing game has had an infamously rocky launch.Over time it has been patched and updated, but we’re ignoring all that to go back to vanilla experience to showcase how this game was shipped on day one.\n\nIn order to do so, Jake and Rob have declined updates to the Xbox One disc version of Cyberpunk 2077 so they can live life on the edge. What you’ll witness in this video are immersion shattering bugs, game and loading stuttering, texture pop-ins, and unresponsive A.I.  Suffice it to say… it ain’t pretty. It’s fun and funny, but not pretty.\n\nWhat’s also worth noting is that this is a series in which Jake and Rob double down on the premise of encouraging “The Worst Way To Play.” That means they’re also role-playing as the worst character possible, so expect obnoxious and rude dialogue choices, as well as completely unnecessary physical altercations.\n\nAnd that’s what Episode 2 of The Worst Way to Play Cyberpunk 2077 has in store for you, so sit back and watch as our duo suffer to give you 12-ish minutes of fun and mischief. If you’d like to see more of this challenge, let us know in the comments below. And if you have specific ideas of how to make the experience even more miserable, let us know that too. Thanks for watching.", "link": "https://www.youtube.com/watch?v=5XZ0Zd1M8i4", "date_published": "2021-01-31 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]