[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCW0gH2G-cMKAEjEkI4YhnPA", "title": "Ian Nathan, author, “Anything You Can Imagine: Peter Jackson and the Making of Middle-earth\"", "description": "We talk about Peter Jackson and how the Middle-earth films came together with someone who spent time behind the scenes on both The Lord of the Rings and The Hobbit trilogies. We hear his favorite stories from the set, what sets Peter Jackson apart from other directors, his idea for a future Lord of the Rings book, the upcoming Amazon show and more!\n\nIan Nathan is a film author, who has written books on The Terminator, Fantastic Beasts, Ridley Scott, Tim Burton, Quentin Tarantino and most notably, \"Anything You Can Imagine: Peter Jackson and the Making of Middle-earth\": https://amzn.to/3ra1NTU\n\n00:00-00:42 Introduction\n00:42-05:25 How Ian was introduced to Tolkien\n05:25-11:22 Previous attempts to adapt LOTR\n11:22-17:02 First experience with Peter Jackson's The Lord of the Rings\n17:02-19:34 When Ian realized the LOTR films would be something special\n19:34-20:38 A box: the pinnacle of special effects\n20:38-25:13 LOTR and the emergence of film news coverage\n25:13-30:03 Is Zack Snyder's Justice League a sign of things to come?\n30:03-35:52 The (relatively) hands-off approach of New Line Cinema\n35:52-38:25 The Unexpected Oscars (The Fellowship of the Ring)\n38:25-43:22 After Fellowship. The Two Towers and Creating Gollum In-House\n43:22-50:33 The fortuitous timing of The Lord of the Rings\n50:33-58:21 The Return of the King, sticking the landing\n58:21-01:04:39 The complicated rights of The Hobbit\n01:04:39-01:09:13 Production timeline of The Hobbit vs The Lord of the Rings\n01:09:13-01:22:54 Studio influence on The Hobbit trilogy\n01:22:54-01:25:31 The great casting of the Middle-earth films\n01:25:31-01:30:10 Ian's favorite memories from his time behind the scenes\n01:30:10-01:37:20 What separates Peter Jackson from other great directors\n01:37:20-01:45:45 Amazon's The Lord of the Rings Series\n01:45:45-01:51:15 Ian's new LOTR book idea, a day-to-day production diary\n01:51:15-02:09:21 Rapid-fire Q&A\n\n#peterjackson #thelordoftherings #film", "link": "https://www.youtube.com/watch?v=UPSKB94Wu8g", "date_published": "2021-03-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]