[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "10 Highest Rated PS4 Exclusives Of All Time", "description": "You may have some more time on your hands to get through that PlayStation pile of shame. Here’s a rundown of the 10 best-rated games for PS4, as gathered by review aggregator, Metacritic.com.\n\nAs more fantastic games are being released, it only means that our piles of shame grow larger and larger. With 2021 looking to keep us all indoors as much as possible, that might mean you have a little extra time on your hands to finally start tackling some games you’ve always meant to play but never had the time to. But where to start?\n\nWell, we’re here to help. We’ve gathered ten of the best PlayStation 4 games that you really should have played by now. They’re ranked by review aggregator Metacritic.com. We’ve only listed games that are PlayStation 4 console exclusives, though remakes of older games and games that eventually ended up on PC are also allowed. You can bet that you’ll see fantastic games from Sony’s lineup of first-party studios, including Naughty Dog and Sony Santa Monica. But which games? You’ll have to watch and find out. \n\nSorry, Xbox gamers, but if you’d like to see an Xbox version of this list, make sure to let us know by dropping a comment, like, or sub to the channel.\n\nTags: best ps4 games, best playstation games, best games for ps4, rez infinite, astro bot, astro bot vr, shadow of the colossus, bluepoint games, bloodborne, journey, uncharted 4, naughty dog, last of us, last of us 2, persona 5, persona 5 royal, god of war, god of war 2018\n\n00:31 - Rez Infinite\n01:03 - Astro Bot Rescue Mission\n01:33 - Shadow of the Colossus \n02:31 - Bloodborne \n03:18 - Journey \n03:55 - Uncharted 4\n04:31 - The Last of Us Part II\n05:02 - God Of War \n05:45 - The Last of Us Remastered\n06:27 - Persona 5 Royal", "link": "https://www.youtube.com/watch?v=cro7kLyIySc", "date_published": "2021-01-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "9 Things We Want In Zelda: Breath Of The Wild 2", "description": "A sequel to The Legend of Zelda: Breath of the Wild is confirmed to be coming, so we take the time to look back at the series as a whole and think about what we'd want to see from the next installment.\n\nWe don't know much about the sequel to The Legend of Zelda: Breath of the Wild--we still don't even have a name for it yet. After releasing an announcement trailer for the game during E3 2019, Nintendo went radio silent. We'll hear more about the game once Nintendo is ready, but there's no indication of how soon that might be.\n\nIn the meantime, it's always fun to speculate and talk about what we hope to see in the new game. In the video above, Max Blumenthal details nine dreams for the Breath of the Wild sequel, ranging from who we want to play as to where we hope the game is ultimately set. It would be pretty cool to see the return of notable Legend of Zelda enemies and allies as well.\n\nIf you haven't yet seen the announcement trailer for Breath of the Wild's sequel, it's worth checking out. The trailer seems to imply that at least part of the game will take place in an underground-looking setting or perhaps a more traditional Legend of Zelda dungeon environment. You can also see Link and Zelda working side by side as opposed to Link soloing the adventure and Zelda tagging along as a disembodied voice. The withered husk of what looks like Ganon is present as well, as is imagery and sounds that may suggest a connection to the events and characters of Twilight Princess--one of the many Legend of Zelda games referenced in Breath of the Wild. But, admittedly, that's all conjecture.\n\nLike we said before, we don't really know anything about this game other than that it exists. So what are your hopes and dreams for Breath of the Wild's sequel? Leave your answers in the comments section below.\n\nTimestamps:\n0:00 Intro\n0:24 Partnerable Zelda\n0:56 Bring Back Traditional Items\n1:14 Nero Mechanics?\n1:35 Bring Back Traditional Dungeons\n1:56 More Story Focus \n2:50 New Explorable Areas\n3:19 Swimming Upgrades\n3:45 Return The Darknut\n4:05 Pet Dogs\n4:18 Outro", "link": "https://www.youtube.com/watch?v=wNUjaLb_YPM", "date_published": "2021-01-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]