[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "Christiane Amanpour, Maria Ressa & Ramona Diaz in Conversation About “A Thousand Cuts” | FRONTLINE", "description": "Christiane Amanpour hosts a roundtable conversation about the new documentary “A Thousand Cuts” with director Ramona Diaz and film subject Maria Ressa, a prime target in Philippine President Rodrigo Duterte’s war on the press.\n\nThis journalism is made possible by viewers like you. Support your local PBS station here: http://www.pbs.org/donate \n\nThis conversation was produced in collaboration with WLIW’s “Amanpour & Company\": https://www.youtube.com/amanpourandcompany\n\n“A Thousand Cuts” is streaming now: https://youtu.be/LixnwDIh2wU\n\nThrough the lens of Duterte’s crackdown on the news media and Ressa’s vow to “hold the line,” the film chronicles what can happen to democracy when disinformation flourishes on social media and press freedom is under threat.\n\n#AThousandCuts #MariaRessa #PressFreedom\n\nLove FRONTLINE? Find us on the PBS Video App where there are more than 300 FRONTLINE documentaries available for you to watch any time: https://to.pbs.org/FLVideoApp \n\nSubscribe on YouTube: http://bit.ly/1BycsJW \nInstagram: https://www.instagram.com/frontlinepbs \nTwitter: https://twitter.com/frontlinepbs \nFacebook: https://www.facebook.com/frontline \n\nFunding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Major funding for FRONTLINE is provided by the John D. and Catherine T. MacArthur Foundation and the Ford Foundation. Additional funding is provided by the Abrams Foundation; Park Foundation; the Heising-Simons Foundation; the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation; and Koo and Patricia Yuen. A Thousand Cuts\" original production funding provided by Cinereach, Catapult Film Fund, Sundance Institute, and International Documentary Association (IDA).", "link": "https://www.youtube.com/watch?v=iiK2fQeSPdA", "date_published": "2021-01-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "Invasion of the Capitol Was Planned for Weeks in Plain Sight | FRONTLINE + ProPublica", "description": "The Capitol rioters planned weeks before in plain sight. Why were police caught off-guard?\n\nThis journalism is made possible by viewers like you. Support your local PBS station here: http://www.pbs.org/donate\n\nOn Jan. 6, 2021, a mob of President Trump's supporters invaded the U.S. Capitol building, while Congress was meeting to certify Joe Biden's victory in the presidential election. The rioters had planned online for weeks in plain sight, raising questions about why the police presence was so easily overwhelmed.\n\nLove FRONTLINE? Find us on the PBS Video App where there are more than 300 FRONTLINE documentaries available for you to watch any time: https://to.pbs.org/FLVideoApp \n\nSubscribe on YouTube: http://bit.ly/1BycsJW \nInstagram: https://www.instagram.com/frontlinepbs \nTwitter: https://twitter.com/frontlinepbs \nFacebook: https://www.facebook.com/frontline \n\nFunding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Major funding for FRONTLINE is provided by the John D. and Catherine T. MacArthur Foundation and the Ford Foundation. Additional funding is provided by the Abrams Foundation; Park Foundation; the Heising-Simons Foundation; the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation; and Koo and Patricia Yuen.", "link": "https://www.youtube.com/watch?v=w-DPnaJZI_U", "date_published": "2021-01-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]