[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Why Battlefield Can Beat Call Of Duty This Year", "description": "Battlefield 2042 had a strong showing at E3, where Call Of Duty's yearly plan was notably absent. Right now, it looks like Battlefield is winning, but Activision could come back this summer with strong reveals for Vanguard and Warzone. It’s time to examine how these two juggernauts will go head to head. \n\nDeveloper DICE showed off a ton of promising features in Battlefield 2042 at E3 2021, including massive, purpose-built maps, a revamped conquest mode, 128-player matches, bots, vehicle combat, tornadoes, a battle pass with free and paid tiers, near-future gadgets, and a new class system. As we hurtle towards the early access release on October 15 and general launch on October 22, there's still a lot we don't know, and more announcements are coming from EA Play Live on July 22. We are also expecting an open beta and the non-battle royale mode Hazard Zone to be playable before launch. \n\nMeanwhile, Call Of Duty: Black Ops Cold War and Warzone have managed to alienate some Modern Warfare fans who could lean heavily towards Battlefield. Not to be counted out, Call Of Duty may announce their 2021 game in the near future, informally called Vanguard by the public, and rumors are swirling around a new and larger Warzone map.  \n\nIn this video, we take a look at why Battlefield 2042 feels like it's already winning this year, compared to Call Of Duty and the rumors that it’s returning to a World War setting. We're also going to look at pitfalls that DICE needs to avoid, like the perception its new specialists have been designed for monetization and microtransactions. Finally, we’re going to look at the current state of Cold War and Warzone, and how Warzone specifically became well balanced, how it's telling stories in a way that Battlefield hopes to repeat, and how Activision's yearly cycle could mess it all up.\n\nBattlefield 2042 is set to release on October 22 for Playstation 4, PS5, Xbox One, Xbox Series X/S, and PC. The next-gen and PC versions will sport enhancements and a higher player count. Call Of Duty: Warzone is currently in Season 4 and can be played for free. The next Call Of Duty is being developed by Sledgehammer Games and is still expected to release in 2021, with some kind of reveal event hopefully this summer.\n\n#callofduy #cod #Battlefield", "link": "https://www.youtube.com/watch?v=Mn5Q76j5b2A", "date_published": "2021-07-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "29 MORE Things You STILL Didn't Know In Zelda Breath Of The Wild", "description": "We're back with more secrets that you probably don't know about in Breath of the Wild! This time we dive into miniaturized items, carrying snowy weather across Hyrule, Yiga Blademasters stealing the Master Sword, and much more! \n\nRin's Combat Glossary - https://docs.google.com/document/d/1qtYT06sxweRW3tRnovcCc-f4xIOGFNsD02pG1TzloHc/edit?usp=sharing\n\nIn the video above, we cover 29 tips and tricks that aren’t quite as well known, ranging from secrets to glitches, some that are pretty simple and others that are fairly complex. Breath of the Wild has been out for four years at this point, and players have found some amazing things, intended or not, that keep the game and its sense of discovery feeling fresh.\n\n0:00 Intro\n0:22 Ancient Bow Secret Armor Pierce\n0:47 Knockout King Rhoam\n1:05 Patricia's Tips\n1:19 Japanese Inside Joke\n1:29 Monk Tells You To Solve It Properly\n1:43 Fireball Verticality\n1:54 Golden Gauntlets Glitch\n2:11 Shrink Items With Octoroks\n2:33 Menu Bullet Time\n2:47 Yiga Unarmed Dance\n2:57 Impossible Shock Arrow\n3:13 Enemies Can Catch Boomerangs\n3:24 Chasing Enemies With Rocks\n3:34 Outdoor Door Stove\n3:46 Hestus Secret Animation\n3:59 Under Villia's Mask\n4:08 Fire Lizalfos' Secret Fireshot\n4:17 Ice Lizalfos vs Spring Water\n4:29 Turn Link Red\n4:49 Tinder Fire Starter Trick\n5:13 Switch Lightning Targets\n5:34 Why Epona Is The Best\n5:49 Yiga Master Sword Steal\n6:22 Map Pin Flying Arrows\n6:30 Lizalfos Eat Critters\n6:46 Carry Snowy Weather Around Hyrule\n7:16 Chilly Ganon Intro\n7:28 How To Pierce Ganon's Armor 1\n7:48 How To Pierce Ganon's Armor 2\n8:11 Outro\n\n\n\n#zelda #zeldabreathofthewild #breathofthewild", "link": "https://www.youtube.com/watch?v=FMuoOQxk6_w", "date_published": "2021-07-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]