[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "United States of Secrets, Part Two (full documentary) | FRONTLINE", "description": "In part two of this two part series, FRONTLINE explores the secret relationship between Silicon Valley and the National Security Agency, investigating how the U.S. government and tech companies worked together to gather and warehouse personal data. (Aired 2014)\n\nThis journalism is made possible by viewers like you. Support your local PBS station here: http://www.pbs.org/donate​.\n\nHow did big tech companies react when the government asked them to turn over data on millions of ordinary American citizens? And what do companies like Google, Facebook and Yahoo! really know about you? FRONTLINE Producer Martin Smith (\"Money, Power and Wall Street\" and \"Obama's War\") investigates the ways Silicon Valley has played a role in the NSA’s dragnet, and blurred the boundaries of privacy for us all.\n\nWatch Part One here: https://youtu.be/kaUemcqIQ-k\n\nLove FRONTLINE? Find us on the PBS Video App where there are more than 300 FRONTLINE documentaries available for you to watch any time: https://to.pbs.org/FLVideoApp​ \n\n#Documentary #UnitedStatesofSecrets\n\nSubscribe on YouTube: http://bit.ly/1BycsJW​\nInstagram: https://www.instagram.com/frontlinepbs​\nTwitter: https://twitter.com/frontlinepbs​\nFacebook: https://www.facebook.com/frontline\n\nFunding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Major funding for FRONTLINE is provided by the Ford Foundation. Additional funding is provided by the Abrams Foundation; the John D. and Catherine T. MacArthur Foundation; Park Foundation; and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation, and additional support from Koo and Patricia Yuen.", "link": "https://www.youtube.com/watch?v=rs2iN0oVdt4", "date_published": "2021-09-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]