[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Fortnite Operation: Sky Fire Season 7 Finale Event Gameplay", "description": "Fortnite obliterates Season 7 with a cosmic BANG during the Operation: Sky Fire finale event! Find out what Doctor Slone and the Imagined Order have been cooking up all this time.\n\nWe infiltrated the alien ship and helped trigger all the bombs to go off to help stop the invasion. We see an old friend, the Cube. Look forward to Season 8 of Fortnite which will trigger at 2am PT on September 13th. Find out what happens in the next chapter.\n\n#fortnite #operationskyfire", "link": "https://www.youtube.com/watch?v=4o9FZMLjDDA", "date_published": "2021-09-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "15 Best PlayStation Exclusives To Play Right Now", "description": "PlayStation owners have been blessed with numerous exclusives over the years, and we're here to pick 15 of our all-time favorites. Everything from the Uncharted and God Of War to Bloodborne and Persona 5.\n\nThe PS4 (and even the PS5 so far) has been defined by its exclusives. While Sony's PlayStation consoles have had notable exclusive games over the years, a significant number of the very best games on modern PlayStation consoles are exclusives. From sterling action games like God of War and Marvel's Spider-Man to brilliant RPGs such as Final Fantasy VII Remake and Persona 5 Royal, recent PlayStation exclusives have been mightily impressive. We've rounded up the best PlayStation exclusives for PS4 and PS5. While most of these games are playable on both PS4 and PS5, we've included a few PS5 exclusives as well.\n\nIn the above video, we round up 15 of the best PS4 and PS5 exclusives.\n\nTimestamps:\n00:18 - Bloodborne\n01:05 - Death Stranding\n01:52 - Demon's Souls\n02:40 - Dreams\n03:15 - FFVII Remake\n03:59 - Ghost of Tsushima\n0:4:38 - God of War\n05:23 - Horizon Zero Dawn\n05:56 - The Last of Us Part 2\n06:50 - Spider-Man & Spider-Man: Miles Morales\n07:25 - Persona 5 Royal\n08:08 - Ratchet & Clank: Rift Apart\n08:36 - Returnal\n09:15 - Shadow of the Colossus\n09:54 - Uncharted 4: A Thief's End\n\n#playstationexclusive #playstation", "link": "https://www.youtube.com/watch?v=z0lfTMa6e4I", "date_published": "2021-09-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Aliens: Fireteam Elite’s Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the sci-fi arsenal of Aliens: Fireteam Elite, including the legendary Smartgun, the OCAP-91 Volcan flamethrower and, of course, the iconic M4A1 Pulse Rifle.\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of Aliens: Fireteam Elite and compares them to their real-life inspirations.\n\nHow Aliens’ Iconic Pulse Rifle Was Created: https://youtu.be/zDIPuP7T64Q\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\n#firearmsreacts #royalarmouries #aliens", "link": "https://www.youtube.com/watch?v=M5YylyfzXYQ", "date_published": "2021-09-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]