[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Sleater-Kinney: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nJacob Ganz | July 1, 2021\nYou don't have to wait long for a signature Sleater-Kinney moment in the band's Tiny Desk (home) concert. Over the first half of the title track to Path of Wellness, Corin Tucker and Carrie Brownstein sing of human frailty and self-improvement, vibrating with low notes of disgust. Then Brownstein shoots Tucker a knowing smile as they sing, \"You could never love me enough,\" and the pair, who have been making music together for nearly 30 years, start to unwind things: Brownstein hisses \"I am on a path of wellness\" through gritted teeth before ripping into a four-note riff that feels like it's pulling your guts out; Tucker sets her voice at maybe 75 percent howl capacity to sing \"I feel like I'm unknown\" and Brownstein still has to raise a hand to steady herself against the force. She can't stop grinning.\n\nTension is the heart of Sleater-Kinney's untouchable catalog, and Brownstein and Tucker know how to add layers to keep a song's meaning shifting. They recorded Path of Wellness at Halfling Studio in Portland in the midst of pandemic and protest, and returned to make this Tiny Desk. \"High In The Grass\" feels looser and hazier than on the album; \"Worry With You\" feels heavier. A treat for fans from the band's first decade: \"One Beat\" played with piano and bowed upright bass, making it that much easier to hear how, by the end, Tucker's pleas and Brownstein's yelp have been inextricably knitted together. Untangling things would be missing the point.\n\nSET LIST\n\"Path of Wellness\"\n\"High In The Grass\"\n\"One Beat\"\n\"Worry With You\"\n\nMUSICIANS\nCarrie Brownstein: guitar, vocals\nCorin Tucker: guitar, vocals\nFabi Reyna: guitar\nGalen Clark: keyboards\nBill Athens: bass\nVince Lirocchi: drums\n\nCREDITS\nVideo: Karen Murphy, Joe Meade\nAudio: Cian Riordan\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Kara Frame, Gabrielle Pierre\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #sleaterkinney", "link": "https://www.youtube.com/watch?v=emPobfT6kOk", "date_published": "2021-07-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]