[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Raye Zaragoza: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nSam Yellowhorse Kessler | November 10, 2021\nFor Native American Heritage Month, we wanted to feature Indigenous musicians that break out of the preconceptions that many have of Indigenous music. Raye Zaragoza does just that, planting herself firmly in the folk genre, a tradition often reduced to white musicians with acoustic guitars. She pushes back on the narrative of folk music being for a certain type of person in her song “They Say,” in which she sings specifically about a time she realized at one of her own concerts that she probably couldn’t have afforded to be a member of the audience. “They say that folk music’s for the elite,” she sings, “the wise and the old with a college degree.” \n\nZaragoza is a natural performer, able to go big --  like on her 2020 album, Woman in Color --  or pare it all back, as she does in this Tiny Desk (home) concert. Her music reminds me of Ondara, an artist working within the troubadour tradition of storytelling, but unafraid to deliver incisive social and political messages. After all, what is folk music without something to work toward? “Change is a choice,” Zaragoza sings, “and it starts with me.” \n\nSET LIST\n* \"The It Girl\"\n* \"Rebel Soul\"\n* \"They Say\"\n* \"American Dream\"\n\nMUSICIANS\n* Raye Zaragoza: vocals, guitar\n\nCREDITS\n* Video By: James Gang Pictures, Drew James, Austin Straub, Hayley Palmaer\n* Audio by: Raye Zaragoza\n\nTINY DESK TEAM\n* Producer: Sam Yellowhorse Kesler\n* Video Producer: Kara Frame\n* Audio Mastering: Josh Rogosin\n* Tiny Production Team: Bob Boilen, Bobby Carter, Maia Stern, Sofie Hernandez-Simeonidis\n* Executive Producer: Keith Jenkins\n* Senior VP, Programming: Anya Grundmann\n\n#tinydesk #nprmusic #rayezaragoza", "link": "https://www.youtube.com/watch?v=K6NR9DYiEqc", "date_published": "2021-11-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Ya Tseen: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nSam Yellowhorse Kesler | November 9, 2021\n\"It's Indigenous Peoples' Month every month, don't you forget, mark your calendars,\" says Nicholas Galanin. \"I think it's important right now that we uplift and acknowledge Indigenous people beyond holidays or months, allocated time.\" Galanin, who's Tlingit and Unangax̂, leads Ya Tseen and brings his perspective as an Indigenous artist to every aspect of the band's music and artistry. Even the backdrop of their Tiny Desk (home) concert is a house screen — the largest of its kind in Southeast Alaska — carved by Will Burkhart and Galanin (as an apprentice). The video itself was filmed at the Sheet'ka Kwaan Naa Kahidi community house, which is modeled after customary Tlingit Long Houses.\n\nMinutes can quickly turn into an hour listening to Ya Tseen's music, which uses a combination of electronic and acoustic elements to create an inviting atmosphere. But his words are often far more cutting, literally so on \"Knives,\" which hides an ominous bent under an otherwise dreamy texture. It's the first song off the band's debut album, Indian Yard, though by no means Galanin's first foray into music; he's performed under other names like Silver Jackson and Indian Agent, and collaborated with the likes of Tanya Tagaq and Meshell Ndegeocello.\n\nGalanin is also a prolific visual artist, often focusing on political and anti-colonialist statements. His Tiny Desk brings all the elements of his work — music, video and artistry — together in a single package.\n\nSET LIST\n\"Knives\"\n\"Light the Torch\"\n\"Back in That Time\"\n\nMUSICIANS\nNicholas Galanin: vocals, keys, synthesizers, djembe\nBenjamin Verdoes: vocals, guitar, drums\nZak Dylan Wass: guitar, vocals\nQacung: Vocals, hand drum Jesse Hughey: vocals, electronics\n\nCREDITS\nVideo: Aaron Minks, Jesse Hughey\nAudio: Wilson Rahn, Bryan Lovett\n\nTINY DESK TEAM\nProducer: Sam Yellowhorse Kesler\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Bobby Carter, Kara Frame, Sofie Hernandez-Simeonidis\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #yatseen", "link": "https://www.youtube.com/watch?v=GatQYthTUKs", "date_published": "2021-11-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]