[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty Black Ops Cold War S4 - Inside Mauer der Toten and More", "description": "CoD Black Ops Cold War Season Four Reloaded arrives July 15th with our latest round-based Zombies map, \"Mauer der Toten,\" as well as plenty of new content in Multiplayer, Zombies, and Warzone. Join long-time Zombies developers Craig Houston, Anthony Saunders, Kevin Drew, and Mark Maestas for a deep dive into what awaits in Berlin in this behind the scenes look.\n \nTimestamps:\n00:00 Welcome\n00:29 Zombies\n06:33 Multiplayer\n08:15 Warzone\n\n#cod #cod4 #codblackopswar", "link": "https://www.youtube.com/watch?v=LvSX9e1lzCs", "date_published": "2021-07-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Company of Heroes 3 Preview", "description": "Company of Heroes 3's predecessor, Company of Heroes 2, released in 2013. And finally, 8 years later, Relic Entertainment is updating their popular RTS series in a big way. Company of Heroes 3 will feature an updated single player campaign that now includes turn based strategy on-top of the standard RTS features. Phil had a chance to preview Company of Heroes 3 and here's what we can expect from the next installment. Company of Heroes 3 is currently set to be released late 2022, and a free pre-alpha preview is available today.\n\n#companyofheroes3", "link": "https://www.youtube.com/watch?v=97JSDpP6R28", "date_published": "2021-07-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Legend of Zelda: Skyward Sword HD Review", "description": "Link's divisive Wii adventure returns on Switch with some welcome quality-of-life improvements.\n\nNintendo's The Legend of Zelda: Skyward Sword HD will be available on Nintendo Switch on July 16, 2021. You can read the full written Skyward Sword HD review by Kevin Knezevic on GameSpot: https://www.gamespot.com/reviews/the-legend-of-zelda-skyward-sword-hd-review-link-to-the-past/1900-6417698/\n\n#legendofzelda #zelda #zeldaskywardsword", "link": "https://www.youtube.com/watch?v=oEEjbLxaCes", "date_published": "2021-07-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Zelda: Skyward Sword HD - Switch vs. Wii Graphics Comparison", "description": "With The Legend of Zelda: Skyward Sword HD coming to Nintendo Switch, we put it head-to-head with the original Wii version to see the graphical differences.\n\nThe Legend of Zelda: Skyward Sword was originally released for Nintendo Wii in November 2011 to celebrate the 25th anniversary of The Legend of Zelda series. Now, 10 years later, it’s being remastered in HD for the Nintendo Switch. In this game, Link and Zelda are childhood best friends who live on an island in the sky named Skyloft. After evil forces kidnap Zelda and take her to the surface, it’s up to Link to fulfill his destiny as the Goddess' chosen hero and save the world from the evil that wants to control it.\n\nA few things to note about this video: The original version of Skyward Sword is a Wii game, but the footage used in this video is the Wii version running on a Wii U and captured at 1080p, so it’s the original standard definition image quality blown up. The HD version is captured on Switch at 1080p. The Wii version is running at 30fps, while the new HD remaster runs at 60fps, so you’ll notice one is smoother than the other. And lastly, the new Switch version is being played with the newly added button controls\n\nThe Legend of Zelda: Skyward Sword HD releases for Nintendo Switch on July 16, 2021. Alongside the game, Nintendo is releasing a pair of Joy-Con controllers themed after the Master Sword and Hylian Shield, and a Zelda & Loftwing amiibo figure. If you’re looking for more Skyward Sword HD videos, we’ve got you covered here on GameSpot.\n\nBiggest Changes: https://youtu.be/P3E8zT0eAwI\nVideo Review: https://youtu.be/oEEjbLxaCes\n10 Minutes of Gameplay: https://youtu.be/yacvlG1HBco\nLivestream: https://youtu.be/DgL3jDZdPzk\n\n#zelda #legendofzelda #zeldaskyward", "link": "https://www.youtube.com/watch?v=G8wbQMKIQzA", "date_published": "2021-07-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Zelda: Skyward Sword HD Pre-Launch Livestream", "description": "Join Evan Langer and Kurt Indovina as they play through the Skyview Temple in The Legend of Zelda: Skyward Sword HD ahead of launch and answer your questions about the game.\n\n#zelda #zeldaskywars", "link": "https://www.youtube.com/watch?v=DgL3jDZdPzk", "date_published": "2021-07-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Company of Heroes 3 - Announcement Trailer", "description": "Check out the all new announcement trailer for Company of Heroes 3!\n\n#companyofheros3", "link": "https://www.youtube.com/watch?v=56zJehIXcaU", "date_published": "2021-07-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Company of Heroes 3 - Gameplay Reveal Trailer", "description": "Check out the all new Company of Heroes 3 Gameplay Reveal Trailer!\n\n#companyofhereos3", "link": "https://www.youtube.com/watch?v=O6FOau5Mmvk", "date_published": "2021-07-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "EA PLAY Live 2021 Spotlight – Independent Studios Livestream", "description": "Todd Martens of the Los Angeles Times hosts a panel featuring Josef Fares of Hazelight (It Takes Two), Olov Redmalm of Zoink (Lost in Random), Melissa Phillips and Abubakar Salim of newcomers Silver Rain Games, and Guha Bala of Velan (Knockout City™).\n\nESRB EVERYONE to TEEN.\n\n#eaplay", "link": "https://www.youtube.com/watch?v=rwwjLZefHTg", "date_published": "2021-07-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]