[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty's The Haunting Event Livestream", "description": "Call of Duty's \"The Haunting\" event returns in season 6 of Black Ops Cold War & Warzone. Join Richie as he plays through the spooky limited-time modes including \"Scream Deathmatch, Prop Hunt Halloween and more!", "link": "https://www.youtube.com/watch?v=PAqEWfDsyfI", "date_published": "2021-10-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New Splinter Cell In The Works… Please Be Real! | GameSpot News", "description": "In this episode of GameSpot News, we talk about Splinter Cell reportedly getting a new game soon, the Xbox Series X mini-fridge selling out fast, and Microsoft’s plans to buy more studios in the future. \n\nIn this video, DeVante talks about a report from VGC that Ubisoft is working on a new Splinter Cell game. The report shed no light on what type of game the new Splinter Cell might be, though it was described as being a \"mainline\" entry as opposed to some type of spin-off.\n\nDeVante also talks about the Xbox Series X mini-fridge selling out fast as well as Phil Spencer revealing Microsoft is not done buying studios. Microsoft's last big gaming acquisition was ZeniMax/Bethesda, which it paid $7.5 billion to buy. Microsoft now has 23 game development studios spread across the world, working on a variety of projects.\n\nLater in the video, he covers the latest games being added to Game Pass for the second half of October. Titles like: The Forgotten City, Outriders for PC, Backbone and Age of Empires IV. \n\nTIME STAMPS\n00:00 - Intro\n00:15 - Splinter Cell\n01:18 - Xbox Series X Mini-Fridge\n02:06 - Microsoft to buy more studios\n02:48 - Forza Horizon 5 has gone gold\n02:59 - Game Pass Additions", "link": "https://www.youtube.com/watch?v=8GCUvI57eC8", "date_published": "2021-10-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Legends: Arceus | Hisui Region Hidden Footage Trailer", "description": "Check out the all new trailer for Pokemon Legends: Arceus showing off a few sneak peak hints into the Hisui Region.", "link": "https://www.youtube.com/watch?v=10mphsyQFBw", "date_published": "2021-10-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Suicide Squad: Kill The Justice League - Everything We Know So Far...", "description": "Rocksteady of Batman Arkham Asylum, Arkham City, and Arkham Knight fame is finally back! This time, they're continuing the series with Suicide Squad. In Suicide Squad: Kill the Justice League, you'll play Harley Quinn, Deadshot, Captain Boomerang, and King Shark as Amanda Waller pits you against the likes of the Flash, Green Lantern, and a big bad Superman, all likely being mind-controlled by Brainiac. While you'll potentially have Wonder Woman on your side, with a missing Batman, as ever, the odds are definitely not stacked in the Suicide Squad's favor. Suicide Squad: Kill the Justice League releases to PC, Xbox Series X/S, and Playstation 5 in 2022.\n\n#SuicideSquad", "link": "https://www.youtube.com/watch?v=EEPG2jZUBQI", "date_published": "2021-10-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Apex Legends - Ashes to Ash Stories from the Outlands", "description": "Ash’s problems are all in her head...but that’s the most dangerous place they could be. Who is Ash, and who is Leigh? Learn more about the situation in the Escape Launch trailer coming on Apex Legends on October 21st, 2021.\n\n#ApexLegends #Ash", "link": "https://www.youtube.com/watch?v=KrJ4yAYa6h4", "date_published": "2021-10-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Elden Ring Gets Delayed But You Can Still Play Early | GameSpot News", "description": "In this episode of GameSpot News, we talk about Elden Ring getting delayed to February 2022, the GTA Trilogy’s achievements leaking as well as the ongoing EA and FIFA negotiations and Marvel movie delays. \n\nIn this video, DeVante talks about the delay of Elden Ring from January 2022 to February 25, 2022. Along with the announcement of the game’s push, Elden Ring is getting a closed network test that begins on November 12 and you can register now for a chance to get in. Those who are chosen for the beta test can take part in five different sessions, held November 12-15 for three hours each time.\n\nDeVante also explains the alleged leak of the Grand Theft Auto Trilogy: The Definitive Edition achievements. One of which is titled \"...Here we go again\" which is a reference to the meme of C.J. saying the line in GTA San Andreas.\n\nLater on, FIFA hints at ending its exclusive deal with EA Sports and Marvel delays major films in it’s 2022 lineup.", "link": "https://www.youtube.com/watch?v=9Lbtfbu6MrU", "date_published": "2021-10-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Gotham Knights: Everything We Know So Far", "description": "Gotham Knights will let you play as Batgirl, Robin, Nightwing, and Red Hood and is set in the wake of Batman's death. The Bat-family faces its biggest challenge yet, as they face off against the Court of Owls. Here are all the details about WB Montreal's upcoming open-world action title. \n\nCheck out Tamoor's feature about the Court of Owls: https://youtu.be/IR7Hrlh_dB0 \n\nFor as long as Gotham has existed, so has the Court of Owls, a mysterious and powerful organization that rules the city from the shadows. They have been hinted at in previous Batman games, but in Gotham Knights they'll be the main foes that Batgirl, Robin, Red Hood, and Nightwing will be up against in the wake of Batman's death.\n\nIn this video, we'll go through everything we know so far about Gotham Knights, the new game from WB Games Montreal, the studio best known for developing Batman: Arkham Origins. While Gotham Knights shares a lot of familiar characters and DNA with Rocksteady's beloved Arkham games, building on the universe with shake-ups to combat, it is a completely new and original story. \n\nThe video also delves into who the Court of Owls are, but for a bigger deep dive, make sure to check out this video from GameSpot's Batman expert, Tamoor Hussain. Gotham Knights is due to launch on PlayStation 4, PlayStation 5, Xbox Series X/S, and PC in 2022.", "link": "https://www.youtube.com/watch?v=MEqd9ZPobdI", "date_published": "2021-10-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Origin of Payday", "description": "Celebrate 10 years of Payday with the first episode of a Payday video series. This first episode primarily focuses on the origin of Payday and how the game came to life. Learn more from the developers themselves, as well as some of the members of the community. \n\n#Payday", "link": "https://www.youtube.com/watch?v=CfuLSfi0nlM", "date_published": "2021-10-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]