[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "In Search of Al Qaeda (full documentary) | FRONTLINE", "description": "In December 2001, as American forces blasted mountain hideouts in the Tora Bora region of Afghanistan, hundreds of Al Qaeda soldiers fled seemingly disappearing into thin air. In this 2002 documentary, FRONTLINE investigates what happened to the fighters who survived.\n \nThis journalism is made possible by viewers like you. Support your local PBS station here: http://www.pbs.org/donate​.\n\nIn August of 2002, FRONTLINE veteran producer Martin Smith, his co-producer Marcela Gaviria, and cameraman Scott Anger set out on a two-month journey that took them from London to the Gulf of Oman, into the border regions and teeming cities of Pakistan, and finally to Saudi Arabia and Yemen to investigate what happened to Al Qaeda. Where did its members find sanctuary? Had the network been scattered and rendered ineffective -- or were they regrouping and planning more attacks? \n\nLove FRONTLINE? Find us on the PBS Video App where there are more than 300 FRONTLINE documentaries available for you to watch any time: https://to.pbs.org/FLVideoApp​ \n\n#Documentary​ #InSearchofAlQaeda\n\nSubscribe on YouTube: http://bit.ly/1BycsJW​\nInstagram: https://www.instagram.com/frontlinepbs​\nTwitter: https://twitter.com/frontlinepbs​\nFacebook: https://www.facebook.com/frontline\n\nMajor funding for FRONTLINE is provided by the Ford Foundation. Additional funding is provided by the Abrams Foundation; the John D. and Catherine T. MacArthur Foundation; Park Foundation; and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation, and additional support from Koo and Patricia Yuen.", "link": "https://www.youtube.com/watch?v=BlhQ1cc3EbQ", "date_published": "2021-08-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]