[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCAKcSON6PSG_JkTbXh2WdIg", "title": "Rock The Cradle Play Along Episode 5", "description": "In episode 5 of Rock the Cradle Play Along, SaulPaul shares two songs — and there will be dancing! MacPhail Center for Music introduces us to the cello. We get into breakdancing footwork with House of Dance. Koo Koo Kanga Roo get silly and crafty with glitter. And Nur-D wants you to meet his dog B-I-N-G-O.\n\nEPISODE 5 CONTENTS\nIntro with Maddie 00:00\nSaulPaul, \"I am Enough\" 0:57\nMacPhail Center for Music: Meet the Cello 05:10\nSaulPaul, \"Vibes\" 08:17\nLittle Moments Count: Dancing with Baby 13:19\nHouse of Dance: Break Dancing Lesson 14:12\nKoo Koo Kanga Roo: Glitter Crafting 18:51\nNur-D, \"Bingo\" (Remix) 21:50\n\nBig thanks to our Rock the Cradle Play Along sponsors: Minneapolis Institute of Art, Bell Museum, Pizza Lucé, Little Moments Count, MacPhail Center for Music, Sala Architects and Park Dental. Enjoy these special offers from our sponsors: https://files.apmcdn.org/production/44a599df4cf8938bde128245edfa495c.pdf\n\nYou can also find this on our website: https://www.thecurrent.org/feature/2021/05/15/rock-the-cradle-2021-a-saturday-morning-video-series\n\nABOUT THE PERFORMERS\n\nHouse of Dance Twin Cities — Established in 2014, House of Dance Twin Cities is Minnesota's first and premier dance studio dedicated to teaching breakdancing, popping and locking, and hip hop dance classes to people of all ages and experience levels. The instructors humbly maintain that they are students themselves, dedicated to improving their dance so that they can share more with others. They take their art and their jobs very seriously and appreciate everyone who entrusts their learning with them.\n\nKoo Koo Kanga Roo is a dance party of the senses. For the last 12 years, lifelong friends and collaborators Bryan and Neil have toured the globe delighting fans with their high-energy music, infectious positivity, and interactive live show. Of course, the global pandemic of 2020 threatened to put an end to the carefree fun that had come to define the band, but instead of putting the group on pause or looking for office jobs, Bryan and Neil doubled down and created their most triumphant and expansive album yet.\n\nNur-D is taking the hip-hop world by storm! One of Minnesota's fastest-rising stars, Nur-D has been everywhere, including First Avenue, Paisley Park and US Bank Stadium. With his powerful vocals, witty lyricism, and heart laid out on every track, it's no wonder that Nur-D is on the way to becoming everyone's seventh-favorite hip-hop person.\n\nSaulPaul is an award-winning musician with a message. In addition to recording music, he has also presented three TEDx Talks, performed at the Kennedy Center for Performing Arts and has been featured on America's Got Talent. His life story of transitioning from tragedy to triumph has been told on screen via the documentary Tower to Tower as well as in his memoir Be the Change. Most recently, SaulPaul founded Change Water, a socially conscious bottled water company that donates to the local community with each case of water sold. Whether via art, entrepreneurship or community service, SaulPaul is committed to #BeTheChange.\n\nSubscribe to our channel:\nhttp://www.youtube.com/user/893TheCurrent?sub_confirmation=1\nLike/Follow:\nhttps://www.facebook.com/TheCurrent/\nhttps://twitter.com/TheCurrent\nhttps://www.instagram.com/thecurrent/\n\n#thecurrent #rockthecradle", "link": "https://www.youtube.com/watch?v=JmIhFecXLms", "date_published": "2021-06-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]