[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Nintendo Switch Pro: 9 Upgrades We'd Love To See", "description": "With rumors that a Nintendo Switch Pro is on the horizon, we round up 9 changes we'd love to see from a beefier Switch model.\n\nAnother day, another Switch Pro rumour, this time from Bloomberg, which reports that a beefed-up version of the handheld will launch in time for the 2021 holiday season. It will allegedly include a 7-inch, 720p OLED screen and be able to output in 4K when docked. \n\nImproving the Switch's screen is one thing, but we've got some other gripes with Nintendo that we'd love to see it address with a Switch Pro, including eliminating Joy-Con drift, adding an ethernet port to the Switch dock, and even bringing back the eShop music. Please, Nintendo, we need all the serotonin we can get.\n\nFor more on Nintendo, make sure to tune in to Console Crew every Friday at youtube.com/GameSpot. Each week, Lucy James, Jordan Ramée, and Tamoor Hussain dig through the biggest PlayStation, Xbox, and Nintendo news stories.", "link": "https://www.youtube.com/watch?v=IuVa23H9BMs", "date_published": "2021-03-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Battlefield 5’s Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of Battlefield 5, including the FP-45 Liberator pistol, the Boys AT Rifle, and the M3 Carbine complete with Infrared Sniper Scope.\n\nBattlefield V sees EA’s shooter franchise enter the Second World War, and naturally, the game includes a range of period weaponry, including the M1 Garand, the MP28 2, and the distinctive Fliegerfaust rocket launcher.\n\nIn this video, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of Battlefield V and compares them to their real-world counterparts.\n\nIf you're interested in seeing more of Jonathan, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can purchase Jonathan’s book here - https://www.headstamppublishing.com/bullpup-rifle-book", "link": "https://www.youtube.com/watch?v=-Pz7l-_AxKg", "date_published": "2021-03-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "It’s Time To Say Goodbye To Call Of Duty: Modern Warfare", "description": "Call Of Duty: Black Ops Cold War is probably going to nuke the Warzone map and put a final end to the era of Modern Warfare while forcing some players to choose which game to fit on their hard drive. \n\nCall Of Duty: Modern Warfare 2019 had a massive impact on the Call Of Duty formula by delivering a mil-sim-inspired game. Large maps, a thoughtful attachment system, and the inclusion of vehicles attracted lapsed Battlefield players and gamers who didn't traditionally enjoy the arcade feel of Call Of Duty. Modern Warfare fans were upset when Cold War took over the season pass, in-game store, and added over 30 Cold War guns into Warzone. Now with Cold War Season 2, Treyarch is taking the series, including Warzone, in a different direction, and it involves a lot of zombies. \n\nIn this video we talk about how recent unconfirmed reports say that the Warzone map introduced by Modern Warfare, Verdansk, will finally get nuked sometime in Season 2 to bring it in line with Black Ops Cold War. To make matters even tougher for some Modern Warfare players, the game may no longer fit on a base PS4's 500 gig hard drive with Cold War also installed. In this video, we talk over the pros and cons of this final switch and check in on how you're feeling about it.\n\nCall Of Duty: Black Ops Cold War is now in Season 2 and available on PlayStation 4, PS5, Xbox One, Xbox Series X/S, and PC.", "link": "https://www.youtube.com/watch?v=X3jLlvFr5PA", "date_published": "2021-03-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Silent Hills PT vs Evil Inside Comparison", "description": "Evil Inside is a new psychological-horror game by JanduSoft, and it has some remarkable similarities to the infamously canceled Silent Hill sequel, P.T. Check out this side-by-side comparison of the two games in action.\n\n\nIt's been nearly seven years since the release of P.T., and it's still left a massive impression on fans and developers alike. Though the ill-fated demo for Silent Hills is now just a specter in the gaming world, that hasn't stopped other developers from trying to rekindle the same sense of dread and horror with their attempts at paying homage to the minimalist horror game. The latest game paying tribute to P.T. is Evil Inside, an indie psychological horror game that tasks you with exploring a seemingly empty home to commune with the spirits that reside there.\n\nWith a trailer for the game being released, we put together a comparison video that shows off a side-by-side gameplay of P.T. and Evil Inside. In this video, we show off a number of the similarities between the two games--which there are many. In addition to similar-looking gameplay that focuses on walking down seemingly empty hallways and exploring rooms, we also get a look at the few jump scares that happen in both games. However, Evil Inside takes place in a much larger setting, and it's fair to say that there's much more to the game that we haven't yet seen.\n\nIn addition to this comparison between horror games, we've also put together several other side-by-side looks at other games, including how the Mass Effect Legendary Edition remaster compares to its original counterparts. For more on what's happening in the gaming world, be sure to keep up with GameSpot.", "link": "https://www.youtube.com/watch?v=lYXs4Fga3aY", "date_published": "2021-03-06 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]