[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "BRAVE + BRAVE SEARCH: is it the king of web browsing now?", "description": "Wanna get your own Linux server? Visit https://www.linode.com/linuxexperiment for a 100$ credit ! \n\nGet your Linux desktop or laptop here: https://slimbook.es/en/\n\nI'd like to take a look at a browser that I've been starting to like more and more: Brave. They opened up their own search engine recently, in beta, and their browser has always been billed as a very privacy focused solution. So let's take a look at the browser itself, and the search engine, and see if this combo is deserving of the web browser crown.\n\nBecome a channel member to get access to a weekly patroncast and vote on the next topics I'll cover:\nhttps://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nSupport the channel on Patreon: \nhttps://www.patreon.com/thelinuxexperiment\n\nFollow me on Twitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\nFollow me on ODYSEE: https://odysee.com/@TheLinuxExperiment:e\nOr join ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\n00:00 Intro\n01:47 Brave Browser\n03:23 Privacy\n06:27 Speed\n08:54 Brave Search\n11:53 Parting thoughts\n\nIt's really customizable, and that's a good thing, but it's also pretty tricky to find something when you're not used to it. Thankfully they have a search feature for the settings.\n\nIn terms of Privacy, Brave uses what it calls Shields, to block all trackers and ads. By default, it has an aggressive blocking policy enabled, with cross site cookie and fingerpriting blocking enabled. The ad block seems very effective, and I haven't seen a single ad by default using Brave.\n\nWell, that is, a single ad on the webpages I used. Brave offers you to receive ads as notifications, entirely comprised of ads for various crypto related services. These ads are handled by Brave, and each ad will net you some small amount of BAT, the crypto token Brave uses to earn money. These tokens can then be either paid to content creators, if they've enlisted in the brave rewards program, automatically contributed each month to selected creators of your choosing, or just kept on your own wallet and sold, or exchanged.\n\nYou can, of course, turn off the brave rewards system and never see any ads. In that case, you'll still have the ad blocker enabled as well.\n\nOn top of the ad blocking capabilities, Brave also has a built-in TOR browser: you can open links in a new private window using TOR. It basically routes your query to various TOR servers, effectively hiding your IP address from the website you're visiting. This mode switches your search engine to Duck Duck Go for the duration of the session, as other search engines can have issues with TOR routing.\n\nNow, let's take a look at Brave's speed.\n\nRunning Basemark Web 3.0, Brave got a score of 1554.53. Chrome got 1686.06. For refecrence, Firefox got 1045.09. In case you're wondering, higher is better. So in there, Chrome still beats Brave by a nice margin, and Firefox lags way behind.\n\nThe Speedometer test is designed to measure the responsiveness of web applications in a web browser, on multiple javascript frameworks, and that's going to be a bit closer to real life.\nOn that benchmark, Firefox got 117 runs per minute. Brave got 126 runs per minute, and Chrome got 157 runs per minute.\n\nNow, using the dev tools of Brave and Chrome, loading theverge.com, Brave took 709ms, and Chrome took 4.29s, because it had to load the ads in after the fact.\nOn OMG Ubuntu, Chrome took 3.26s, and Brave took 1.22s.\nOn GamingOnLinux.com, Brave took 1.26s, and Chrome took 1.35s. This website has no ads, so the end results are pretty similar.\n\nNow, let's move on to the search engine. Brave Search is still in beta, but it's already really promising. It's based on the TailCat engine, that Brave bought a while ago, and that I had personally never used. It uses its own index, and doesn't use any other search engine's results. Engines like Duck Duck Go or Ecosia use Bing to get search results, or supplement their own index, Startpage uses Google's search results, but completely anonymized, but Brave search just stands on its own.\n\nWell, up to a point. Brave Search will, in fact, supplement some results with results from Google and Bing, when they feel their own aren't up to par. The good thing is that they'll actually let you know how much comes from other search engines, and these additional results are completely anonymized.\n\nI've been using Brave Search for about a month now, and the results are quite impressive.\nSimple searches won't give you any trouble: you get good quality results, at least in english and in French, you get snippets from Wikipedia when they're relevant, you get ratings for apps drawn from the Google Play Store and the Apple App Store, and you get small cards that correctly identify the type of content you're looking for, for example with recipes. You even get suggested questions related to what you're looking for.", "link": "https://www.youtube.com/watch?v=5P7zZOtiTGc", "date_published": "2021-07-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]