[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Does Dead Space Need a Remake?", "description": "With the success of Capcom's Resident Evil 2 remake, rumors are abound that EA is looking into giving Dead Space a similar treatment and could discuss it at EA Play Live 2021. But, how much of a face lift does Dead Space really need? The game is still playable on modern consoles and looks great. Do we need a Dead Space Remake?\n\nFew games hold up as well as Dead Space. Despite releasing 13 years ago, Visceral Games' space horror shooter is still as intense and scary today as it was then. In fact, it's shockingly good--you can get it right now on PC, Xbox One, and even Xbox Series X with Auto HDR, and it still controls exceedingly well, features some great shooting mechanics, and looks pretty great.\n\nBut most importantly, Dead Space can still scare the hell out of you, with a combination of great sound design, excellent jump scares, ridiculously gross monsters, and awesome set piece moments. Running atop of the Ishimura with Zero-Gravity boots, I’m looking at you.\n\n#deadspace", "link": "https://www.youtube.com/watch?v=ccdqr1dyX28", "date_published": "2021-07-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Yiga Stealing The Master Sword In BOTW Explained", "description": "While it is generally explained how to get the Yiga to the Master Sword, how hard is it to actually do yourself?\n\nThis trick was recently found taking the internet by storm, again pushing the possibilities of things you can do in Breath of the Wild. In the video above, we go in-depth with the whole process including when it was found, how to pull the Yiga clan out of the hideout, and extra glitches that make this process much smoother.\n\n#mastersword #yiga", "link": "https://www.youtube.com/watch?v=wKSUn4CAj_E", "date_published": "2021-07-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]