[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "This Man Risked His Life to Secretly Film in an Eritrean Prison | Escaping Eritrea | FRONTLINE", "description": "In an excerpt from the five-years-in-the-making documentary “Escaping Eritrea,” a man named Michael shares footage he secretly filmed inside an Eritrean prison.\n\nSubscribe on YouTube: http://bit.ly/1BycsJW \n\n“The reason I did this was to get evidence that the regime is oppressing the youth and the people and to show that the Eritrean people suffer a lot of abuses,” says Michael, speaking to FRONTLINE in 2016.\n\nOver the past two decades, Michael and more than a half a million other Eritreans have fled their home country in eastern Africa. They say they are escaping one of the most repressive and secretive dictatorships in the world.\n\nFilming and reporting in Eritrea is almost impossible, but for more than five years, producer and director Evan Williams has been working to gather footage secretly shot inside the country and to interview people like Michael who’ve escaped. The resulting film, from FRONTLINE in the United States and Channel 4 in the United Kingdom, documents searing allegations of torture, arbitrary detention and indefinite forced conscription into military service.\n\nWatch \"Escaping Eritrea\" in full starting May 4: https://to.pbs.org/2Ri5SJi\n\nLove FRONTLINE? Find us on the PBS Video App, where there are more than 300 FRONTLINE documentaries available for you to watch any time: https://to.pbs.org/FLVideoApp\n\nSubscribe on YouTube: http://bit.ly/1BycsJW \nInstagram: https://www.instagram.com/frontlinepbs \nTwitter: https://twitter.com/frontlinepbs \nFacebook: https://www.facebook.com/frontline \n\nFunding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Major funding for FRONTLINE is provided by the Ford Foundation. Additional funding is provided by the Abrams Foundation; the John D. and Catherine T. MacArthur Foundation; Park Foundation; and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation, and additional support from Koo and Patricia Yuen.", "link": "https://www.youtube.com/watch?v=yQvFa40dg0s", "date_published": "2021-05-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]