[{"source": "https://lukesmith.xyz/rss.xml", "title": "Monero and Other Privacy Coins", "description": "<p>As I said <a href=\"https://lukesmith.xyz/posts/monero-maximalism-or-how-bitcoin-is-a-coin\">in other writings</a> and\n<a href=\"https://videos.lukesmith.xyz/videos/watch/8ba38c94-e8c2-421f-bb5f-47f4169fa804\">videos</a>,\nno serious cryptocurrency can function <strong>in real life</strong> which is not\nalso a <em>truly private</em> cryptocurrency.</p>\n<p>By far, the most popular of all these is Monero, which has already\nbecome the <em>de facto</em> currency of the dark web, but also of <em>all</em>\ncryptocurrency users <em>who actually use cryptocurrency for purposes other\nthan a mere investment</em>.</p>\n<p>Monero, however, is not actually the only private or pseudo-private\ncrypto-currency, and while I talked about its competitors in a recent\nstream, I think it's worth putting in words for a reference.</p>\n<h2 id=\"moneros-competitors\">Monero's Competitors</h2>\n<h3 id=\"zcash-is-trash\">Zcash is Trash</h3>\n\n<figure class=\"resright\"><a href=\"https://lukesmith.xyz/pix/zcashy_owned.png\"><img src=\"https://lukesmith.xyz/pix/zcashy_owned_small.png\" /></a></figure>\n\n<p><strong>Optional privacy is no privacy at all.</strong></p>\n<p>Zcash (ZEC) is often shilled as a Monero replacement. On the surface it\nactually sounds great and unambiguously better: it has a clever a\nzero-knowledge proof technology called zk-SNARKs which can store and\nprove transactions in the blockchain in a private way. zk-SNARKs are\ngenerally superior to Monero's somewhat ragtag triad of ring\nsignatures + stealth addresses + ring CT to anonymize transactions and\nthey are more scalable.</p>\n<p>zk-SNARK is short for &quot;Zero Knowledge Succinct Non-interactive ARgument\nof Knowledge.&quot;</p>\n<ul>\n<li>Zero Knowledge &ndash; It is private.</li>\n<li>Succinct &ndash; Referring to computation time.</li>\n<li>Non-interactive &ndash; In some earlier implementations of the\ntechnology, the interacting parties must exchange information and\nnegotiate in turns, while zk-SNARKs can occur instantaneously.</li>\n</ul>\n<p>Zcash, however, has two major problems, one substantial and one\naccidental (in the Aristotelean sense).</p>\n<p>The substantial problem is that zk-SNARKs <em>are not fully trustless</em>:\nthey require a trusted setup where public parameters are generated and\nif not properly disposed of, the initial developers could use that\nknowledge to produce infinite money without anyone knowing. This sort of\ndefeats the purpose of having a decentralized cryptocurrency and while\nthe rest of the currency is decentralized, that gaping hole certainly\nisn't.</p>\n<p>The accidental problem (or maybe <em>incidental</em> problem in modern English)\nis that Zcash is only <em>optionally private</em>. The vast majority of ZEC\ntransactions are not &quot;shielded&quot; with the zk-SNARK technology, but are\nas public as a Bitcoin transaction. <strong>This allows a third-party to\nuncover the &quot;private&quot; transactions by a process of automatic process\nof elimination.</strong></p>\n<p>Zcash, while is created valuable technology, is simply not a private\ncurrency and is not a valid competitor to Monero.</p>\n<h3 id=\"pirate-chain\">Pirate Chain</h3>\n<p>Pirate Chain (ARRR) is a minor privacy coin that has mooned\nsignificantly recently popping up from 30 cents to 14 dollars or so\n(it's halved since I started writing this article though). Pirate Chain\nuses the zk-SNARK technology, but unlike Zcash, uses it mandatorily\n(with optional transparent transactions like Monero via the private view\nkey).</p>\n<p>Pirate Chain has two big issues though. The first is what I mentioned\nbefore: zk-SNARKs as they have been implemented in ZEC and ARRR are\n<strong>not trustless</strong>. They require a setup in which theoretically, if the\npublic parameters of the system were known to some inside party, they\ncould print an infinite amount of the currency with absolutely no way\nthat any other people could know.</p>\n<p>Even if you <em>trust</em> the Pirate Chain developers, Pirate has another\npretty undeniable problem: <strong>90% of ARRR has already been mined and is\nin circulation!</strong> Yep, you heard that right: A minor niche alt-coin\nwhich has existed for only three years was put together in such away\nthat now as big of a proportion of it has been mined as has been mined\nof Bitcoin in over ten years!</p>\n<p>That means that that 90% is highly aggregated in the wallets of the two\nand a half people who knew of ARRR in this period, and anyone adding to\nthe market cap is mostly just contributing to these people's bags. Even\nif Pirate Chain had great trustless technology (which is doesn't) it\nhas not been set up equitably, but in a way that enriches early adopters\nto an extreme degree. Expect to get dumped on if you buy this stuff.</p>\n<p>Honestly, if you want a better, more honest cryptocurrency, you could\njust take the Pirate setup and give it a slower and more sane emission.\nThat would be a better choice than ARRR itself.</p>\n<h3 id=\"monero--dogecoin--bitcoin--wownero\">Monero + Dogecoin + Bitcoin = Wownero</h3>\n\n<figure class=\"resright\"><img src=\"https://lukesmith.xyz/pix/nowow.jpg\" /></figure>\n\n<p><a href=\"https://wownero.org\">website</a> &ndash; <a href=\"https://suchwow.xyz\">meme site</a></p>\n<p>Wownero is a joke currency. It's literally a fork of Monero with\nDogecoin aesthetics and some minor additions. Like Pirate Chain, it also\nhas surged significantly recently (from 2 or 3 cents to more than a\ndollar&mdash;beating out Dogecoin as a pump-and-dump for sure).</p>\n<p>Weirdly enough, Wownero is probably the best of the alternative privacy\ncoins that I've mentioned so far. It's trustless, unlike the zk-SNARK\ncoins, but also has some nice features.</p>\n<p>It was created somewhat as a satirical response for another privacy\n💩coin, MoneroV, which was just Monero with an initial coin offering and\nforked from the same blockchain (which ruins the privacy of users on\nboth chains because it becomes easier to triangulate on when outputs are\nactually spent).</p>\n<p>Since Wownero is a &quot;joke,&quot; it actually has integrated new technology\nand helpful additions <em>before</em> Monero has, since the Wownero developers\nare doing it all fast and loose. Ironically, that can be good.</p>\n<p>One principle division between Monero and Wownero is that Wownero is\nmore like Bitcoin in that it has a totally fixed supply, while Monero\nhas tail emission. Some people have criticized Monero for tail emission,\narguing that it is unnecessary and inflationary. I am not sold on either\nside: the game theoretics of this has never truly played out, but\nWownero might actually be something to look into if you like Monero, but\nthink it's &quot;inflationary.&quot; Regardless, Wownero's whitepaper and\nroadmap on their website are something that everyone should read and\ntake seriously.</p>\n<p>Again, the currency is sort of a meme, but it is what it is. I decided\nto start taking <a href=\"https://lukesmith.xyz/crypto.html\">Wownero donations</a> on my site a while\nago, just for fun.</p>\n<h3 id=\"suterusu-and-the-suter-token\">Suterusu and the Suter Token</h3>\n<p><a href=\"https://suterusu.io/\">website</a></p>\n<p>Now the ideal private currency would have the simple and scalable\nzk-SNARK technology implemented in a fair way and hopefully started in\nsome novel manner that is truly trustless. Suterusu is one potential\ncandidate for this kind of system. Behind it is a novel idea of\nzk-conSNARKs which can be read about in their\n<a href=\"https://github.com/suterusu-team/suterusu-documents/raw/master/Suterusu_whitepaper.pdf\">whitepaper</a>,\ntheir\n<a href=\"https://github.com/suterusu-team/suterusu-documents/raw/master/Suterusu_yellowpaper%20V%200.2.pdf\">yellowpaper</a>\nand a document on <a href=\"https://github.com/suterusu-team/suterusu-documents/raw/master/Suterusu_architecture.pdf\">Suterusu\narchitecture</a></p>\n<p>This technology hasn't been extensively vetted, but it has the\npotential to solve all the issues in privacy coins.</p>\n<p>Suterusu isn't quite meant to be an analog of Monero. The token itself\nis actually just an Ethereum token. In fact, this might be the\ninteresting part: Part of its system is that it can provide zk-conSNARK\nshielding <em>to other currencies</em> that support smart contracts. You can\nuse Suter to transact with Ethereum privately, for example.</p>\n<p>The Suterusu system, however is not perfect as far as I'm concerned. It\nisn't a self-propelling decentralized system in the way that Bitcoin or\nMonero is. That makes is regulatable and subject to human whim in a way\na cryptocurrency should not be. It is a designed system with dev taxes\nand even <a href=\"https://medium.com/suterusu/regulation-compliance-of-suterusu-625abc752eb9\">regulatory compliance that includes\nblacklisting</a>.</p>\n<h2 id=\"zk-snarks-vs-zk-starks\">zk-SNARKs vs. zk-STARKs</h2>\n<p>In addition to the zk-S<strong>N</strong>ARK system used in Zcash and Pirate, there\nalso exists zk-S<strong>T</strong>ARKs, which like zk-conSNARKs allow for a trustless\nsetup. <a href=\"https://eprint.iacr.org/2018/046.pdf\">Whitepaper</a>.</p>\n<p>To repeat, zk-SNARK stands for &quot;Zero Knowledge Succinct Non-interactive\nARguments of Knowledge.&quot; zk-S<strong>T</strong>ARK stands for &quot;Zero Knowledge\n<strong>Scalable Transparent</strong> ARguments of Knowledge.&quot; [Scalable]{.dfn}\nbecause it scales better than zk-SNARKs and [transparent]{.dfn} because\nit has a trustless setup.</p>\n<p>I do not know of a currency project that uses this technology now. Like\nzk-conSNARKs, it's only a couple years old.</p>\n<h2 id=\"the-ideal-privacy-coin\">The ideal privacy coin</h2>\n<p>Would be one that:</p>\n<ol>\n<li>Is actually private.</li>\n<li>Is trustless.</li>\n<li>Is highly scalable.</li>\n<li>Is truly decentralized and unmanaged by a singular entity.</li>\n<li>Has reasonably fair emission/mining schedule.</li>\n</ol>\n<p>Monero gets only half credit on 3, but full points on the rest. Wownero\nis the same, although perhaps it should be taken less seriously as a\nDoge-tier joke. Zcash fails on 1 and 2. Pirate Chain fails on 2 and 5.\nSuterusu has great tech, but flounders on 4.</p>\n<p>So the recipe for an ideal currency is here. It is one that implements\nthe zk-conSNARK technology of Suterusu or zk-STARKs (provided that such\ntechnology is appropriately vetted), but does so in a way without\ncentralization, dev taxes and other self-refuting silliness.</p>\n<p><strong>This ideal currency might just be Monero itself</strong>, to my understanding\nMonero has contemplated integrating zk-STARKs as they become more\nwell-travelled. Such an addition, if it works, would drastically improve\nthe scalability of Monero even if it might require somewhat of an\noverhaul.</p>\n<hr />\n<h2 id=\"donate\">Donate</h2>\n<ul>\n<li><img alt=\"\" src=\"https://lukesmith.xyz/pix/xmr.svg\" /> Monero &ndash; <code>48jewbtxe4jU3MnzJFjTs3gVFWh2nRrAMWdUuUd7Ubo375LL4SjLTnMRKBrXburvEh38QSNLrJy3EateykVCypnm6gcT9bh</code></li>\n<li><img alt=\"\" src=\"https://lukesmith.xyz/pix/wow.svg\" /> Wownero &ndash; <code>Wo3kx9FY1sQLndodemcibifzbdi2Q7X9YaoaMAVdKCwXieVJBJTRdpG3WoWzQ1atnBLK1Wti7P72p34K21EaACRv124yiLenE</code></li>\n</ul>", "link": "https://lukesmith.xyz/articles/monero-and-other-privacy-coins/", "date_published": "2021-05-04 00:00:00+00:00", "persistent": true, "user": null, "language": "en-US"}]