[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Fallout: New Vegas’ Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of Fallout: New Vegas, including the franchise’s iconic Nuka Launcher, the cumbersome Minigun, and the Gauss Rifle.\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of Fallout: New Vegas and compares them to their real-life counterparts.\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can purchase Jonathan's book here - https://www.headstamppublishing.com/bullpup-rifle-book", "link": "https://www.youtube.com/watch?v=CP7YVMBtEmU", "date_published": "2021-05-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "48 Things You STILL Didn't Know In Zelda Breath Of The Wild", "description": "Even four years after Zelda's release, there are things in the game you never thought possible. Here is another list of amazing things to show off to your friends.\n\nIn the video above, we cover 48 tips and tricks that aren’t quite as well known, ranging from secrets to glitches, some that are pretty simple and others that are fairly complex. With Breath of the Wild having  been out for four years at this point, players have found some amazing things, intended or not, that keep the game and its sense of discovery feeling fresh. \n\nOf note, we point out some secrets in Kakariko Village and Gerudo Town that the developers left that aren’t quite as well known, as well as strange techniques, like how to permanently disable a Guardian and cover yourself with impaled arrows. With Breath of the Wild’s highly anticipated sequel still nowhere to be found, these techniques should help you continue to push what you're able to do in the original game.\n\n0:00 Intro\n0:23 Stalnox With Bent Trees Miss Link\n0:32 Crouch Under Hinox Swings\n0:36 Hyrule Castle Batteries Actually Work\n0:43 Hyrule Castle Ability Cooldowns\n0:52 Eating Animations\n1:06 Spin Attack Directions\n1:13 Alternate Swim Animation\n1:20 Secret Lynel Dodge\n1:33 Double Rush Moblins\n1:42 Secret Kakariko Apple\n1:50 Sheep Conductivity\n1:58 Spin Attacks Cancel Burn\n2:08 Chuchu Jellies Stave Off Heat\n2:17 Magnesis Equipment For Shade\n2:28 Olkin's Funny Response\n2:42 Master Mode Red Bokoblin\n2:51 Throw Distances\n3:00 First Person BOTW\n3:08 Empty Quiver Animation\n3:17 Lift Stalnox\n3:24 Bokoblin And Link Parry Loop\n3:36 Minibosses Can Be Crouched Under\n3:48 Falling One Hit Obliterator\n4:01 Master Cycles Kill Pebblits\n4:07 Rear Wheel Bullet Time\n4:19 Guardian's Secondary Weakpoint\n4:28 Clipping Holes Around Hyrule\n4:39 Chaining Updrafts\n4:51 Arrow Pincushion\n5:04 Hateno Village Reacts To The Ancient Flame\n5:14 Body-slam Enemies\n5:27 Turn Link Invisible\n5:39 Campfire In The Rain Trick\n5:52 Guardians Show On The Map\n6:02 Shield Surf On Guardian Heads\n6:10 Selfie Against Guardians\n6:18 Hold ZL To Walk Faster\n6:23 Gerudo Dating Dummy\n6:32 Thrown Bokoblin Damage\n6:39 Floating Critters\n6:44 Place Critters\n6:56 Extra Fairy Tech\n7:05 Cooking Pots Bring Up Materials Menu\n7:13 Korok Puzzle Direction Hint\n7:21 Guardian Disable\n7:31 Guardian Delayed Lightning\n7:43 Extra Champion Dialogue And Lore\n7:55 Force Stone Doors Open\n8:13 Outro", "link": "https://www.youtube.com/watch?v=7gVvvE19Izw", "date_published": "2021-04-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "6 Biggest Changes In New Pokémon Snap", "description": "New Pokemon Snap has some big differences compared to its N64 predecessor; here is our breakdown of the biggest changes we've found in the new Switch game.\n\nIt's been 22 years since the original Pokémon Snap released on Nintendo 64, and we’ve finally gotten a follow-up on Nintendo Switch. The sequel has a very similar structure to the original game; both have you helping a Pokémon professor with research by taking photos over the course of an on-rails nature expedition, and then once you finish, the professor will grade your work and give you new information on the Pokémon you observed out in the wild.\n\nSome of the biggest changes to New Pokémon Snap include the addition of night courses and research levels to make the individual courses more dynamic, how your photos are graded by the game's different professors, some new photo editing tools, support items you can use for better photographs, and an expanded roster of characters that are tied to a more developed storyline.\n\nNew Pokémon Snap is available now exclusively on Nintendo Switch. The sequel has a lot of surprises, but it can also be pretty cryptic about how to progress the main story and find its secrets. If you find yourself stuck, we also made a video breaking down things you can try to help advance the story.\n\nYou can also read our full New Pokémon Snap review by Jenae Sitzes on GameSpot: https://www.gamespot.com/reviews/new-pokemon-snap-review-nintendo-switch/1900-6417668/\n\n00:00 - Intro\n00:26 - Night Courses\n00:53 - Research Levels\n01:42 - PhotoDex & Ratings\n02:38 - Re-Snapping\n03:19 - New Items\n04:19 - Expanded Story & Characters\n05:34 - Outro", "link": "https://www.youtube.com/watch?v=KN5d0cMfmOQ", "date_published": "2021-04-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New Pokémon Snap - What To Do If You're Stuck", "description": "New Pokémon Snap can be very cryptic about how to progress the story, so here's some things to try if you find yourself stuck.\n\nLike its predecessor, New Pokémon Snap is all about taking some skilled photos of the various Pokémon you find out in the wild. However, the journey to being a great Pokémon photographer is a little more confusing than you might think, and you may find yourself at a crossroads on what you should do next in the New Pokémon Snap's storyline. In this video we explain some of the common roadblocks you may find while on your journey, and what to do if you find yourself stuck.\n\nHere's a quick set of tips to help you along your way. The first thing you’ll want to try is reaching Research level 2 in the various courses you have available to you. If you’re having trouble reaching level 2 then try taking photos of Pokémon you’ve already snapped and have them evaluated to get more expedition points. Your research level determines how you can progress, but if you still find that you're stuck after increasing your level, then you may need to uncover an island's glowing Crystabloom, which is found on each of the islands in the game. Once you take a photo of the glowing Crystabloom, you will unlock that island’s Illumina orb which can help you progress your journey. Try using that Illumina orb in a course too if unlocking it isn’t enough.\n\nOnce you reach a certain point in New Pokémon Snap there will be more specific things you need to do to progress the story. One of the more cryptic things you will need to do is toss an Illumina orb at a Clawitzer in Seafloor level 2, which will unlock a new path that leads to a new Illumina spot. Some courses, like Volcano level 2 and Cave level 2, are on entirely different paths, which is different from the average level 2 courses that retain the same layout as the level 1 areas.\n\nNew Pokémon Snap is available now exclusively on Nintendo Switch. If you’re curious about the differences between Pokémon Snap and New Pokémon Snap, you can check out our video breaking down the 6 biggest changes.\n\nYou can also read our full New Pokémon Snap review by Jenae Sitzes on GameSpot: https://www.gamespot.com/reviews/new-pokemon-snap-review-nintendo-switch/1900-6417668/\n\n00:00 - Intro\n00:24 - Get to Research Level 2 in every course\n01:36 - Unlock every island's Illumina Orbs\n02:33 - How to find Voluca island's Illumina Pokemon in the Volcano\n02:53 - How to find Maricopia island's Illumina Pokemon in the Seafloor\n03:41 - How to find the final Illumina Pokemon\n04:03 - Outro", "link": "https://www.youtube.com/watch?v=KDOk1esk5RQ", "date_published": "2021-04-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]