[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "THIS TABLET RUNS LINUX?! Microsoft Won't buy Discord, and GUI Linux apps on Windows - Linux News", "description": "Visit https://www.linode.com/linuxexperiment for a 100$ credit on your new Linode account!\n\nThis time, we have the release of Ubuntu 21.04, graphical linux apps on windows, Discord refusing to be bought by Microsoft, and a good looking potential new Linux tablet. Let's take a look!\n\n00:00 Intro\n01:32 Linux News\n06:31 Application News\n10:23 Hardware News\n11:20 Gaming News\n12:39 Privacy News\n\n\nBecome a channel member to get access to a weekly patroncast and vote on the next topics I'll cover:\nhttps://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nSupport the channel on Patreon: \nhttps://www.patreon.com/thelinuxexperiment\n\nFollow me on ODYSEE: https://odysee.com/@TheLinuxExperiment:e\nOr join ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\nFollow me on Twitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\nThe Linux Experiment merch: get your goodies there! https://teespring.com/en-GB/stores/the-linux-experiment\n\n## Linux\n\nThe University of Minnesotta has been banned from contributing to the linux kernel, for sending buggy patches for research purposes. \nhttps://www.zdnet.com/article/university-of-minnesota-response-to-linux-security-patch-requests/\n\nMicrosoft showcased Linux apps running on windows through Windows subsystem for Linux, in all their graphical glory. https://www.omgubuntu.co.uk/2021/04/run-linux-apps-on-windows-wsl-2\n\nVersion 5.12 of the Linux kernel was released, and it's called a \"small release\" by Linus Torvalds himself. \nhttps://www.omgubuntu.co.uk/2021/04/new-linux-5-12-kernel-features\nhttps://kernelnewbies.org/Linux_5.12\n\nPlasma Mobile has received a big update, to a lot of its defaults apps, and is seeing a bunch of new ones coming in as well, including the first steps for a mobile-enabled email client, which was a big missing part of the experience.\nhttps://www.plasma-mobile.org/2021/04/27/plasma-mobile-update-march-april/\n\n## Apps\nFirefox 88 was released, and it seems to remove as many features as it's adding. \nhttps://www.mozilla.org/en-US/firefox/88.0/releasenotes/\n\n\nDiscord was talking with Microsoft about a potential buy, but it seems that this won't happen. \nhttps://www.cnbc.com/2021/04/21/messaging-platform-discord-reportedly-ends-sale-talks-with-microsoft.html\n\nGeary 40 was released, and this GTK based mail client is getting really good these days.\nhttps://www.omgubuntu.co.uk/2021/04/geary-40-released\n\n\nKdenlive 21.04 was released, and it packs a lot of new features!\nhttps://kdenlive.org/en/2021/04/kdenlive-21-04-released/\n\n\n## Hardware\nYou probably have heard about JingOS, the tablet focused Linux based OS coming from a relatively new chinese company. Well these guys want some nice flagship hardware to accompany that new distro, and they are launching a crowdfunding campaign for the JingPad A1, an ipad pro clone, at least in terms of look and feel, with 128Gb of storage, 6Gb of RAM, and an octo core CPU.\nhttps://en.jingos.com/jingpad-a1/\n\n## Gaming\n\nWine 6.7 was released, with a few new features\nhttps://www.winehq.org/announce/6.7\n\n22\nVKD3D 2.3 was released. The directX 12 to Vulkan conversion layer gains suport for DirectX Ray Tracing, only with Nvidia drivers for now.\nhttps://github.com/HansKristian-Work/vkd3d-proton/releases/tag/v2.3\n\n## Privacy\nWordpress announced that they would like to auto block the new Google designed tracking method called FLOC. It seems like Wordpress thinks that this method is a security concern, and is proposing to send, in future version 5.8, a header indicating that they don't want to support it. Wordpress powers, according to them, 41% of the web right now, so if that change is agreed upon, and I have little doubt it will, it means that Google's new tracking method could lose a LOT in terms of efficiency, that is, if people update their Wordpress version, which isn't the case for a lot of websites. Admins that still want to opt into Floc will be able to revert that change and remove the 4 lines of code. I covered this new tracking method in a dedicated video a few weeks ago, check out the card up top to know more.\n\nhttps://www.bleepingcomputer.com/news/security/wordpress-may-automatically-disable-google-floc-on-websites/", "link": "https://www.youtube.com/watch?v=9h4YIwT9JZM", "date_published": "2021-05-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]