[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCoOjH8D2XAgjzQlneM2W0EQ", "title": "Fine Art Isn’t About Art. It’s About Evading Taxes.", "description": "Get your first seven days right now for just ONE dollar. Go to ➡️ http://trends.co/jaketran for your $1 seven-day trial! 🔥\n\n😈 Watch exclusive 40+ minute documentaries that are too controversial to ever be released to the public: https://jake.yt/join \n\n📹 Take a peak at all the private documentaries here: https://jake.yt/hidden-vids\n\n💸 Win $1,000! https://jake.yt/1000 \n\nSubscribe to airrack's channel! https://jake.yt/airrack\n\n🎥 Business is complicated. Subscribe to curiosity: http://bit.ly/jt-sub\n🎙️ Subscribe to the 2nd channel, Intellectual Dropouts: https://jake.yt/id\n✉ Be the first to watch new videos with email notifications: http://bit.ly/jt-inbox\n📸 Follow me on IG for a chance to win $1,000: @jaketran // http://bit.ly/jt-ig\nPlease watch out for fake accounts. I will never message you asking for money or to invest. As of right now, it's spelled exactly like this: @jaketran\n👨👦👦 Join the Tran Mafia Family here: https://bit.ly/patreon-jt\n💬 Join the community Discord: http://discord.gg/BmK8EnQ\n\nSupport this channel monetarily:\n💻 𝗟𝗮𝗽𝘁𝗼𝗽 𝗟𝗶𝗳𝗲𝘀𝘁𝘆𝗹𝗲 𝗔𝗰𝗮𝗱𝗲𝗺𝘆: Learn exactly how I landed my $40/hr work from home job ($83k/yr) at 19 years old: https://jake.yt/LLAd\n🖥️ Website platform I use: https://jake.yt/kd\n📈 Get up to $250 in free Bitcoin at http://blockfi.com/jake \n💽 Editing software I've used for 7+ years: https://jake.yt/ccd\n📒 Online bookkeeping software I use: https://jake.yt/benchd \n📜 The exact resume I used to get my $40/hr remote web dev job + a lot of bonuses: https://jake.yt/DRBd\n🎥 My video gear, setup, tech, books: https://jake.yt/stored\n\n✉️ Email me: jake@jaketran.io\n\nSubscribe to the backup channel on LBRY, use reward code \"jake-cast\" for free coin: https://bit.ly/LBRY-jt\n\n📰 Sources & visuals: https://bit.ly/3udsTvK\n\n-----------------------\nYou’re a billionaire. The problem with being a billionaire is that you make a lot of money that you don’t want the government to get their grubby little hands on. So we need a way to hide your wealth discreetly, to reduce your tax burden. \n\nBuying the art. The fine art world is a very exclusive circle that is made up of only a few exquisite galleries or dealers where art gets sold for the first time, and two major auction houses where art gets resold for increasingly higher prices.\n\nSo you go to the gallery of your choice, pick a piece, they don’t put the price on display so you’re gonna have to ask, and when you finalize on a price, it’s then time for step #2 where are you gonna store the art.\n\nStoring the Art. Now, there’s two kinds of ultra wealthy that buy fine art: One are the people that genuinely enjoy art and then there are the ones that purely see art as we called it - a financial instrument to grow their money and get the government’s grubby hands off their wealth. If you really don’t care what the artwork looks like, what you can do is purchase the artwork, and have it shipped directly to what's called a “freeport” which are giant warehouses that you can think of as the physical equivalent of a Swiss bank account.\n\nPump up those numbers. Art is like any other asset like real estate or stocks. If you own a painting of one artist and other pieces from that artist keep selling for higher and higher prices, the value of your painting goes up too - at least on paper. And this is where the gallery and dealers will do most of the work. \n\nDonate. Let’s say you bought a painting for $10,000,000 a few years back. And today, it’s now worth a nice $50M. So you put $10m into this financial instrument, now you have $50m on paper, and you have that disgusting $37m tax bill staring at you in the face. \n\n-----------------------\n\nPhilanthrope, No Spirit - Pacific https://chll.to/6626a694\n\nAll materials in these videos are used for educational purposes and fall within the guidelines of fair use. No copyright infringement intended. If you are or represent the copyright owner of materials used in this video and have a problem with the use of said material, please send me an email, jake@jaketran.io, and we can sort it out.\n\nCopyright © 2021 Transcend Visuals, LLC. All rights reserved.\n\nDISCLAIMER:\n\nThis video does not provide investment or economic advice and is not professional advice (legal, accounting, tax).  The owner of this content is not an investment advisor.  Discussion of any securities, trading, or markets is incidental and solely for entertainment purposes.  Nothing herein shall constitute a recommendation, investment advice, or an opinion on suitability.  The information in this video is provided as of the date of its initial release.  The owner of this video expressly disclaims all representations or warranties of accuracy.  The owner of this video claims all intellectual property rights, including copyrights, of and related to, this video.\n\nAFFILIATE DISCLOSURE: Some of the links in this video's description are affiliate links, meaning, at no additional cost to you, the owner may earn a commission if you click through, make a purchase, and/or opt-in.", "link": "https://www.youtube.com/watch?v=3L1an9JU3Nk", "date_published": "2021-04-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]