[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Ranking the Best N64 Games", "description": "The Nintendo 64 is celebrating its 25th anniversary this year and it’s getting a lot of love from Nintendo, with their Nintendo Switch Online expanding to include classic N64 games like Super Mario 64, Starfox 64 and the Legend of Zelda: The Ocarina of Time. So with all the N64 love in the air, we’re looking back for that quick hit of nostalgia to decide the best games on the N64.\n\nIn this video, we go over the best games that the Nintendo 64 had to offer over its entire lifetime. From the weirdness of Grunty’s Lair in Banjo-Kazooie to the space adventure of Starfox 64, the 64 era was filled with classic worlds to discover and explore. Not only that, but with games like Super Mario 64, the N64 helped to define what 3D gaming could become. Even more, games like Mario Kart 64 set the template for long-running series that have dominated entire genres.\n\nFor this ranking, we look at everything from the multiplayer madness of Goldeneye 007 to the dark themes of Majora’s Mask to the horrors of Resident Evil 2… and it’s graphics. Even further, we highlight some underappreciated gems like Conker’s Bad Fur Day… though we hope you’ll forgive us if we forget to talk about Superman 64. \n\nIf you want to see how you can replay some of these nostalgic games, check out the news about N64 games, as well as some Sega Genesis classics, will be coming to Nintendo Switch Online later this year here!\n\n#n64 #nintendo", "link": "https://www.youtube.com/watch?v=xWhi0HTvXTs", "date_published": "2021-09-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 Open Beta Trailer", "description": "Be among the first to experience the next generation of all-out warfare in the Battlefield 2042 Open Beta. Join the fight on Orbital with a diverse selection of Specialists, cutting-edge weaponry, and vehicles to choose from. Open Beta between October 8-9, 2021. Early access is available on October 6-7, 2021 for all players who pre-order the game or are current EA Play members. \n\nPreload starts Oct 5th, 2021 at 06:00 UTC on PC and 07:00 UTC on consoles.\n\n#battlefield #battlefield2042", "link": "https://www.youtube.com/watch?v=DGimZtGatZY", "date_published": "2021-09-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty Black Ops Cold War & Warzone Season Six Cinematic", "description": "The final showdown between Adler and Stitch is coming in Season Six of Call of Duty Black Ops Cold War and Warzone.\n\n#cod #callofduty #warzone", "link": "https://www.youtube.com/watch?v=qeLPa1b7iAY", "date_published": "2021-09-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Co-Creator Reacts to Infinite | GameSpot News", "description": "Join Persia as she talks about the Halo co-creator’s reaction to Halo Infinite so far, Resident Evil 4 VR launching on the Oculus Quest 2, and the reworks coming to Bastion and Sombra in the next Overwatch game. \n\nIn today’s episode of GameSpot News, Persia talks about the reaction of Halo’s co-creator to Halo Infinite after the recent beta. Marcus Lehto said he had a \"great time\" playing Infinite over the weekend, going on to praise its combat and map designs. The next Halo Infinite beta test begins September 30, and it will invite players to try Big Team Battle for the first time.\n\nPersia also goes over the details for the launch of Resident Evil 4 VR. This version completely reimagines the classic title and provides a brand-new way to experience it which will be coming to the Oculus Quest 2 on October 21.\n\nLastly, she talks about the big changes to Sombra and Bastion in the next Overwatch game as details were revealed during the Overwatch League Grand Finals. Sombra receives a series of tweaks while Bastion has gotten much more of an overhaul. \n\nFor more information on all of our topics today, visit gamespot.com\n\nTIMESTAMPS:\n\nIntro - 00:00 \nHalo Infinite - 00:15\nResident Evil 4 VR - 01:14\nOverwatch 2  - 02:20\nOutro - 04:20\n\n#halo #haloinfinite", "link": "https://www.youtube.com/watch?v=MiucvV0mmEc", "date_published": "2021-09-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Metroid Dread - 5 Minutes of Off-Screen Gameplay", "description": "We got a chance to check out Metroid Dread on the Nintendo Switch OLED ahead the October 8 release. Here's 5 minutes of gameplay for Metroid Dread that we shot off screen, focusing on the opening of the game. We also have our hands-on impressions up for Metroid Dread, which you can check on YouTube and GameSpot.com.\n\n#metroiddread #metroid #switch", "link": "https://www.youtube.com/watch?v=HzrGWR4cgt0", "date_published": "2021-09-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New World Launch Day Livestream", "description": "Join DeVante as he dives into the world of Aeternum. For thousands of years explorers have ventured to the island in search of its mysterious resource known as Azoth. This substance grants power and eternal life but often at a cost and has led to the corruption of the island as well as the island’s former masters to nearly go extinct. \n\nFind out which faction DeVante chooses and what his preferred style of play is.\n\n#newworld #newworldlivestream", "link": "https://www.youtube.com/watch?v=QSp1qSpMdc0", "date_published": "2021-09-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New World Server Issues - We Know You Want To Play! | GameSpot News", "description": "In today’s episode of GameSpot News, Persia talks about the massive popularity of New World causing problems for the game’s servers, Battlefield 2042 beta details, and Halo Infinite’s next beta being open to everyone on Xbox and friend’s of current Halo Insiders. \n\nNew World, Amazon Game Studios' long-delayed MMO, is finally live, and it has quickly become the #2 game on Steam with more than 700,000 concurrent players and counting. Due to this, the game is experiencing overloaded servers that is causing long queue times. The game is also seeing massive popularity on Twitch, which is owned by Amazon. Currently, more than 750,000 people are watching New World on the platform, and those watching certain channels and who link their Steam accounts can earn Twitch drops for in-game items.\n\nEA and DICE have officially announced the open beta dates for Battlefield 2042 and the beta officially begins on October 8, but people who preorder or subscribe to EA Play can start two days early, beginning October 6. Since EA Play is bundled with Xbox Game Pass Ultimate, subscribers to Microsoft's service can start on October 6 as well. Many other features including progression, cosmetics, and more will also be available during the open beta. \n\nXbox users can get access to the upcoming Halo Infinite multiplayer beta by downloading the Xbox Insider Hub app, which is free to download. Current Halo Insiders will also receive a “friend code” that can be redeemed for access to the beta on PC or Xbox.\n\nFor more information on all of today’s topics, visit gamespot.com\n\nTIMESTAMPS:\nIntro - 00:00\nNew World - 00:17\nBattlefield 2042 - 01:20 \nHalo Infinite  - 03:39\nOutro - 04:52\n\n#newworld #gamespotnews", "link": "https://www.youtube.com/watch?v=5HZPQpvRlWk", "date_published": "2021-09-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Nintendo Switch OLED Hands On Preview", "description": "The Nintendo Switch OLED version will release on October 8, and we recently got a chance to finally spend some time playing with the new device.\n\nThe new Nintendo Switch OLED is almost out, with its release date of October 8 only a matter of days away. I recently got some hands-on time with this new version during a preview session with the upcoming Metroid Dread, and I'm sure the question you're all asking is the same. Is the Nintendo Switch OLED version, which at $350 is $50 more expensive than the base Switch version, worth it?\n\n#nintendo #switch #switchOLED", "link": "https://www.youtube.com/watch?v=ZtCWMgPzIOQ", "date_published": "2021-09-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Legends: Arceus | New Gameplay Trailer", "description": "Check out the all new Pokemon Legends: Arceus trailer that dropped showing off some of the Noble Pokemon you'll experience in the game. Pokemon Legends: Arceus is coming in January 2022 to Nintendo Switch.", "link": "https://www.youtube.com/watch?v=CUhP8-uA5vc", "date_published": "2021-09-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]