[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCoOjH8D2XAgjzQlneM2W0EQ", "title": "The mafia is not gonna like this video...", "description": "📹 Get unlimited stock video, photos, music, & more at http://storyblocks.com/jaketran\n\n😈 Watch exclusive 40+ minute documentaries that are too controversial to ever be released to the public: https://jake.yt/join\nUpdated refund policy: Email us within your first month of joining and we'll refund you for your first month. There is no refund if you cancel at a later time. \n\n📹 Take a peak at all the private documentaries here: https://jake.yt/hidden-vids\n\n🎥 Business is complicated. Subscribe to curiosity: http://bit.ly/jt-sub\n✨ Follow us on TikTok: https://jake.yt/tiktok\n🎙️ Subscribe to the 2nd channel, Intellectual Dropouts: https://jake.yt/id\n✉ Be the first to watch new videos with email notifications: http://bit.ly/jt-inbox\n📸 Follow me on IG for a chance to win $1,000: @jaketran // http://bit.ly/jt-ig\nPlease watch out for fake accounts. I will never message you asking for money or to invest. As of right now, it's spelled exactly like this: @jaketran\n💬 Join the community Discord: http://discord.gg/BmK8EnQ\n\n💻 𝗟𝗮𝗽𝘁𝗼𝗽 𝗟𝗶𝗳𝗲𝘀𝘁𝘆𝗹𝗲 𝗔𝗰𝗮𝗱𝗲𝗺𝘆: Learn exactly how I landed my $40/hr work from home job ($83k/yr) at 19 years old: https://jake.yt/LLAd\n📜 The exact resume I used to get my $40/hr remote web dev job + a lot of bonuses: https://jake.yt/DRBd\n🎵 Get unlimited royalty-free music for your videos with Epidemic Sound! ➡️ https://share.epidemicsound.com/jaketran\n\n🍿 OUR MOST VIRAL VIDEOS: \nNestlé: The Most Evil Business in the World https://youtu.be/rj6JOKrL_vg\nBlackRock: The Company that Owns the World https://youtu.be/1n4zkdfKUAE\nRecycling is literally a scam https://youtu.be/LELvVUIz5pY\nWhy do Chinese Billionaires Keep Disappearing? https://youtu.be/qyMsrgI7-_s\n\n✉️ Email me: jake@jaketran.io\n\n📰 Sources & visuals: https://bit.ly/3ENwYfI\n\n-----------------------\nIf you were a skilled worker in the 19th century, you were probably part of a labor union. Basically, a labor union is an organization workers could join for a fee, and in exchange, they would (in theory) get protection from the union against their employers lowering their wages, firing them for no reason, or from bad working conditions. \n\nOne of the first strikes ever recorded happened in 1768 in New York when workers started protesting against getting their salaries cut. \n\nSuddenly, everyone saw the power of collective bargaining, and people started demanding things like better salaries and less working hours per day. For skilled workers, unions could perform miracles. \n\nEmployers obviously weren’t exactly happy with these strikes, higher wages, and better working conditions. So to fight back, they needed to find ways to put an end to the strikes.\n\nBut as we all know, the only way to fight fire, is with fire! \n\nMafia controlled labor unions would soon become one of their most powerful, influential weapons.\n\nWhen the unions came knocking at the mafia’s door for help, the mobsters saw an opportunity of a lifetime. The two things any good mafioso wants most in his life is money and power, and by joining the unions they could get both. \n\nThe mafia took over so many unions that at one point, La Cosa Nostra had unions in every major city in the US.\n\nUnions gave the mafia a chance to expand, get richer, and spread their influence like never before. At one point, you couldn’t even tell the difference between unions and the mob.\n\nLike all good things, the marriage between the mafia and labor unions eventually had to come to an end. What had seemed like an unbreakable partnership was left in pieces.\n-----------------------\n\nAll materials in these videos are used for educational purposes and fall within the guidelines of fair use. No copyright infringement intended. If you are or represent the copyright owner of materials used in this video and have a problem with the use of said material, please send me an email, jake@jaketran.io, and we can sort it out.\n\nCopyright © 2021 Transcend Visuals, LLC. All rights reserved.\n\nDISCLAIMER:\n\nThis video does not provide investment or economic advice and is not professional advice (legal, accounting, tax).  The owner of this content is not an investment advisor.  Discussion of any securities, trading, or markets is incidental and solely for entertainment purposes.  Nothing herein shall constitute a recommendation, investment advice, or an opinion on suitability.  The information in this video is provided as of the date of its initial release.  The owner of this video expressly disclaims all representations or warranties of accuracy.  The owner of this video claims all intellectual property rights, including copyrights, of and related to, this video.\n\nAFFILIATE DISCLOSURE: Some of the links in this video's description are affiliate links, meaning, at no additional cost to you, the owner may earn a commission if you click through, make a purchase, and/or opt-in.", "link": "https://www.youtube.com/watch?v=fLkG0ySuHY0", "date_published": "2021-09-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]