[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Animal Friends of the 2021 Tiny Desk Contest", "description": "Animals aren't required in Tiny Desk Contest entries, but they are appreciated. Check out some of the animal friends who doubled as bandmates in these entries from the 2021 Tiny Desk Contest. \n\nWatch all the entries and learn more about the Tiny Desk Contest: https://npr.org/tinydeskcontest. \n\nSong: \"Halfway to Tilton\" by 9lb Hammer\n\n#tinydesk #tinydeskcontest", "link": "https://www.youtube.com/watch?v=FEG3Ob7-E_w", "date_published": "2021-07-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Bleachers: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nLyndsey McKenna | July 12, 2021\nBoth as producer extraordinaire and artist in his own right, Jack Antonoff has had an outsized impact on the past decade in pop. And yet, even with such maximalist aims, Antonoff clearly understands the effectiveness of scale: that the most enduring tracks are often intimate portraits.\n\nRecorded in a sun-drenched spot outside Electric Lady Studios, where the forthcoming Take the Sadness Out of Saturday Night was made, Bleachers' Tiny Desk (home) concert puts a premium on proximity, both emotionally and spatially. Surrounded by greenery, the footage is interspersed with close-up angles filtered through an old-school finish (scan the wide shot and you'll spy a video camera perched on the piano, plus one very tiny desk, too). The set opens with \"91,\" the album's ambitious opening cut, followed by a bombastic revision of \"Stop Making This Hurt,\" which gets a slick saxophone rewrite courtesy of Zem Audu and Evan Smith.\n\nJust before the concert concludes with a sweeping rendition of \"Chinatown\" – no Bruce Springsteen cameo, but the emotional ache remains – Antonoff explains the urgency of the recording process: \"We did a bunch of live takes that sound to me like a group of people who didn't know if they were ever gonna play again, and that became the backbone of this album.\" The stakes feel high when the tracks feel personal: It's a balancing act at which Antonoff excels.\n\nSET LIST\n\"91\"\n\"Stop Making This Hurt\"\n\"Chinatown\"\n\nMUSICIANS\nJack Antonoff: vocals, piano\nMikey Freedom Hart: keys\nZem Audu: saxophone\nEvan Smith: saxophone\n\nCREDITS\nVideo and Audio: Adrian Nieto\n\nTINY DESK TEAM\nProducer: Bobby Carter\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Kara Frame, Gabrielle Pierre\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #bleachers", "link": "https://www.youtube.com/watch?v=vvgTV5NEpu4", "date_published": "2021-07-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]