[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "\"Epic Mistake\"? Fmr NY Fed Exec Worries About Fed Policies | \"The Power of the Fed\" | FRONTLINE", "description": "Peter R. Fisher spent more than a decade working at the Federal Reserve Bank of New York. In this excerpt from the new documentary \"The Power of the Fed,\" he has a warning about the actions of the Fed system of which he was once part.\n\nSubscribe on YouTube: http://bit.ly/1BycsJW \n\n“I feel as anxious today as I've ever felt about the financial world, because of my belief that the Fed has been pumping up asset prices in a way that is creating a bit of an illusion,” Fisher tells FRONTLINE correspondent James Jacoby in the new documentary \"The Power of the Fed.\" \"And I think it — I think the odds are now sort of one in three, very high, that we will look at this as an epic mistake and one of the great financial calamities of all time.”\n\nFisher, who left his role as executive vice president and manager of the System Open Market Account of the New York branch of the nation’s central bank in 2001, is just one of the former and current Fed insiders who speak with FRONTLINE in the new documentary, along with economists, journalists and titans of finance. From the award-winning investigative team behind \"Amazon Empire\" and \"The Facebook Dilemma,\" \"The Power of the Fed\" examines the roots of the Federal Reserve’s attempt to avert financial crisis when COVID-19 struck and how the institution continues to pump billions of dollars into the financial system daily, more than a year later — a process Fisher criticizes.\n\nThe Fed’s response to COVID, the film finds, is the latest chapter in an experiment begun after the 2008 crash that involves both lowering interest rates to almost zero, and creating new money and injecting it into the financial system in a process called “quantitative easing. That experiment has been dramatically changing the American economy ever since — and was ramped up in a big way when the coronavirus pandemic hit, the filmmakers find, helping to stave off total economic collapse.\n\n“We're lucky that the government was successful, or we could be living through a true depression,” Lev Menand, a former economic advisor to the Fed and the Treasury Department, says in the film.\n\nWhile well-intentioned, the Fed’s experiment has delivered mixed results over the years, some experts say in the documentary, with the biggest benefits going to Wall Street rather than Main Street, wealth inequity widening and the risk of inflation growing.\n\nNeel Kashkari, president of the Federal Reserve Bank of Minneapolis, defends the Fed’s actions and impacts on the economy in the documentary.\n\n“The Fed has been on a mission, I've been on a mission, to put Americans back to work and help them get their wages up, especially for those lowest-income Americans,” Kashkari says. “And if it’s had some effect on Wall Street, to me, the tradeoff is well worth it, if we can put Americans back to work, so that they can put food on the table, they can take care of themselves. That is profoundly beneficial to society.”\n\nWatch \"The Power of the Fed\" in full starting July 13: https://to.pbs.org/3hH4Z85\n\nThe correspondent is James Jacoby. The writers and producers are Anya Bourg and James Jacoby. The co-producer is Megan Robertson. The senior producer is Frank Koughan. The documentary is supported by The WNET Group’s Chasing the Dream, a public media initiative that examines poverty, justice and economic opportunity in America. \n\n\nFind more from FRONTLINE on the PBS Video App, where there are more than 300 FRONTLINE documentaries available for you to watch any time: https://to.pbs.org/FLVideoApp\n\nSubscribe on YouTube: http://bit.ly/1BycsJW \nInstagram: https://www.instagram.com/frontlinepbs \nTwitter: https://twitter.com/frontlinepbs \nFacebook: https://www.facebook.com/frontline \n\nFRONTLINE is produced at GBH in Boston and is broadcast nationwide on PBS. Funding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Major funding for FRONTLINE is provided by the Ford Foundation. Additional funding is provided by the Abrams Foundation; the John D. and Catherine T. MacArthur Foundation; Park Foundation; and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation and additional support from Koo and Patricia Yuen. Support for The Power of the Fed is provided by The WNET Group’s “Chasing the Dream,” a public media initiative that examines poverty, justice, and economic opportunity in America, with major funding by The JPB Foundation and additional funding from The Peter G. Peterson and Joan Ganz Cooney Fund.", "link": "https://www.youtube.com/watch?v=YD6uaIxtCaY", "date_published": "2021-07-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "Episode 4: The Hope | Un(re)solved Podcast | FRONTLINE", "description": "Fifty-five years before the death of Breonna Taylor in Louisville, Kentucky, the killing of another Black woman, Alberta O. Jones, sent shock and grief through that city’s Black community.\n\nIn 1965, Jones, a trailblazing attorney in Louisville, was found dead, floating in the Ohio River — the victim of a murder that’s still unsolved today. Thirty-four-year-old Jones was the city’s first female prosecutor, and a charismatic fixture in the Black community, helping educate and register people to vote.\n\nDespite multiple investigations over nearly 60 years, there are no official motives or suspects in her killing. In 2018, her case was added to the federal government’s cold case list and is one of the few that remains open.\n\nIn episode 4, James explores what an open case on the list looks like through the life and death of Alberta Jones — and talks to the person who never gave up fighting for answers.\n\nThis journalism is made possible by viewers like you. Support your local PBS station here: http://www.pbs.org/donate\n\nThe multi-platform Un(re)solved project investigates the federal government’s effort to grapple with America’s legacy of racist killings, mainly against African Americans, through the Emmett Till Unsolved Civil Rights Crime Act. For more, visit: frontline.org/unresolved\n\nLove FRONTLINE? Find us on the PBS Video App where there are more than 300 FRONTLINE documentaries available for you to watch any time: https://to.pbs.org/FLVideoApp\n\n#Unresolved #CivilRightsColdCases #frontlinePBS\n\nSubscribe on YouTube: http://bit.ly/1BycsJW\nInstagram: https://www.instagram.com/frontlinepbs\nTwitter: https://twitter.com/frontlinepbs\nFacebook: https://www.facebook.com/frontline\n\nThe Un(re)solved podcast was produced by FRONTLINE at WGBH and powered by PRX. Some of the interviews with family members of the next of kin were produced in collaboration with StoryCorps, a national nonprofit whose mission is to preserve and share humanity’s stories in order to build connections between people and create a more just and compassionate world. The Civil Rights and Restorative Justice Project at Northeastern University served as an academic advisor to the project.\n\nSupport for the Un(re)solved podcast by PBS; the Corporation for Public Broadcasting; the Abrams Foundation; WGBH; and the Massachusetts General Hospital Cancer Center.\n\nThe FRONTLINE Dispatch is made possible by the Abrams Foundation and by the GBH Catalyst Fund. Additional support for the FRONTLINE Dispatch comes from the Massachusetts General Hospital Cancer Center.\n\nSupport for the Un(re)solved initiative provided by PBS; the Corporation for Public Broadcasting; the Abrams Foundation; the Jonathan Logan Family Foundation; The WNET Group’s Chasing the Dream, a public media initiative that examines poverty, justice, and economic opportunity in America, with major funding by The JPB Foundation and additional funding from The Peter G. Peterson and Joan Ganz Cooney Fund; the GBH Catalyst Fund; the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation; the Lisa and Douglas Goldman Fund; the Massachusetts General Hospital Cancer Center; The Barbra Streisand Foundation; and Unity Software, Inc. through its Unity Charitable Fund, a fund of the Tides Foundation.\n\nFunding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Major funding for FRONTLINE is provided by the Ford Foundation. Additional funding is provided by the Abrams Foundation; the John D. and Catherine T. MacArthur Foundation; Park Foundation; and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation.\n\n© 2021 WGBH Educational Foundation\nAll Rights Reserved", "link": "https://www.youtube.com/watch?v=_PO9O2XrEzw", "date_published": "2021-07-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "Police Killed a Handcuffed Man. Here's What Led to the Shooting. | FRONTLINE", "description": "Bodycam footage obtained by The Salt Lake Tribune and FRONTLINE from the West Valley City Police in Utah, reveals what preceded a fatal, point-blank shooting of a handcuffed man — including the man’s denied requests for psychiatric help, which have never before been reported.\n \nWARNING: This video contains graphic footage of a person being killed in police custody and strong language.\n \nIn the two years since Michael Chad Breinholt’s August 23, 2019, shooting death, the public has only seen a sliver of what happened in bodycam footage released by police. Now, this video draws on newly obtained bodycam footage to paint a fuller picture of what happened, showing how the encounter that would lead to Breinholt’s death began, and how officers’ handling of him turned fatal. \n \nWhen police initially responded to a call about Breinholt, his girlfriend told police, “he told me he took, like, eight or nine pills,” and said Breinholt told her “he took all those pills so he’ll die.”Over the course of the next two hours, while booking Breinholt on DUI charges, police denied his requests for psychiatric help — at one point, leaving him lying on the floor for more than 11 minutes while waiting for a medical team’s review. Police did not inform the medics that he had taken pills possibly attempting to end his life.\n \nOfficers had already searched Breinholt for weapons, the footage reveals. But after a disoriented Breinholt began claiming he had a gun, an officer began grappling with him. Eventually, Breinholt was shot point-blank by police sergeant Tyler Longman while his hands were cuffed behind his back. One officer claimed Breinholt had grabbed his gun, although it was never removed from the holster. \n \n“You’re about to die, my friend,” Longman said prior to firing the fatal shot.\n \nThe West Valley City Police Department found Sergeant Longman's use of deadly force within policy. As of July 12, 2021, the district attorney has not filed any charges.\n \nThis is the third person Sergeant Longman has killed while on duty. The previous two shootings in 2007 and 2008 were ruled legally justified.\n \nThis reporting is part of FRONTLINE’s partnership with The Salt Lake Tribune through the FRONTLINE Local Journalism Initiative. For more on this story, visit the Salt Lake Tribune’s website: https://www.sltrib.com/news/2021/07/12/video-west-valley-city/\n \nBreinholt’s case will be featured in an upcoming FRONTLINE documentary premiering in the fall on PBS. The documentary is produced, written and directed by Abby Ellis and reported with The Salt Lake Tribune.\n \nVideo Credits\nProduced & Edited by: Abby Ellis\nReporter: Jessica Miller, The Salt Lake Tribune \nAdditional Editing: Miles Alvord and Tessa Maguire\nMusic: Ty Gibbons\n \nSubscribe on YouTube: http://bit.ly/1BycsJW\nInstagram: https://www.instagram.com/frontlinepbs\nTwitter: https://twitter.com/frontlinepbs\nFacebook: https://www.facebook.com/frontline\n \nFunding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Major funding for FRONTLINE is provided by the Ford Foundation. Additional funding is provided by the Abrams Foundation; the John D. and Catherine T. MacArthur Foundation; Park Foundation; and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation, and additional support from Koo and Patricia Yuen. Additional support for this video was provided by the Corporation for Public Broadcasting, the John S. and James L. Knight Foundation, and the Hollyhock Foundation.", "link": "https://www.youtube.com/watch?v=GV0oLU9E4zc", "date_published": "2021-07-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]