[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Company of Heroes 3 - Announcement Trailer", "description": "Check out the all new announcement trailer for Company of Heroes 3!\n\n#companyofheros3", "link": "https://www.youtube.com/watch?v=56zJehIXcaU", "date_published": "2021-07-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Company of Heroes 3 - Gameplay Reveal Trailer", "description": "Check out the all new Company of Heroes 3 Gameplay Reveal Trailer!\n\n#companyofhereos3", "link": "https://www.youtube.com/watch?v=O6FOau5Mmvk", "date_published": "2021-07-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "EA PLAY Live 2021 Spotlight – Independent Studios Livestream", "description": "Todd Martens of the Los Angeles Times hosts a panel featuring Josef Fares of Hazelight (It Takes Two), Olov Redmalm of Zoink (Lost in Random), Melissa Phillips and Abubakar Salim of newcomers Silver Rain Games, and Guha Bala of Velan (Knockout City™).\n\nESRB EVERYONE to TEEN.\n\n#eaplay", "link": "https://www.youtube.com/watch?v=rwwjLZefHTg", "date_published": "2021-07-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Does Dead Space Need a Remake?", "description": "With the success of Capcom's Resident Evil 2 remake, rumors are abound that EA is looking into giving Dead Space a similar treatment and could discuss it at EA Play Live 2021. But, how much of a face lift does Dead Space really need? The game is still playable on modern consoles and looks great. Do we need a Dead Space Remake?\n\nFew games hold up as well as Dead Space. Despite releasing 13 years ago, Visceral Games' space horror shooter is still as intense and scary today as it was then. In fact, it's shockingly good--you can get it right now on PC, Xbox One, and even Xbox Series X with Auto HDR, and it still controls exceedingly well, features some great shooting mechanics, and looks pretty great.\n\nBut most importantly, Dead Space can still scare the hell out of you, with a combination of great sound design, excellent jump scares, ridiculously gross monsters, and awesome set piece moments. Running atop of the Ishimura with Zero-Gravity boots, I’m looking at you.\n\n#deadspace", "link": "https://www.youtube.com/watch?v=ccdqr1dyX28", "date_published": "2021-07-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]