[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Activision Employees Stage Walkout Following Bombshell Bobby Kotick Report | GameSpot News", "description": "In today’s episode of GameSpot News, DeVante talks about the latest update involving Activision Blizzard, the modding community improving the GTA trilogy, and more. \n\nThe first story involves a bombshell report from the Wall Street Journal that covers numerous allegations at Activision Blizzard CEO Bobby Kotick, including that he had knowledge of numerous sexual assault and harassment claims at the company's various studios. In the wake of this, Kotick released an internal video message to staff, but a group of employees are now staging a walkout.\n\nDevante also talks about the GTA modding community taking it upon themselves to make improvements to the Grand Theft Auto: The Trilogy - The Definitive Edition. Outside of fixing visual issues, some modders have also gotten busy restoring the classic feel of The Trilogy's games.\n\nLater in the video, DeVante also covers Far Cry 6, as the game's new Vaas Insanity DLC has launched, alongside new Breaking Bad-inspired cosmetics. November 16 also saw the release of a new Far Cry 6 hotfix that fixes various issues and in addition to the paid content, Far Cry 6 will offer free expansions featuring missions involving Danny Trejo, Stranger Things, and Rambo.\n\nFor more information on all of our topics, please visit gamespot.com.", "link": "https://www.youtube.com/watch?v=45Xk3YU1r_w", "date_published": "2021-11-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 Issues? It's Not Your Fault | GameSpot News", "description": "In this episode of GameSpot News, we talk about Battlefield 2042’s rubber banding issues being investigated by DICE, Saints Row Reboot being delayed to August 2022 and shareholders calling for Activision Blizzard CEO Bobby Kotick to resign.\n\nIn this video, DeVante talks about DICE investigating Battlefield 2042’s rubber banding issues. Rubber banding results in players snapping between two positions on a map, hence the name. It stems from high latency or packet loss, as a player's position in-game desynchronizes with the location the game server has them in.\n\nDeVante also talks about the Saints Row reboot being delayed. Originally scheduled for release on February 25, 2022, the game is now launching six months later, on August 23, 2022.  \n\nLater in the video, shareholders call for Activision Blizzard CEO Bobby Kotick to resign following a report that he knew of misconduct at the company. \n\nTIME STAMPS\n00:00 - Intro\n00:06 - Battlefield 2042 Issues\n01:12 - Saints Row Delayed\n02:12 - Activision Blizzard Update", "link": "https://www.youtube.com/watch?v=kF8r5pBveIY", "date_published": "2021-11-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Brilliant Diamond & Shining Pearl Review-In-Progress", "description": "Pokemon Brilliant Diamond and Shining Pearl are comfortably nostalgic, with just enough modern tweaks to smooth over the rough edges.\n\nNintendo and ILCA's Pokémon Brilliant Diamond & Shining Pearl will be available on Nintendo Switch on November 19, 2021. You can read the full written Pokémon Brilliant Diamond & Shining Pearl review-in-progress by Steve Watts on GameSpot: https://www.gamespot.com/reviews/pokemon-brilliant-diamond-shining-pearl-review-in-progress/1900-6417790/", "link": "https://www.youtube.com/watch?v=tsyXsJvjArM", "date_published": "2021-11-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Dying Light 2 Hands-On Preview", "description": "We got hands-on time with Dying Light 2, the anticipated sequel to 2016's open-world post-apocalyptic game. \n\nThe build Mark Delaney played was about a month old and kicked off in the game's opening region Old Villedor. This was, as lead game designer Tymon Smektala explained it, a tamer region meant to allow players to get to grips with the game's melee combat and parkour moves, and come to understand how to manage crowds of infected and survivors alike.\n\nThe first thing I realized when I started to play Dying Light 2 was how fluid the movement felt. Smart changes like faster strafing and back-pedaling, and an always-on sprint ability, make the anti-hero protagonist Aiden Caldwell feel more adept at performing his death-defying feats than Kyle Crane ever was. He's lighter on his feet and animations are smoother, even from the get-go, and despite me seeing some really tantalizing skills not yet unlocked during my play sessions. I especially loved how quickly I was able to intuit whether or not I could make any particular jump. The mechanics are improved across the board and give the controls a faster, more reliable feeling in my hands. \n\n#DyingLight2", "link": "https://www.youtube.com/watch?v=5Pl-MdM1-i4", "date_published": "2021-11-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Fortnite X Naruto Shippuden Trailer", "description": "Naruto and Team 7 from Naruto Shippuden join the Fortnite Crew.\n\nPlay Fortnite Battle Royale, the completely free 100-player PvP mode. One giant map, A Battle Bus, Last one standing wins.\n\n#Fortnite #Naruto", "link": "https://www.youtube.com/watch?v=wYkDeaCfBQo", "date_published": "2021-11-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Infinite Multiplayer Surprise Launch: Co-Op, Forge Details Coming Soon | GameSpot News", "description": "In this episode of GameSpot News, we talk about Halo Infinite’s Multiplayer beta releasing early, Battlefield 2042 crashing on Xbox Series X, the GTA Trilogy returning to PC and Rainbow Six Extractions post-launch DLC plans. \n\nIn this video, DeVante talks about November 15th’s Xbox 20th Anniversary Celebration and the launch of Halo Infinite’s multiplayer. The shooter’s first season is called Heroes of Reach and will run through May 2, 2022. Alongside Halo, Microsoft announced a new six-part documentary series titled Power On and addition of 70+ original Xbox and Xbox 360 titles to the backwards compatibility library of Xbox One and Xbox Series X|S. \n\nDeVante also talks about Battlefield 2042 running into some issues on Xbox Series X. According to a blog post, DICE will release an update on November 17 to resolve the crashing issues. The update is optional until November 23, when it becomes mandatory.\n\nLater in the video, the GTA Trilogy returns to PC and Ubisoft reveals Rainbow Six Extractions post-launch DLC plans.", "link": "https://www.youtube.com/watch?v=G1X5xjgPmFc", "date_published": "2021-11-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Let's Play Elden Ring | Every Boss Fight in the Closed Network Test", "description": "The Elden Ring's Network Test has wrapped up, and Dave Klein of DaveControl tackled the Elden Ring Network Test on PlayStation 5 to see if he could defeat every Elden Ring boss during the 3 hour time limit of 1 session. Not only that, but what Elden Ring secrets we could find just in this network test alone. Elden Ring releases February 25, 2022. Check out all the timestamps below for a glimpse at all the bosses that the Elden Ring Network Test had to offer.\n\n1:41 - Limgrave\n13:02 - Burial Tree Watchdog\n17:05 - Beastman of Farum Azula\n33:24 - Obtaining Ordovis' Greatsword and the Crucible Set\n41:45 - Pumpkin Head\n45:47 - Stormhill Statue Secret Item\n49:27 - Flying Dragon Agheel\n1:03:40 - Stonedigger Troll\n1:09:58 - Bloody Finger Hunter Yura\n1:20:37 - Grave Warden\n1:23:51 - Bloody Finger Nerijus Invasion\n1:27:02 - Spirit Tracks on the Beach\n1:31:30 - Demi-Human Chief\n1:35:48 - Church of Dragon Communion\n1:40:42 - Bloodhound Knight Darriwil\n1:44:33 - Tree Sentinel\n1:50:21 - Margit the Fell Omen\n1:55:34 - Stormveil Castle Route 1\n1:58:35 - Many Armed Key Master\n2:02:42 - Stormveil Castle Route 2\n2:04:55 - Lion Guardian\n2:12:50 - Soldier of Godrick\n2:14:05 - Giant Flower\n2:19:52 - Bridge Knight Battle\n2:22:40 - Hidden NPC\n2:29:04 - Spiritspring Fun", "link": "https://www.youtube.com/watch?v=jkz9cDmFFe4", "date_published": "2021-11-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Brilliant Diamond & Shining Pearl - Everything To Know", "description": "With Pokémon Brilliant Diamond and Shining Pearl's November 19th release date right around the corner, here is everything you need to know about these Nintendo DS remakes.\n\nNearly 15 years after their original release, Pokémon Diamond and Pearl are coming to Nintendo Switch as Brilliant Diamond and Shining Pearl. And like other Pokémon remakes before them, these two games update the classic DS versions with some modern features. \n\nIn this video, we share everything you need to know about Pokémon Brilliant Diamond and Shining Pearl. From the new Grand Underground to modern additions such as autosave, experience sharing and more. \n\nPokémon Brilliant Diamond and Shining Pearl launch exclusively for Nintendo Switch on November 19, 2021.", "link": "https://www.youtube.com/watch?v=6A0p7d16f5c", "date_published": "2021-11-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]