[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Vitamin D levels advised", "description": "Read the link to the original paper, \nhttps://www.mdpi.com/2072-6643/13/10/3596\n\nDeficiency of vit D limits the performance of systems resulting in, increased spread of diseases of civilization\n\nReduced protection against infections\n\nReduced effectiveness of vaccination\n \nCovid fatality rates correlate with,\n\nElderly, dark, black people, comorbidities, winter\n\nBlood level of 20 ng/mL, (50 nmol/L) sufficient to stop osteomalacia\n\nPreferable, 40–60 ng/mL (100 to 150 nmol/L)\n\nVitamin D3 receptors\n\nBone\n\nIntestine\n\nPancreas\n\nProstate\n\nImmune system cells\n\nVitamin D is a powerful epigenetic regulator\n\nInfluencing more than 2,500 genes\n\nCancer\n\nDiabetes mellitus\n\nAcute respiratory tract infections\n\nViral lung infections that cause ARDS\n\nChronic inflammatory diseases\n\nAutoimmune diseases\n\nMultiple sclerosis\n\nImmunomodulatory properties\n\nRegulating innate and adaptive immune systems\n\nD3 receptors \n\nMonocytes/macrophages\n\nT cells\n\nB cells\n\nNatural killer (NK) cells\n\nDendritic cells (DCs)\n\nSupplements\n\nWithout calcium supplementation, even very high vitamin D3 supplementation does not cause vascular calcification\n\nVitamin D3 supplementation in the range of 4000 to 10,000 units (100 to 250 µg) needed to generate an optimal 40–60 ng/mL (100 to 150 nmol/L)\n\nhas been shown to be completely safe when combined with approximately 200 µg vitamin K2\n\nhttps://www.nhs.uk/conditions/vitamins-and-minerals/vitamin-k/\n\nHowever, this knowledge is still not widespread in the medical community, and obsolete warnings about the risks of vitamin D3 overdoses unfortunately are still commonly circulating.\n\nARDS and cytokine release syndrome\n\nVitamin D3 is able to inhibit the underlying metabolic pathways\n\nVitamin D3 has a protective role against ARDS caused by SARS-CoV-2. \n\nA rapidly increasing number of publications are investigating the vitamin D3 status of SARS-CoV-2 patients,\n\nand have confirmed low vitamin D levels in cases of severe courses of infection \n\nand positive results of vitamin D3 treatments \n\nConclusions\n\nwe recommend raising serum 25(OH)D levels to above 50 ng/mL (100 to 150 nmol/L)\n\nto prevent or mitigate new outbreaks due to escape mutations or decreasing antibody activity.\n\nAt a time when vaccination was not yet available,\n\npatients with sufficiently high D3 serum levels preceding the infection were highly unlikely to suffer a fatal outcome. \n\nThis correlation should have been good news when vaccination was not available but instead was widely ignored. \n\nthe lower threshold for healthy vitamin D levels should lie at approximately 125 nmol/L or 50 ng/mL 25(OH)D3,\n\nwhich would save most lives, reducing the impact even for patients with various comorbidities.\n\nThis is—to our knowledge—the first study that aimed to determine an optimum D3 level to minimize COVID-19 mortality\n\nImplications for herd immunity\n\nIt seems clear that a good immune defense, \n\ndoes not prove protection against physical infection \n\nbut rather against its consequences\n\nThis “protection” was most effective at ~55 ng/mL\n\nTraditionally living populations in East Africa have a mean serum 25-hydroxyvitamin D concentration of 115 nmol/l\nhttps://www.cambridge.org/core/journals/british-journal-of-nutrition/article/traditionally-living-populations-in-east-africa-have-a-mean-serum-25hydroxyvitamin-d-concentration-of-115-nmoll/6188564A01361C5CF5F196229430E475\n\nnatural vitamin D3 levels seen among traditional hunter/gatherer lifestyles,\n\nin a highly infectious environment, \n\nwere 110–125 nmol/L (45–50 ng/mL)\n\nWHO advice may not be correct\n\n30 ng/mL D3 value considered by the WHO as the threshold for sufficiency\n\nFuture mutations of the SARS-CoV-2 virus, vaccine immune escape\n\nthe entire population should raise their serum vitamin D level to a safe level as soon as possible. \n\nAs long as enough vitamin K2 is provided, the suggested D3 levels are entirely safe to achieve by supplementation. \n\nSelenium, magnesium, zinc, and vitamins A and E should also be controlled for and supplemented where necessary to optimize the conditions for a well-functioning immune system.\n\nNext study\n\ntest PCR-positive contacts of an infected person for D3 levels immediately, i.e., \n\nbefore the onset of any symptoms, \n\nand then follow them for 4 weeks and relate the course of their symptomatology to the D3 level, \n\nthe same result as shown above must be obtained", "link": "https://www.youtube.com/watch?v=V5g9AVqRsjo", "date_published": "2021-11-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Vitamin D, government inaction", "description": "COVID-19 Mortality Risk Correlates Inversely with Vitamin D3 Status, \n\na Mortality Rate Close to Zero Could Theoretically Be Achieved at 50 ng/mL 25(OH)D3: (125 nmol/L)\n\nResults of a Systematic Review and Meta-Analysis\n\nhttps://www.mdpi.com/2072-6643/13/10/3596\n\nBlood calcifediol (25(OH)D3) levels correlate strongly with SARS-CoV-2 infection severity\n\nCause or effect?\n\nStrength of our immune system,\n\nMore or less neglected by the responsible authorities\n\nNutrition, physical fitness, recreation, sleep\n\nWidespread vitamin D deficiency\n\nData collected March 2021\n\nMethods\n\nSystematic literature search\n\nRetrospective cohort studies (1)\n\nClinical studies (7) on COVID-19 mortality rates versus D3 blood levels\n\nReported D3 blood levels pre-infection or on the day of hospital admission\n\nMortality rates, corrected for age, sex, and diabetes\n\nResults\n\nNegative Pearson correlation of D3 levels and mortality risk\n\nr = −0.4154, p = 0.0770\n\nr = −0.4886, p = 0.0646\n\nCombined data\n\nMedian D3 levels were 23.2 ng/mL (58 nmol/L)\n\nPearson correlation = −0.3989, p = 0.0194\n\nRegression suggested a theoretical point of zero mortality at approximately 50 ng/mL (125 nmol/L) D3\n\nConclusions\n\nThe datasets provide strong evidence that low D3 is a predictor rather than just a side effect of the infection. \n\nDespite ongoing vaccinations, we recommend raising serum 25(OH)D levels to above 50 ng/mL", "link": "https://www.youtube.com/watch?v=fbGug3rczx4", "date_published": "2021-11-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]