[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty Firebase Z New Zombie Map", "description": "Join us to solve the initial secrets of Firebase Z, Call Of Duty: Black Ops Cold War's latest map in the Dark Aether Story. If you're looking for more information on FireBase Z check out our additional coverage on GameSpot https://www.gamespot.com/articles/call-of-duty-black-ops-cold-war-patch-notes-february-3-firebase-z-express-map-more/1100-6487085/", "link": "https://www.youtube.com/watch?v=Xgl5Q9cZcbk", "date_published": "2021-02-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "God Of War PS5 vs PS4 Pro - Loading Times & Gameplay Comparison", "description": "God of War (2018) is a gorgeous game, but with the latest PS5 patch it looks even better. Here's a side by side comparison of the PS5 and PS4 Pro versions.\n\nGod of War is a great game--one of our favorites of 2018. It's a pretty good-looking exclusive for PlayStation 4 as well, so we figured that checking out the game on PS5 following the release of its new gen console upgrades was in order.\n\nIn the video above, we play through God of War on both PS4 Pro and PS5. We also do a side-by-side comparison of the game's load times on the two different consoles, providing a clear view of just how much faster the game loads on PS5.\n\nAnd speaking of loading, did you know that developer Sony Santa Monica had to pull off some exceptionally clever tricks in order to make that scene as awe-inspiring and cool-looking as it did? If you've played God of War, you know exactly which scene we're talking about. On the first episode of Audio Logs, game director Cory Barlog offers his insight into how God of War's most memorable scene was ultimately created.\n\nIf you haven't yet played God of War, you probably want to skip that episode of Audio Logs until you do. The game is definitely worth your time--as seen in GameSpot's God of War review, which reads: \"In many ways God of War is what the series has always been. It's a spectacular action game with epic set pieces, big-budget production values, and hard-hitting combat that grows more feverish and impressive as you progress. What may surprise you is how mature its storytelling has become. Like Kratos, God of War recalls the past while acknowledging the need to improve. Everything new it does is for the better, and everything it holds onto benefits as a result. Kratos is no longer a predictable brute. God of War is no longer an old-fashioned action series. With this reboot, it confidently walks a new path that will hopefully lead to more exciting adventures to come.\"", "link": "https://www.youtube.com/watch?v=aKoprh-vgX4", "date_published": "2021-02-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Control Ultimate PS5 vs PS4 - Loading Times And Gameplay Comparison", "description": "Control Ultimate Edition on PS5 brings out the full potential of the game with faster loading times, a new 60fps performance mode, and a ray tracing graphics mode.\n\nControl: Ultimate Edition takes the already excellent storytelling of 2019's Control and brings it to next-gen tech on Xbox Series X|S and PlayStation 5. And it just looks so good. But you don't need to just take our word for it, you can check it out for yourself.\n\nIn the video above, we showcase how Control on PS4 compares with Control: Ultimate Edition on PS5. We first test the game's loading speeds, putting Control on both base PS4 and PS4 Pro up against the Ultimate Edition on PS5. After that, we dive into some side-by-side gameplay comparisons. Don't worry, if you've yet to play Control, you won't find any major spoilers here. We just go through the first 20 minutes of the game's campaign.\n\nIn GameSpot's Control review, Peter Brown writes, \"It's not often that a game invades my thoughts the way Control has. I'm at the point where I want to consume every last thing it has to offer. And if I'm honest, it also makes me want to go back and replay Remedy's past games, too. Sure, it's a faulty metroidvania in some respects, but there are so many exceptional qualities afoot that Control handily deflects any momentary ire.\"\n\nOn top of that, Phil Hornshaw adds that the Ultimate Edition, with \"its graphical add-ons, the stability and performance enhancements, and the inclusion of all of Control's DLC,\" is \"the best way to experience Control--and the PS5's haptics really add an extra layer of intensity to a game that already feels great to play.\" \n\nControl is available for Xbox One, PS4, Luna, PC, and Switch, while the Ultimate Edition is available for Xbox Series X|S and PS5.", "link": "https://www.youtube.com/watch?v=4P1vx-6Dx98", "date_published": "2021-02-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]