[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Abandoned and the Silent Hill Conspiracy", "description": "After Hassan Kahraman unveiled his Abandoned Teaser to the internet, widespread speculation began that Abandoned was - in fact - a secret reveal for Hideo Kojima's Silent Hill. While Blue Box Game Studios have fervently denied any connection to Hideo Kojima and Silent Hill, the internet has continued to find odd correlations between Blue Box Game Studios, Abandoned, Hideo Kojima, and Silent Hill. This is that story.\n\nAccording to Hassan Kahraman, Abandoned will be revealed in the coming months.\n\n#Abandoned #SilentHill", "link": "https://www.youtube.com/watch?v=sFVK0SO_FLI", "date_published": "2021-06-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Apex Legends' Kings Canyon: Evolution Of Its Map Changes", "description": "Kings Canyon has a long history in Apex Legends--it's undergone many changes, like Skull Town, and been the setting for numerous in-game story moments like the rivalry between Revenant and Loba or the relationship between Caustic and Wattson.\n\nPersia and Jordan are back to talk over some more Apex Legends lore. With Kings Canyon and World's Edge reverting to their original layouts for the Apex Legends Genesis event, the duo decided it would be a good opportunity to talk through the history of those maps. First up: the OG, Kings Canyon.\n\nIn the video above, Persia and Jordan discuss Kings Canyon's history, both in terms of its lore and updates over the seasons. As Apex Legends' first map, Kings Canyon has seen more changes than any other in the game. Kings Canyon has been invaded by wild animals, poisoned by toxic fuel, excavated by greedy corporations, and blown up by numerous people numerous times.\n\nPersia and Jordan start at the beginning, discussing how Kings Canyon looked when Apex Legends first launched back in February 2019. The map saw its first town takeover in Season 1: Wild Frontier and then underwent its first major transformation in Season 2: Battle Charge. And, of course, you can't talk about Kings Canyon without diving into Season 5: Fortune's Favor, when the map's most prominent landmark, Skull Town, was destroyed.\n\nKings Canyon has been the center stage for plenty of stories in Apex Legends as well. The earliest major in-game teasers on this map ultimately led to the reveal of Crypto. It's on Kings Canyon that we first learned of the Titanfall/Apex Legends multiverse as well. Plus, Kings Canyon has been the site where many ongoing rivalries and storylines among the legends reached meaningful developments, especially for Loba and Revenant, Wattson and Caustic, and Fuse and Mad Maggie.\n\n#kingscanyon #apexlegends", "link": "https://www.youtube.com/watch?v=ovAC2FHSAio", "date_published": "2021-06-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Mass Effect Devs Break Down Their Favourite Moments", "description": "One week before the release of Mass Effect: Legendary Edition, we asked three BioWare developers to break down their favourite moments from the original trilogy. From the infamous Suicide Mission to Shepard's questionable dance moves Mac Walters, Melanie Faulknor and Brenon Holmes share their memories of the scenes and set pieces from the Mass Effect trilogy that matter to them.\n\nThis video features a mix of gameplay from the original Mass Effect trilogy and Mass Effect: Legendary Edition.\n\n00:00: Intro\n00:35: The Suicide Mission\n03:42: Biotic Charge\n06:33: Geth & Quarian Conflict (Bad Outcome)\n10:06: The Child\n11:38: Anderson's Finale\n14:29: Shepherd's Terrible Dance Moves\n15:31: Working on the Legendary Edition\n\n#masseffect", "link": "https://www.youtube.com/watch?v=MV-hHZPSONA", "date_published": "2021-06-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Sea Of Thieves A Pirate's Life Review", "description": "The Pirates of the Caribbean tie-in content for Sea of Thieves offers a whole lot to do, and while it can be buggy and a bit frustrating, it's still pretty fun.\n\nTying in with Disney's Pirates of the Caribbean film franchise, the expansion provides new stories to uncover that are both fairly delightful for fans of the films and the theme park attraction that spawned them, as well as big, involved new Sea of Thieves locations to explore.\n\nSea of Thieves: A Pirate's Life is now available. You can read the full written Sea of Thieves: A Pirate's Life review by Phil Hornshaw on GameSpot: https://www.gamespot.com/reviews/sea-of-thieves-a-pirates-life-review-dead-men-tell-five-tales-actually/1900-6417693/\n\n#PiratesoftheCaribbean #seaofthieves", "link": "https://www.youtube.com/watch?v=y5rF7qJbKXg", "date_published": "2021-06-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]