[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "From The Top: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nTom Huizenga | June 30, 2021\nIt's been said that our young people are the hope of our future. If that's true, the future of classical music looks blazingly bright, judging from these extraordinary performances by the young musicians in this triple-play Tiny Desk (home) concert.\n\nTeenagers from three locales around the country – Chicago, St. Louis and Palo Alto, Calif. – invite us into their homes for fresh takes on vintage classics, contemporary sounds and sophisticated pop arrangements. They are all alums of From the Top, the radio program (distributed by NPR) that spotlights today's terrific young players.\n\nIfetayo Ali-Landing, an outstanding 18-year-old cellist from Chicago starts us off. She's already performed with the Chicago Symphony Orchestra and given her own TEDx talk. One of her calling cards is this propulsive performance of \"Evergreen,\" a pop song by Yebba, arranged for solo cello.\n\nPairing up in Palo Alto, the Davisson Guitar Duo features Jack, 16, and his sister Elle, 13. Their signature piece is the rhythmically driven Jongo, which offers flavors from composer Paulo Bellinati's native Brazil. The siblings finish each other's musical phrases with startling lyrical precision.\n\nSeventh-grader Jerry Chang, clad in his comfy exercise shorts, closes this cross-country Tiny Desk from home, playing Schubert's G-flat major Impromptu like someone twice his age. The gentle, rippling effects he gets from his still-growing 13-year-old hands, and the way he makes Schubert's wistful melody sing, is astonishing.\n\nThese Tiny Desk performances alone are proof enough that classical music in America is alive and in very talented hands.\n\nSET LIST\nYebba: \"Evergreen\" (arr. Charles Yang)\nPaulo Bellinati: Jongo\nFranz Schubert: \"Impromptu Op. 90, No. 3\"\n\nMUSICIANS\nIfetayo Ali-Landing: cello\nJack Davisson: guitar\nElle Davisson: guitar\nJerry Chang: piano\n\nCREDITS\nAudio: John Escobar\nVideo: Mike Grittani, Omid Zoufonoun, Dexx Broughton, Shaun Hautly\n\nTINY DESK TEAM\nProducer: Tom Huizenga\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Bob Boilen, Kara Frame, Gabrielle Pierre\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #fromthetop", "link": "https://www.youtube.com/watch?v=sLFDCyqqBsQ", "date_published": "2021-06-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Tiny Desk Contest 2021: Desks In The Wild", "description": "From fields of flowers to seaside cliffs (and to lots and lots of backyards), Tiny Desk Contest entries have taken us to some pretty amazing places this year. Here are some of the artists who used their outdoor voices and recorded their entries in the wild. \n\nMusic: \"Man On Fire\" by Paul Saint John and the Nighthawks\n\nWatch more entries: https://tinydeskcontest.npr.org/2021/browse/\n\n#tinydesk #tinydeskcontest", "link": "https://www.youtube.com/watch?v=vixsBxoufRg", "date_published": "2021-06-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]