[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "Far-Right Group Was Preparing for \"Day X\" | \"Germany's Neo-Nazis & the Far Right\" | FRONTLINE", "description": "Nordkreuz, a German far-right group, stockpiled weapons and prepped for violence. Its alleged leader wasn’t tried on terror charges. An excerpt from FRONTLINE's \"Germany's Neo-Nazis & the Far Right.\"\n\nSubscribe on YouTube: http://bit.ly/1BycsJW \n\n“If you had an Islamist, a jihadi, doing the same thing, he would go to jail,” journalist Dirk Laabs tells FRONTLINE's Evan Williams of Nordkreuz's alleged leader. \n\nThe documentary includes photos found on a hard drive obtained by investigative journalist Dirk Laabs, showing members of the secret group of soldiers, police and civilians practicing military maneuvers and believed to be preparing for something they called Day X: a future moment when the German state would collapse in chaos, and the far right could step in and take control.\n\nWatch \"Germany's Neo-Nazis & the Far Right\" in full starting June 29: https://to.pbs.org/3jvKOLD\n\nThe documentary, which explores the rise of far-right and neo-Nazi violence in modern-day Germany and whether authorities are doing enough to stop it, is supported by \"Exploring Hate,\" a multiplatform public media initiative from The WNET Group in New York aimed at offering an in-depth understanding of the rising tide of hatred, hate crimes, antisemitism and racism. \n\nFind more from FRONTLINE on the PBS Video App, where there are more than 300 FRONTLINE documentaries available for you to watch any time: https://to.pbs.org/FLVideoApp\n\nSubscribe on YouTube: http://bit.ly/1BycsJW \nInstagram: https://www.instagram.com/frontlinepbs \nTwitter: https://twitter.com/frontlinepbs \nFacebook: https://www.facebook.com/frontline \n\nFRONTLINE is produced at GBH in Boston and is broadcast nationwide on PBS. Funding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Major funding for FRONTLINE is provided by the Ford Foundation. Additional funding is provided by the Abrams Foundation; the John D. and Catherine T. MacArthur Foundation; Park Foundation; and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation and additional support from Koo and Patricia Yuen. Funding for Germany’s Neo-Nazis & the Far Right is provided by The WNET Group’s “Exploring Hate” initiative on Antisemitism, Racism and Extremism, with principal support by The Sylvia A. and Simon B. Poyta Programming Endowment to Fight Antisemitism and additional major funding from The Peter G. Peterson and Joan Ganz Cooney Fund, and Patti Askwith Kenner. Additional support from Sue and Edgar Wachenheim III, Nancy and Morris W. Offit, and Judy and Josh Weston.", "link": "https://www.youtube.com/watch?v=qJkeY6lTsHs", "date_published": "2021-06-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]