[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCmKurapML4BF9Bjtj4RbvXw", "title": "Before You Go - Lewis Capaldi (Piano & Cello Cover) The Piano Guys", "description": "GET OUR LATEST ALBUM: https://smarturl.it/TPG_LATEST_ALBUM \n“Before You Go” by Lewis Capaldi piano & cello cover from The Piano Guys.\nSTREAM THIS SONG & GET SHEET MUSIC: https://smarturl.it/TPGBYG | WE’RE ON TOUR: https://smarturl.it/the10tour\nSUBSCRIBE: https://bit.ly/subTPG | NEWEST videos: https://youtube.com/watch?v=IkBGhMUGtuA&list=PL7j5iXGSdMwc6hOknjuRsk6x8UieRRngh&index=2\n\nOur latest song isn’t about what you think it’s about. Yes, we love Lewis Capaldi. We love his unassuming, atypical nature, his gravelly vocals, and his heart that lends personal power to his music. We just loved this melody and everything about the emotionality of this tune. It wasn’t until later in our arranging process that we discovered the true meaning behind Lewis’ lyrics. At first listen we thought, perhaps like many of you, the words were pleadings after a bad breakup wondering whether there was something that could have been said that might have saved the relationship. But that’s not it at all. Lewis wrote it to emotionally process the death of his aunt, who ended her own life. If you are struggling and considering suicide as an option to ease your pain or dispel your darkness, know that your presence is priceless -- worth infinitely more than your absence. Watch the sunrise every day you can and consider it a symbol of your total reset, a “do-over,” a second chance to start again. See it as light that breaks through the night. Yes, night will come again. And again. But so does the sunrise. It always will. And which one is more beautiful? More powerful? More present? More like who you really are inside?\n\nLearn about our beliefs here: https://smarturl.it/TPG_Beliefs\nDownload the sheet music: https://smarturl.it/bygsheetmusic\n\nFollow The Piano Guys:\nFacebook: https://facebook.com/ThePianoGuys/\nInstagram: https://instagram.com/thepianoguys/\nTwitter: https://twitter.com/thepianoguys\n \nWatch More of The Piano Guys:\nOfficial Music Videos: https://youtube.com/playlist?list=PL7j5iXGSdMwfDukj_bIIB_1JhbYtaWRYg&playnext=1&index=2\nNewest Videos: https://youtube.com/playlist?list=PL7j5iXGSdMweO0HJlfOWtI2693vu23r_C&playnext=1&index=2\nMost Popular: https://youtube.com/playlist?list=PL7j5iXGSdMwc3F_u0P8QDpINSrsG_a5Tl&playnext=1\n \nListen to The Piano Guys:\nSpotify: https://open.spotify.com/artist/0jW6R8CVyVohuUJVcuweDI?si=8GgyFRhiTz6POs8b0ir2IA&dl_branch=1\nApple Music: https://music.apple.com/us/artist/the-piano-guys/498030399\nAmazon Music: https://amazon.com/The-Piano-Guys/e/B00BXLTTI4\n\nCredits:\n- Piano: Jon Schmidt\n- Cello & Piano: Steven Sharp Nelson\n- Percussion & Keyboards: Al van der Beek\n- Cinematography & Editing:  Nick Sales (Aevium Films)\n- \"Before You Go\" Written by: Lewis Capaldi, Ben Kohn, Pete Kelleher, Phil Plested & Tom Barnes\n- The Piano Guys Arrangement Produced & Written by: Al van der Beek & Steven Sharp Nelson\n- Recorded, Mixed & Mastered by: Al van der Beek (TPG Studios, Utah)\n\nAbout The Piano Guys:\nBillions of views. Millions of followers. Wonders of the World. Concerts in every corner of the globe. Who knew all this could have started in a little Yamaha Piano Store in a tiny town of Southern Utah? But that’s what happened. Paul, a Yamaha dealer who dabbled in videography, Jon, a professional pianist, Al, a music producer and studio engineer, and Steve, a cellist with a creative superpower called ADHD, all serendipitously joined forces to create the most successful YouTube instrumental music group in history. The Piano Guys are watched and streamed over 3 million times EVERY DAY.\n \nThey’ve made their mark by taking the piano and cello out of their concert hall context and putting them in places you’d never expect to see them: On a speeding train, a cliff’s edge, a beach, or in front of the Seven Wonders. The Piano Guys’ mission is to inspire and spread hope through incomparably imaginative music videos filmed all over the world.\nLearn more online at ThePianoGuys.com\n\n#LewisCapaldi #PianoCover #CelloCover", "link": "https://www.youtube.com/watch?v=IkBGhMUGtuA", "date_published": "2021-06-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]