[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCHnyfMqiRRG1u-2MsSQLbXA", "title": "Why You Should Want Driverless Cars On Roads Now", "description": "How close are we to having fully autonomous vehicles on the roads? Are they safe? In Chandler, Arizona a fleet of Waymo vehicles are already in operation. Waymo sponsored this video and provided access to their technology and personnel. Check out their safety report here: https://waymo.com/safety/\n\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀ \nReferences:\n\nWaymo Safety Reports — https://waymo.com/safety/\n\nDriving Statistics — https://ve42.co/DrivingStats\n\nThe Real Moral Dilemma of Self-Driving Cars https://ve42.co/SelfDriving\n\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀ \nSpecial thanks to Patreon supporters: \nAlvaro naranjo, Burt Humburg, Blake Byers, Dumky, Mike Tung, Evgeny Skvortsov, Meekay, Ismail Öncü Usta, Paul Peijzel, Crated Comments, Anna, Mac Malkawi, Michael Schneider, Oleksii Leonov, Jim Osmun, Tyson McDowell, Ludovic Robillard, Jim buckmaster, fanime96, Juan Benet, Ruslan Khroma, Robert Blum, Richard Sundvall, Lee Redden, Vincent, Marinus Kuivenhoven, Alfred Wallace, Arjun Chakroborty, Joar Wandborg, Clayton Greenwell, Pindex, Michael Krugman, Cy 'kkm' K'Nelson, Sam Lutfi, Ron Neal \n\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀ \nAnimation by Fabio Albertelli and Jakub Misiek\nEdited by Trenton Oliver\nAudio Mix and SFX by Shaun Clifford\nMusic by Epidemic Sound https://epidemicsound.com \nAdditional video supplied by Getty Images and Pond 5\nProduced by Derek Muller, Emily Zhang and Petr Lebedev", "link": "https://www.youtube.com/watch?v=yjztvddhZmI", "date_published": "2021-07-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]