[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "NPR Music Listening Party: Christone \"Kingfish\" Ingram, '662'", "description": "Join us in an online listening party for Christone \"Kingfish\" Ingram's new album 662. With World Cafe contributor and Music Inside Out host Gwen Thompkins, we'll feature a live conversation with the blues guitarist.\n\nWatch Christone \"Kingfish\" Ingram's Tiny Desk (home) concert\nhttps://www.youtube.com/watch?v=nmDSzmiys1g", "link": "https://www.youtube.com/watch?v=k4A-NWOdd7s", "date_published": "2021-07-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Vince Staples: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nBobby Carter | July 23, 2021\nAt the midpoint of Vince Staples' Tiny Desk (home) concert, he gazes through the sun-soaked windows of his Hollywood Hills location and pauses. \"You should see this view – I don't live here,\" he exclaims with pride. \"I would never live here.\" As to why he wouldn't give in to the spoils of success and relocate to a fancy spot in the Hills or Calabasas, he explains in the lyrics of the song that follows, \"THE SHINING\": I could never do it / I'm too active. That sentiment, the push-pull relationship with his North Long Beach home base, is a dominant theme of his new self-titled album, which he tells NPR is \"the clearest expression yet of who he is.\"\n\nDespite years-long demand from our audience on YouTube, this was the perfect time for a Vince Staples Tiny Desk performance. We've very rarely seen him perform with a band in the past. Then there's the sound of his new work – Kenny Beats, seen playing bass, handled the bulk of the production of the album, Staples' most melodic to date. The band, outfitted in blue khaki suits, was able to recreate the sound of Vince Staples seamlessly (it's mostly made up of players from the album), and coast wonderfully through this four-song set, punctuated by Vince's signature, tongue-in-cheek humor between songs. Always willing to share the spotlight with future stars (see Snoh Aalegra), he closes with the assistance of another on the horizon, the singer Fousheé, on \"TAKE ME HOME.\"\n\nSET LIST\n\"LAW OF AVERAGES\"\n\"SUNDOWN TOWN\"\n\"THE SHINING\"\n\"TAKE ME HOME\" (featuring Fousheé)\n\nMUSICIANS\nVince Staples: vocals\nKenny Beats: bass\nGio \"Dutchboi\" Ligeon: guitar, vocals\nReske: keys, vocals\nDavid Meyers Jr.: drums\nFousheé: vocals\n\nCREDITS\nVideo: Keaton Kinnaman, Jak Bannon, and Jess Colquhoun\nAudio: Tyler Page\nExecutive Producer: Corey \"Blacksmith\" Smyth\nProducer: Emily Hillgren\nCreative Directors: Travis Brothers and Bryan Rivera\nDirector of Photography: Charlie Owens\nProduction Assistants: Meghan Matthews and Colin Martin\n\nTINY DESK TEAM\nProducer: Bobby Carter\nVideo Producer: Maia Stern\nAudio Mastering: Alex Drewenskus\nTiny Production Team: Bob Boilen, Kara Frame, Josh Rogosin, Gabrielle Pierre\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #vincestaples", "link": "https://www.youtube.com/watch?v=yN0I5xTjaGo", "date_published": "2021-07-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Tiny Desk Contest Top Shelf: Episode 1 with Bobby Carter", "description": "NPR Music received thousands of submissions to this year's Tiny Desk Contest, our annual search for the next great undiscovered artist to play a Tiny Desk concert. Before we announce this year's winner, this year's Contest judges are sharing their favorite entries in our weekly Tiny Desk Contest Top Shelf livestream series.\n\nEpisode 1 was hosted by Tiny Desk series creator Bob Boilen and Tiny Desk producer Bobby Carter. Featured entries:\n- \"Hummingbird\" by Selina Moon https://www.youtube.com/watch?v=65jvtJ90-F4\n- \"Khali's Interlude\" by Z The Author https://www.youtube.com/watch?v=dl2guFoaaqM\n- \"Love The World\" by DAP The Contract https://www.youtube.com/watch?v=OlWSXMpoQx4\n- \"Root\" by Seafoam Walls https://www.youtube.com/watch?v=Cdk3QKMlhQE\n- \"Old Empires\" by Lithia https://www.youtube.com/watch?v=OJ8dSHsJ8HM\n\nLearn more about the Tiny Desk Contest: https://npr.org/tinydeskcontest.\n#tinydesk #tinydeskcontest #tinydeskcontesttopshelf", "link": "https://www.youtube.com/watch?v=83nai-eV0vs", "date_published": "2021-07-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]