[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCsXVk37bltHxD1rDPwtNM8Q", "title": "The Day the Dinosaurs Died – Minute by Minute", "description": "DISCOVER ANCIENT WORLDS\nPeek into the past and learn about dinosaurs and other amazing creatures: https://kgs.link/shop-144\n\nSources & further reading:\nhttps://sites.google.com/view/sourcesdinosaurapocalypse/\n\n66 million years ago, maybe on a Tuesday afternoon, life was the same as it had been the day before or a thousand years before or pretty much a million years before. Things were good for our feathered dinosaur buddies. Until a tiny, tiny detail in the sky changed. \n\nOUR CHANNELS\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nGerman Channel: https://kgs.link/youtubeDE \nSpanish Channel: https://kgs.link/youtubeES \n\n\nHOW CAN YOU SUPPORT US?\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nThis is how we make our living and it would be a pleasure if you support us!\n\nGet Merch designed with ❤ https://kgs.link/shop-144  \nJoin the Patreon Bird Army 🐧  https://kgs.link/patreon  \n\n\nDISCUSSIONS & SOCIAL MEDIA\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nReddit:            https://kgs.link/reddit\nInstagram:     https://kgs.link/instagram\nTwitter:           https://kgs.link/twitter\nFacebook:      https://kgs.link/facebook\nDiscord:          https://kgs.link/discord\nNewsletter:    https://kgs.link/newsletter\n\n\nOUR VOICE\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nThe Kurzgesagt voice is from \nSteve Taylor:  https://kgs.link/youtube-voice\n\n\nOUR MUSIC ♬♪\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\n700+ minutes of Kurzgesagt Soundtracks by Epic Mountain:\n\nSpotify:            https://kgs.link/music-spotify\nSoundcloud:   https://kgs.link/music-soundcloud\nBandcamp:     https://kgs.link/music-bandcamp\nYoutube:          http://kgs.link/music-youtube\nFacebook:       https://kgs.link/music-facebook\n\nThe Soundtrack of this video:\n\nSoundcloud:   https://bit.ly/3cGoESF\nBandcamp:     https://bit.ly/2SwqvSU\n\nIf you want to help us caption this video, please send subtitles to subtitle@kurzgesagt.org\nYou can find info on what subtitle files work on YouTube here:\nhttps://support.google.com/youtube/answer/2734698?hl=en-GB&ref_topic=7296214\nThank you!\n\n🐦🐧🐤 PATREON BIRD ARMY 🐤🐧🐦\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nMany Thanks to our wonderful Patreons (from http://kgs.link/patreon) who support us every month and made this video possible:\nNicolas F. R. A. Prado, Máté Dusik, Patrick Alvarado, ThomasM0120, Aadit Kamat, xathor, Parathan Ramamurthi, Luca Rasche, Xueyang Hu, Escape Into Adventures, Silas dresser, Andrés Rodart, Kevin Cortes, Koichi Tsunoda, Ronaldo Ramos, 빛날해 달, Shawon Ashraf, Paris, Soumen Koley, David Heer, Shayne Scheller, Dominic German, Erik Botsford, Misha Black, Colin Strigenz, Samuel Comeau, Hari, Joshua Shou, Evan Davis, Adam Reed, Lumentus, Logan Hawk, Cornel Dixon, MonkeyKid12, Jessi Miller-Webster, Seth Roberts, Public Domain, Katherine Jean Christmas, Suzanne Barker, Erin Donohue, Rafael Alvarez, Simon Horwell, Abhinav Bairathi, Campbell Melrose-Allen, Jeremy Stephens, Ash Myburgh, Zach Wright, Hannah Murphy, Tekruan, Matthew Zimmerman, César Guadarrama Cantú, Jesse Baker, Jonny Robert Bédard, sieyin, Quenby Joanette, Paulius Budzinskas, James DiLoreto, Marcelo Guimarães, Jodi Manela, Abdullah A, emirhasa, Will Block, Booty_McScooty, Waymond, Gabriel Araujo, Maksut Spahi, Kevin, Pitersonus, Jeremy Lash, Skytelegat, Bernd, Robert Richter, Theo Garnier, Kevin Shepherd, afroctopus, Michael Gentili, Dominik Dito, Isak, Michael Van Wambeke, Tutimon, Daniel D., Tim Brüning, Rory Durrant, Roman Brendel, Garrett Locke, Charles Ahearn, EvilBUrrito955, Jenny Zeng, Puwit Yahom, Andrea Yoszie Majda, Danielle Kelly, Tillmann Peeters, Mayur Ramjee, Punktrees, Takashige Yamamoto, Luke Brickman, Daniel Gamper, Chris, Mein Account_1, William Guardado, Ivo Hlebarov, daelus Lu, Ponky, Enrique Gutierrez, Asaree Thaitrakulpanich, Daniel Emig, Alexander Kazakoff, Cal Stayton, Eduardo Uriguen, nnkken, Rolan Wagener, Dávid Östör, Philippe Durand, Ysbrand Galama, Jacob Siegumfeldt, Pierre, Michael", "link": "https://www.youtube.com/watch?v=dFCbJmgeHmA", "date_published": "2021-06-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]