[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Men I Trust: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nBobby Carter | June 16, 2021\nFrom a rustic and retro-looking cabin on the north shore of the St. Lawrence River in Quebec, the band Men I Trust seized the essence of the Tiny Desk almost to a tee. The controlled, yet layered four-song set, bookended by tracks from 2019's Oncle Jazz would almost certainly make for a plug-and-play situation had it been behind Bob Boilen's desk.\n\nMen I Trust was initially the duo of high school friends Dragos Chiriac and Jessy Caron, before adding vocalist Emma Proulx in 2015 and recording the group's debut album, Headroom. (They expanded to a quintet for this performance, with Cedric Martel handling bass and Eric Maillet on drums.) The song \"Humming Man,\" performed here, was its first official single as a trio and they never looked back from there. The band's style sways between rubbery upbeat electro-pop and the muddy pace evident on last year's \"Lucky Sue,\" but generally hits that sweet spot for anybody looking to be cradled and carried by a vibe-y groove. The overdubs and reverb on Emma's vocals are stripped away here, leaving a deceptively endearing quality to her voice. The band told NPR that this set was one of its first times playing together after a long hiatus due to the COVID-19 lockdown. \"We reunited at the cabin, jammed and recorded our session,\" the members said via email. \"We strived to capture the intimacy and coziness on sound and image. We hope you'll enjoy it!\"\n\nSET LIST\n\"Show Me How\"\n\"Lucky Sue\"\n\"Humming Man\"\n\"All Night\"\n\nMUSICIANS\nEmma Proulx: vocals, guitar\nJessy Caron: guitar\nDragos Chiriac: keyboard\nCedric Martel: bass\nEric Maillet: drums\n\nCREDITS\nVideo and Audio: Men I Trust\n\nTINY DESK TEAM\nProducer: Bobby Carter\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Kara Frame, Gabrielle Pierre\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #menitrust", "link": "https://www.youtube.com/watch?v=wp7qctyVU2s", "date_published": "2021-06-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Desks Of The 2021 Tiny Desk Contest", "description": "The first rule of the Tiny Desk Contest: Each entry video must include a desk. If they didn’t, how would we know the artists are ready to perform behind Bob Boilen's Tiny Desk? Here are some of the many notable desks from the 2021 Tiny Desk Contest — the tiny, the huge and the in-between — in one celebratory video. \n\nWatch all the entries and learn more about the Tiny Desk Contest: https://npr.org/tinydeskcontest. \n\nSong: \"Love Me\" by Los Wizzards\n\n#tinydesk #tinydeskcontest", "link": "https://www.youtube.com/watch?v=D7bUdMDK310", "date_published": "2021-06-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]