[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "35 Minutes Of Stranger Of Paradise Final Fantasy Origin Trial PS5 Gameplay", "description": "We fight our way through various enemies, and even a boss. Check out various weapons and skills in Stranger of Paradise Final Fantasy Origin.\n\nCheck out this full playthrough of the trial edition for Stranger of Paradise: Final Fantasy Origin on PS5. Go download the trial as its available until June 24th, 2021. Final Fantasy Origin is coming out in 2022 on PC, PS4, PS5, Xbox One, and Xbox Series X/S.\n\n#strangerofparadise #fantasyorigin", "link": "https://www.youtube.com/watch?v=WdTvtdRgqxI", "date_published": "2021-06-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Aliens: Fireteam Is Real Spooky On Its Highest Difficulty, So Be Careful Of Friendly Fire", "description": "We sat down with Cold Iron Studios CEO Craig Zinkievich and creative director Matt Highison to talk about Aliens: Fireteam, an upcoming multiplayer-focused game that embodies both the horror of 1979's Alien and the action of 1986's Aliens.\n\nAliens: Fireteam will release on PC, PS5, Xbox Series X|S, PS4, and Xbox One.\n\n#aliensfireteam #playforall2021", "link": "https://www.youtube.com/watch?v=LNilwXNBxUE", "date_published": "2021-06-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Back 4 Blood: New Beta Details | Play For All 2021", "description": "Matt O'Driscoll, Lead Producer at Turtle Rock Studios joins Persia to discuss everything you need to know about the upcoming Back 4 Blood early access, Beta, and release date. \n\nHe discusses major differences between the PvE and PvP of Back 4 Blood, and what players will have to look forward to with the upcoming PvP Beta.\n\n#back4blood #backforblood #playforall2021", "link": "https://www.youtube.com/watch?v=axVlkIYpDy0", "date_published": "2021-06-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Bright Memory Infinite - Exclusive Gameplay Trailer [Play For All 2021]", "description": "Bright Memory Infinite is set for release sometime in 2021, and GameSpot has the exclusive debut of a new gameplay trailer showcasing the stylish thrills of FYQD Studio's upcoming slash-and-shoot action game.\n\n#brightmemoryinfinite #brightmemory", "link": "https://www.youtube.com/watch?v=3CNFJgIGVEg", "date_published": "2021-06-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty Season 4 - Everything We Know", "description": "Season 4 of Call of Duty Black Ops Cold War kicks off with several updates including the Red Door Event, new Zombies Map and Satellites coming to Warzone. Tune in to find out what weapons, operators, and maps will be added and when you can expect them.\n\nCall of Duty Black Ops Cold War Season 4 is loaded with new maps, operators, weapons and more. Tune in as Richie breaks down the details of the latest season in just under 5 minutes. Call of Duty has a unique standing in the games industry with a mix of yearly premium AAA titles as well as their free-to-play battle royale, Warzone. This update has something for Cold War, Warzone and Zombies players. Here’s what's new.\n\nWarzone is getting some new points of interests with some satellite crash sites surrounding the all new “Groundfall” event. Thanks to Stitch’s mercenary friend Jackal, some CIA satellites have been sent out of orbit and have crash landed onto Verdansk. In Groundfall, completing challenges surrounding the crash sites will earn players XP, weapon charms and a chance at an exclusive blueprint upon completing all challenges. Some changes coming to Cold War’s multiplayer include new maps like the returning “Hijacked” map from BO2 as well as new weapons both at launch and throughout the season. These include the Mace melee weapon, MG82 Light machine gun, OTs 9 Submachinegun and the C58 Assault rifle.\n\nLastly, big changes are coming to zombies mode. Later in the season, we’ll be seeing an all new round-based zombies map. This will continue the story between requiem and omega forces and will take place in east Berlin. Before that, Outbreak mode will get a new Zoo area to explore and complete missions. Grigori Weaver from Requiem and Black Ops 1 will also be available as a playable operator later in the season. Until then, keep it tuned to GameSpot for the latest COD news and gameplay.\n\n00:00 - Intro\n00:12 - Story Updates\n00:53 - Changes to Warzone\n01:58 - New Operators\n02:31 - New Weapons\n03:10 - New Maps and Game Modes\n03:58 - New Zombies Map\n\n#cod #codwarzone #cod4", "link": "https://www.youtube.com/watch?v=8PelIDGpGoE", "date_published": "2021-06-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Cris Tales - Exclusive Opening Cinematic Reveal [Play For All 2021]", "description": "Cris Tales is a new RPG that pays tribute to classic games like Final Fantasy and the Secret of Mana. In this exclusive video, we have the debut of the game's stylish and exciting opening cinematic. Cris Tales launches on PC, PS4, PS5, Xbox One, Xbox Series X, and Nintendo Switch on July 20, 2021.\n\n#cristales #playforall2021", "link": "https://www.youtube.com/watch?v=bdWBdoI9e0g", "date_published": "2021-06-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Diablo II: Resurrected - Rod Fergusson Reveals New Details | Play For All 2021", "description": "Rod Fergusson joined us to discuss the latest details on the upcoming remaster of Diablo II. While the Diablo II: Resurrected Alpha took place earlier this year, he delves into the upcoming Beta and what changes the team are hard at work on for Diablo II: Resurrected.\n\n#diablo2 #playforall", "link": "https://www.youtube.com/watch?v=s2VaL66s-yw", "date_published": "2021-06-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Exclusive Gameplay and Trailers, Developer Interviews - Play For All Live Day 1", "description": "Tune in on June 16th at 9am PT for an in-depth look at upcoming games, some exclusive trailers, gameplay and a few panels with GameSpot friends. We have interviews with Rod Fergusson on Diablo, Pete Hines on Bethesda Games, Marvel's Guardians of the Galaxy and more. Stick around for some exclusive looks at trailers and  gameplay. \n\nSchedule:\n9AM PT - Play For All Open\n9:10AM PT - Diablo Interview with Rod Fergusson \n9:33AM PT - Pete Hines Interview\n10:00AM PT - GameSpot and Friends Roundtable\n10:20AM PT - Exclusive Trailers!\n10:40AM PT - Marvel's Guardians of the Galaxy Interview\n11:00AM PT - Knock Out City Interview\n11:20AM PT - Back 4 Blood Interview\n11:40AM PT - Far Cry 6 Interview\n12:00PM PT - Exclusive Trailers!\n12:20PM PT - Aliens Fireteam Interview\n12:40PM PT - Elder Scrolls Online Interview\n1:05PM PT - Life is Strange True Colors Interview\n1:20PM PT - GameSpot and Friends Roundtable 2\n1:40PM PT - Streets of Rage 4 Interview\n2:00PM PT - Exclusive Gameplay\n2:13PM PT - More Exclusive Gameplay\n2:20PM PT - Deathloop Interview\n\n#playforall2021", "link": "https://www.youtube.com/watch?v=-ZM22Vmiths", "date_published": "2021-06-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Far Cry 6 Is A Game Of Contrasts | Play For All 2021", "description": "Ubisoft's Navid Khavari and Benjamin Hall take us on a short guided tour of Yara, the island of Far Cry 6. We talk about the politics behind the story as well as the slapstick action of the gameplay, alligators in t-shirts and how Macarena became the weaponised music disk of choice.\n\n#farcy6 #farcy #playforall2021", "link": "https://www.youtube.com/watch?v=K9f8h-_ZKDQ", "date_published": "2021-06-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Marvel's Guardians Of The Galaxy: First Look & Details", "description": "From its original story to killer soundtrack and Deus Ex-style decision making: find out all the latest on Marvel's Guardians Of The Galaxy, a brand new single-player game from Eidos Montreal and Marvel Games.\n\n#marvel #guardiansofthegalaxy #playforall2021", "link": "https://www.youtube.com/watch?v=J4AoPef-P3A", "date_published": "2021-06-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pete Hines Dives Into Starfield And Redfall | Play For All 2021", "description": "Pete Hines joined Tamoor Hussain and GameSpot to give details about Bethesda's upcoming games. From Starfield to Redfall, Pete explains Bethesda's work philosophy and his thoughts on Xbox Game Pass.\n\n#starfield #redfall #playforall", "link": "https://www.youtube.com/watch?v=ebNlaSEfc5w", "date_published": "2021-06-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Salt and Sacrifice Exclusive Extended Gameplay - Play For All 2021", "description": "We have the exclusive first gameplay of Salt and Sacrifice, the sequel to Ska Studios' 2D tribute to the Souls sub-genre. In this new video, we get to see the exploration of an even more dangerous world filled with monsters and giant demons, and this time you can bring allies with you into battle.\n\n#saltandsacrifice #playforall2021", "link": "https://www.youtube.com/watch?v=P7cuQRCASCQ", "date_published": "2021-06-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Serial Cleaners - Exclusive Developer Walkthrough [Play For All 2021]", "description": "As the sequel to 2017's stealth-puzzle game, Serial Cleaners continues with the fast, slapstick approach to covering up messy crime scenes. In this exclusive developer walkthrough from Draw Distance, we get to see the amount of trouble you'll get into in the '90s set sequel.\n\n#serialcleaners #playforall", "link": "https://www.youtube.com/watch?v=qiuPBComngk", "date_published": "2021-06-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Zelda: Breath Of The Wild Sequel Trailer Breakdown | E3 2021", "description": "After two years, we've finally received a brand new trailer for Breath of the Wild 2 on Nintendo Switch, so Max Blumenthal (RinHara5aki) and Evan Langer are back to dissect everything shown.\n\nThe Legend of Zelda: Breath of the Wild was released four years ago on March 3, 2017, and was a launch title for the Nintendo Switch. At E3 2019, we got our first glimpse of the sequel where Link and Zelda investigate a cave and find what appears to be the corpse of Ganondorf. Two years later, we finally received a new look at the sequel during the E3 2021 Nintendo Direct.\n\nIn the new trailer, we learn that the game takes place on the surface world of Breath of the Wild--and in the sky. During the sky section, we see Link with his hair down, and he also sports some strange new abilities in his arm, including the ability to rewind time. Link also seems to be able to travel between the sky and surface; however, the trailer showcases Link with his original haircut in the surface sections, so we aren’t entirely sure how they connect or whether each segment takes place at different points in time.\n\nThe Sequel to The Legend of Zelda: Breath of the Wild will be released exclusively for Nintendo Switch in 2022. Despite rumors of a Switch Pro on the way, Nintendo announced nothing of the sort at the Direct, so we’ll have to wait and see if Breath of the Wild 2 utilizes this rumored hardware upgrade. If you want to watch us analyze the E3 2019 trailer, be sure to check out our previous Breath of the Wild 2 trailer breakdown: https://youtu.be/3DRARZQexW4\n\n#zelda #botw #zeldabotw", "link": "https://www.youtube.com/watch?v=5L7TNcyno-Q", "date_published": "2021-06-16 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Advance Wars 1 + 2 Re-Boot Camp First Look | Nintendo E3 2021", "description": "Advance Wars first released on the Game Boy Advance, and is being completely remastered for the Nintendo Switch as: Advance Wars 1 & 2 Re-Boot Camp. We got a first hand look at the brand new graphics and animations being remade for this tactical grid based strategy game. Advance Wars utilizes a similar grid system to Fire Emblem, but with armies at your disposal as you attempt to face off against rival COs. Control Andy and the Orange Star army in this remaster of the GBA classic. Advance Wars 1 + 2 Re-Boot Camp releases December 3, 2021.\n\n#advancewars #rebootcamp #e32021", "link": "https://www.youtube.com/watch?v=8sYnBRElNcI", "date_published": "2021-06-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Advance Wars 1 + 2 Re-Boot Camp Trailer | Nintendo E3 2021", "description": "Advance War returns for the Nintendo Switch! Advance Wars has been reimagined and built from the ground up, with all new 3D graphics and animations. This grid-based strategy game was a classic for the Nintendo hand helds. Advance Wars 1 + 2 Re-Boot Camp releases December 3, 2021.", "link": "https://www.youtube.com/watch?v=q7w53f5zPA0", "date_published": "2021-06-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Bandai Namco E3 2021 Live", "description": "Tune into the Bandai Namco E3 2021 live panel to for news, announcements, trailers and more. Come join us on June 15, 2021 to see what Bandai Namco presents.\n\nBandai Namco closes out the major developer presentations at E3 2021 before the E3 2021 awards. What will Bandai Namco show off to close out the show? \n\n#Bandai #BandaiNamco", "link": "https://www.youtube.com/watch?v=zE_RHdp-nTw", "date_published": "2021-06-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 Livestream", "description": "Tune in to the Battlefield briefing welcome to 2042 livestream with DICE general manager Oskar Gabrielson and senior design director Daniel Berlin. Other \"guests from across the team\" will appear as well. Get a behind the scenes chat with the gang from DICE as we take a look back at this incredible first week on June 15th at 8AM PT.\n\nBattlefield 2042 unveiled its cinematic trailer on June 9th showing off the massive scale of this multiplayer focused game. Battlefield 2042 then followed up with a gameplay trailer during the Xbox & Bethesda E3 2021 Showcase which showed off some of the massive maps, unique Battlefield gameplay, and a modern day shooter that is sure to get fans excited. \n\n#Battlefield2042 #Battlefield #DICE", "link": "https://www.youtube.com/watch?v=SdiI33GRABw", "date_published": "2021-06-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Best Trailers from Nintendo Direct", "description": "From WarioWare to Advance Wars to The Legend of Zelda: Breath of the Wild 2, Nintendo Direct offered an exciting glimpse of their upcoming selection. Here's a roundup of the best trailers from Nintendo Direct.\n\n00:03 - The Legend of Zelda: Breath of the Wild 2 - E3 2021 Teaser\n01:33 - Metroid Dread - Annoucement Trailer\n03:41 - Advance Wars 1 + 2 Re-Boot Camp Trailer\n04:48 - WarioWare: Get It Together! – Announcement Trailer\n00:03 - Super Smash Bros. Ultimate – The Iron Fist of Darkness\n08:25 - Shin Megami Tensei V – Release Date Trailer\n11:29 - Mario Party Superstars – Announcement Trailer\n12:44 - Danganronpa Decadence Trailer\n\n#nintendo #nintendodirect #e32021", "link": "https://www.youtube.com/watch?v=-YYj9zi14dk", "date_published": "2021-06-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Danganronpa Decadence Trailer | Nintendo E3 2021", "description": "Danganronpa is back with Danganronpa Decadence. Danganronpa Decadence includes 3 Danganronpa games, all comign to the Nintendo Switch. The board game from Danganronpa 3 has been expanded as well in this collection. Danganronpa Decadence releases later 2021.\n\n#DanganronpaDecadence", "link": "https://www.youtube.com/watch?v=AR4z6PkIIpM", "date_published": "2021-06-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Dragon Ball Z: Kakarot Trailer | Nintendo E3 2021", "description": "Dragon Ball Z: Kakarot is an action RPG that includes the major arcs from the anime, including Dragon Ball Super, and is finally coming to the Nintendo Switch. Dragon Ball Z: Kakarot releases September 24, 2021\n\n#dragonballz #kakarot #e32021", "link": "https://www.youtube.com/watch?v=5xNdJFFX-Zo", "date_published": "2021-06-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "E3 2021 Nintendo Direct and Treehouse, Bandai Namco and More | Play For All", "description": "Tune in on June 15th for the Nintendo Direct, which will be roughly 40 minutes of news, trailers, announcements, gameplay and more. Following the Nintendo Direct enjoy the Nintendo Treehouse which will offer deeper dives into some of their games. Later in the day tune in for the Bandai Namco showcase, as well as a special Play For All and Indie Mix Showcase.\n\nE3 is a trade event for the video game industry. The Entertainment Software Association organizes and presents E3, which many developers, publishers, hardware and accessory manufacturers use to introduce and advertise upcoming games and game-related merchandise to retailers and to members of the press.\n\nAfter a brief hiatus, E3 is back and GameSpot is an official media partner here to show off all the latest games and releases from developers all over the industry. E3 Day 4 wraps up an eventful E3 2021 showcase. Nintendo and Bandai Namco are the two biggest developers wrapping up the E3 conference with fans hoping for highly anticipated releases like Breath of the Wild 2, a new Mario game, or even a new Super Smash Character. \n\nNintendo Direct 9AM PST\nBandai Namco 2:30PM PST\n\n#E32021 #E3 #NintendoDirect", "link": "https://www.youtube.com/watch?v=SyiMfd5r01o", "date_published": "2021-06-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "House of Ashes Developer Breakdown | Bandai Namco E3 2021", "description": "The Dark Pictures Anthology is a series of standalone branching narrative horror games. House of Ashes is the latest game in this anthology, and takes place at the end of the Iraq War. A group of soldiers are plunged underground into a hidden temple, where mysteries horrors await. House of Ashes is based on a real world myth and legend. House of Ashes releases October 22, 2021.\n\n#houseofashes #darkpictureanthology #e32021", "link": "https://www.youtube.com/watch?v=j4Fe4-baCtg", "date_published": "2021-06-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Hyrule Warriors Age of Calamity Expansion Pass Trailer | Nintendo E3 2021", "description": "Hyrule Warriors is releasing a brand new DLC, Age of Calamity Expansion Pass. Wave 1 releases June 18 to the Nintendo eshop. Wave 2 releases November 2021.\n\n#HyruleWarriorsAgeofCalamity #hyrule", "link": "https://www.youtube.com/watch?v=NOmzdvlYhOA", "date_published": "2021-06-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Into the Starfield: The Journey Begins (4K)", "description": "Starfield is the first new universe in 25 years from Bethesda Game Studios, the award-winning creators of The Elder Scrolls V: Skyrim and Fallout 4. In this next generation role-playing game set amongst the stars, create any character you want and explore with unparalleled freedom as you embark on an epic journey to answer humanity’s greatest mystery.\n\nLaunching November 11, 2022 exclusively on Xbox Series X/S and PC. Become a member of Constellation at StarfieldGame.com and be among the first to receive Starfield news and updates.\n\n#intothestarfield #starfield #starfieldjourneybegins", "link": "https://www.youtube.com/watch?v=DfvAWjMzHlk", "date_published": "2021-06-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Kazuya Mishima Smash Bros. Ultimate X Tekken Full Presentation | Nintendo E3 2021", "description": "Smash Bros. Ultimate revealed its latest fighter to the Nintendo's ultimate fighting franchise - Kazuya Mishima of Tekken fame. Smash Bros. Ultimate has partnered with many major fighting game franchises, and Smash Bros. Ultimate X Tekken is just the latest. Kazuya Mishima is here.\n\n#KazuyaMishima #UltimateXTekken #e32021", "link": "https://www.youtube.com/watch?v=VGdEVa3Ic5E", "date_published": "2021-06-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Kazuya Mishima Smash Bros. Ultimate X Tekken Reveal | Nintendo E3 2021", "description": "Smash Bros. Ultimate revealed its latest fighter to the Nintendo's ultimate fighting franchise - Kazuya Mishima of Tekken fame. Smash Bros. Ultimate has partnered with many major fighting game franchises, and Smash Bros. Ultimate X Tekken is just the latest. Kazuya Mishima is here.\n\n#kazuyamishima #tekkenreveal #e32021", "link": "https://www.youtube.com/watch?v=RNONjaX4qK0", "date_published": "2021-06-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Mario Golf: Super Rush Early Look | Nintendo E3 2021", "description": "Mario Golf: Super Rush is the latest installment to the Mario Golf series. At Nintendo Tree House E3 2021, Nintendo gave us a closer look at the newest Mario Golf game in a full Mario Golf: Super Rush gameplay presentation. Mario Golf: Super Rush releases June 25, 2021.\n\n#mariogolf #e32021 #mariosuperrush", "link": "https://www.youtube.com/watch?v=gkD24ALGmpU", "date_published": "2021-06-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Mario Party Superstars Early Look | Nintendo E3 2021", "description": "Mario Party Superstars is a best-of compilation of the Mario Party series. Mario Party Superstars will take boards from the previous games and remaster them, and include 100 former minigames. Nintendo Tree House took us threw a playthrough of Mario Party Superstars to showcase some of the maps and minigames of the game. Mario Party Superstars Releases October 29.\n\n#marioparty #mariosuperstars #e32021", "link": "https://www.youtube.com/watch?v=W_UAbVr6lMM", "date_published": "2021-06-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Mario Party Superstars – Announcement Trailer – Nintendo Direct | E3 2021", "description": "The latest Mario Party to release to Nintendo Switch includes 100 minigames from the Mario Party franchise over the years. Mario Party Superstars Releases October 29.\n\n#mariopartysuperstars #marioparty", "link": "https://www.youtube.com/watch?v=drWRtgg7OMg", "date_published": "2021-06-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Metroid Dread - Development History - Nintendo Switch | E3 2021", "description": "Check out the development history of Metroid Dread which was unveiled during the Nintendo Direct showcase at E3 2021!\n\n#metroiddread #e32021", "link": "https://www.youtube.com/watch?v=jP9hn0nSvWw", "date_published": "2021-06-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Metroid Dread Early Look 2 | Nintendo E3 2021", "description": "In a second look at Metroid Dread, Nintendo showcases all new enemies and terrain Samus will have to navigate around. Samus is able to use brand new abilities such as a Phantom Cloak in order to avoid robotic enemies who are impenetrable to her weapons, or the Spider Magnet to climb along certain sections of a wall. Metroid Dread releases October 8, 2021.\n\n#metroiddread #e32021", "link": "https://www.youtube.com/watch?v=dz1lKWmudmk", "date_published": "2021-06-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Metroid Dread Gameplay Presentation | Nintendo Treehouse E3 2021", "description": "Check out the gameplay shown off for Metroid Dread during the Nintendo Treehouse presentation during the Nintendo Showcase at E3 2021!\n\nWatch 20 minutes of gameplay as the Nintendo team walks you through some of the gameplay mechanics and more. Metroid Dread releases October 8th, 2021.\n\n#metroiddread #nintendotreehouse #e32021", "link": "https://www.youtube.com/watch?v=Vkyyxrnjkgo", "date_published": "2021-06-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Metroid Dread Trailer | Nintendo E3 2021", "description": "Samus returns for Metroid Dread. In the latest Metroid trailer, Samus must fight against robots who are immune to her energy blasts. Metroid Dread will be a brand new 2D Metroid experience, returning to the series' roots. Metroid Dread releases October 8, 2021.\n\n#metroiddread #metroid #e32021", "link": "https://www.youtube.com/watch?v=4tYzveufd9Q", "date_published": "2021-06-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Monster Hunter Stories 2: Wings of Ruin Early Look | NIntendo E3 2021", "description": "Nintendo took us through an early look of Monster Hunter Stories 2: Wings of Ruin gameplay by playing the Monster Hunter Stories 2 demo. Monster Hunter Stories 2: Wings of Ruin is a turn-based RPG. They also gave us a look at the upcoming Monster Hunter Stories 2: Wings of Ruin X Monster Hunter Rise content. A Monster Hunter Stories 2: Wings of Ruin demo releases June 25th. Monster Hunter Stories 2: Wings of Ruin releases July 9.\n\n#monsterhunterstoires #monsterhunter2 #wingsofruin", "link": "https://www.youtube.com/watch?v=bQCo2M5UA14", "date_published": "2021-06-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Nintendo Direct E3 2021 Showcase and Nintendo Treehouse", "description": "Tune into Nintendo's E3 2021 showcase for all the latest news, updates, announcements, trailers. Following the Direct will be Nintendo Treehouse which will give you a deeper look.\n\nNintendo Direct kicks off the last day of E3 2021 with fans hoping for updates on beloved series like Mario and potential news on Zelda BOTW 2! Following Nintendo Direct, Nintendo Treehouse will provide a deeper dive on what was shown and some other hands on features. \n\n#Nintendo #NintendoDirect #BOTW2", "link": "https://www.youtube.com/watch?v=6KEnzhHQhoo", "date_published": "2021-06-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Nintendo Direct Full Showcase | E3 2021", "description": "Check out the full Nintendo Direct Showcase that took place during E3 2021! The showcase featured updates to popular titles like Super Smash Bros. as well as an update on the long awaited sequel, The Legend of Zelda Breath of the Wild 2 (BOTW 2).\n\n#nintendodirect #nintendo #e32021", "link": "https://www.youtube.com/watch?v=_fRR31xi_1w", "date_published": "2021-06-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "No More Heroes 3 Early Look | Nintendo E3 2021", "description": "No More Heroes III is the latest game from Grasshoper Manufacture, the studio that brought the original No More Heroes for the Nintendo Wii. No More Heroes is a unique arcade action beat-em-up where Travis Touchdown will destroy enemies with his beam katana. In No More Heroes 3, you'll attempt to work your way up the Galactic Superhero Rankings. No More Heroes 3 releases August 27, 2021.\n\n#nomoreheroes3 #nomoreheroes #e32021", "link": "https://www.youtube.com/watch?v=kPBjsxFBnOY", "date_published": "2021-06-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Play For All E3 2021 Showcase (Presented by GameSpot and The MIX)", "description": "GameSpot teams up with The MIX for the Play For All Showcase, which features trailers from upcoming indie titles as well as interviews with some of the developers. Tamoor interviews a diverse group of indie developers including: Xavier Nelson Jr. developer on El Paso Elsewhere, Gwen Foster developer on Soup Pot, Davionne Gooden developer on She Dreams Elsewhere, Saverio Caporusso developer on Blind Fate Edo No Yami, and Derrick Fields developer on Onsen Master. \n\n00:00 Intro\n8:19 El Paso Elsewhere\n19:38 Soup Pot\n31:05 She Dreams Elsewhere\n43:04 Blind Fate: Edo No Yami\n53:13 Onsen Master Interview\n\n#playforall #e32021", "link": "https://www.youtube.com/watch?v=De_AlT3qWK8", "date_published": "2021-06-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Shin Megami Tensei V Early Look | Nintendo E3 2021", "description": "Nintendo gives us a full gameplay presentation for the upcoming Shin Megami Tensei V. Shin Megami Tensei V is the latest game in the Shin Megami Tensei series - the same series that spawned Persona. Shin Megami Tensei V is a tradition turned based RPG featuring the ability to recruit and battle with the very demons you fight. Shin Megami Tensei V releases November 12, 2021.\n\n#shinmegami #tenseiv #e32021", "link": "https://www.youtube.com/watch?v=szCON4pGxJ0", "date_published": "2021-06-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Shin Megami Tensei V Trailer | Nintendo E3 2021", "description": "Shin Megami Tensei V is here, and in the latest installment to the Shin Megami Tensei RPG series, you control a High School student in Tokyo who gets pulled into an alternate dimension. A post-apocalyptic Tokyo full of angels and demons. Recruit demons as your allies and fuse them in the franchise that spawned Persona. Shin Megami Tensei V releases November 12, 2021.\n\n#shinmegami #shinmgamitenseiv #tenseiv", "link": "https://www.youtube.com/watch?v=ZpnpPji2n1k", "date_published": "2021-06-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Super Monkey Ball Banana Mania - Official Gameplay Reveal Trailer", "description": "Get ready for a modern HD remaster of Super Monkey Ball 1, Super Monkey Ball 2, and Super Monkey Ball Deluxe releasing on Nintendo Switch, PlayStation 5, Xbox Series X|S, PlayStation 4, Xbox One, and PC via Steam on October 5, 2021.\n\n#supermonkeyball #bananamania", "link": "https://www.youtube.com/watch?v=VddXq3aVwaw", "date_published": "2021-06-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Legend of Zelda Game & Watch | Nintendo E3 2021", "description": "It's Zelda's 35th anniversary, and to celebrate, a special Zelda Game & Watch will be releasing. It comes with Zelda, Zelda 2: The Adventure of Link, and the game boy version of Zelda: A Link's Awakening. The pick up and play game Vermin will also be included. The LEgend of Zelda Game & Watch releases November 12, 2021.\n\n#zelda #legendofzelda #zelda2", "link": "https://www.youtube.com/watch?v=jdv7c8G70yw", "date_published": "2021-06-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Legend of Zelda: Breath of the Wild 2 Full Presentation | Nintendo E3 2021", "description": "Eiji Aonuma announced the release date of The Legend of Zelda: Breath of the Wild 2, and showcased more gameplay. In this highly anticipated sequel to Breath of th Wild, we see Link falling through the sky and gliding through a world with floating land in the sky. Breath of the Wild 2 shows all new abilities, including merging through land. The Legend of Zelda: Breath of the Wild 2 releases 2022.\n\n#legendofzelda #botw #zelda", "link": "https://www.youtube.com/watch?v=1hHfmy8zGdw", "date_published": "2021-06-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Legend of Zelda: Breath of the Wild 2 Gameplay Trailer | Nintendo E3 2021", "description": "The Legend of Zelda: Breath of the Wild 2 finally received an updated trailer showcasing more gameplay. In this highly anticipated sequel to Breath of th Wild, we see Link falling through the sky and gliding through a world with floating land in the sky. Breath of the Wild 2 shows all new abilities, including merging through land. The Legend of Zelda: Breath of the Wild 2 releases 2022.\n\n#Zelda #BOTW2 #ZeldaBOTW2", "link": "https://www.youtube.com/watch?v=fNAhxl0uYQw", "date_published": "2021-06-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Wario Ware: Get It Together! Trailer | Nintendo E3 2021", "description": "Wario Ware Inc. is finally back for the Nintendo Swtich! The micro grame franchise is back with all new insane tiny games utilizing new Switch mechanics. 2 player versus makes it way too. Wario Ware: Get it Together! September 10, 2021.", "link": "https://www.youtube.com/watch?v=zvuZHVR9q0c", "date_published": "2021-06-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "WarioWare: Get It Together! First Look | Nintendo E3 2021", "description": "WarioWare Inc is finally returning with Wario's Nintendo Switch Debut - WarioWare: Get It Together! WarioWare features a unique brand of gameplay with micro games - where players will have to quickly figure out both how to play a game, and successfully complete it. In this WarioWare go-around, you'll control characters who are randomly chosen for you, who each control separately, adding even more chaos to the micro games. WarioWare: Get It Together! also features a 2 player mode, where you'll be forced to quickly work together to solve the micro tasks. WarioWare: Get it Together! September 10, 2021.\n\n#warioware #getittogether #e32021", "link": "https://www.youtube.com/watch?v=vy-2fw_dCp4", "date_published": "2021-06-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]