[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Apex Legends War Games Event Gameplay", "description": "Join Persia as she drops into the War Games event for Apex Legends. Persia will try the first of five modes to come to the War Games Event, Second Chance. In Second Chance Mode each legend will get one free respawn per match. \n\nThe remaining modes include: Shield Regen, Killing Time, Auto Banners, and Ultra Zones. In shield regen mode the Legends will regenerate over time passively. In Killing time mode each round time will be reduced every time a legend dies. In Auto Banners mode all banner cards are automatically retrieved. In Ultra Zones mode there will be three hot zones per match. The War Games event starts April 13th with Second Chance Mode. See below for the times each mode will be active.\n\nSecond Chance: Tuesday, 4/13 – Thursday, 4/15\nUltra Zones: Thursday, 4/15 – Monday, 4/19\nAuto Banners: Monday, 4/19 – Wednesday, 4/21\nKilling Time: Wednesday, 4/21 – Friday, 4/23\nArmor Regen: Friday, 4/23 – Tuesday, 4/27\n\n#ApexLegends #WarGames", "link": "https://www.youtube.com/watch?v=4-2_6uPOVtA", "date_published": "2021-04-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Best Valorant Clips Of The Week: Ace Or No Ace?", "description": "Can you tell which clip will be an Ace and which one won't? Join Persia as she puts your game sense to the test with the Valorant clips of the week in celebration of the game's one-year anniversary. \n\nIn this video, Persia is back with another round-up of community clips from Twitch, TikTok, Twitter, and more. In celebration of Valorant's one-year anniversary, we're putting your game sense to the test to see if you can guess which clip will be an Ace or not. \n\nAll of these clips are filled with amazing play, but the final seconds can be a toss-up no matter who is playing. Whether it is in a Nerd St Gamers tournament or just another day in Aceu's office, these clips are sure to kick off your week with a bang. \n\nNext week we'll be checking out all of the best and crazy Apex clips of the week! If you want to submit your own then upload the video to your Twitter, tag @persia_xo and @GameSpot, then tune in next week to see if you made it! \n\nCheck out the links below for the full version of all of our clips!\nhttps://twitter.com/NightElfLin1/status/1380220996418990084\n\nhttps://twitter.com/GhoshT99/status/1380175478619697154\n\nhttps://twitter.com/HypnotikCii/status/1380148522008387584\n\nhttps://twitter.com/MouggsR/status/1380117033233289218\n\nhttps://twitter.com/RadIsTaken/status/1346926046315048962\n\nhttps://twitter.com/cryptic2c/status/1376882788545220610\n\nhttps://www.twitch.tv/aniemal/clip/DeadAnimatedHorseradishPeanutButterJellyTime-tVB0d_8TL8_dDbUr?filter=clips&range=7d&sort=time\n\nhttps://clips.twitch.tv/UnusualCourageousSageHeyGirl-htUuvPNYZ6ikkb0M\n\nhttps://clips.twitch.tv/MildCulturedGaurStinkyCheese-4ZmnAEpbNpc2JjR1\n\nhttps://twitter.com/TheKhaloKs/status/1306384650907127809\n\nhttps://twitter.com/R99PK/status/1381682051070492674\n\nhttps://www.twitch.tv/aceu/clip/ColdInventivePelicanTwitchRPG-18v_RKX_SkWvItmG?filter=clips&range=7d&sort=time", "link": "https://www.youtube.com/watch?v=k_JNyao0rQ0", "date_published": "2021-04-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Hood: Outlaws & Legends - Gameplay Overview Trailer", "description": "Check out the official gameplay overview trailer for Hood: Outlaws & Legends! \n\nHood: Outlaws & Legends in-depth Gameplay Overview trailer takes you on a deep dive into the medieval multiplayer heists\n\nHood: Outlaws and Legends, the multiplayer PvPvE heist game from Sumo Digital and Focus Home interactive today releases its Gameplay Overview trailer. Matchmaking in opposing teams of four, choose your character based on your preferred playstyle, or what best fits your team’s strategy. In this game where cooperation is key, your team’s composition can suit a stealthy long-range approach, a brutal close combat heist or a balanced band of Outlaws prepared for anything. Watch today’s Gameplay Overview trailer for a deeper look into exactly what goes into Hood’s medieval multiplayer heists. \n\nAssemble, infiltrate, battle and extract\n\nEvery game of Hood: Outlaws & Legends pits you and your friends against a rival group of four other players who are also aiming to steal the treasure. You and your team must work together to select your band of complementary outlaws, each with unique abilities to offer, before infiltrating vast, medieval strongholds. Outsmart the opposing team and villainous State to find, steal, and return the riches unfairly taken from the people. \n\nBetween heists, visit the hideout to spend some of your stolen fortune. Giving money back to the people will increase the range of items available to you in the shops, while keeping it for yourself lets you directly purchase them. Improve, alter and refine your characters’ skills with a range of perks, or further personalize your heroes with a range of new weapons and costumes. Some of the more prestigious cosmetics will even require you to demonstrate your heisting mastery.\n\nPre-order now for early access and cosmetics!\n\nBy pre-ordering today, you’ll get early access to Hood: Outlaws & Legends starting May 7, as well as the Forest Lords cosmetic pack for free. The Forest Lords pack includes a skin for each character and weapon in the game. The Year 1 Edition is also available for pre-order, giving access to Hood and three Battle Passes due to be released post-launch, after the initial free Season.\n\nPre-order now on PlayStation 5, Xbox Series X|S, PlayStation 4, Xbox One, and PC to get exclusive bonuses and early access to Hood: Outlaws & Legends from May 7 - three days before the official release on May 10.\n\n#HoodOutlaws&Legends #Hood #Outlaws&Legends", "link": "https://www.youtube.com/watch?v=jIrLfuPUmi8", "date_published": "2021-04-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Mass Effect Legendary Edition – Official Remastered Comparison Trailer", "description": "Get an in-depth look at the visual upgrades you’ll experience when Mass Effect Legendary Edition launches May 14. Check out a side-by-side comparison of the stunning environmental, character, and visual effects improvements waiting for you – the people, places, and tech you know and love have never looked so good.  \n\nThe Mass Effect Legendary Edition will be available on Origin, Steam, PlayStation 4, and Xbox One with forward compatibility and targeted enhancements on Xbox Series X|S and PlayStation 5. \n\nABOUT MASS EFFECT LEGENDARY EDITION:\n \nOne person is all that stands between humanity and the greatest threat it’s ever faced. Relive the legend of Commander Shepard in the highly acclaimed Mass Effect trilogy with the Mass Effect Legendary Edition. Includes single-player base content and over 40 DLC from Mass Effect, Mass Effect 2, and Mass Effect 3 games, including promo weapons, armors, and packs – remastered and optimized for 4K Ultra HD.\n \nExperience an amazingly rich and detailed universe where your decisions have profound consequences on the action and the outcome.\n \nRELIVE THE CINEMATIC SAGA:  Heart-pounding action meets gripping interactive storytelling where you decide how your unique story unfolds.\nThree Games – One Launcher: Play through the single-player base content and over 40 DLC from all three games, including promo weapons, armors, and packs.\n\nRemastered for a New Generation: Experience the trilogy in 4K Ultra HD with enhanced performance, visuals, and graphics, all available in HDR.\nVisual Improvements on All Three Games: Updates include enhanced models, shaders, FX, lighting, and depth of field. \n \nEXPERIENCE THE LEGEND OF SHEPARD:  Create and customize your own character, from appearance and skills to a personalized arsenal then lead your elite recon squad across a galaxy in turmoil.\n\nNew Shepard Customizations: With improved hair, makeup, eye color and skin tones you can create your Shepard in a unified character creator with all options available across the full trilogy, or choose to play as the iconic Femshep from Mass Effect 3 now available in all titles.\n\nGameplay Enhancements for the First Mass Effect Game: Enjoy improved aiming and weapons balance, SFX, input/controls, squad behavior, cover behavior, and gameplay cameras.\n \nREFLECT ON YOUR CHOICES:  Your choices seamlessly travel from one game to the next. Each decision you make will control the outcome of every mission, every relationship, every battle – and even the fate of the galaxy itself.\n\nPerformance Mode Options: Supports ultra-high refresh rates on PC, and offers a choice between \"Favor Quality\" for increased resolution or \"Favor Framerate\" to boost your FPS on consoles.\n \nINCLUDED CONTENT:  Mass Effect Legendary Edition includes single-player base content for all three titles (Mass Effect, Mass Effect 2 and Mass Effect 3), your favorite single-player story DLC, promo weapons, armors, and packs:\n•             Bring Down the Sky\n•             Genesis\n•             Zaeed – The Price of Revenge\n•             Kasumi – Stolen Memory\n•             Lair of the Shadow Broker\n•             Firewalker Pack\n•             Overlord\n•             Normandy Crash Site\n•             Arrival\n•             Genesis 2\n•             From Ashes\n•             Mass Effect 3: Extended Cut\n•             Leviathan\n•             Omega\n•             Citadel\n•             Equalizer Pack\n•             Aegis Pack\n•             Firepower Pack\n•             Cerberus Weapons and Armor\n•             Arc Projector\n•             ME2 Alternate Appearance Pack 1\n•             ME2 Alternate Appearance Pack 2\n•             ME3 Alternate Appearance Pack 1\n•             Firefight Pack\n•             Groundside Resistance Pack\n•             Recon Operations Pack\n•             Collector's Weapon and Armor\n•             Terminus Weapon and Armor\n•             M-21 Incisor\n•             Blood Dragon Armor\n•             Inferno Armor\n•             Recon Hood\n•             Sentry Interface\n•             Umbra Visor\n•             N7 Warfare Gear\n•             AT-12 Raider\n•             Chakram Launcher\n•             M-55 Argus\n•             M-90 Indra\n•             Reckoner Knight Armor\n•             N7 Collector's Edition Pack", "link": "https://www.youtube.com/watch?v=EURSMpXpnwE", "date_published": "2021-04-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Xbox Game Pass for PC Added 100+ Games", "description": "Xbox Game Pass for PC added 100 more iconic games! Now play award-winning Bethesda titles, brand new PC games, and EA Play on PC.\n\nWith Xbox Game Pass for PC you can play great PC games and new Xbox Game Studios games when they launch, all for one low monthly price. Starting today, you can play games like DOOM Eternal, Yakuza 6: The Song of Life, Narita Boy and more.\n \nEnjoy a collection of EA’s top titles with EA Play, included with your Xbox Game Pass for PC subscription at no extra cost. With EA Play, members get instant access to EA games on PC, exclusive in-game rewards, and early trials of select new games.\n\nWith new titles added all the time, there’s always something new to discover and play including upcoming day one titles like Halo Infinite. Join Xbox Game Pass for PC today and start your first month for $1.\n\n#XBOX #XBOXGamePass #GamePass", "link": "https://www.youtube.com/watch?v=s0yaFg1463Q", "date_published": "2021-04-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "9 Things We Want From Nintendo at E3 2021", "description": "Nintendo is officially confirmed to participate in E3 2021, and since Nintendo tends to bring out the big guns at E3, we've compiled the biggest things we want at this year's show.\n\nE3 2020 didn’t happen, and Nintendo Direct shows became somewhat nonexistent for the entire year. We received plenty of Partner Showcases, but no regular Nintendo Direct between September 2019 and February 2021. Typically, Nintendo Direct presentations are announced 1-2 days before airing, but with Nintendo returning to E3 in 2021, we have a solid timeframe of when new announcements will come.\n\nThere are a few things lingering from previous years we’d like to see return at this year’s show, like the sequel to The Legend of Zelda: Breath of the Wild, Metroid Prime 4, and Bayonetta 3. But what about other stuff? ARMS 2? Pikmin 4? N64 and GameCube Online? All that and more is touched on in this video.\n\nIf you want to know more about E3’s return in 2021, then check out our show Console Crew, where Lucy James, Tamoor Hussain, and Jordan Ramée discuss the news and if publishers even need E3 in a world where digital events are doing really well: https://youtu.be/xBhuNg2DMJI\n\n9 Things We Want In Zelda: Breath Of The Wild 2: https://youtu.be/wNUjaLb_YPM", "link": "https://www.youtube.com/watch?v=Bj6Q9t2fTGM", "date_published": "2021-04-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Elgato LED Strip | Is It Worth It?", "description": "Elgato LED Strips: https://bit.ly/3dbba1R\nPhillips Light Strips: https://bit.ly/3tcwyZT\n\nElgato is offering their own streamer-friendly LED light strips. Jean-Luc tests them out and sees how to compare to Philip's lightstrip.\n\nElgato continues their line of lighting products designed for the at-home streamer with the Elgato Light Strip, their take on RGBW lights. At a price of $60 USD, these offer competition with leading competitors like Philips, whose lightstrip runs $80. So let’s take a look at how Elgato stacks up.\n\nWhat Comes in the box\nThe light strip itself runs a length of 78.74 inches, offers a brightness of up to 2000 lumens and the color range of 3500 - 6500 K. For comparison, Philip’s light strips run the same length, has a lower lumen output of 1600, but offer a wider color range of 2000 - 6500 K. In short, Elgato offers a bit less color range but is brighter than the Philips.\n\nSetup\nThe setup is pretty straightforward. Simply apply your light where you want it. I went with placing it behind my computer desk, and then you’ll need to install the Elgato control center app, either on your phone or computer. Sync the lights to your wifi and you’re good to go. I did encounter an issue where after setting up the lights and the control center on my windows desktop would keep crashing every time I pulled it up. But after a fresh reinstall, I haven’t had any issues.\n\nI prefer controlling them on my phone anyways because you can save six sets of colors as favorites for easy switching, which you can’t do on the desktop version. However, if you happen to own a stream deck, you can program that to work with your light strips. You can set up a power button, color presets, and adjust brightness and temp. It's pretty neat but kind of a bummer that you need the stream deck if you want to set up presets using your desktop. At least the phone app is still an option.\n\nFlicker-Free\nOne of the big selling points of these lights is that there are flicker-free. Typically LED lights can flicker when shown on camera and you’ll need to adjust your shutter speed to reduce this. You can see this happening here with the Philips light strip. Meanwhile, Elgato’s do not. This makes these a better choice if you're using these lights to decorate a studio or the background of your streaming setup\n\nOutro\nIf you’re someone like me that likes decorating your space with RGB lights, the Elgato Light Strip is a pretty easy recommendation from me. They are good quality, easy setup, and brighter than the offering from their main competitor Philips, in addition to being $20 cheaper. If you're looking for some LED strips, I would definitely consider these.", "link": "https://www.youtube.com/watch?v=V-AULSN0O_g", "date_published": "2021-04-12 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]