[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firearms Expert Reacts To Halo Franchise Guns", "description": "Jonathan Ferguson, a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries, breaks down the weaponry of the Halo franchise, including the iconic Assault Rifle, the BR55 Battle Rifle, and of course, the Covenant Needler.\n\nIn the latest video in the Firearm Expert Reacts series, Jonathan Ferguson--a weapons expert and Keeper of Firearms & Artillery at the Royal Armouries--breaks down the guns of the Halo franchise and compares them to their real-life counterparts.\n\nIf you're interested in seeing more of Jonathan's work, you can check out more from the Royal Armouries right here. - https://www.youtube.com/user/RoyalArmouries\n\nIf you would like to support the Royal Armouries, you can make a charitable donation to the museum here. - https://royalarmouries.org/support-us/donations/\n\nAnd if you would like to become a member of the Royal Armouries, you can get a membership here. - https://royalarmouries.org/support-us/membership/\n\nYou can either purchase Jonathan's book here. - https://www.headstamppublishing.com/bullpup-rifle-book\n\nOr at the Royal Armouries shop here. - https://shop.royalarmouries.org/collections/thorneycroft-to-sa80-british-bullpup-firearms-1901-2020\n\nYou can subscribe to the Armax Journal that Jonathan Associate Edited here: https://www.armaxjournal.org/", "link": "https://www.youtube.com/watch?v=RmMpjMmCd00", "date_published": "2021-12-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Fortnite Chapter 2 Every In Game Story Event Gameplay", "description": "Fortnite Chapter 2 had 5 major in game story events including: Device, Devourer of Worlds, Zero Crisis Finale, Operation Sky Fire, and The End. With Fortnite Chapter 2 coming to an end relive all these moments one more time.\n\n0:00 Device Event\n07:20 Devourer of Worlds Event\n16:18 Zero Crisis Finale Event\n22:50 Operation Sky Fire Event\n34:00 Chapter 2 The End Event", "link": "https://www.youtube.com/watch?v=q-bEx94xvZ4", "date_published": "2021-12-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Fortnite Chapter 2 The End Event FULL Gameplay", "description": "Get a glimpse of the end of Chapter 2 for Fortnite with an epic appearance by Dwayne \"The Rock\" Johnson as he helps to save Agent Jones. Check out what becomes of the Cube Queen and what's next in Chapter 3.\n\n01:14 The End Event Starts\n\n#Fortnite", "link": "https://www.youtube.com/watch?v=zPdjeyVnV7I", "date_published": "2021-12-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield Will Be Headed By Apex/Titanfall Boss | GameSpot News", "description": "In this episode of GameSpot News, Persia talks about the recent teases for Battlefield 2042’s new map, specialist, and more updates on the way.\n\nFollowing 2042's rocky launch, EA has announced a major shake-up at the company. DICE general manager Oskar Gabrielson is leaving, with Rebecka Coutaz set to take over as the new GM. Meanwhile, Respawn co-founder Vince Zampella will become the overall boss on the Battlefield franchise in addition to his current role. EA also indicated it's looking to create a connected Battlefield universe, and both Ripple Effect and Halo veteran Marcus Lehto's new studio will be working on Battlefield experiences, which may or may not be new games.\n\nLater in the video, Persia also talks about what's next for the game. That includes the launch of a new map and specialist, which will hit next year, as well as time-limited 64-player modes for PC and new-gen consoles. 2022 will also introduce the first live season of Battlefield 2042. \n\nAs far as today’s patch goes for Battlefield 2042, it brings with it more than 150 bug fixes, changes, and improvements across the game. As detailed by DICE, some of those changes include improved level geometry so that players don't get stuck, the elimination of various visual glitches, fixes to spawning issues, and a whole lot more that you can read all about on gamespot.com.", "link": "https://www.youtube.com/watch?v=g3SKxl1LSQ0", "date_published": "2021-12-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Final Fantasy XIV Endwalker - Everything To Know", "description": "To prepare you for Final Fantasy XIV Endwalker, we thought we would gather up everything you need to know about the new expansion before it arrives!\n\nA new adventure awaits the Warriors of Light in Endwalker, the latest expansion for Square Enix’s popular MMO, Final Fantasy 14. Not only is Endwalker wrapping up a huge, intricate story that spans over 10 years, but it’s also bringing us two new jobs,  as well as the male viera and a ton of new content on top.\n\nIn this video, we talk about everything you need to know about Endwalker before it's release. This includes the expansion's story, new modes and features, data center travel and more. \n\nEndwalker launches on December 7th officially, or on the 3rd if you pre-ordered for early access on both Playstation 4 and 5 as well as PC, Steam, and Mac.", "link": "https://www.youtube.com/watch?v=b7diDeCGvBQ", "date_published": "2021-12-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Infinite - Everything To Know", "description": "To prepare you for Halo Infinite, we've gathered everything you need to know about the campaign and the multiplayer. \n\nHalo Infinite is one of Microsoft's biggest upcoming games, and while it missed its original release date as an Xbox Series X|S launch title, the free-to-play multiplayer beta had a surprise launch and the campaign is right around the corner. \n\nIn this video, we talk about everything you need to know about Halo Infinite before it's release. From the campaign's story and gameplay to the multiplayer's new weapons and gadget types.  \n\nHalo Infinite's campaign launches on December 8th for Xbox One, Xbox Series X|S and PC.", "link": "https://www.youtube.com/watch?v=c0W74QlvUlY", "date_published": "2021-12-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "PlayStation’s Game Pass: What We Know So Far | GameSpot News", "description": "In this episode of GameSpot News, we talk about PlayStation planning a game pass competitor, Battlefield 2042’s Santa Clause skin not being available for purchase and Madden 22’s franchise mode updates not being canceled.  \n\nIn this video, DeVante talks about PlayStation reportedly planning a new subscription service to compete with Xbox Game Pass, with the ability to play original PlayStation 1, 2, 3, and PSP games on, most likely, the PS4 and 5. According to Bloomberg, this service is codenamed Spartacus and is reportedly expected to launch in Spring 2022. \n\nDeVante also talks about Battlefield 2042’s leaked Santa Clause skin not actually coming to the game. According to DICE, the skins were developed as options, but “we presently have no plans to utilize all of them this Holiday.”\n\nLater in the video, EA Sports reveals Madden 22 Franchise mode updates have not been canceled. \n\nTIME STAMPS\n00:00 - Intro\n00:09 - PlayStation Game Pass\n01:19 - Godfall on PS+ \n01:58 - Battlefield 2042 Bad Santa\n02:33 - Madden 22 franchise updates\n03:14 - Outro", "link": "https://www.youtube.com/watch?v=WBndu5ZxX2Q", "date_published": "2021-12-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]