[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "Linux is only free if you don't value your time - Is it still true?", "description": "Wanna get your own Linux server? Visit https://www.linode.com/linuxexperiment for a 100$ credit ! \n\nGet your Linux desktop or laptop here: https://slimbook.es/en/\n\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nI also do a Gaming Podcast: https://www.youtube.com/channel/UCbRPZ11S1quJ4ESoj42A3ug\nJoin us on our new Discord server: https://discord.gg/xK7ukavWmQ\nTwitter : http://twitter.com/thelinuxEXP\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\nFollow me on ODYSEE: https://odysee.com/@TheLinuxExperiment:e\nOr join ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\n\n00:00 Intro\n00:22 Get your 100$ Linode Credit\n01:34 Origins of a myth\n02:30 Linux is Free\n03:25 Linux wastes time?\n05:50 Does Linux waste MORE time?\n08:08 Time is still wasted\n10:27 Is it still true?\n\n\nOk, so first, that exact quote is attributed to \"Jamie Zawinski\" a developer, way back in 1998. And at the time it was written, it was true. THe Linux desktop, 24 years ago, was NOT the Linux we know and love today. But things have changed a lot, in 24 years.\n\nOk, let's start with the Linux is free part. This one is going to be easy. Linux, as in \"linux based operating systems\", is, in fact, generally free. 99.9% of dstributions choose to not charge a cent for users to download and to use their OS. Some do choose to charge users, like Zorin OS Pro, for example, or elementary OS.\n\nNow, the second part is more subject to interpretation. The general meaning of \"if you don't value your time\", is that Linux is only free if you have time to waste, or If you don't charge for your time.\n\nLinux, in itself can be time consuming: when you install it, you'll have to look up a few things, you have to try out the OS in a LIVE USB session, you have to install your necessary programs, change the few options you want, for it to work like you want it to. You can also spend a lot of time choosing which desktop or distro you want to use.\n\nSo, yeah, Linux is time consuming.\n\nBut Is it MORE time consuming than the alternatives that people already know?\n\nThe \"Linux wastes time\" myth is generally built upon the assumption that other systems don't, because people are looking at the Linux desktop as something they have to install and learn, compared to something that's already installed and that they already know how to use.\n\nThis comparison doesn't work, because it doesn't place the alternatives on an equal footing. You're comparing something that you already SPENT time setting up and learning, compared to something new.\n\nInstalling Windows takes longer than installing Linux. Windows doesn't come with all the programs you might need, just like most Linux distros, so you have to install your stuff in both cases. Windows also has issues to troubleshoot, even though these seem less frequent than the ones Linux can encounter. Windows has updates to install, like Linux, the difference is that Linux lets you pick which, and when, and WIndows forces them upon you, and they will stop you from using your computer for a LONG time in most cases.\n\n\nIn short, if you compare Windows and a Linux desktop, from an equal standpoint of \"This is a new OS i have to install and learn\", they will BOTH waste your time.\n\nSo, Linux is FREE and it doesn\"t waste your time more than alternatives. SO the sentence should be \"Linux is free and wastes just as much time as paid-for alternatives\", right?\n\nWrong.\n\nThe time is still wasted in the end. Not because Linux is worse, not because it's harder, but because people who will be interested in moving to Linux will already KNOW how things work with their current OS, and re-learning that stuff on another OS will always be time consuming.\n\nWhat the \"Linux is only free if you don't value your time\" myth ignores, is that the time you spend isn't spent every day, for the rest of your life using Linux. It's spend once, when you move to it, and over the course of a few days, while you get used to it, and learn how to use it. Once that's done, you're not wasting time anymore, you're SAVING time, and saving money.", "link": "https://www.youtube.com/watch?v=An4X9E9vyn8", "date_published": "2021-12-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]