[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Melanie Charles: Tiny Desk (Home) Concert", "description": "NPR Music's Tiny Desk series will celebrate Black History Month by featuring four weeks of Tiny Desk (home) concerts and playlists by Black artists spanning different genres and generations each week. The lineup includes both emerging and established artists who will be performing a Tiny Desk concert for the first time. This celebration highlights the beautiful cornucopia of Black music and our special way of presenting it. We hope you enjoy.\n\nNikki Birch | February 4, 2021\nWithin the warm walls of Williamsburg Music Center, one of Brooklyn's last surviving black-owned jazz venues, Melanie Charles takes us on a journey that embodies the soul of jazz: exploration. A Brooklynite proud of her rich Haitian heritage, Charles is conscious of the giant shoulders upon which she stands and takes steps to both honor and advance this music. Behind her, smiling pictures of her guardian angels, Mary Lou Williams and Billie Holiday, encourage Charles while she and her musicians blend the mystique of Haitian folk music with the sorrowful optimism of negro spirituals and the free space for elevation that jazz improvisation allows.\n\nIn \"Damballa Wedo,\" Charles channels her Haitian roots and delivers a modern twist of a traditional vodou song by Toto Bissainthe. She sings that when we seek transformation, we may become someone who those around us no longer recognize, but that the change is necessary and part of the ancestors' divine plan. \"C'est bon, c'est bon,\" she sings.\n\nCharles' arrangement of \"Deep River\" is inspired by her admiration for Sun Ra. The biography of the eccentric composer, arranger, musician, and early pioneer of Afrofuturism, Space Is The Place rests on a stand behind her. By really digging into his approach and arrangements and using his \"spaceship setup as a performance guide,\" she breathes new life into this spiritual, injecting it with a potency that is simultaneously somber and otherworldly.\n\nShe finishes the set with \"Dilemma,\" a new song written to find the balance between self-care and showing up for those you love amid the cries for justice during the first summer of the pandemic. On our phone call, Charles explained that the song is an anthem that reminds us to not to \"dim your light for anybody\" and \"remember how vibrant we are, despite what we as black people had to deal with in 2020.\"\n\nThis performance was a full circle moment for Melanie Charles. The Williamsburg Music Center is owned by Gerry Eastman, a celebrated musician and composer who taught the jazz class Charles and her brother and saxophonist, Rogerst Charles, attended when they were in high school. According to Charles, Eastman \"represents a special era of Brooklyn jazz musicians\" and created a space that gave these artists a place to perform when all other doors were closed to them. On this stage and many others, Melanie Charles continues her mission to show the world exactly what it means to Make Jazz Trill Again.\n\nSET LIST\n\"Damballa Wedo\"\n\"Deep River\"\n\"The Dilemma\"\n\nMUSICIANS\nMelanie Charles: vocals, keys and flute\nDiego Ramirez: drums\nJonathan Michel: upright bass\nRogerst Charles: saxophone\n\nCREDITS\nVideo: Dante Corbett\nAudio: Danny Keith Taylor and BaeBro\nProducer: Ned Levy\nLocation: Williamsburg Music Center\nSpecial Thanks: Gerry Eastman\n\n\nTINY DESK TEAM\nProducer: Nikki Birch\nVideo Producer: Morgan Noelle Smith\nAudio Mastering: Josh Rogosin\nArt Director: CJ Riculan\nAssociate Producer: Bobby Carter\nTiny Production Team: Bob Boilen, Kara Frame, Maia Stern\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann", "link": "https://www.youtube.com/watch?v=4Nms38zErKU", "date_published": "2021-02-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]