[{"source": "https://www.theguardian.com/rss", "title": "We’re on the hunt for young nature lovers – do you know any?", "description": "<p>Know a child who could write a winter piece about the natural world? Our Young Country Diary series is taking submissions</p><p>Winter is here and Young Country Diary is once again open for submissions. Every three months we ask you to send us a piece about the natural world, written by a child aged 8-14. The article can be about anything to do with nature – whether it’s cliff-top birdwatching, a worm in the garden or a wintry walk in the park.</p><p>It doesn’t matter if the child is a nature expert or has never picked up a pair of binoculars. We are especially keen to reach teachers who might like to get their class outside and noticing nature.</p> <a href=\"https://www.theguardian.com/environment/2021/aug/27/nature-lovers-guardian-young-country-diary-writers\">Continue reading...</a>", "link": "https://www.theguardian.com/environment/2021/aug/27/nature-lovers-guardian-young-country-diary-writers", "date_published": "2021-12-15 15:00:15+00:00", "persistent": false, "user": null, "language": "en-UK"}, {"source": "https://www.theguardian.com/rss", "title": "Tell us: what are your plans for the countdown to Christmas?", "description": "<p>We would like to hear from people going into self-imposed lockdown so they can be Covid-free to see people on Christmas Day</p><p>It is 10 days until Christmas Day. According to government rules, if people in the UK test positive for Covid-19 from now on, they will have to self-isolate over Christmas.</p><p>What are your plans during this period? Have you tested positive and had to change your Christmas plans? Or are you going into self-imposed lockdown from now on so that you can be Covid-free to see people on Christmas Day?</p> <a href=\"https://www.theguardian.com/world/2021/dec/15/tell-us-what-are-your-plans-for-the-countdown-to-christmas\">Continue reading...</a>", "link": "https://www.theguardian.com/world/2021/dec/15/tell-us-what-are-your-plans-for-the-countdown-to-christmas", "date_published": "2021-12-15 10:32:47+00:00", "persistent": false, "user": null, "language": "en-UK"}]