[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Palberta: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nMarissa Lorusso | May 18, 2021\nWhile many of us have gotten better at using technology to feel close to our friends and collaborators over the past year, there's still no replacement for being in the same room as someone who you swear can read your mind. That's what it feels like to watch punk band Palberta, whose music makes magic out of repeated phrases sung in tight harmony and charmingly zany pop hooks. For its Tiny Desk (home) concert, shot on a MiniDV and a Hi8, the band crams into one member's Philly basement for a set that's a testament to the group's tight-knit collaboration and playful exuberance.\n\nThe guitar-bass-drums trio is made up of Ani Ivry-Block, Nina Ryser and Lily Konigsberg, and each member sings and plays each instrument. Here, they trade places every couple of songs for a handful of tracks from the band's recently-released album Palberta5000 – including the frenzied opener \"Eggs n' Bac,'\" the queasy-yet-sentimental \"The Cow\" and the anxious and melodic \"Big Bad Want\" – plus a sweet testament to grooving called \"Sound Of The Beat\" from 2018's Roach Goin' Down. The songs aren't over-complicated but still manage to surprise at every turn – a true Palberta specialty. \"We've been a band for eight years,\" Konigsberg explains after the first song with a giggle, \"and we're gonna be rockin' out forever, together.\" I certainly hope so.\n\nSET LIST\n\"Eggs n' Bac'\"\n\"No Way\"\n\"The Cow\"\n\"Big Bad Want\"\n\"Sound of the Beat\"\n\"Before I Got Here\"\n\nMUSICIANS\nAni Ivry-Block: guitar, bass, drums\nNina Ryser: guitar, bass, drums\nLily Konigsberg: guitar, bass, drums\n\nCREDITS\nVideo: Michael Ipsen, Garrett Burke, Adam Torneo\nShot in Nina's basement in Philly\n\nTINY DESK TEAM\nProducer: Marissa Lorusso\nVideo Producer: Kara Frame\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Maia Stern, Bob Boilen\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#tinydesk #nprmusic #palberta", "link": "https://www.youtube.com/watch?v=yBEWlarv8Tk", "date_published": "2021-05-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]