[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Biomutant Developer Explanation Trailer", "description": "Check out the all new developer trailer for Biomutant explaining what Biomutant is and various aspects of the game and story. This trailer also teases different aspects like character customization that you can expect to see in the game upon release. Biomutant is developed by THQ Nordic. \n\n#Biomutant", "link": "https://www.youtube.com/watch?v=xc93HHNk65s", "date_published": "2021-05-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Mass Effect 1 Liara Romance Scene - Original VS Legendary Edition Comparison", "description": "See the differences in Liara's romance scene between the original release of Mass Effect, and the newly remastered version in Mass Effect Legendary Edition.", "link": "https://www.youtube.com/watch?v=NeqQ743h75A", "date_published": "2021-05-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "How Resident Evil Village Captures 25 Years Of The Franchise", "description": "Resident Evil Village manages to encapsulate everything the franchise has attempted over its 25 years, from its highest points to lowest, in this one game.\n\nResident Evil has transformed, molded, and redefined itself over and over again. From its genre defining breakthrough in 1996, to the co-op Hollywood action packed Resident Evil 6, the franchise has attempted a lot of different things over the years -- some more successful than others.\n\nOver its 25 years, Resident Evil cemented the survival horror genre, revolutionized the third person shooters with Resident Evil 4’s influential perspective, and managed to bring survival horror back into the mainstream once again with Resident Evil 7. Village encapsulates all of that, and more, pushing the franchise into new heights while doubling down on everything from the series’ past.\n\nIn the above video, Kurt Indovina ties every element back to where it was previously introduced in the franchise. From Lady Dimitrescu to Resident Evil 3’s iconic Nemesis replicated with Lady Dimitrescu, to its convoluted lore with Mother Miranda, and its similarities to CODE: Veronica. While there’s plenty of similarities to Resident Evil 4, some aren’t as apparent as others, like the ghost dolls from House Beneviento, and its direct inspiration from RE4’s unreleased prototype codenamed the “Hallucination” version, which featured creepy porcelain dolls that protagonist Leon Kennedy had to fight.\n\nWatch the video to hear how Resident Evil Village managed to staple together 25 years of Resident Evil.\n\nCheck out our other Resident Evil content!\nResident Evil Village Ending Explained: https://youtu.be/uQ-zJhZczZk\nThe Complete Resident Evil Timeline Explained: https://youtu.be/QkPgowr-T9g \nResident Evil Village Lore - The Lords: https://youtu.be/EL3nDFpCSyI", "link": "https://www.youtube.com/watch?v=-phrMMEqXkI", "date_published": "2021-05-17 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]