[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "3 New Minecraft Mobs Revealed For Fan Vote | GameSpot News", "description": "In today’s GameSpot News, Persia talks about the three new mobs you can vote for during Minecraft Live, Battlefield 2042’s new Hazard Zone game mode, and the official competitive settings for Halo Infinite.\n\nThree new mobs have been announced for the Minecraft Live fan vote and include the Glare, Allay, and Copper Golem. The Glare assists with finding dark areas, the Allay collects items for you, and the Copper Golem loves to press copper buttons and can turn into a statue over time. You can vote on your favorite mob during Minecraft Live on Saturday, October 16th. \n\nEA and DICE have now formally announced Battlefield 2042's Hazard Zone mode where you play in a four-member squad and your objective is to locate and retrieve data drives that have fallen from satellites. You and your team will have a choice of a mid-game or late-game extraction point where the rewards are greater if you stick around but more dangerous as only two squads can leave victorious. Hazard Zone supports 24 players on PS4 and Xbox One and 32 players on PS5/Xbox Series X|S and PC.\n\nThe settings for Halo Infinite’s competitive playlists were showcased during a livestream from 343 developers and include BR start, no motion tracker, friendly fire enabled, and more. Weapons, equipment, and grenades on maps will always appear in the same location on each map and mode combination and will respawn at the same intervals. \n\nFor more information on all of our topics today, please visit gamespot.com.\n\nTIMESTAMPS:\nIntro - 00:00\nMinecraft - 00:17\nBattlefield 2042 - 02:14\nHalo Infinite - 04:13\nOutro - 05:43", "link": "https://www.youtube.com/watch?v=bUVj92ti1U4", "date_published": "2021-10-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Animal Crossing: New Horizons Direct 10.15.2021 Full Presentation", "description": "Check out the full presentation for Animal Crossing: New Horizons where Nintendo showed off details in the free November Update as well as an all new DLC. \n\nThe new DLC Happy Home Paradise will be a paid DLC and brings lots of new features to the game!", "link": "https://www.youtube.com/watch?v=dlcpZX1T7W4", "date_published": "2021-10-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Animal Crossing: New Horizons Happy Home Paradise DLC Full Presentation", "description": "Check out the full presentation for the all new paid DLC coming to Animal Crossing: New Horizons called Happy Home Paradise!", "link": "https://www.youtube.com/watch?v=rQyU6PEAaGI", "date_published": "2021-10-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 Beta - The Good, The Bad, & The Ugly", "description": "Battlefield 2042 finally gave players a crack at it's open beta and the conversation has been mixed. There's a lot of good, a lot of bad, and some real ugly parts that we decided to break down to see how the Open Beta actually went, and if Battlefield maybe even needs another delay? \n\nBattlefield 2042 wrapped up its open beta to mixed results. There were a lot of positives to the all-out warfare Conquest mode, which players from all over the world got a chance to sink their teeth into, but unfortunately, there were also issues. From bugs and visual glitches to poor performance optimization across multiple platforms, the 2042 beta definitely had its share of problems.\n\nIn this video, we break down some of the most important factors of just where the beta shined, and where it suggests that the full game will seriously need another look. Key components like the excellent destruction are addressed, as well as a look at some of the newest gameplay additions such as the vehicle call-in system and “plus” attachment system.\n\nYour mileage may vary with how you felt on each of these components so definitely let us know in the comments which parts of the beta you enjoyed or didn't quite feel were up to your expectations. Be sure to subscribe to GameSpot cause we're approaching the release date for Battlefield 2042 real soon!", "link": "https://www.youtube.com/watch?v=oR9OJuQA2xA", "date_published": "2021-10-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Back 4 Blood Review", "description": "Back 4 Blood recaptures the spirit of Left 4 Dead while introducing some engaging modern trappings.\n\nTurtle Rock Studios' Back 4 Blood is now available on PC, PS5, PS4, Xbox Series X/S, and Xbox One. You can read the full written Back 4 Blood review by Richard Wakeling on GameSpot: https://www.gamespot.com/reviews/back-4-blood-review-reanimated/1900-6417761/", "link": "https://www.youtube.com/watch?v=B8mhblXVHHY", "date_published": "2021-10-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 Hazard Zone Explained", "description": "Hazard Zone is a Battlefield 2042's high stakes game mode that releases alongside All-Out-Warfare and Portal. It involves squads landing on a map, hunting down Data Drives, and extracting. \n\nBattlefield 2042 will release on November 19 and will most notably not include a battle royale mode at launch. Instead developer DICE is focusing on a new competitive squad-based game type called Hazard Zone that focuses on multiple four person squads moving around a map and competing to collect Data Drives and get them to extraction points. As opposed to much larger player counts in popular battle royale titles, this game type will have 24 players (six total teams) on Xbox One and PlayStation 4 and 32 players (eight total teams) on Xbox Series X|S, PlayStation 5, and PC. \n\nHazard Zone does seem to draw plenty of elements from battle royale titles, such as the ability to spawn downed teammates back at Reinforcement Uplink points or using a Tactical Upgrade. Hazard Zone will be playable on all launch maps from All-Out-Warfare and will occasionally incorporate extreme weather such as tornadoes. Another large element to Hazard Zone will be squad makeup. Players can't use more than one of the same Specialist on their team encouraging teams to work together and rely on different Specialists throughout each match. Having mobility with an operator like Sundance might provide a key advantage during a different phase of the match in comparison to Falck's healing, for example. There is a ton more to know about Hazard Zone, including phases, currencies, tactical upgrades, and how to maximize points. Make sure to watch this video for the full breakdown.", "link": "https://www.youtube.com/watch?v=qsPTVbo-q9s", "date_published": "2021-10-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 | Hazard Zone Official Trailer", "description": "Check out the all new Battlefield 2042 Hazard Zone reveal trailer! \n\nBattlefield 2042 is available on November 19, 2021\n\nDiscover Battlefield Hazard Zone – A tense, squad-focused survival experience combining edge-of-your-seat gameplay with the best of the Battlefield sandbox. Inserted as a four-member squad, you must locate and retrieve critical Data Drives scattered throughout the battlefield, while competing against opposing squads with the same objective and local militias. Succeed by gathering the Data Drives and choosing when to extract before a storm overtakes the area in this high-stakes, one-life experience. Every bullet, every skirmish, and every decision counts.", "link": "https://www.youtube.com/watch?v=sKO8Mwz8Ymk", "date_published": "2021-10-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty Cheaters Hit With Ricochet | GameSpot News", "description": "In this GameSpot News Update, we’re talking about Activision revealing the details for it’s new Call of Duty anti-cheat system Ricochet, the Ghost Recon: Frontline beta getting hit with a delay, and FIFA asking for $1 Billion from EA.\n\nIn this video, DeVante talks about Activision revealing details for Call of Duty’s Ricochet anti-cheat system that will launch alongside Call of Duty: Vanguard on November 5. These new security features will also arrive with the Vanguard-themed Pacific map coming to Call of Duty: Warzone later in the year\n\nDeVante also explains FIFA and EA’s ongoing negotiations following reports that FIFA wants wants \"more than double\" what it currently gets from EA, and is asking for $1 billion for each four-year World Cup cycle.\n\nLater in the video, Ghost Recon: Frontline’s beta is delay indefinitely, Solar Ash is delayed to December 2 and PS Plus members will get 3 extra free games to celebrate the 5th birthday of PSVR. \n\nTIMESTAMPS:\n00:00 - Intro\n00:19 - Call of Duty anti-cheat system\n01:07 - FIFA wants $1 billion from EA\n02:15 - Ghost Recon: Frontline beta delayed\n03:02 - Solar Ash delayed\n03:18 - Extra PS Plus games \n04:07 - Outro", "link": "https://www.youtube.com/watch?v=KXjIRO2vEy8", "date_published": "2021-10-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty: Vanguard | Zombies Reveal Trailer", "description": "Check out the all new Zombies reveal trailer for Call of Duty: Vanguard Your mission: Stop the undead army with a new set of Dark Aether skills.\n\nWelcome to Call of Duty: Vanguard Zombies.\n\n#CallofDutyVanguard", "link": "https://www.youtube.com/watch?v=LOg40ytzIa4", "date_published": "2021-10-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Infinite Competitive Gameplay and Settings Reveal", "description": "Check out gameplay of Halo Infinite competitive and ranked multiplayer settings for the first time. The gameplay will have commentary from Lead Multiplayer Designer, Andrew Witts, and former Halo pro and member of the 343 Competitive Insights team, Sal \"El Town\" Mohanan, with host Andy “Bravo” Dudynsky. \n\nGameplay Starts at: 1:30\n\n#HaloInfinite", "link": "https://www.youtube.com/watch?v=BrlRRL5Oa_k", "date_published": "2021-10-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]