[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Where is herd immunity?", "description": "Moderna boosters, recommended by FDA independent advisory panel\n\n65 and older and for adults who are at high risk of severe illness\n\nSix months\n\nHalf dose\n\nJacqueline Miller, head of Moderna’s infectious-disease therapeutic area\n\nhttps://www.washingtonpost.com/health/2021/10/14/moderna-booster-shot-fda/\n\nSix to eight months after vaccination, antibody levels dropped in vaccine recipients. \n\nA half-dose booster at least six months after initial vaccination restored antibodies levels\n\nPeople from original trial, a clear uptick in breakthrough infections this July and August\n\nUK ONS\n\nhttps://www.ons.gov.uk/peoplepopulationandcommunity/healthandsocialcare/conditionsanddiseases/articles/coronaviruscovid19/latestinsights#cis\n\nWeek ending 9 October 2021 \n\nPeople that that had COVID-19 in the week \n\nUp in England, Wales and NI\n\nDown in Scotland\n\n1.63% in England (1 in 60 people)\n\n2.18% in Wales (1 in 45 people)\n\n0.82% in Northern Ireland (1 in 120 people)\n\n1.26% in Scotland (1 in 80 people)\n\nPeople testing positive for antibodies\n\n93.6%\n\nMortality displacement did not offset excess deaths by mid-2021 \n\nSome evidence of mortality displacement during the pandemic\n\nMortality displacement, when vulnerable people die sooner than expected\n\nPotentially leading to a lower-than-average period of mortality \n\nThese periods of below average mortality did not offset the high number of deaths since the beginning of the pandemic\n\n3 January 2020 to 2 July 2021\n\n97,981 excess deaths in England and Wales\n\n(compared to what we would expect in a non-pandemic period). \n\nWithin 28 days of a positive test, 138,379\n\nCertificated, 161,798\n\nZoe data\n\nhttps://covid.joinzoe.com/data#levels-over-time\n\nhttps://covid.joinzoe.com/post/third-wave-reaches-new-peak\n\nLong covid\n\nhttps://www.ons.gov.uk/peoplepopulationandcommunity/healthandsocialcare/conditionsanddiseases/articles/coronaviruscovid19/latestinsights#cis\n\nLong covid as of 5 September 2021\n\nAn estimated 1.1 million in the UK experiencing long COVID\n\nhttps://www.ons.gov.uk/peoplepopulationandcommunity/healthandsocialcare/conditionsanddiseases/articles/coronaviruscovid19/latestinsights#cis\n\n1.7% of the total population were experiencing self-reported long COVID\n\nUp from 970,000 (1.5%) at 1 August 2021\n\n831,000 (77%) first had (or suspected they had) COVID-19 at least 12 weeks previously\n\n405,000 (37%) first had (or suspected they had) COVID-19 at least one year previously\n\nSymptoms adversely affected the day-to-day activities of around two-thirds (65%) of those with self-reported long COVID\n\nFatigue (56%)\n\nShortness of breath (40%)\n\nLoss of smell (32%)\n\nDifficulty concentrating (31%)\n\nProfessor Tim Spector\n\nThe UK seems to be slowly waking up to the fact that COVID cases are too high, \n\nbut the reality is they’ve been soaring for months and many countries have put us on their red list. \n\nInfections remain high in young people, and look to be spilling over into the 35-55 year olds. \n\nIf these increases creep into the over 55s it could spell disaster for the NHS this winter. \n\nHerd immunity\n\nhttps://www.youtube.com/watch?v=eJHdFOwZjVI\n\nMinimum 85%\n\nWith cases so high, it’s clear that herd immunity isn't happening\n\nCurrent symptoms in vaccinated and children\n\nRunny nose, 76%\n\nHeadache, 75%\n\nSneezing, 66%\n\nSore throat, 53%\n\nCough 53%\n\nLoss of smell or taste\n\nUK official data\n\nhttps://coronavirus.data.gov.uk", "link": "https://www.youtube.com/watch?v=FVBzaTnDZKo", "date_published": "2021-10-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "John gets 'fact checked'", "description": "Fact checked video by FB, A video about my video about this research paper\nhttps://www.youtube.com/watch?v=nw08zWJQ2m8&t=90s\n\nIntravenous Injection of Coronavirus Disease 2019 (COVID-19) mRNA Vaccine Can Induce Acute Myopericarditis in Mouse Model\n\nhttps://academic.oup.com/cid/advance-article/doi/10.1093/cid/ciab707/6353927\n\nhttps://healthfeedback.org/claimreview/incorrect-vaccine-administration-is-a-potential-cause-of-post-vaccine-adverse-effects-but-more-research-is-still-needed-to-confirm-or-reject-this-hypothesis/?fbclid=IwAR0nBbM6v0V2WPFn4LxIdfR4FNAvIzLGKhzFPdQPG8mu_FR1InB8OzYQgMc\n\nLeo Nicolai, Cardiology Fellow, Ludwig Maximilian University of Munich:\n\nGerman Centre for Cardiovascular Research\n\nIndeed, there is peer-reviewed work showing in mice that possibly intravenous injection of mRNA vaccine leads to myocardial inflammation. \n\nthat intravenous injection of adenoviral vector based vaccine (AZ1222, ChAdOx1) leads to thrombocytopenia and platelet-directed immune responses,\n \noffering a possible explanation for vaccine-induced thrombosis/thrombocytopenia\n\nthese data might indicate a simple measure to lower the incidence of vaccine-induced side effects, \n\nThere is a lack of data on frequency and effects of IV injection in humans. \n\nMost likely, two approaches are needed to further validate the data: \n\nLarge animal studies\n\nStudies comparing incidence of vaccine-associated thrombosis/thrombocytopenia/ myocarditis in countries with mandated syringe aspiration to countries that don’t mandate this practice.\n\nThrombocytopenia and splenic platelet directed immune responses after intravenous ChAdOx1 nCov-19 administration (29th June 2021)\n\nhttps://www.biorxiv.org/content/10.1101/2021.06.29.450356v1\n\nRecently a rare and novel complication of SARS-CoV-2 targeted adenovirus vaccines has emerged: thrombosis with thrombocytopenia syndrome (TTS). \n\nwe employ in vitro and in vivo models\n\nto characterize the possible mechanisms of this platelet-targeted autoimmunity. \n\nWe show that intravenous but not intramuscular injection of ChAdOx1 triggers platelet-adenovirus aggregate formation and platelet activation. \n\nAfter intravenous injection, these aggregates are phagocytosed by macrophages in the spleen and platelet remnants are found in the spleen.\n\nThis is followed by a pronounced B-cell response with the emergence of circulating antibodies binding to platelets.\n\nOur work contributes to the understanding of TTS and highlights accidental intravenous injection as potential mechanism for post-vaccination TTS. \n\nHence, safe intramuscular injection, with aspiration prior to injection, \n\ncould be a potential preventive measure when administering adenovirus-based vaccines.\n\nHelen Petousis-Harris, Associate Professor, University of Auckland:\n\nVaccinologist and associate professor at the University of Auckland\n\nThere are a range of injection techniques for administering vaccines, \n\nInjecting fast and withdrawing the needle\n\nInjecting slowly before withdrawing\n\nPulling back on the plunger, seeing there is no blood, then injecting. This is called aspiration.\n\nRationale for aspirating\n\nvaccine could be inadvertently delivered into the blood rather than the muscle tissue. \n\nBut as the flashback of blood hardly ever happens, the practice was abandoned by many practitioners. \n\nI have not seen any evidence to support the rejection of this hypothesis at this stage. \n\nThe animal model study supports the possibility that inadvertent injection into a blood vessel could result in undesirable reactions. \n\nHowever, the majority of myocarditis cases are occurring in young males after the second dose, something that this hypothesis does not explain.\n\nMy conclusion is that this requires more research and observing the patterns of post-vaccine myocarditis among populations where aspiration is practiced could be helpful.\n\nCommon sense in Denmark\n\nhttps://en.ssi.dk/news/epi-news/2021/no-19-21---2021\n\nCOVID-19 Vaccine Janssen\n\nA single 0.5 mL dose of undiluted vaccine is given.\n\nBased on a precautionary principle, we recommend aspiration before injection.\n\nDownload John's two comprehensive but free educational text books or make a donation to the campbellteaching project using this link: http://159.69.48.3", "link": "https://www.youtube.com/watch?v=MXcddiS32s0", "date_published": "2021-10-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]