[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "10 Things We Want In Elden Ring", "description": "We know next to nothing about Elden Ring, but that won’t stop us from listing off some things we’d love to see in From Software’s next outing. Here are 10 things we'd love to see!\n\nWe still know very little about Elden Ring, From Software's upcoming open-world game. But we have a lot of Demon's Souls, Dark Souls, Bloodborne, and Sekiro: Shadows Die Twice fans among us, so there are plenty of things we hope to see in Elden Ring.\n\nIn the video above, we detail 10 mechanics, features, and characters we hope to see in Elden Ring. We have no context for these dreams of ours beyond that Elden Ring is going to be an open-world game where different kingdoms are each ruled by a powerful entity, and that it features lore created in collaboration with Game Of Thrones author George R.R. Martin.\n\nElden Ring has most recently made the news after a gameplay trailer for the game leaked online. Don't worry, we won't be showing off the leaks in the video nor using it as the basis for any of our hopes and dreams. Frankly, leaks suck, and the trailer in question appears to be of an old build, so it's entirely possible that referencing it would be misleading.\n\nElden Ring doesn't yet have a release date, so we're unsure if we'll even get to see the game by the end of 2021.", "link": "https://www.youtube.com/watch?v=9901tyIy5Es", "date_published": "2021-03-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Elden Ring Leaks Suck For Everyone | Console Crew", "description": "This week on Console Crew, the gang discuss why game leaks suck for everyone, what they’d like to see from a Switch Pro, and what the future of PlayStation handhelds could look like.\n\nThis week on Console Crew the gang finally get to talk about Elden Ring, because goodness knows they’ve never talked about a From Software game before on the show. We’re not going to show any footage of the leaked Elden Ring trailer, but we do discuss it--specifically, we talk about why video game leaks suck for everyone involved.\n\nWith numerous reports that the Switch Pro is on the way, they also talk about what improvements they’d like to see to the Nintendo Switch, including better performance and battery life. Finally, the PlayStation Vita is getting a new physical game for the first time since 2019, which begs the question: What does the future look like for Sony handhelds? \n\nConsole Crew is your weekly roundup of the biggest PlayStation, Nintendo, and Xbox news, hosted by Lucy James, Tamoor Hussain, and Jordan Ramée. Catch it every Friday at youtube.com/GameSpot. \n\n00:00 - Intro\n00:53 - Elden Ring leak: why it sucks for everyone\n07:43 - Nintendo Switch's 4th Anniversary & is it time for the Switch Pro?\n13:22 - PS Vita lives, and the future of PlayStation handhelds\n18:08 - Outro", "link": "https://www.youtube.com/watch?v=R_jReBgFIPo", "date_published": "2021-03-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Last of Us Part 2's Shannon Woodward on Playing Dina and Working with Naughty Dog", "description": "On this week's episode of #GameSpotAfterDark, Shannon Woodward from #TheLastOfUsPart2 joins us to talk about her experiences with Naughty Dog. Check out the full interview here: https://open.spotify.com/show/5qmuPYfpj7R7yHXEtKBocG?si=Au1mZdHzTgOSHACMg50irA \n\n00:00 - Intro\n00:24 - Getting Into Acting In Video Games\n02:21 - First Time Walking On Set For LOU2\n04:08 - Differences In Acting For TV and Video Games\n07:57 - How Much Story Did You Know In Advance?\n09:47 - Creative Freedom In Scenes", "link": "https://www.youtube.com/watch?v=91R5s7a1Rtk", "date_published": "2021-03-05 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "8 Minutes of Mortal Shell Enhanced Edition PS5 Gameplay", "description": "Mortal Shell's Enhanced Edition is now available so we fight our way through the opening area and even take on a mini boss Grisha. Take a look at the all new enhanced edition running on the PlayStation 5.\n\n0:00 Intro\n0:10 Opening Area\n03:25 Grisha Fight", "link": "https://www.youtube.com/watch?v=dyTF8eTQPNw", "date_published": "2021-03-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Guilty Gear Strive Gameplay - Anji and I-No Footage", "description": "Check out new Anji and I-No footage from Guilty Gear  -Strive-, releasing on June 11, 2021.", "link": "https://www.youtube.com/watch?v=wRFk5YPMRnY", "date_published": "2021-03-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Hitman 3 Devs Break Down Dartmoor Mission", "description": "IO Interactive level designers Toke Krainert and Victor Rasmussen break down Hitman 3's incredible Dartmoor mission, including the development of the enthralling murder mystery storyline.\n\nHitman 3's 'A Death in the Family' mission is a Hitman level like no other, allowing the player the opportunity to take on the role of a master detective, collect clues and alibis, and solve a locked room murder mystery with multiple possible outcomes. \n\nIn the video above, Hitman 3 level designers Toke Krainert and Victor Rasmussen  break down the development of the game's unforgettable Dartmoor mission and how they reworked familiar Hitman mechanics to allow players to catch a killer. \n\nFrom initial conception to their favourite secrets, Toke and Victor detail the challenges and opportunities that come with crafting a compelling murder mystery narrative, as well as how the foreboding Thornbridge Manor was designed.", "link": "https://www.youtube.com/watch?v=ww9uHdE_wks", "date_published": "2021-03-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Zombieland Headshot Fever - Official Announcement Trailer", "description": "Survive ferocious zombies and enjoy the dystopian humour of Zombieland as Tallahassee, Wichita, Columbus and Little Rock train you to run the fastest, most dangerous zombie-killing race course ever devised - the Zombieland Invitational! (Captured on Oculus Quest)", "link": "https://www.youtube.com/watch?v=H_35Kd7hUl0", "date_published": "2021-03-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]