[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCSiPjfAJBgbFlIUsxOWpK0w", "title": "Assedic // Les Escrocs // POMPLAMOOSE", "description": "Here's our cover of Assedic, a French love song \"of sorts\"...we included the translation because the lyrics are pretty hysterical.\n\nSave this song on Spotify: https://spoti.fi/2r3Yqkh\nFollow us on instagram: https://instagram.com/pomplamoosemusic\nBecome a patron of our music: http://www.patreon.com/pomplamoose\n\nA cover of Assedic by Pomplamoose.\n\nMUSICIAN CREDITS\nLead Vocals: Nataly Dawn\nAccordion/Rhodes: Jack Conte\nPiano: Ross Garren\nNylon String Guitar: John Schroeder & Erik Miron\nUpright Bass: Eliana Athayde\nDrums: Ben Rose\nBackground Vocals: Sarah Dugas & Annick Brémault\nPercussion: Roland Gajate Garcia\nClarinet & Reedless Clarinet: John Tegmeyer\n\nAUDIO CREDITS\nEngineer: Tim Sonnefeld \nAssistant Engineer: Branko Presley\nMixing/Mastering: Caleb Parker\nProducer: John Schroeder\n\nVIDEO CREDITS\nDirector: George Sloan\nDP: Ricky Chavez\nCamera Operators: Merlin Showalter, Sammy Rothman, Dijon Herron, Charlene Gibbs\nArt Design: George Sloan, Susannah Honey\nVideo Editor: Athena Wheaton\n\nRecorded at The Village in Los Angeles.\n\n#Pomplamoose #FrenchJazz #LesEscrocs #Assedic\n\nLYRICS (French - English)\n\nJ'en avais marre de travailler - I was sick of working\nEt de perdre mon temps - And wasting my time\nÀ faire des boulots mal payés - Doing underpaid jobs\nAvec des gens très emmerdants - With very annoying people\nJe cherchais la combine - I was looking for a scheme\nEt c'est pas facile - And it's not an easy thing\nDe se tirer de l'usine - To get away from the factory\nPour partir dans les îles - And head for the islands\nJe me creusais le ciboulot - I was wracking my brain\nJ'étais comme tous les gens - I was like everyone\nAllergique au boulot - Allergic to work\nMais pas allergique à l'argent - But not allergic to money\nJe n'connais qu'une façon - There's only one way I know\nDe se tirer sous les tropiques - Of escaping to the tropics\nQuand on est petit, laid - When one is small, ugly\nEt qu'on a pas de fric - And has no cash\n\nASSEDIC*\nJe t'écrirai de temps en temps - I'll write to you from time to time\nToi tu m'enverras mon virement - And you'll wire my cash\nDirectement - On time\nTout là-bas, dans mon île - Way out there, on my island\nASSEDIC\nAvec ton amie RMI - With your friend RMI**\nVous s'rez mes deux meilleurs amies - You'll be my two best friends\nCe s'ra dément - It's going to be insane\n\nL'Agence Nationale Pour l'Emploi - The Agence Nationale Pour l'Emploi***\nM'écrit de France - Writes to me from France\nIls veulent à peine au bout d'un mois - It's only been a month and they're\nMe gâcher mes jolies vacances - Already messing with my lovely holiday\nEn m'envoyant chez \"Prisunic\" - They want to send me to \"Prisunic\"****\nDécharger des camions - To unload their trucks\nAvec ma copine ASSEDIC - My girl, ASSEDIC and I\nÉvidemment on a dit non - Obviously had to decline\nJ'veux qu'ça dure toute la vie - I want this to last forever\nQue chaque jour soit férié - For every day to be a holiday\nUn jour, je r'cevrai l'avis de fin de droit - Someday I'll get a benefit termination notice\nDans mon courrier - In the mail\nMais faudra me payer cher - but they'll have to pay me a fortune\nPour retourner au carnaval - To get me back into the circus\nDu R.E.R. - Of the R.E.R.*****\nEt du Leclerc de Bougival - And the Leclerc de Bougival******\n\nASSEDIC\nJe t'écrirai de temps en temps - I'll write to you from time to time\nToi tu m'enverras mon virement - And you'll wire my cash\nDirectement - On time, please\nTout là-bas, dans mon île - Way out there, on my island\nASSEDIC\nEnfin ma place au soleil - At least my place in the sun\nÀ moi les ciels vermeils - All mine these vermillion skies\nEt les beaux voyages - And the lovely trips\nM'en priver ce s'rait dommage - Doing without would be a shame\nASSEDIC\nTu s'ras ma petite maman - You’ll be my little mama \nLa maman de tous les gens - The mother of all those people\nQui n'ont pas d'argent - Who don’t have money\nEnfin pas assez, quoi… - Well, not enough anyway…\n\n*ASSEDIC is an acronym for Association pour l’emploi dans l’industrie et le commerce or the Association for Employment in Industry and Trade. It was a French agency that collected and paid unemployment insurance contributions.\n\n**RMI is an acronym for Revenu minimum d’insertion, a type of social welfare that was aimed at people without any income, who were of working age and had no other employment benefits. \n\n***L’Agence nationale pour l’emploi or National Employment Agency was the French agency tasked with providing counseling and aid to those in search of employment and training.\n\n****PRISUNIC was a large French retail chain that merged with Monoprix in 1997. Its last stores closed in 2003.\n\n*****R.E.R. is an acronym for the Réseau express régional or Regional Express Network. It is a hybrid commuter rail and rapid transit system serving Paris and its suburbs.\n\n******Leclerc or E.Leclerc officially, is a French hypermarket chain. The song refers to an E.Leclerc store located in Bougival, a small town 10 miles from the center of Paris.", "link": "https://www.youtube.com/watch?v=klIwRQ8kxvU", "date_published": "2021-03-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]