[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Diablo 4 Sound Effects and Design (Quarterly Update)", "description": "Learn more about Diablo IV's sound effects and design for the upcoming game. Get some behind the scenes looks at how the audio for the gore is created and recorded, as well as the sound design being made for the Desert Field. \n\nListen in on a shortened version of the ambient sound effects of different Diablo 4 regions including: Dry Steppes, the Scosglen Coast, Scosglen Rain, and Fractured Peaks. Additionally, get a glimpse and listen to sound effects for the Wood Wraith monster, as well as different breakable interaction sound effects with a Sorceress.\n\n#Diablo4\n\nTimestamps:\nBreakable Objects Sound Effects - 0:00\nWood Wraith Monster Audio - 1:27\nSound Development Field Recording - 2:27\nSound Development BTS Studio Foley - 4:20\nDry Steppes Ambience Audio -5:33\nFractured Peaks Ambience Audio - 7:45\nScosglen Coast Ambience Audio - 10:05\nScosglen Rain Ambience Audio - 12:07\n\nFor the full video on each of the areas with ambient music see below\nDry Steppes https://www.youtube.com/watch?v=0RDwMOxZqsY\nFractured Peaks: https://www.youtube.com/watch?v=F0G4ECzssK8\nScosglen Coast: https://www.youtube.com/watch?v=wnez77GvFpU\nScosglen Rain: https://www.youtube.com/watch?v=JRdkkd4BdYg", "link": "https://www.youtube.com/watch?v=t4uNK17DxTE", "date_published": "2021-10-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Far Cry 6 Post-Credits Scene Explained", "description": "A post-credits scene in Far Cry 6 answers some questions about the possible return of Far Cry 3 villain Vaas, while raising a few more.\n\nFor a while now, fans have speculated that Far Cry 6 would bring back fan-favorite villain Vaas, one of the antagonists of Far Cry 3. Vaas is the guy who pretty much defined what has become the archetypal Far Cry villain. He's charismatic, scary, and ruthless, and he has some long and fun bad guy monologues. Hints that Vaas was returning have circulated for more than a year, with actor Michael Mando even suggesting he'd reprise the role, and that's fueled a lot of fan theories about the villain's role in Far Cry 6. \n\nUbisoft revealed earlier this year that Vaas, as well as Far Cry 4 villain Pagan Min and Far Cry 5 villain Joseph Seed, would be playable characters in a Far Cry 6 post-launch DLC expansion. But as it turns out, there's more to the Vaas story than whatever is going on in that expansion--which seems altogether dream-like and might possibly exist outside the realm of Far Cry 6's \"real world.\"", "link": "https://www.youtube.com/watch?v=k4K_cDtUo9U", "date_published": "2021-10-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Far Cry 6 Review", "description": "Though it can be really fun, especially when it descends into absolute chaos, Far Cry 6 is overstuffed and disjointed, with so many ideas that it's tough to focus.", "link": "https://www.youtube.com/watch?v=kc1LfTizxyo", "date_published": "2021-10-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "15 Best Switch Exclusives To Play Right Now", "description": "Whether you're an existing Switch owner looking to complete your collection, or someone new to the Switch family looking for where to start, look no further: we put together a list of the 15 of the best Switch Exclusives.\n\nTIME STAMPS:\n00:00 - Intro\n00:21 - The Legend of Zelda: Breath of the Wild\n01:05 - Super Mario Odyssey\n01:50 - Fire Emblem: Three Houses\n02:26 - Luigi's Mansion 3\n03:06 - Super Smash Bros. Ultimate\n03:42 - Super Mario Maker 2\n04:10 - Paradise Killer\n04:46 - Pokémon Sword & Shield\n05:08 - Mario + Rabbids: Kingdom Battle\n05:35 - Bowser's Fury \n06:13 - Animal Crossing: New Horizons\n06:44 - Monster Hunter Rise\n07:14 - Clubhouse Games\n07:45 - Splatoon 2\n08:45 - Mario Kart 8 Deluxe", "link": "https://www.youtube.com/watch?v=ph7pJgD6HsY", "date_published": "2021-10-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 Open Beta Has Crazy Glitches - Here's Why | GameSpot News", "description": "n this episode of GameSpot News, we explain why Battlefield’s open beta is months old, why EA might rename the FIFA series and when you can expect to see Halo Infinite ranked gameplay.\n\nIn this video, DeVante talks about why the Battlefield 2042 open beta is already facing a variety of bugs and issues just a day after going live. DICE also published a list of known issues with the Battlefield 2042 open beta, some of which have already been fixed for the full game's release in November.\n\nDeVante also explains the reason EA is thinking about renaming their FIFA series of soccer games. This situation is similar, in some ways, to what's happening with EA's college football series which will return without the NCAA title. \n\nLater on, Halo Infinite’s ranked gameplay is revealed to be coming very soon and NPD credits a rise in game sales on older generations and lapsed gamers.\n \nTIME STAMPS\n00:00 - Intro\n00:16 - Battlefield Glitches\n01:08 - EA could rename FIFA series\n02:17 - Halo Infinite Ranked Gameplay Coming\n02:47 - Older Generations buying games again\n03:24 - Outro", "link": "https://www.youtube.com/watch?v=GNRklMKHgpU", "date_published": "2021-10-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]