[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "elementary OS 6.1 Jolnir - What's new?", "description": "Get your Linux desktop or laptop here: https://slimbook.es/en/\n\nEverything new in Jolnir: https://blog.elementary.io/elementary-os-6-1-available-now/\n\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nPatreon: https://www.patreon.com/thelinuxexperiment\n\nOr, you can donate whatever you want: https://paypal.me/thelinuxexp?locale.x=fr_FR\n\n🏆 FOLLOW ME ELSEWHERE:\nI also do a Gaming Podcast: https://www.youtube.com/channel/UCbRPZ11S1quJ4ESoj42A3ug\n\nJoin us on our new Discord server: https://discord.gg/xK7ukavWmQ\n\nTwitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\n📷 GEAR I USE:\nSony Alpha A6600 Mirrorless Camera: https://amzn.to/30zKyn7\nSigma 56mm Fixed Prime Lens: https://amzn.to/3aRvK5l\nLogitech MX Master 3 Mouse: https://amzn.to/3BVI0Od\nBluetooth Space Grey Mac Keyboard: https://amzn.to/3jcJETZ\nLogitech Brio 4K Webcam: https://amzn.to/3jgeTh9\nLG Curved Ultrawide Monitor: https://amzn.to/3pcTVDH\nLogitech White Speakers: https://amzn.to/3n6wSb0\nXbox Controller: https://amzn.to/3BWmIA3\n*Amazon Links are affiliate codes and generate small commissions to support the channel*\n\n\nSo, on the desktop side of things, elementary finally got a new app switcher. You know, the thing that comes up when you hit alt + tab.\n\nDialogs in elementary OS apps have also been animated, as they seem to come from above their parent window, which is now dimmed.\n\nApps can now benefit from the new file chooser portal, which has new actions, like creating a new folder, filters for file types, or the ability to open files read only.\n\nelementary OS also now has a app picker portal, which lets you... pick an app to open a file with if multiple apps are available to handle the same file type.\n\nDark mode is now a standard, which means that apps from other toolkits will be able to respect it, once they implement that new standard.\n\nFinally, the applications menu got more search results for your favorite folders or network shares.\nYou can also right click on an app and choose to launch it using the dedicated GPU.\n\nThe Sound indicator uses new device icons to better represent each output and input, and the buggy \"analog\" devices that sometimes appeared, are now removed. \n\nA middle click on the date and time indicator will now open the calendar.\n\nOther smaller changes include the ability to automatically clean up old downloads in the housekeeping tab of the settings.\n\nYou can now stash the picture in picture window outside of the screen to make room for other things, and the power indicator can now be scrolled to change the screen brightness and will show a notification to represent that.\n\nMail now groups notifications for new messages when multiple ones arrive at the same time, you can right click conversations to manage them, and conversations with unread messages now use your accent color to be more distinctive. Mail also got a new toolbar with a refresh button to manually check for new mail, and also got new filter options.\n\nThe tasks app, introduced with Odin, has a more \"secure\" shortcut to delete tasks, and prevent accidental deletion, performance has been improved a lot, and tasks can also be moved from one list to another through simple drag and drop. Epiphany, moved to version 41.\n\nFiles, the file manager got plenty of fixes on the creation of bookmarks in the sidebar, and now supports multiple drag selections by pressing control. You can also select all, deselect all, or invert selection from a right click menu.\n\nThe home page of AppCenter has been reworked, with banners for most recently released apps, and a bunch of recently updated ones directly underneath, with their short description and an install button. Category views also look a lot more user friendly, with big headers to differentiate paid and free apps, and non curated apps.\n\nApp details pages now took a page from GNOME Software's book, and display more prominently some security info, ratings, and various categories that the app belongs to.\n\nWhen installing or removing an app, a progress indicator will appear inside of the button itself, which looks cool and is more explicit for the user, and allows the app center window to work better on smaller screen sizes.\n\nThe payment dialog has been reworked to include the price you want to pay, and now shows validation checkmarks to make your payment details easier to enter. \n\nStill, all AppCenter apps are now built for ARM, so you can now download all of them on the likes of the pinebook pro or the raspberry pi 4, and maybe, in the future, on Apple Silicon Macs.", "link": "https://www.youtube.com/watch?v=LGY3-KyLVdg", "date_published": "2021-12-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]