[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "19 MORE Things You STILL Didn't Know In Zelda Breath Of The Wild", "description": "We keep on truckin' with more things you still probably don't know about Breath of the Wild! This time we dive into the history behind the damaged Master Sword, how smuggle a Sand Seal out of the Gerudo Desert, and how to camouflage yourself against pesky Guardians.\n\nIn the video above, we cover 19 facts, tips and tricks that aren’t quite as well known, ranging from secrets to glitches, some that are pretty simple and others that are fairly complex. The Legend of Zelda: Breath of the Wild has been out for four years at this point, and players have found some amazing things, intended or not, that keep the game and its sense of discovery feeling fresh.\n\n0:00 Intro\n0:15 Make Dragons Go Fast\n0:28 Smuggle Sand Seals Out Of The Desert\n1:07 Wooden Platforms Hinge\n1:23 How To Save A Falling Horse\n1:47 Damaged Master Sword\n2:35 Vah Rudania Hole\n2:42 Hinox Somersault\n3:03 How Lynels Drop Equipment\n3:19 How To Lift Slabs\n3:36 Guardian Recoil\n3:52 Where Robbie Is Looking\n4:12 Deflect Lizalfos Water Shot\n4:26 Easy Camouflage Against Guardians\n5:07 Cannonball Weirdness\n5:27 Barrel Defense\n5:43 Walk Around Slate-less\n6:06 Trial Of The Sword Room Reference\n6:45 Manta Ray Divine Beast\n7:03 Link's Retconned Father And Sister\n7:43 Outro\n\n#BOTW", "link": "https://www.youtube.com/watch?v=j5zxOlPWkZQ", "date_published": "2021-12-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Best Xbox Exclusive Games of 2021", "description": "In most other years, Microsoft-developed Xbox games are few and far between, but 2021 ended up being one of the best years we've ever seen for the platform. So, here are GameSpot's Best Xbox Exclusive Games of 2021.\n\nTimestamps:\n0:00 Intro\n0:21 Halo Infinite\n1:45 Flight Simulator\n2:55 Forza Horizon 5\n4:17 Artful Escape\n5:21 Sable", "link": "https://www.youtube.com/watch?v=iyzSkxQfSv8", "date_published": "2021-12-21 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Best PlayStation Exclusive Games of 2021", "description": "While the PS4 is still set with plenty of fantastic titles like Resident Evil: Village, the PS5 saw its fair share of amazing exclusives in 2021. So, here are GameSpot's Best PlayStation Exclusive Games of 2021, with a focus on the PlayStation 5.\n\nTimestamp\n0:00 Intro\n0:31 Ratchet and Clank: Rift Apart\n2:14 Returnal\n3:37 Deathloop\n5:17 Chicory: A Colorful Tale\n7:01 Kena: Bridge of Spirits", "link": "https://www.youtube.com/watch?v=S7orR8FQQfQ", "date_published": "2021-12-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Diablo 4 Brand New Gameplay, Combat Improvements, Lighting, Weapon Buffs and More (Quarterly Update)", "description": "The latest Diablo IV quarterly update blog has just released jam pack with new information and also some brand new gameplay and videos to watch. Check out different character abilities, combat animation differences, lighting effects, buff effects, and much more. See timestamps below for specific sections.\n\n0:00 Sorceress, Barbarian, Rogue, and Druid Abilities Gameplay\n3:17 Dynamic Player Skills\n5:22 Combat Improvements\n6:56 Blood on Characters\n8:04 Lighting Effects\n8:55 Weapon Buff Effects", "link": "https://www.youtube.com/watch?v=Ygz21oiv20A", "date_published": "2021-12-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The History Of Five Nights At Freddy's", "description": "Love it or loathe it, there’s no denying that Five Nights at Freddy’s, or FNaF, is a global sensation.  But how did this horror game about creepy animatronic animals get so many sequels, books, fan theories, and even a movie? This is the History of Five Nights At Freddy’s.\n\nTimestamps:\n0:00 - Introduction\n0:25 - Chipper and Sons Lumber Co\n1:25 -  Five Nights at Freddy's (2014)\n3:50 -  Five Nights at Freddy's 2 (2014)\n5:55 -  Five Nights at Freddy's 3 (2015)\n7:58 -  Five Nights at Freddy's 4 (2015)\n9:30 -  Five Nights at Freddy's: Sister Location (2016)\n10:19 -  Freddy Fazbear's Pizzeria Simulator (2017)\n10:48 -  Five Nights at Freddy's: Help Wanted (2019)\n11:52 -  Five Nights at Freddy's: Security Breach (2021)\n\nFive Nights at Freddy's started life as a terrifying indie game made by a one-man development team and exploded in popularity when its jumpscares and creepy animatronics became perfect YouTube let's play fodder. Over time, FNaF has become a colossal franchise, with multiple sequels, spin-offs, books, and even a movie. \n\nIn the above video, we chronicle the history of the mainline FNaF games, starting with Chipper & Sons Lumber Co, an indie game that got ripped apart by critics but eventually led to creator Scott Cawthon making something even scarier.  Cawthon's new project was Five Nights at Freddy's, a relatively straightforward horror game where you play as a nighttime security guard at a Freddy Fazbear's Pizzeria, a family-friendly pizza spot haunted by broken and dangerous animatronics. Thanks to its cheap price point, dark lore, and scares, it skyrocketed in popularity, and Cawthon released many sequels in quick succession. This is the story of the entire franchise, from inception to what it is today.\n\nThe latest entry, Five Nights at Freddy's: Security Breach launched for PlayStation 4, PlayStation 5, and PC. For more, be sure to subscribe at youtube.com/gamespot.", "link": "https://www.youtube.com/watch?v=PmPhBfovNYg", "date_published": "2021-12-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Why Cyberpunk 2077 Has No Police Chases | GameSpot News", "description": "In this episode of GameSpot News, we talk about why Cyberpunk 2077 has no police chases, a working metro system added to 2077 via mods, how the Xbox is affecting the Halo tournament as well as the next Mass Effect allegedly running on Unreal Engine 5. \n\nIn this video, DeVante talks about Cyberpunk 2077’s quest director revealing why the game is missing a police chase system outside of scripted sequences. Cyberpunk also gets a new mod that adds a working metro system. This mod by KeanuWheeze features 19 working stations and full integration with the game’s UI and controls and players can switch between first and third person views. \n\nDeVante also talks about the Xbox shortage’s affect on the Halo Infinite tournament. According to 343’s eSports lead, Tashi, revealed some competitors were using \"development\" consoles due to the ongoing semiconductor shortages.\n\nLater in the video, It appears the next Mass Effect game will, as rumored, run on Epic's Unreal Engine. BioWare producer Brenon Holmes recently tweeted about an open position at the company for associate technical director, and the ideal candidate will have experience with Unreal Engine 4 and 5.", "link": "https://www.youtube.com/watch?v=em512Qjwimg", "date_published": "2021-12-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]