[{"source": "https://lukesmith.xyz/rss.xml", "title": "Academic", "description": "<figure class=\"resright\"><img src=\"https://lukesmith.xyz/pix/med_arts.jpg\" title=\"Back when universities were good...\" /></figure>\n\n<h2 id=\"table-of-contents\">Table of Contents</h2>\n<ul>\n<li><a href=\"https://lukesmith.xyz/rss.xml#papers\">Papers and Memories...</a></li>\n<li><a href=\"https://lukesmith.xyz/rss.xml#pie\">The Indo-European Tapes</a></li>\n<li><a href=\"https://lukesmith.xyz/rss.xml#videos\">Video Talks</a></li>\n<li><a href=\"https://lukesmith.xyz/rss.xml#audio\">Audio Talks</a></li>\n<li><a href=\"https://lukesmith.xyz/rss.xml#slides\">Other Presentations</a></li>\n</ul>\n<h2 id=\"papers\">Papers and Memories...</h2>\n<p>Here are some old academic papers that I mostly wrote as term papers and\nsuch in graduate school. People occasionally ask out of interest.</p>\n<p>By the time I got a year or so into my Ph.D. at Arizona, I had pretty\nmuch not intention on continuing in the charade of academia, therefore,\nthey are usually out of the mold of normalcy for the field since most of\nthese papers I had no intention of ever &quot;publishing&quot; in &quot;academic\njournals.&quot;</p>\n<dl>\n<dt><a href=\"https://lukesmith.xyz/dox/luke_thesis.pdf\">Master's Thesis on External Possession</a> (April 2015)</dt>\n<dd>\n<p>Not actually that interesting, at least I don't think.</p>\n</dd>\n<dt><a href=\"https://lukesmith.xyz/dox/luke_countercyclic.pdf\">Syntax doesn't exist</a> (May 2016)</dt>\n<dd>\n<p>I wrote this back for that old throwaway seminar class that Tom,\nMassimo and Chomsky put on (this was actually before Chomsky\nofficially relocated to Arizona). Most of the students in the class\nwere just undergraduate communists who didn't know anything about\nlinguistics and just wanted to be around Chomsky and therfore had to\nsurvive abject confusion and suffering. The class was really fun and\nI just talked to cute girls or us graduate students just goofed off.\nThis was actually when I decided to get my first ThinkPad.</p>\n<p>...Oh yeah the paper. It actually was the first inklings of &quot;my\nidea&quot; written in this highly disorganized paper in less than a day.\nThe idea is that alternations in languages that seem strange all\noccur because they are attempts to try to optimize between\nphonological and semantic constraints. Syntax is not an autonomous\nengine with idiosyncratic constraints, but just a shorthand we use\nto talk about these strange things that happen to make phonological\nstructure acceptable to semantic structure or <em>vice versa</em>. I argue\nthat extraposition, the EPP and some other things all are\nphonological repairs and we don't have to posit some extra\nconstraints in the language faculty to model them <em>ad hoc</em>.</p>\n</dd>\n<dt><a href=\"https://lukesmith.xyz/dox/papers/scopemarking.pdf\">Scope marking... yep, it's prosodic too.</a> (May 2017)</dt>\n<dd>\n<p>A very short paper I wrote for one of Mike Hammond's classes. Not\neven sure it gets the point across, but I really like this idea.\nLanguages like German can have residual wh- words in places through\nwhich they have been raised: <em>scope markers</em>. I noticed a\nformal similarity with noun phase stressing in a cited Kimper\narticle. I argue that German scope marking is actually the same\npheonomenon, based on that interesting idea that Richards had about\nphonology driving wh- movement.</p>\n</dd>\n<dt><a href=\"https://lukesmith.xyz/dox/papers/prelim1.pdf\">Prosodically-driven word order</a> (September 2017)</dt>\n<dd>\n<p>I argue that syntactic word order is just an epiphenomenon of\nprosodic, rather than &quot;syntactic&quot; parameters. Ultimately, all\nlanguages simply place subjects, objects and verbs where they will\nrecieve the appropriate stress level, and where this is ties in with\nindependent prosodic rules of each language. I use Optimality Theory\nto model this as some cruel joke and because this was a qualifying\npaper and I had to do something conventional. I don't really take\nit seriously as a scientific tool.</p>\n</dd>\n<dt><a href=\"https://lukesmith.xyz/dox/papers/pie_wordorder.pdf\">Indo-European Particles and Word Order</a> (November 2017)</dt>\n<dd>\n<p>The most boring class I ever, ever took in my 20 years of schooling\nfrom kindergarten to Ph.D. was Heidi Harley's head-movement\nseminar. Just thinking about that room lowers my testosterone.\nActually, I need to go lift right now...</p>\n<p>Thankfully, the only thing we had to do for that seminar was write a\npaper. (We may've had to present articles a couple days, but I must\nhave suppressed that level of boredom.) Obviously I was not going to\nwrite something about head-movement (which is some silly\ntheory-internal idea of Generative Grammar), so I wrote the paper on\nIndo-European particles and how they affected a change in word order\nover time from SOV to SVO. This was obviously not the kind of paper\nexpected and I wrote it dismissively, but the argument of it is\nsolid and interesting.</p>\n</dd>\n<dt><a href=\"https://lukesmith.xyz/dox/papers/reason.pdf\">A Critique of &quot;Reason&quot;</a> (December 2017)</dt>\n<dd>\n<p><em>Finally</em>, not a stupid linguistics paper. On my issues with the\nKahneman and Tversy's &quot;heuristics and biases&quot; program, with\nvarious support from Gigerenzer and Taleb. I wrote this for a class\nof Massimo Piatelli-Palmarini's I took which if I remember right\nwas technically an economics/neuroscience class. Massimo is a big\nfan of Kahneman and Tversky, but I've always found their work basic\nand predicated on clumsy hyper-rationalism which ends up not being\nrational at all. I explain in the paper: <strong>Actually read it.</strong></p>\n</dd>\n<dt><a href=\"https://lukesmith.xyz/dox/papers/prelim2.pdf\">Game Theory determines quanitifer scope interpretation</a> (April 2018)</dt>\n<dd>\n<p>I argue that Chomskyan syntax is not equipped to properly deal with\nquantifier scope interpretations. I present a framework that assumes\nthat speakers use and assume their languages' constructions to\ncommunicate scope given certain universal constraints assuming the\npriority of surface scope and economy principles. Nearly all normal\nand abnormal scope judgments fall out for free from this method,\nwhich is analyzed with Game Theory. At the end: flexible syntax\n(across either a whole language or a specific construction) ends up\nentailing universal surface scope, while syntactic rigidity causes\nscope ambiguity. BTW, <strong>look at those cute little LaTeX charts...</strong></p>\n</dd>\n<dt><a href=\"https://lukesmith.xyz/dox/papers/neuralnets_shivasutras.pdf\">The Shivasutras and Neural Nets</a> (April 2018)</dt>\n<dd>\n<p>This is actually probably a ditsy paper, but it was my last paper I\nwrote in graduate school and for a class I never actually went to. I\ndon't really remember what it was even a class on. I think Mike\nHammond was the professor? Maybe Robert Henderson? That's how much\nI paid attention my last semester, and I wrote this paper as a larp.</p>\n<p>I had been reading classical Indian/Vedic grammars and the Paninian\nstuff. We had been talking about the &quot;interpretability&quot; (or\nlack-thereof) of Neural Nets so I wrote a little piece on the\nShivasutras, which order the phonemes of Sanskrit in a unique order\nto be able to refer to them in Paninian grammars with the greatest\neconomy. I make the statement that these classes of phonemes are\nanalogous to the intermediate nodes of a neural net, which often\nappear to have no real-life relevance, but one often appears at an\nextra level of abstraction. For example, it becomes very easy to\nmodel the Indo-European ablaut system via the Shivasutras since\ndifferent lines show the different grades. Sanskrit grammarians of\ncourse had no direct knowledge of Proto-Indo-European but in the\ninterest of formal economy, end up discovering aspects of its\ngrammar.</p>\n</dd>\n</dl>\n<h2 id=\"pie\">The Indo-European Tapes</h2>\n<p>Since I had a background in classical languages and Indo-European\nstudies, a couple of my friends wanted to put together a little reading\ngroup to learn about Indo-European stuff. We covered all the basics of\nIndo-European grammar and reconstruction and basic lore, although we\nfizzled out after only a couple weeks.</p>\n<p>For my personal records, I actually recorded these meetings on my phone\n(it was actually mostly me lecturing and all of us making jokes). The\naudio recordings are extremely messy, with every bump on the table\naudible, but they are listenable if you care about the topic.</p>\n<p>I also made some handouts which have also survived. I'm uploading these\nin ogg because it's a superior format. If you're an Apple/Mac user,\nsuck it up and get a real audio player.</p>\n<ol>\n<li><a href=\"https://lukesmith.xyz/dox/pie/pie_1.ogg\">Week 1 Audio</a>: Basics and Phonology\n(<a href=\"https://lukesmith.xyz/dox/pie/pie_1.pdf\">handout</a>)</li>\n<li><a href=\"https://lukesmith.xyz/dox/pie/pie_2.ogg\">Week 2 Audio</a>: Ablaut, Morphology and\nIndo-Hittite (<a href=\"https://lukesmith.xyz/dox/pie/pie_2.pdf\">handout</a>)</li>\n<li><a href=\"https://lukesmith.xyz/dox/pie/pie_3.ogg\">Week 3 Audio</a>: Divergence and Syntax\n(<a href=\"https://lukesmith.xyz/dox/pie/pie_3.pdf\">handout</a>,\n<a href=\"https://lukesmith.xyz/dox/pie/pie_3_examples.pdf\">examples</a>)</li>\n<li><a href=\"https://lukesmith.xyz/dox/pie/pie_4.ogg\">Week 4 Audio</a>: Paleohistory and Migration\n(<a href=\"https://lukesmith.xyz/dox/pie/pie_4.pdf\">handout</a>)</li>\n<li><a href=\"https://lukesmith.xyz/dox/pie/pie_5.ogg\">Week 5 Audio</a>: Greek, individual languages\n(<a href=\"https://lukesmith.xyz/dox/pie/pie_greek.pdf\">handout on Greek</a>)</li>\n<li>We got lazy after this and the group ended! Good while it lasted. I had prepared <a href=\"https://lukesmith.xyz/dox/pie/piewords.pdf\">this handout</a> for the sixth week which never happened.</li>\n</ol>\n<p><strong>If someone is good at cleaning up audio, I would be very grateful if\nyou could do a number on these; email me and I can provide the lossless\noriginals for that.</strong></p>\n<p>(Note also that these tapes were recorded back when I cursed, so you can\nget a snippet of me still saying naughty words.)</p>\n<h2 id=\"videos\">Video Talks</h2>\n<p>The embedded videos here are from PeerTube. These are all on YouTube if\nyou prefer (to see all the extra comments or whatever).</p>\n<h3 id=\"biolinguistic-clarity-in-generative-syntax-2015\">Biolinguistic Clarity in Generative Syntax (2015)</h3>\n<details>\n    Click to reveal video.\n\n\n</details>\n\n<p>Shortly after I finished by M.A. at the University of Georgia, I ended\nup returning to help with a conference they had started recently. Some\nguy canceled at the last minute the day before, so I volunteered to\ninvent a talk in 24 hours. It was more of a comedy routine, but here it\nis. I consider the actual ideas behind this talk underdeveloped and\ntotally superseded by the ideas I illustrate above in those paper on\nsyntax and phonology, but this is a good idea of the kinds of things I\nwas thinking around 2015.</p>\n<h3 id=\"language-as-synesthesia-2017\">Language as Synesthesia (2017)</h3>\n<details>\n    Click to reveal video.\n\n\n</details>\n\n<p><a href=\"https://lukesmith.xyz/dox/talks/synesthesia.pdf\">slides</a></p>\n<p>Tom Bever had a cognitive science seminar for graduate students and this\nwas my presentation for it. Most of the other grad students were in\ncogsci or philosophy, nonetheless, I did a pretty linguistics-heavy\ntalk.</p>\n<h3 id=\"linguistics-isnt-60-years-old-2018\">&quot;Linguistics Isn't 60 Years Old!&quot; (2018)</h3>\n<details>\n    Click to reveal video.\n\n\n</details>\n\n<p><a href=\"https://lukesmith.xyz/dox/talks/panini_sanskrit.pdf\">slides</a></p>\n<p>My last semester at Arizona, Simin invited me to present a day in one of\nher grad classes on the history of linguistic thought (she actually\ninvited me to present a lot because she knew I liked teaching or just\ntalking about these issues, while she is totally burned out on it (I\nactually was her assigned assistant for an undergraduate syntax class,\nand I ended up teaching about a third of the days just because I wanted\nto and she liked taking vacation)). Anyway, as we all know, I mostly\nlike old books and old stuff that no one seems to know anymore, so I\ntalk about Paninian/Sanskrit grammar in Classical India.</p>\n<p>As we talk about at the end, originally we planned to make this a series\n(I even thought of making it a goodbye tour), but that never happened.\nNo one will ever know my hot takes on medieval European grammar.</p>\n<h2 id=\"audio\">Audio Talks</h2>\n<ul>\n<li><a href=\"https://www.youtube.com/watch?v=8SPD35ETwuk\">&quot;Chomsky Joins Us in\nHell&quot;</a> (YouTube video)\n&ndash; Me and my roomate talk about when Chomsky relocated to our\ndepartment from MIT. This was <em>originally</em> going to be a series\nuntil Heidi Harley bullicided Ryan from talking more lol.</li>\n<li><a href=\"https://lukesmith.xyz/dox/audio/quantifier_scope.ogg\">Quantifier Scope is Just All Fun and\nGames</a> &ndash; I gave a teaser\npresentation for prospective students on my quantifier scope project\nmentioned above. It's also on\n<a href=\"https://videos.lukesmith.xyz/videos/watch/7e63b20d-33c2-463c-a44f-973a040c9d10\">PeerTube</a>\nand <a href=\"https://www.youtube.com/watch?v=5w_PMpQiGL0\">YouTube</a>, but no\nvideo.</li>\n<li><a href=\"https://lukesmith.xyz/dox/audio/neuroscience_decision_making.ogg\">Neuroscience and decision-making graduate seminar\npresentation</a> &ndash; Begins\naround 1:20. Sort of bad quality audio at the beginning.</li>\n</ul>\n<h2 id=\"slides\">Other presentations</h2>\n<p>I have some slides and stuff from other presentations, and I might\nupload them here when I get the chance.</p>\n<ul>\n<li><a href=\"https://lukesmith.xyz/dox/talks/uga_colloquium.pdf\">UGA colloquium</a> &ndash; a very old talk\nfrom my Master's program. Was more of a comedy routine, but you can\nlook at it and only guess what my hilarious jokes were.</li>\n<li>For the Quantifier Scope with Game Theory project I have a couple\npresentation slides: <a href=\"https://lukesmith.xyz/dox/talks/luke_synsalon.pdf\">Synsalon\npresentation</a> and <a href=\"https://lukesmith.xyz/dox/talks/adamandy.pdf\">another\none</a>.</li>\n<li><a href=\"https://lukesmith.xyz/dox/talks/greek_alphabet.pdf\">The Greek Alphabet</a> &ndash; presentation I\ndid in my friend Shannon's class once.</li>\n<li>Handouts I made the syntax class I did with Simin Karimi: <a href=\"https://lukesmith.xyz/dox/talks/headmovement.pdf\">Head\nMovement</a> (sort of modeled off a lecture\nAndrew Carnie would give) and on page <a href=\"https://lukesmith.xyz/dox/talks/guide_generative_syntax.pdf\">A Guide to Generative\nSyntax</a>.</li>\n<li>Also <a href=\"https://lukesmith.xyz/dox/talks/constituency.pdf\">a presentation on constituency</a> I\ndid in that class.</li>\n</ul>\n<h1 id=\"dont-go-to-college\">Don't go to college!</h1>\n<p>Just in case anyone sees this page and thinks, &quot;Oh wow, look at all the\ncool things Luke was doing in graduate school! I should go too!&quot; <strong>Do\nnot do that.</strong> I want to make it clear that if any genuinely intelligent\nand curious person whose goal is inquiry without reservation, you will\nfind nothing but frustration and suffering in contemporary academia.\nParticularly Arizona was very cultlike, stifling and uncomfortable. I\nstayed alive by being blasé and jocular about things, as you may be able\nto tell in some of those recordings, but I want to make it clear that I\nregret going into a Ph.D. program and I consider it the third biggest\nmistake of my life. I will never get those years back, and I sorrowfully\nregret it.</p>", "link": "https://lukesmith.xyz/articles/academic/", "date_published": "2021-01-11 00:00:00+00:00", "persistent": false, "user": null, "language": null}]