[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call Of Duty’s Top 9 Special Weapons", "description": "From the Ballistic Knife to the Crossbow, let's take a look back at Call of Duty's Special Weapons class.\n\nCall of Duty's Special weapons class has always helped mix up a weapon roster. In this video, Richie goes over the top nine weapons that earned the \"special\" moniker. Everything from Riot Shields to the legendary Crossbow, this list will be familiar to those who have played any Call of Duty game from 2010 onwards. \n\nOver the years, the special class of weapons usually  refers to equipment like ballistic knives and specialty rocket launchers. While this list has both, there are also strange weapons like Black Ops III's DIY 11 Renovator, which is a tactical nail gun. Launched along the D13 Sector handsaw, the category of weapons has sure take some silly turns. Others are more well known such as the Death Machine mini gun and the War Machine chain gun. While these are fun to use and memorable, our number 1 pick is the iconic Crossbow. \n\nFor more info about this sort of specialty weapon, be sure to check out our video where arms expert John Ferguson discusses them and their impact in weapons history. We've also got more top 10 videos in our Call of Duty playlist. Thanks for watching!  \n\n00:18 - M2 Flamethrower\n00:57 - D13 Sector + DIY 11 Renovator\n01:41 - Valkyrie Rockets\n02:16 - Riot/Assault Shield \n03:12 - Minigun\n03:58 - War Machine\n04:34 - Grim Reaper\n05:32 - Ballistic Knife\n06:18 - Venom X\n06:50 - Crossbow", "link": "https://www.youtube.com/watch?v=NSMSauDH4lU", "date_published": "2021-01-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "10 Highest Rated PS4 Exclusives Of All Time", "description": "You may have some more time on your hands to get through that PlayStation pile of shame. Here’s a rundown of the 10 best-rated games for PS4, as gathered by review aggregator, Metacritic.com.\n\nAs more fantastic games are being released, it only means that our piles of shame grow larger and larger. With 2021 looking to keep us all indoors as much as possible, that might mean you have a little extra time on your hands to finally start tackling some games you’ve always meant to play but never had the time to. But where to start?\n\nWell, we’re here to help. We’ve gathered ten of the best PlayStation 4 games that you really should have played by now. They’re ranked by review aggregator Metacritic.com. We’ve only listed games that are PlayStation 4 console exclusives, though remakes of older games and games that eventually ended up on PC are also allowed. You can bet that you’ll see fantastic games from Sony’s lineup of first-party studios, including Naughty Dog and Sony Santa Monica. But which games? You’ll have to watch and find out. \n\nSorry, Xbox gamers, but if you’d like to see an Xbox version of this list, make sure to let us know by dropping a comment, like, or sub to the channel.\n\nTags: best ps4 games, best playstation games, best games for ps4, rez infinite, astro bot, astro bot vr, shadow of the colossus, bluepoint games, bloodborne, journey, uncharted 4, naughty dog, last of us, last of us 2, persona 5, persona 5 royal, god of war, god of war 2018\n\n00:31 - Rez Infinite\n01:03 - Astro Bot Rescue Mission\n01:33 - Shadow of the Colossus \n02:31 - Bloodborne \n03:18 - Journey \n03:55 - Uncharted 4\n04:31 - The Last of Us Part II\n05:02 - God Of War \n05:45 - The Last of Us Remastered\n06:27 - Persona 5 Royal", "link": "https://www.youtube.com/watch?v=cro7kLyIySc", "date_published": "2021-01-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]