[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "20 Best PS5 And PS4 First-Person Shooters To Play", "description": "Here are our picks for the 20 best Playstation shooters. \n\nThe best PlayStation shooters come in all shapes and sizes. No matter what kind of FPS player you are, the best PS4 and PS5 shooters have something to keep you entertained by yourself or with friends. All of our picks are arranged in alphabetical order and playable on both PS4 and PS5.  \n\nTimestamps\n0:00 Introduction\n0:24 Apex Legends\n0:47 Battlefield 1\n01:13 Bioshock: The Collection\n02:31 Borderlands 3\n03:01 Call of Duty Modern Warfare Remastered\n03:31 Call of Duty: Warzone\n03:54 Destiny 2\n04:25 Doom (2016)\n05:00 Doom Eternal\n05:45 Fallout 4\n06:26 Far Cry 5\n07:01 Metro Exodus\n07:28 Overwatch\n07:56 Prey\n08:31 Rage 2\n08:54 Rainbow Six Siege\n09:24 Superhot\n09:52 Titanfall 2\n10:20 Wolfenstein: The New Order\n10:52 Wolfenstein II: The New Colossus\n\n#ps5 #ps4", "link": "https://www.youtube.com/watch?v=pHshNUc-cuo", "date_published": "2021-09-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Deathloop: 9 Things To Know Before You Play", "description": "At a glance, Deathloop, Arkane's newest game, might seem like its past work on Dishonored and Prey, but Deathloop also introduces new wrinkles to familiar roguelite and first-person shooter elements that might initially be challenging to wrap your head around. Here are the 9 tips we wish we knew before diving into the Groundhog Days of Blackreef.\n\nAt a glance, Deathloop, the newest game from Dishonored and Prey developer Arkane, might seem like its past work on Dishonored and Prey. You get an array of varied weapons, a handful of creative powers, and the ability to use them in experimentative and inventive ways to progress. And that's true, but Deathloop also introduces new wrinkles to familiar roguelite and first-person shooter elements that might initially be challenging to wrap your head around. Fret not, though, as we've collected some of the lessons we wish we knew before diving into the Groundhog Days of Blackreef.\n\n#deathloop", "link": "https://www.youtube.com/watch?v=mHmgqj_QFXw", "date_published": "2021-09-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "God of War: Ragnarok - Everything We Know", "description": "Several God of War: Ragnarok details were revealed at Sony's PlayStation showcase. Check out our breakdown of everything we know so far for the highly anticipated sequel. This includes info on characters, new worlds, combat, and where the story picks up following the events of the prequel.\n\nLink to Audio Logs Episode with Cory Barlog: https://www.youtube.com/watch?v=e4XRmMkQcuQ \n\nSony's PlayStation showcase got us up to speed on God of War: Ragnarok. Viewers were treated to gameplay and more following the original 30-second teaser from nearly a year ago. The showcase brought us details with the story, introduced new characters, and showed us new worlds along the way.\n\nTaking place shortly after the events of the first, the trailer reveals that Ragnarok (the Norse mythological end of the world) is indeed coming. On their quest to prevent it, Kratos and Atreyus return to find Odin. While the trailer didn't feature the all-father this time, we did get a quick look at Thor. (played by Sons of Anarchy's Ryan Hurst) \n\nThe presentation ended with a developer interview where new director Eric Williams discussed how Santa Monica Studio likes to change directors when they can for a fresh take on the creative process. With the exception of previous director Cory Barlog-who directed God of War from 2018 as well as God of War 2 from 2007. God of War Ragnarok is slated to release in 2022.  \n\nTimestamps:\n00:00 - Intro\n00:20 - The Story So Far\n03:27 - Combat\n04:17 - The World\n04:52 - Voice Cast\n05:09 - Music\n05:27 - New Director\n06:12 - Platforms\n\n#godofwar #ragnarok", "link": "https://www.youtube.com/watch?v=7swc1R0aIrY", "date_published": "2021-09-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Deathloop Early Gameplay Livestream", "description": "Join Lucy and Tamoor as they stream the opening hours of Arkane Lyon's latest, Deathloop.\n\n#deathloop", "link": "https://www.youtube.com/watch?v=4gSEAXUZnAg", "date_published": "2021-09-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Deathloop Review", "description": "Arkane Lyon's follow-up to Dishonored is a masterclass in open-ended action game design. It's a game where observation and dynamic thinking go hand-in-hand with shotgunning goons in the face and snapping their necks; where throwing a grenade into a soiree for sycophants counts as the right kind of experimentation and derring-do. It delivers bombastic thrills and wince-inducing kills with intelligence and elegance in equal measure.\n\n#deathloop", "link": "https://www.youtube.com/watch?v=7_wHbSmEaTE", "date_published": "2021-09-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Diablo 2 Resurrected Cinematic Trailer", "description": "We get more Diablo II Resurrected Cinematic cutscenes in this latest trailer. This time we some of Act 3, 4, and 5. Watch the transformation of the stranger into Diablo!\n\n#diablo2", "link": "https://www.youtube.com/watch?v=dT-Nsl7NfOw", "date_published": "2021-09-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Fortnite Season 8 Chapter 2 Battle Pass Trailer", "description": "Get a glimpse of Fortnite's new battle pass trailer for Season 8 of Chapter 2. Kevin the Cube is back and much much more. Looks like Marvel's Carnage is going to join the fray too. Fight your way through what looks like hordes of enemies in the Fortnite Cubed.\n\n#fortnite #cubed #fortniteseason8", "link": "https://www.youtube.com/watch?v=f1VF0GmIV2g", "date_published": "2021-09-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Fortnite Season 8 Chapter 2 Story Trailer", "description": "Fornite's Cubed season has arrived bringing with it some strange things. Check out the new story trailer to get a glimpse of whats to come in the upcoming season. Kevin the Cube has returned! \n\n#fortnite #cubed #forniteseason8", "link": "https://www.youtube.com/watch?v=Xapcdz_rwes", "date_published": "2021-09-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New Marvel’s Wolverine Details Revealed | GameSpot News", "description": "The length of Marvel’s Wolverine is revealed by the game’s creative director. An Xbox user finds an alternative to Seagate’s expansion card. And Volition opens up about deep customization in the new Saints Row.\n\nIn this video, DeVante talks about Marvel’s Wolverine and it’s size compared to Spider Man: Miles Morales. Jake from State Farm going viral and the 18th birthday of Valve’s Steam. \n\nLater on DeVante explains one Xbox users alternative expanded storage solution as well as customization in the reboot for Saints Row.\n\n#marvel #wolverine", "link": "https://www.youtube.com/watch?v=1HQaw7Y8f5E", "date_published": "2021-09-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]