[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Circuit des Yeux: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nLars Gotrich | October 25, 2021\nHaley Fohr's voice is built for cathedrals, but we'll take a funeral chapel. In Circuit des Yeux's Tiny Desk (home) concert — recorded amid the sepia-toned stained glass of the historic May Chapel at the Rosehill Cemetery and Mausoleum — Fohr's operatic, four-octave vibrato contains a wondrous terror, but also an illumination of being.\n\nThis unique setting is not merely a venue for the Chicago experimental music scene that Fohr calls home, but also a reflection of Circuit des Yeux's latest album, -io. In it, Fohr explores how grief not only shapes people but transforms them — that death (of self, of a loved one, of an idea) is not a finality, but an opening. On \"Vanishing,\" she brandishes a 12-string acoustic guitar distorted to disastrous peaks, matched only by blown-out drum fills and a string trio searing Fohr's ecstatic arrangements into sublime chaos. \"Dogma\" follows with a spaghetti-western riff, like an existential biker gang grooving to chirping synths and Fohr's deep howl: \"Tell me how to feel real / Talk talk talk talk talk talk about what's real.\"\n\nMuch of -io was written on the organ and piano, instruments that allowed Fohr to expand her sonic universe. This set closes on the balcony's organ with \"Stranger,\" a song ultimately about empathy, and accompanied only by Andrew Scott Young, who bows an upright bass behind the pews. At the climax, Fohr's voice rips across the vaulted ceiling as if to split the chapel in half, and we're left in the wailing's wake.\n\nSET LIST\n\"Vanishing\"\n\"Dogma\"\n\"Stranger\"\n\nMUSICIANS\nHaley Fohr: vocals, guitar, bass, organ\nWhitney Johnson: viola\nAndrew Scott Young: bass, guitar\nAshley Guerrero: drums\nBillie Howard: violin\nOli Harris: cello\n\nCREDITS\nVideo Rudy Rubio, Marisa Gesualdi\nAudio: Cooper Crain, Cooper Crain Recording\nDirector of Photography: Rudy Rubio\nEditor: Marisa Gesualdi\nAssistant: Margaret McCarthy\nGaffer: Mike Weldon\n\nTINY DESK TEAM\nProducer: Lars Gotrich\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Bobby Carter, Kara Frame, Sofie Hernandez-Simeonidis\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #circuitdesyeux", "link": "https://www.youtube.com/watch?v=WEkXiSfnZpE", "date_published": "2021-10-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Karrie Martin Lachney + Jason Genao: Una Conversación Con Alt.Latino", "description": "In collaboration with Netflix's Con Todo and as part of our Hispanic Heritage Month programming, Alt.Latino host Felix Contreras interviewed On My Block actor Jason Genao and Gentefied actor Karrie Martin Lachney. The two actos discussed representation on the small screen and artists paving a way for a nuevo generación.\n\n#eltiny #gentefied #onmyblock", "link": "https://www.youtube.com/watch?v=_4HBmNI0IPo", "date_published": "2021-10-24 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]