[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "The Designated Terrorist and the Fight Over the Future of Syria | The Jihadist | FRONTLINE", "description": "Abu Mohammad al-Jolani, a former leader of an Al Qaeda affiliate in Syria, is one of the most wanted men in the world. The U.S. designated him a terrorist in 2013, with a $10 million reward for information leading to his capture.\n\nJolani is also the leader of the dominant force in Syria’s Idlib province, which after more than 10 years of conflict is the last remaining opposition stronghold to President Bashar al-Assad’s regime — and which is home to more than 3 million Syrian civilians, many of them displaced from other parts of the country.\n\nNow, Jolani says he and his current Islamist group are seeking a new relationship with the West. But can he be trusted?\n\nIn the FRONTLINE documentary \"The Jihadist,\" veteran FRONTLINE correspondent Martin Smith travels to Idlib to investigate Jolani's rebranding efforts, becoming the first American journalist to interview Jolani. Smith also tracked down and interviewed his critics and victims. \n\nWatch a clip from the documentary above.\n\nWatch \"The Jihadist\" in full starting June 1: https://to.pbs.org/3i8Ja1O\n\nThe documentary is produced, written and directed by Martin Smith and Marcela Gaviria, with Smith as correspondent, and co-produced by Brian Funck and Scott Anger. \n\nLove FRONTLINE? Find us on the PBS Video App, where there are more than 300 FRONTLINE documentaries available for you to watch any time: https://to.pbs.org/FLVideoApp \n\nSubscribe on YouTube: http://bit.ly/1BycsJW \nInstagram: https://www.instagram.com/frontlinepbs \nTwitter: https://twitter.com/frontlinepbs \nFacebook: https://www.facebook.com/frontline \n\nFunding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Major funding for FRONTLINE is provided by the Ford Foundation. Additional funding is provided by the Abrams Foundation; the John D. and Catherine T. MacArthur Foundation; Park Foundation; and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation, and additional support from Koo and Patricia Yuen.", "link": "https://www.youtube.com/watch?v=0-vbHHl8RpY", "date_published": "2021-06-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]