[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Kirk Franklin: Tiny Desk (Home) Concert", "description": "NPR Music's Tiny Desk series will celebrate Black History Month by featuring four weeks of Tiny Desk (home) concerts and playlists by Black artists spanning different genres and generations each week. The lineup includes both emerging and established artists who will be performing a Tiny Desk concert for the first time. This celebration highlights the beautiful cornucopia of Black music and our special way of presenting it. We hope you enjoy.\n\nBobby Carter | February 25, 2021\nKirk Franklin, set up with his band and choir in a corner of Uncle Jessie's Kitchen, makes a declaration. \"I know you're at home right now, in your draws, listening to some Jesus music. It's ok. Jesus loves you in your draws!\" The Arlington, Texas studio, named after a long time close friend, features a large photo of the iconic \"I AM A MAN\" protest signs from the 1968 Memphis Sanitation Strike on the wall. The jubilant energy that Franklin and company emit, juxtaposed with a visual reminder of the strife that Black people have endured is illustrative of the importance of gospel music in the Black community.\n\nFor nearly 30 years, Franklin has been widely regarded for revolutionizing gospel. He incorporated secular music, particularly hip-hop, while preserving the message and integrity of traditional gospel. Here, he and his powerhouse choir pace through a decades-long, sixteen Grammy award winning discography of faith, praise and encouragement while cracking plenty of jokes. I cannot recall a more moving Tiny Desk home performance.\n\nAll month long, we've presented artists that speak to the diversity and complexity of Black music--where we've been, where we are and where we're going. For the final show, we take it back to the spiritual roots and there's no one more fitting to cap things off than Mr. Kirk Franklin.\n\nSET LIST\nLove Theory \nSilver and Gold\nMelodies From Heaven \nI Smile\n\nMUSICIANS\nKirk Franklin: vocals, keys\nMelodie Pace: vocals\nDarian Elliot: vocals\nMichael Bethany: vocals\nEboni Ellerson: vocals\nDeon Yancey: vocals\nTia Rudd: vocals\nShaun Martin: keyboard\nMatthew Ramsey: bass\nTerry Baker: drums, percussion\n\nCREDITS\nVideo: Clear Scope Media\nAudio: Michael Havens Reese Brooks\n\nTINY DESK TEAM\nProducers: Bobby Carter\nVideo Producer: Morgan Noelle Smith\nAudio Mastering: Josh Rogosin\nArt Director: CJ Riculan\nTiny Production Team: Bob Boilen, Kara Frame, Maia Stern\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #kirkfranklin #gospel #tinydesk", "link": "https://www.youtube.com/watch?v=wRwId2RfmfA", "date_published": "2021-02-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]