[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Biggest Upcoming PC Games For 2022 and Beyond", "description": "As we come to the end of another year, let's look ahead to 2022 (and beyond) with our list of 33 of the most anticipated PC titles.\n\nTimestamps:\n00:25 - Suicide Squad: Kill the Justice League\n00:57 - Ghostwire: Tokyo\n01:20 - Overwatch 2\n02:03 - Saints Row\n02:34 - Dying Light 2\n02:59 - Prince of Persia: The Sands of Time Remake\n03:21 - Diablo IV\n04:07 - The Elder Scrolls VI\n04:24 - The Next Mass Effect\n04:54 - Lego Star Wars: The Skywalker Saga\n05:20 - Starfield\n05:42 - Baldur's Gate 3\n06:08 - Avowed \n06:39 - Elden Ring\n07:09 - System Shock\n07:42 - Star Citizen\n08:27 - Fable\n08:54 - Forspoken\n09:14 - Vampire: The Masquerade – Bloodlines 2\n09:36 - Everwild\n09:58 - Gotham Knights\n10:31 - Scorn\n10:54 - Kerbal Space Program 2\n11:21 - The Lord of the Rings: Gollum\n11:35 - Homeworld 3\n12:07 - Rainbow Six Extraction\n12:43 - Redfall\n13:06 - Senua's Saga: Hellblade II\n13:33 - Monster Hunter Rise\n14:06 - Company of Heroes 3\n14:35 - S.T.A.L.K.E.R 2\n15:06 - Total War Warhammer 3\n15:33 - Two Points Campus\n\nDespite the new generation of consoles, PC remains its own unique gaming platform that can provide experiences you might not be able to find on other systems while also offering a place to play multiplatform games at their best. PC's seemingly infinite backlog of games makes it a beast of a platform, and there's just as much to look forward to in 2022 and beyond.\n\nIt's exciting that PC gamers have options for even more powerful video cards with Nvidia's RTX 30-series and AMD's RX 6000-series (if you can find them), providing more graphical horsepower than ever before and new features like ray tracing and AI-driven supersampling. But while PC pushes innovation in graphics and performance, what matters most is the games. And if you need a cheat sheet for what's in your PC gaming future, and details on why you should be excited for each of these upcoming titles, we have you covered. Plus, if you’re looking for some of the best PC games to play right now, we've got a great list for that too.", "link": "https://www.youtube.com/watch?v=952r2Ma3ctg", "date_published": "2021-12-31 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Biggest Upcoming Nintendo Switch Games Of 2022 And Beyond", "description": "Here are all the games headed to Nintendo Switch that you need to know about.\n\nThe Nintendo Switch keeps building in strength, thanks to a library of great first-party games and strong third-party support. With the flexibility of playing while docked to a TV or as a handheld, portable console, it's a great way to enjoy your favorite games. We've already seen plenty of brilliant Nintendo Switch games such as The Legend of Zelda: Breath of the Wild, Super Mario Odyssey, and Animal Crossing: New Horizons, so it's exciting to know there's more to come. Whether you've been a Switch owner from the beginning, or are perhaps eyeing the new OLED version, there are plenty of upcoming games to get excited about. To help you find your next gaming obsession, we've compiled a list of the biggest upcoming Nintendo Switch games to watch out for over the next year.\n\nZelda: Breath Of The Wild Sequel Trailer Breakdown | E3 2021: https://youtu.be/5L7TNcyno-Q\n\nThe Legend Of Zelda: Breath Of The Wild 2 E3 2021 Trailer: Theories, Breakdown, And More: https://www.gamespot.com/articles/the-legend-of-zelda-breath-of-the-wild-2-e3-2021-trailer-theories-breakdown-and-more/1100-6467714/\n\nSequel To Zelda: Breath Of The Wild Trailer Breakdown | E3 2019: https://youtu.be/3DRARZQexW4\n\nTimestamps:\nIntro - 00:00\nAdvance Wars 1+2: Re-Boot Camp - 00:44\nBayonetta 3 - 01:45\nHollow Knight: Silksong - 02:20\nKirby and the Forgotten Land - 03:14\nSequel to The Legend of Zelda: Breath of the Wild - 03:53\nLego Star Wars: The Skywalker Saga - 04:44\nMario + Rabbids: Sparks of Hope - 05:33\nMetroid Prime 4 - 06:27\nMarvel's Midnight Suns - 07:27\nMonster Hunter Rise: Sunbreak - 07:59\nPokémon Legends: Arceus - 08:27\nSplatoon 3 - 09:17\nSports Story - 09:59\nTriangle Strategy - 10:52\nOutro - 11:46", "link": "https://www.youtube.com/watch?v=7tFDAkOYi_Q", "date_published": "2021-12-30 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]