[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Mass Effect Legendary Trailer vs Originals, Side By Side Comparison", "description": "We went through the Mass Effect Legendary Edition Trailer and matched as many shots as possible with the original games.\n\nIt's been nearly a decade and a half since the original Mass Effect was released, and while it was visually impressive at the time, like a lot of older games, it's pretty handily outclassed by modern graphics. The newly announced Mass Effect Legendary Edition brings the original Mass Effect trilogy into the modern era--and a lot of that is updating the game's look to bring it in line with current games and to unify the visuals between each of the trilogy's entries.\n\nVideo producer Jean-Luc Seipke has painstakingly analyzed the shots found in the trailer for the Mass Effect Legendary Edition, then dug through the PC versions of the Mass Effect games for their corresponding moments. Check out the video above, where he compares the originals and the Legendary Editions point-by-point to show you just how much BioWare has improved the graphics of the original games.\n\nThere's a whole lot more to talk about with the Mass Effect Legendary Edition, so be sure to check out all our coverage on GameSpot.com.", "link": "https://www.youtube.com/watch?v=HJa_sY0f8jM", "date_published": "2021-02-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Persona 5 Strikers Review", "description": "Persona 5's RPG elements have translated well into action combat, and while the story may not hit hard, the Phantom Thieves haven't forgotten who they are.", "link": "https://www.youtube.com/watch?v=pgFah-mYyao", "date_published": "2021-02-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Rise And Fall Of Stadia Games And Entertainment", "description": "With the news that Stadia Games And Entertainment is closing down, Lucy recaps just what happened with Google's foray into video game development.\n\nIn February 2021, Google dropped a bomb that no one expected: it was closing Stadia Games and Entertainment, its first-party studio tasked with developing games for its streaming service, Stadia. The news seemingly came out of nowhere. Or did it?\n\nIn the above video, Lucy chronicles the development of Google's oft-maligned streaming service, from the initial promise of incredible cloud-based development tools and social integration to hiring key development talent like Jade Raymond, Shannon Studstill, and Alex Hutchinson, to its rocky launch, and the eventual closure of its first-party studio. \n\nShe also explores if Stadia has a future as a streaming platform akin to Nvidia's GeForce Now, or Sony's PlayStation Now. The future of Stadia is very much up in the air, but GameSpot will always have the latest. Subscribe at youtube.com/gamespot to keep up to date.", "link": "https://www.youtube.com/watch?v=M0pzHeppJ_I", "date_published": "2021-02-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]