[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Activision Blizzard Accused Of Shredding Abuse Evidence | GameSpot News", "description": "Niantic has announced that the PokeStop and Gym interaction distance in the U.S. and New Zealand has been increased from 40m to 80m.\n\nEpic Games and Time Studios (of Time Magazine) have teamed up to present the Fortnite March Through Time, a limited-time mode that offers no combat, building, or anything of the usual sort Fortnite is known for.\n\nThe California Department of Fair Employment and Housing has updated its lawsuit against Activision Blizzard, accusing the gaming giant of destroying evidence pertinent to the investigation.\n\n00:14 - Pokemon Go PokeStop and gym interaction distance increased\n01:03 - Fortnite celebrates MLK with in-game march through time mode\n02:10 - Activision Blizzard accused of shredding abuse evidence\n\n#pokemongo #fortnite #activision blizzard", "link": "https://www.youtube.com/watch?v=Ie3AKNxYq6I", "date_published": "2021-08-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty Vanguard Multiplayer Alpha Livestream", "description": "Richie is gonna check out the multiplayer alpha for Call of Duty Vanguard and see how this year's COD is shaping up.\n\n#cod #callofduty #callofdutyvanguard", "link": "https://www.youtube.com/watch?v=A1Y2_2w2etg", "date_published": "2021-08-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Elden Ring: 7 New Details Revealed", "description": "Tamoor recently got to see Elden Ring in action in a behind-closed-doors session at Gamescom 2021, here’s everything he learned about From Software’s upcoming open-world adventure. There was no additional footage given. Only new screenshots. \n\nDespite how little we've seen of Elden Ring, those familiar with From Software's catalogue will have a good idea of what to expect. Surprising absolutely no one, Elden Ring is a dark fantasy action RPG set in an intricately constructed world. It delivers its narrative in fragmented pieces, leaving the player to make connections, fill in the gaps, and draw conclusions. Its gameplay marries the tension of venturing into the unknown with the joy of discovery and, most importantly, it emphasizes a sense of accomplishment that comes from conquering seemingly insurmountable challenges. \n\nElden Ring is the exact kind of game that From Software is known for creating, but it's also an exciting evolution that takes the best of what came before and extrapolates it out onto a much grander scale, potentially realizing that open-world Soulsborne fantasy that many fans have been eager for.\n\nIn the video above, Tamoor Hussain discusses 7 new takeaways from a behind-closed-doors gameplay presentation that he attended at Gamescom 2021. Elden Ring will release on January 21 2022 for PS4, PS5, Xbox One, Xbox Series S, Xbox Series X, and PC.\n\n#elden ring7 #eldenring7 #gamescom 2021", "link": "https://www.youtube.com/watch?v=GOTPRZ5cJno", "date_published": "2021-08-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "No More Heroes 3 Review", "description": "No More Heroes 3 is at its best when you're slicing your way through alien invaders, but the rest of the game wrapped around the energetic combat is a laborious disappointment.\n\nGrasshopper Manufacture's No More Heroes 3 is now available on Nintendo Switch. You can read the full written No More Heroes 3 review by Richard Wakeling on GameSpot: https://www.gamespot.com/reviews/no-more-heroes-3-review-desperate-struggle/1900-6417721/\n\n#nomoreheros 3 #nomoreheros3", "link": "https://www.youtube.com/watch?v=sE08izxLzHY", "date_published": "2021-08-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "SAINTS ROW Welcome to Santo Ileso Trailer", "description": "Learn more about Santo Ileso in the new reboot for Saints Row.\n\nJoin voice of The Boss Bryce Charles and the Volition team as they take you on a tour of a whole new world for the Saints.  Welcome to Santo Ileso, a brand new location in the American Southwest, complete with a brand new cast of characters to discover.  \n\n#saintsrow", "link": "https://www.youtube.com/watch?v=IRQP-KWYtDg", "date_published": "2021-08-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Michael Higham Goodbye Stream", "description": "It's our boy Michael Higham's last day at GameSpot, so we're getting the crew together for one last celebration stream.", "link": "https://www.youtube.com/watch?v=IwIURVwQot0", "date_published": "2021-08-27 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Deathloop - The Final Preview", "description": "Deathloop is shaping up to be another stellar Arkane title. Lucy and Tamoor chat about their time with the game over 15 minutes of brand new PS5 gameplay.\n\n#deathloop", "link": "https://www.youtube.com/watch?v=EtoC-V5W_YY", "date_published": "2021-08-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Destiny 2: The Witch Queen - What You Need To Know", "description": "Destiny 2’s latest expansion The Witch Queen has been officially revealed with a lot of new content for fans to experience. From a new antagonist and campaign, to a brand new raid, we dive into all the big things you need to know about the latest expansion.\n\nBungie has been on a tear lately with Destiny’s story telling. The developer has expanded its past seasonal stories in a cohesive and evolving manner and fans were eagerly anticipating the reveal for Destiny’s next large expansion, The Witch Queen. The reveal is here--and it’s juicy. Bungie officially dropped tons of info about the new expansion and its story premise, finally giving us a look into the brand new antagonist, Savathun.\n\nSavathun will be our largest threat yet, and is able to grant the gift of the Light to her brood. That’s right, weak Hive knights, wizards, and other Hive enemies are now essentially Guardians who can wield the Light’s power against us, which is really saying something. The campaign and new story will have us traveling to Savathun’s throne world, where we will challenge her Lucent Brood and attempt to get to the heart of it all and pierce through her lies and facades. \n\nThere’s a ton of new content coming to The Witch Queen, which we detail in the video, such as the brand new raid that will take place in a sunken Pyramid ship. We also delve into weapon crafting, a first for the game, and break down the Glaive, a first-of-its-kind melee weapon. Additionally, there are new seasonal activities, and more content to look forward to when the new expansion finally drops.\n\nDestiny 2: The Witch Queen is slated for release in February 2022, and will be available on Xbox One, Xbox Series S|X, PS4, PS5, PC, and Google Stadia. There will be a standard edition with just the expansion, and a deluxe edition that includes a season pass with plenty of end game content like brand new dungeons and raids in future seasons. Hardcore fans can up the ante with the physical collectors edition, which costs a good chunk of change but comes with really cool limited edition goodies like a Hive Ghost. Be sure to subscribe to GameSpot for more Destiny content!\n\n#destiny2 #destiny 2 #thewitchqueen", "link": "https://www.youtube.com/watch?v=Cvw5EvuAzqk", "date_published": "2021-08-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Dying Light 2 - Parkour Gameplay Breakdown (Dying 2 Know Episode 3)", "description": "Techland invites gamers to watch Dying 2 Know gamescom Edition, the 3rd episode of an original web series diving deep into the world of Dying Light 2 Stay Human, on August 26 at 11:00 AM PT / 8:00 PM CEST. During the special gamescom episode, hosted by lead game designer Tymon Smektała and streamed via gamescom Studio, the development team will reveal more about parkour and combat, showcase a new gameplay trailer, and much more.\n\n#dyinglight2", "link": "https://www.youtube.com/watch?v=bCZxfwqSK9M", "date_published": "2021-08-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Dying Light 2 Stay Human — Dying 2 Know Episode 3 Gamescom Edition", "description": "Join the lead game designer Tymon Smektała in a special Gamescom episode of Dying 2 Know!\n\nYou will learn more about parkour, combat, and some tools of destruction that will help you in Dying Light 2 Stay Human.\n\n#dyinglight2 #dying2know #gamescom", "link": "https://www.youtube.com/watch?v=Ocm0nVmVc3I", "date_published": "2021-08-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Infinite & Horizon Forbidden West Release Dates Confirmed | GameSpot News", "description": "Halo Infinite’s December 8th release date is confirmed following a leak. A special edition Xbox Series X console and special edition Xbox Elite 2 controller were also revealed in celebration of Halo’s 20th anniversary. \n\nHorizon: Forbidden West’s new release date of February 18, 2022 has been revealed by Guerrilla Games. The game was originally slated for release in the second half of 2021. \n\nRaven Software announced the ban of 100,000 accounts from Warzone. The game’s last ban wave was back in July, and more than half a million accounts have now been banned for cheating and other offenses. \n\n00:12 - Halo Infinite Release Date Confirmed\n01:06 - Horizon Forbidden West Release Date Confirmed\n01:47 - Saints Row Reboot Revealed\n02:21 - ONL Highlights\n03:08 - 100,000 Warzone Users Banned\n\n#haloinfinite #horizonforbidden #onlhighlights #saintsrow #warzone", "link": "https://www.youtube.com/watch?v=kNeLCgoXVbo", "date_published": "2021-08-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Saints Row Reboot Preview", "description": "Steve Watts got a hands-off preview of the new Saints Row during Gamescom 2021. Learn more about what he got to see, and what he learned from a Q&A.\n\nThe new Saints Row, announced at Gamescom, is a total reboot for the series--not just in setting and characters but in tone. While it looks primed to carry forward the same playfully zany spirit as its predecessors, the new game--simply called Saints Row--is clearly taking a step back and allowing developer Volition some breathing room without having to constantly top itself with ever-expanding wacky hijinks.\n\n#saintsrow #gamescom", "link": "https://www.youtube.com/watch?v=Gx4adr8_X-E", "date_published": "2021-08-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]