[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "NPR Music Listening Party: John Prine's Debut Turns 50", "description": "John Prine's self-titled album came out 50 years ago. Bonnie Raitt, Jim Rooney, Fiona Prine and Jody Whelan guest in an online listening party with host Ann Powers on Sept. 23.\n\nWatch John Prine's Tiny Desk concert\nhttps://www.youtube.com/watch?v=sOg7mAkrKJw\n\nWatch the Tiny Desk tribute to John Prine\nhttps://www.youtube.com/watch?v=PBksI8zbhrg", "link": "https://www.youtube.com/watch?v=hPNNiQzYpMo", "date_published": "2021-09-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "maye: Tiny Desk (Home) Concert", "description": "From Sept. 15 through Oct. 15, Tiny Desk is celebrating Hispanic Heritage Month with an \"El Tiny\" takeover of the (home) concert series, featuring J Balvin, Camila Cabello and several more musicians from all corners of Latinidad.\n\nAnamaria Sayre | September 22, 2021\nmaye's sultry vocals and ethereal energy conjure a world in which areperias shrouded in hazy bubbles and twinkly lights feels astonishingly normal.\n\nThe enchanting pop singer fills her \"El Tiny\" home stage — the artist's favorite Venezuelan eatery in Miami — with family and friends, su propia gente. She opens with a short and simple rendition of the soon-to-be-released \"Maybe Baby\" before dropping her instrument and transitioning to an up-tempo, vocal-driven performance of \"Yours.\" Picking the electric guitar back up, she strums along with a steady percussion and accompanying guitars for a soulful premiere of brand-new track \"Descifrar,\" emanating an understated and consistent confidence fitting for a pop reina on the rise. She closes out the set with a full-bodied execution of \"Tú,\" showcasing her signature tropicalia-meets-dream pop sound.\n\nmaye's effortless sashay from English to Spanish in her songs and speech represent an important facet of the El Tiny audience. Featuring a whole crew of Venezuelan-Americans, including her famous Latin singer-songwriter papá, Fernando Osorio on the traditional Venezuelan cuatro, the third performance in our Hispanic Heritage Month series authentically represents the experience of a family like maye's — one that exists in both planes, two worlds.\n\nGiven a moment and a platform like this, maye seizes the opportunity and creates an alternate universe, where barriers of culture and language dissolve and areperias sparkle.\n\nSET LIST\n\"Maybe Baby\"\n\"Yours\"\n\"Descifrar\"\n\"Tú\"\n\nMUSICIANS\nmaye: vocals, guitar\nAna Osorio: vocals, shakers\nOriana Aravena: guitar\nFernando Osorio: cuatro, vocals\nPatrick Howard: drums\nFernando Belisario: keys\nGuillermo Belisario: bass\n\nCREDITS\nVideo: Fernando Manuel, Carlos Reyes, Alexandra Añez\nAudio: Andrés Daza, Spencer Ford, Patrick Howard\nB-Cam Operator: Jose Trujillo\nAC: Alejandro Villegas\n2nd AC: Lewis Reif\nGaffer: Michaelangelo Arizmendi\nGrip: Alejandro Domínguez\nArt Direction: Alexandra Añez\nProduction Assistants: Nathalie Chybik, Nicole Buitrago, Zelmira Rizo-Patron, Antonio Marval, Andrés Osorio\nSpecial Thanks: Pink Poetry, LLC Electric Air Studios, Talk Shop Studios, Underdog Inc, Retro Nomad Productions, EO Entertainment and Rafael Urbina\n\nTINY DESK TEAM\nProducer: Anamaria Sayre\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nAlt.Latino 'El Tiny' Team: Felix Contreras, Reanna Cruz, Anaïs Laurent, Stefanie Fernandez\nTiny Production Team: Bob Boilen, Bobby Carter, Kara Frame, Sofie Hernandez-Simeonidis\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #eltiny #maye", "link": "https://www.youtube.com/watch?v=2nkWKhcG-Zg", "date_published": "2021-09-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]