[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Core Games - Official Early Access Cinematic Trailer", "description": "Check out the Core Games official early access cinematic trailer! \n\nCore Early Access is here and available in the Epic Games Store for free at https://www.epicgames.com/store/p/core​.  Join Kenton (voiced by WWE's Austin Creed) as he gains access to the Core multiverse. Play thousands of Unreal-powered games in every genre imaginable, or create, share, and earn from your own!\n\n#EpicGames #CoreGames", "link": "https://www.youtube.com/watch?v=Bj9DTD9rpqU", "date_published": "2021-04-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Days Gone PC Features Trailer", "description": "Check out this official trailer for Days Gone outlining all the features coming to the game for PC. Days Gone comes to PC on May 18th! \n\nDays Gone is an open-world action-adventure game set two years after a devastating global pandemic. Play as Deacon St. John, a bounty hunter facing a brutal struggle for survival while searching for a reason to live.", "link": "https://www.youtube.com/watch?v=JT_gdAMuY3I", "date_published": "2021-04-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil 4 VR Reveal Trailer | Resident Evil Showcase", "description": "Resident Evil 4 is getting the VR treatment. Check out this world premiere trailer that brings the original landmark classic to the world of VR!", "link": "https://www.youtube.com/watch?v=_FJFnm9PCfY", "date_published": "2021-04-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil Village April Showcase Livestream", "description": "Tune into Capcom’s showcase for Resident Evil Village to see a brand new trailer and gameplay. The event begins on April 15th at 3pm PT.", "link": "https://www.youtube.com/watch?v=aIgJrN6mmGI", "date_published": "2021-04-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil Village Demo: Everything To Know", "description": "The Resident Evil Showcase showed off a bunch of new things for Resident Evil Village! This shows off all the information to know about the upcoming cross platform demo for Resident Evil Village! \n\n#ResidentEvil #ResidentEvilShowcase #ResidentEvilVillage", "link": "https://www.youtube.com/watch?v=z4mi8yV6QwY", "date_published": "2021-04-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil Village Mercenaries Mode Reveal Trailer  | Resident Evil Showcase", "description": "The classic, frenetic survival mode makes its glorious return to the series with new abilities and customization options. Check out the reveal trailer shown off during the Resident Evil Showcase event!", "link": "https://www.youtube.com/watch?v=WiOTdbT9RSI", "date_published": "2021-04-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil Village Trailer  | Resident Evil Showcase", "description": "Ethan Winters is dealing with some serious mommy issues in this brand new trailer for Resident Evil Village kicking off this month's Resident Evil showcase. Join him, Chris Redfiled, and of course, tall vampire ladies when it launches on May 7th!", "link": "https://www.youtube.com/watch?v=tjfTxFzGh3Q", "date_published": "2021-04-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Every Game Delay In 2021 (So Far)", "description": "We saw a few games get delayed back in 2020, but it seems that the real impact of the pandemic on the gaming world is being felt in 2021. We're not even halfway through the year but numerous titles have slipped from their original release dates, with some even moving into 2022.\n\nIt's to be expected. Game development is hard enough without the pitfalls of transitioning to working from home. While it's a shame that games won't be released when we initially thought they would, we say give developers all the time they need to release something that they're truly proud of.\n\nThe above video lists a number of games that have been delayed in 2021, including Gotham Knights, Hogwarts Legacy, and Deathloop, among others. We'll just have to wait a little while longer to play them. But there's still plenty being released, for the latest recommendations, check out gamespot.com and youtube.com/gamespot.", "link": "https://www.youtube.com/watch?v=e1Axqw9z4Zc", "date_published": "2021-04-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Final Fantasy XIV - PS5 Update Performance And Loading Screen Gameplay", "description": "The PlayStation 5 upgrade for FFXIV has finally arrived with patch 5.5 and brought a whole bunch of new updates including higher UI resolutions and a major framerate bump from the PS4 version. We decided to take a look at how everything runs by checking out a few notorious areas for framerate problems and getting into a few fights.\n\n00:00 Intro and Fighting Capering Pixie\n01:18 Fighting Necropsyche\n04:16 Checking Out the Gold Saucer Area\n05:51 Returning to Eulmore\n07:07 Checking out Limsa Lomnisa Lower Decks\n08:56 Flying around with Rathalos", "link": "https://www.youtube.com/watch?v=gfgOxVXfvNE", "date_published": "2021-04-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Indie World Nintendo Full Presentation", "description": "Check out the Nintendo Indie World full presentation that was unveiled by Nintendo on April 14th, 2021! \n\nThe Nintendo Indie World presentation features announcements from a variety of indie games coming to Nintendo! \n\n#Nintendo #NintendoIndie #IndieGames", "link": "https://www.youtube.com/watch?v=GvzS2F6Yilk", "date_published": "2021-04-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "MetaHuman Creator Early Access Out Now: Meet the Team | Unreal Engine", "description": "Check out the latest developer video on the MetaHuman Creator from Unreal Engine which early access is now available for! \n\nMetaHuman Creator, a cloud-based app for creating high-fidelity digital humans in minutes, is now available in Early Access. Here, we talk with some of the team behind the tool about what inspired and motivated them to spend years crafting the technology, and how they’re excited to make it available to everyone.\n\n#UnrealEngine #MetaHuman", "link": "https://www.youtube.com/watch?v=aMJKNTmPxyY", "date_published": "2021-04-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil 7 Story Recap", "description": "It's been a few years since Resident Evil 7, so with Resident Evil Village is nearly here, let’s recap what went down in the Baker house all those years ago with Ethan and Mia Winters.\n\nCheck out our complete Resident Evil timeline explained here: https://youtu.be/QkPgowr-T9g\n\nResident Evil Village is nearly here, which means big spooky times with Lady Dimitrescu. However, it’s been a few years since Resident Evil 7, and while RE Village isn’t called 8, it’s something of a direct sequel, as it's the return of 7’s protagonist Ethan Winters. And not to forget series veteran Chris Redfield, who also had a guest appearance at the end of the last installment.\n\nIn this video, Kurt Indovina recaps the events of Resident Evil 7, from Ethan’s search for his wife Mia, to escaping the grips of the Baker family, and also, most strangely, its two endings--only one of which is canonical to Resident Evil Village.\n\nWhere Resident Evil 7 returned to its more traditional roots of survival horror, Village seems to be taking a lot of inspiration from one of the franchises most iconic installments: Resident Evil 4. Look no further than the addition of a merchant, tetris-like inventory management, and a European-style village to draw comparisons. Still, there are many questions left to be answered: like, what is the importance of Ethan and Mia’s child who has been taken? Why does Chris Redfield suddenly appear to be a villain? And how much alone time will Ethan get to have with Lady Dimitrescu? May 7 couldn’t come soon enough.", "link": "https://www.youtube.com/watch?v=c_M_KFIzqa0", "date_published": "2021-04-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Teenage Mutant Ninja Turtles: Shredder's Revenge - Gameplay Trailer", "description": "Teenage Mutant Ninja Turtles: Shredder’s Revenge is bringing all the action to Nintendo Switch.", "link": "https://www.youtube.com/watch?v=nbxIAqSUHtI", "date_published": "2021-04-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]