[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC3ScyryU9Oy9Wse3a8OAmYQ", "title": "After Jan 6, Examining a “Broad Fascist Movement” in the U.S. | \"American Insurrection\" | FRONTLINE", "description": "In a scene from the new documentary “American Insurrection,” correspondent A.C. Thompson talks with sociologist Pete Simi about the state of domestic extremism in the U.S.\n\nSubscribe on YouTube: http://bit.ly/1BycsJW​ \n\n\"American Insurrection,\" a 90-minute documentary from FRONTLINE, ProPublica and Berkeley Journalism's Investigative Reporting Program, traces the road that led to the Capitol siege and examines the evolution of right-wing extremism over the past several years — including how fallout from Charlottesville prompted some groups to change their tactics, the mounting acts of political violence that preceded the Capitol attack, and the contours of the right-wing extremist movement today. \n\n\"American Insurrection\" premiered April 13, 2021, and is now available to stream in full: https://to.pbs.org/3d9Bzgk\n\nThe documentary is supported by Exploring Hate, a new, multiplatform public media initiative from The WNET Group in New York aimed at offering an in-depth understanding of the rising tide of hatred, hate crimes, anti-Semitism and racism. \n\nInstagram: https://www.instagram.com/frontlinepbs\n​Twitter: https://twitter.com/frontlinepbs\n​Facebook: https://www.facebook.com/frontline​\n\nFRONTLINE is streaming more than 300 documentaries online, for free, here: http://to.pbs.org/hxRvQP​ \n\nFunding for FRONTLINE is provided through the support of PBS viewers and by the Corporation for Public Broadcasting. Major funding for FRONTLINE is provided by the Ford Foundation. Additional funding is provided by the Abrams Foundation; the John D. and Catherine T. MacArthur Foundation; Park Foundation; the Heising-Simons Foundation; and the FRONTLINE Journalism Fund with major support from Jon and Jo Ann Hagler on behalf of the Jon L. Hagler Foundation, and additional support from Koo and Patricia Yuen. Funding for \"American Insurrection\" is provided by The WNET Group’s “Exploring Hate” initiative on Antisemitism, Racism and Extremism, with principal support by The Sylvia A. and Simon B. Poyta Programming Endowment to Fight Antisemitism and additional major funding from The Peter G. Peterson and Joan Ganz Cooney Fund, and Patti Askwith Kenner. Additional support from Sue and Edgar Wachenheim III, James and Merryl Tisch, Nancy and Morris W. Offit, and Judy and Josh Weston.", "link": "https://www.youtube.com/watch?v=dyNP_-bG7Os", "date_published": "2021-04-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]