[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "CARM: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nBob Boilen | April 15, 2021\nFor the Tiny Desk (home) concert series, 'home' can mean many things. For CJ Camerieri and his project CARM, home is where the art is. He performed his concert at the Pablo Center in Eau Claire, Wisc., where the trumpeter and French horn player conceived and recorded all the songs for his 2021 debut solo album, CARM. \"This particular community has been a really big part of my musical life for 10 years,\" CJ says after playing the calming tune \"Soft Night,\" \"so it seems like the perfect place to be doing this.\"\n\nCJ Camerieri is a co-founder of the ensemble yMusic, a member of Paul Simon's band, a collaborator with Bon Iver and a Tiny Desk alum. (You can hear his French horn with The Tallest Man On Earth from their 2019 Tiny Desk Concert.) For this home concert, Trever Hagen joins him to provide the electronic pulse, trumpet, and other textures to the mix. On song two, he welcomes fellow Eau Claire musician S. Carey, a drummer and singer with Bon Iver, as well as someone I've admired as a solo artist. Here he plays piano and sings a song CJ co-wrote with Sufjan Stevens titled \"Song of Trouble.\" It's a song written pre-pandemic and, like so many songs, has taken on new significance. And that goes for both the jittery electronica and the calming horns we hear; it's music that's resonated with me all year long.\n\nSET LIST\n\"Soft Night\"\n\"Song of Trouble\" (feat. S. Carey)\n\"Nowhere\"\n\"Slantwise\"\n\nMUSICIANS\nCJ Camerieri: trumpet, French horn\nTrever Hagen: trumpet, electronics\nS. Carey: vocals, piano\n\nCREDITS\nVideo: Isaac Gale\nAudio: Brian Joseph\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Kara Frame\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Maia Stern\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann\n\n#carm #tinydesk #nprmusic", "link": "https://www.youtube.com/watch?v=DN1Y-tbCHvA", "date_published": "2021-04-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Demi Lovato: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nLyndsey McKenna | April 14, 2021\nA few years ago, some of us on the NPR Music team stumbled upon a copy of Demi Lovato's 2013 book, Staying Strong: 365 Days A Year. Reading Lovato's heartfelt daily reflections became a workday habit; her transparency and vulnerability made us ardent admirers who wanted nothing but the very best for Demi.\n\nWe made it our mission to get Demi to the Tiny Desk, and though the pandemic had other plans, Lovato's Tiny Desk (home) concert was worth the wait. Recorded on a sunny spring day in her Los Angeles backyard, Lovato begins with a moving rendition of \"Tell Me You Love Me\" from her 2017 record of the same name, accompanied by subtle, sparse keys. She continues her set with the title tracks from her recently-released studio album, Dancing With The Devil...The Art Of Starting Over. On both tracks, Lovato's voice feels stabilizing and grounding; there's a sense of clarity and purpose in its power.\n\nWhen interviewed by NPR's Ailsa Chang back in 2017, Demi Lovato said, \"I think I've lived a lot of life.\" Through both her struggles and successes, Lovato's shown all sides of herself – the confident and unapologetic star, but also the complexities of recovery – inviting us on her journey in a deeply personal way. Her intimate (home) concert feels like a natural extension of that sincerity.\n\nSET LIST\n\"Tell Me You Love Me\"\n\"The Art Of Starting Over\"\n\"Dancing With The Devil\"\n\nMUSICIANS\nDemi Lovato: vocals\nSteven \"Styles\" Rodriguez: keys\n\nCREDITS\nDirector: Mike Drew\nEditor: Aaron Kroger\nEngineer/Shader: David Vega\nCamera Operator: Austin Wavra\nCamera Operator: Noel Galan\nCamera Operator: Drew Welker\nAssistant Camera: Lawrence Montemayor\nAudio : Steven \"Styles\" Rodriguez\n\nTINY DESK TEAM\nProducers: Abby O'Neill\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Kara Frame, Bob Boilen\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #demilovato", "link": "https://www.youtube.com/watch?v=Ehw07lXL1AY", "date_published": "2021-04-14 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]