[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Raye Zaragoza: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nSam Yellowhorse Kessler | November 10, 2021\nFor Native American Heritage Month, we wanted to feature Indigenous musicians that break out of the preconceptions that many have of Indigenous music. Raye Zaragoza does just that, planting herself firmly in the folk genre, a tradition often reduced to white musicians with acoustic guitars. She pushes back on the narrative of folk music being for a certain type of person in her song “They Say,” in which she sings specifically about a time she realized at one of her own concerts that she probably couldn’t have afforded to be a member of the audience. “They say that folk music’s for the elite,” she sings, “the wise and the old with a college degree.” \n\nZaragoza is a natural performer, able to go big --  like on her 2020 album, Woman in Color --  or pare it all back, as she does in this Tiny Desk (home) concert. Her music reminds me of Ondara, an artist working within the troubadour tradition of storytelling, but unafraid to deliver incisive social and political messages. After all, what is folk music without something to work toward? “Change is a choice,” Zaragoza sings, “and it starts with me.” \n\nSET LIST\n* \"The It Girl\"\n* \"Rebel Soul\"\n* \"They Say\"\n* \"American Dream\"\n\nMUSICIANS\n* Raye Zaragoza: vocals, guitar\n\nCREDITS\n* Video By: James Gang Pictures, Drew James, Austin Straub, Hayley Palmaer\n* Audio by: Raye Zaragoza\n\nTINY DESK TEAM\n* Producer: Sam Yellowhorse Kesler\n* Video Producer: Kara Frame\n* Audio Mastering: Josh Rogosin\n* Tiny Production Team: Bob Boilen, Bobby Carter, Maia Stern, Sofie Hernandez-Simeonidis\n* Executive Producer: Keith Jenkins\n* Senior VP, Programming: Anya Grundmann\n\n#tinydesk #nprmusic #rayezaragoza", "link": "https://www.youtube.com/watch?v=K6NR9DYiEqc", "date_published": "2021-11-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]