[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 Hazard Zone - Huge Win With 11 Data Drives", "description": "We dive into Battlefield 2042's new battle royale-like Hazard Zone mode, smashing squads and extracting with data drives. In this video you will see two perspectives from both Dozer and Mackay, and follow their successful infiltration and extraction. \n\n#Battlefield2042 #HazardZone", "link": "https://www.youtube.com/watch?v=kn5JKi3BXIM", "date_published": "2021-11-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield 2042 Review-In-Progress", "description": "Although some specialists can feel a bit useless at times, tweaks to the formula with Battlefield 2042 add a lot of interesting gameplay variety.", "link": "https://www.youtube.com/watch?v=_Qvfdva5puk", "date_published": "2021-11-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Battlefield Portal NO SPECIALIST Mode Gameplay Highlights (1942 and BF3)", "description": "Battlefield Portal is a special game mode allowing players to revisit the glory of iconic Battlefield games with a refreshed engine in Battlefield 2042. Portal gives players an opportunity to mix and match as they please mixing different elements from Battlefield 1942, Bad Company 2, and Battlefield 3, or leaving them untouched for a classic experience. In this video we grabbed gameplay highlights of our time playing the classic modes on several original maps including Caspian Border, and Battle of the Bulge.\n\n#Battlefield2042", "link": "https://www.youtube.com/watch?v=hah_PuU3tmQ", "date_published": "2021-11-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Bright Memory: Infinite Review", "description": "Bright Memory: Infinite offers concise and frenetic thrills, but technical issues and that same brevity hold it back.", "link": "https://www.youtube.com/watch?v=gRWBeEjkPyE", "date_published": "2021-11-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Marvel's Avengers Spider-Man With Great Power Cinematic Trailer", "description": "We finally get to see Spider-Man in Marvel's Avengers. Peter Parker works with the Avengers to stop AIM from getting new and definitely deadly technology.\n\nPlay Spider-Man throughout the Avengers Initiative when he swings into Marvel's Avengers on November 30 for PS4 and PS5!\n\n#MarvelsAvengers", "link": "https://www.youtube.com/watch?v=4lajAICHiLU", "date_published": "2021-11-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil 4 On Meta Quest 2 is What VR Was Made For", "description": "Presented by Meta Quest. Resident Evil 4 feels more real than ever in VR. Buddy is here to run down the reasons why Resident Evil 4 on Meta Quest 2 is worth making the trip back to one of the most beloved entries in the Resident Evil series.", "link": "https://www.youtube.com/watch?v=3SxWJnBnOws", "date_published": "2021-11-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Some Cheats Gone Missing In GTA Trilogy Definitive Edition | GameSpot News", "description": "In today’s episode of GameSpot News, Persia goes over some Grand Theft Auto: Trilogy - The Definite Edition’s missing cheats codes and reused assets from GTA V, Rainbow Six Extractions release date, and more.\n\nTo begin the episode, Persia talks about the discovery of missing cheat codes from the GTA Trilogy along with the reused assets in the Definitive Edition from Grand Theft Auto V after a recent interview with Producer Rich Rosado from USA Today.\n\nShe also talks about the reveal of the Rainbow Six Extraction release date and details about the free buddy passes you can receive with your copy of the game to give to friends. These buddy passes provide a 14-day trial of the full game.\n\nLater in the episode, Persia goes over some changes coming to the Xbox App for PC and the release of the Twitch app on the Nintendo Switch. \n\nFor more information on all of our topics, be sure to check out gamespot.com.\n\nTIMESTAMPS:\nIntro - 00:00\nGTA Trilogy - 00:10\nRainbow Six Extraction - 01:36\nXbox App for PC - 02:56\nTwitch for Switch & Outro - 03:58", "link": "https://www.youtube.com/watch?v=J7eriFY3HjU", "date_published": "2021-11-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "10 Best Call of Duty Games", "description": "Since 2003, Call of Duty has had over 19 mainline titles including juggernauts like Call of Duty 4: Modern Warfare, Call of Duty: Warzone and the Call of Duty Black Ops series. In no order, here’s our pick for ten of the series’ best.\n\nThe Call of Duty franchise has seen multiple critical success Over the last 18 years. From the renowned Black Ops series to Warzone, fans have returned year after year to experience a core staple in fps gaming.\n\nIn this video, Richie goes through the series to comb out some of the best, most memorable titles that stand out amongst the sea of Call of Duty titles. From  humble beginnings with World War 2 games, to the popular modern setting, these picks are undeniably Call of Duty at its finest.\n\nWith Warzone’s new pacific map coming soon, stay tuned to GameSpot for continued coverage of all things Call of Duty.\nEddie wrote up a best cod games listicle for us to make eventually.", "link": "https://www.youtube.com/watch?v=WvT8652dZkU", "date_published": "2021-11-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "27 Minutes Of Elden Ring Network Test PS5 Gameplay (4K)", "description": "Here is 27 Minutes of Elden Ring gameplay in 4K running on the PlayStation 5. This is gameplay from the Elden Ring closed network test that is starting for those invited on November 12th. Get a glimpse of various exploration, wild life, combat, some boss fights and more. \n\nTimestamps:\nIntro - 0:00\nGameplay Start 0:55\n\n#EldenRing", "link": "https://www.youtube.com/watch?v=kpqv2ooMWBw", "date_published": "2021-11-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Among Us Added 4 New Roles! | GameSpot News", "description": "In today's GameSpot News, Persia talks about the new Among Us update, a new weapon coming to Fortnite, and more. \n\nAmong Us has released a new update called the Cosmicube Update that introduces a store, new cosmetic items, achievements, an XP system, and four new roles that players can choose. Each roles offers unique abilities such as the Scientist who can look at vitals at any time as well as the engineer who can also freely take vents. \n\nFornite has also released its November 9 patch that will replace the Standard Pistol with the beefier Combat Pistol and also give a nice buff to the Sideways Rifle. Expect things to pick up quickly in the days ahead, as we continue to build toward some sort of showdown with the Cube Queen.\n\nLater in the video, Persia also talks about how you can get the Assassin's Creed Chronicles Trilogy for free through Ubisoft Connect PC and the recently released AGDQ 2022 speedrunning schedule.\n\nFor more information on all of our topics, please visit gamespot.com.\n\nTIMESTAMPS:\nIntro - 00:00\nAmong Us - 00:10\nFortnite - 01:25\nAssassin's Creed Chronicles - 02:29\nAGDQ 2022 - 03:57\nTiny Tina's / Outro - 06:22", "link": "https://www.youtube.com/watch?v=yOyyNKrMHfc", "date_published": "2021-11-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Best Skyrim Mods Of All Time", "description": "In this video, DeVante runs down a list of 17 of Skyrim's best mods from the past decade.\n\nThe Bee That Broke Skyrim - COMING SOON!\nTop 5 Skyrim Mods of the Week - https://youtube.com/playlist?list=PL4C05D15D44C89DD8\n\nSkyrim and Mods go together like mac and cheese, peanut butter and jelly, pineapple and pizza - it's just a magical combination. And after 10 years since the game’s release, there are more mods for Skyrim than a nord can shake a sword at. \n\nIn this video, we run down a list of 17 of Skyrim's best mods.This list includes graphical enhancements like Skyrim HD 2K Textures, Skyrim Flora Overhaul, and Static Mesh Improvement Mod. Gameplay mods like Alternate Start - Live Another Life, Really Useful Dragons, and Apocalypse - Magic of Skyrim. \n\nThe Elder Scrolls V: Skyrim Anniversary Edition releases November 11, 2021 on PS4/5, Xbox Series X/S, Xbox One, and PC.\n\nTIME STAMPS\n00:00 - Intro \n00:36 - SkyUI\n01:07 - Alternate Start\n01:39 - Really Useful Dragons\n02:12 - Crimes Against Nature\n02:31 - Immersive Weapons & Armors\n02:28 - Immersive HUD\n03:31 - ApachiiSkyHair\n03:56 - RaceMenu\n04:12 - Skyrim HD - 2K Textures\n04:39 - Skyrim Flora Overhaul\n04:57 - Static Mesh Improvement Mod\n05:19 - Climates Of Tamriel\n05:39 - A Quality World Map with Roads\n05:58 - Apocalypse - Magic of Skyrim \n06:24 - Realistic Ragdolls and Force\n06:50 - Fore’s New Idles in Skyrim\n07:10 - Falskaar", "link": "https://www.youtube.com/watch?v=O7Bk3RfdRCA", "date_published": "2021-11-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Elden Ring Hands On Preview", "description": "We got hands-on with the Elden Ring closed network test, and it felt both familiar and different in an exciting way.\n\nOf all the things I expected from Elden Ring, a sense of serenity wasn't one of them. Whether you've played From Software's games or are simply aware of them, you likely have an idea of what they offer: doomed kingdoms, tragic characters, a pervasive sense of melancholy, and gameplay that will challenge both your skill and your resolve. And yet, what defined my seven hours of hands-on time with the Elden Ring closed network test was what many would consider uncharacteristic of a Soulsborne game: tranquility.\n\nAs much of a surprise as that was, it's not something that's completely uncommon in these games. Whether it's the Nexus, Firelink Shrine, Hunter's Dream, or the Dilapidated Temple, each FromSoft title has a place where adventurers can find respite from the cruelty of the world beyond. These places have a sympathetic quality to them, somehow being able to acknowledge the harshness of the world, lament that its fate has been put upon your shoulders, and comfort you when you're at your lowest, giving you the space to put yourself together before you pick yourself up and venture out once more.\n\nWalking around the Lands Between, specifically a small section of an area called Lingrave, I felt that same intent, but laid out over a vast open world. The gentle, understated music that played as I wandered around aimlessly, or marveled at the beautiful golden Erdtree towering above, invited me to let my guard down and take in the world around me without the fear that a blade would suddenly be plunged into me. And when I did, I found the world to be both familiar and unlike anything in From Software's previous games. \n\n#EldenRing", "link": "https://www.youtube.com/watch?v=HAJTW1rL3-A", "date_published": "2021-11-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Grand Theft Auto: The Trilogy - Definitive Edition vs Original Graphics Comparison", "description": "We get a look at Grand Theft Auto: The Trilogy Definitive Edition graphics compared to the original games. Get a glimpse of Grand Theft Auto III, Grand Theft Auto: Vice City, and Grand Theft Auto: San Andreas. \n\nThe release of Grand Theft Auto: The Trilogy The Definitive Edition is so close. Get the game on November 11th on Xbox Series X and Series S, PlayStation 4, PlayStation 5, Nintendo Switch, Xbox One.\n\n#GTA", "link": "https://www.youtube.com/watch?v=V4ZZilpRBdc", "date_published": "2021-11-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Steam Deck Delayed! | GameSpot News", "description": "In today’s episode of GameSpot New, Persia talks about the Steam Deck being delayed, the new trailer for the Skyrim Anniversary edition, more details on Battlefield 2042’s first season, and more. \n\nIt was announced on the Steam website that the Steam Deck has been delayed due to manufacturing and supply issues. The new expected delivery date has shifted two from December of 2021 to February of 2022.\n\nThe Elder Scrolls V: Skyrim is celebrating its 10th anniversary, and Bethesda has released a new trailer for the Anniversary Edition ahead of the game's launch on November 11, showcasing the new gear and magic, fishing, and more.\n\nLater in the video, Persia goes over the new details for Battlefield 2042’s season 1 content that won’t be kicking off until 2022 along with the full year of content plans that include four seasons, four battle passes, four new Specialists, and \"new locations\" to explore. It was also announced that Battlefield Portal is now live for all players.\n\nPokemon Brilliant Diamond and Shining Pear will get a day-one, 3GB update that will add new content and various bug fixes. And lastly, The Game Awards 2021 has been announced for December 9th with 40 to 50 games being showcased and a double-digit number of new reveals.\n\nFor more information on all of our topics, please visit gamespot.com.\n\nTIMESTAMPS:\nIntro - 00:00\nSteam Deck - 00:11\nSkyrim - 1:00\nBattlefield 2042 - 1:48\nPokemon - 03:17\nThe Game Awards & Outro - 04:16", "link": "https://www.youtube.com/watch?v=mrPGiLKGPcY", "date_published": "2021-11-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Xbox Series X/S: One Year Later", "description": "Happy birthday to the Xbox Series X and S! In this special episode of Generation Next/Console Crew, Lucy, Tamoor, and Jordan chat about the highs and lows of the Xbox Series' first year, including Game Pass, exclusive games, and acquiring Bethesda.\n\nTamoor, Jordan, and Lucy are back for a very special episode of Generation Next/Console Crew to celebrate the one year anniversary of the Xbox Series X and S. \n\nIn the video above, the gang discuss the biggest Xbox news from the year, from game announcements to the acquisition of Bethesda Games Studios and the subsequent exclusives to look forward to. They also chat about how they use their Xboxes in their day-to-day lives, discussing everything from their favorite Xbox exclusives from the past year, and the quality of life changes that have impacted them the most (spoilers: it's absolutely the Quick Resume feature), to the improvements they'd like to see from the second year of the consoles. \n\nNovember 12 marks the one-year anniversary of the PlayStation 5, so make sure to come back for an episode about that console's first year too. To make sure you never miss anything, subscribe at youtube.com/gamespot.", "link": "https://www.youtube.com/watch?v=Czr_slm5R5k", "date_published": "2021-11-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]