[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Alternative facts", "description": "Merck, Pfizer COVID-19 Antivirals Different From Ivermectin. Link for Richard,\nhttps://twitter.com/richjsimmonds\n\nhttps://www.factcheck.org/2021/10/scicheck-merck-pfizer-covid-19-antivirals-different-from-ivermectin/?fbclid=IwAR2YgSVzorIwnzLmtNfyBUXInsbuEw3bHf6ZVhyDlNtXp11SPL1orXz_bSs\n\nhttps://www.factcheck.org/our-staff/\n\nis a journalist\n\nis a journalist who has covered government and politics\n\nProfessor for Communication at University\n\nis a journalist who covered the media \n\nA journalist\n\nis a former assignment editor\n\nis a science journalist\n\nearned his B.A. in journalism\n\nworked as a reporter\n\nis a graduate of the Journalism School \n\nis a journalist\n\nSciCheck Digest\n\nThe pills are very different from the antiparasitic medication ivermectin, \n\nDubbed PF-07321332, the investigational medication is a protease inhibitor that blocks a key enzyme the SARS-CoV-2 virus needs to replicate itself.\n\nMolnupiravir\n\nWhile the results have not been published or peer-reviewed, they were compelling enough for the trial’s independent Data Monitoring Committee to recommend an early halt to recruitment into the study. \n\nFood and Drug Administration, an advisory committee to discuss the application on Nov. 30.\n\nMolnupiravir is a nucleoside analog — a drug that messes up viral replication by tricking the virus into using the processed medication as one of its building blocks for its genetic code. \n\nThis is what’s known as “error catastrophe,” using a mechanism called “lethal mutagenesis.”\n\nAlthough both drugs are novel, with news of these developments, people on social media are spreading the false notion that the pills are the same or “suspiciously similar” to ivermectin\n\nSome iterations of the claim incorrectly posit that Pfizer’s drug is “based on” ivermectin and that the two are essentially the same because both are protease inhibitors \n\n— something that has not been established, and even if true, doesn’t mean the drugs are similar, \n\nThat paper, (computational modeling paper published by some Indian scientists in March)\n\nhowever, does not show that ivermectin acts as a protease inhibitor against SARS-CoV-2 through any sort of biological experiment — it only proposes the possibility based on computer simulations. \n\nDrugs Shown to Inhibit SARS-CoV-2 in COVID-19 \nOpen Access \n \nDisease: Comparative Basic and Clinical Pharmacology of \nMolnupiravir and Ivermectin \n\nhttps://austinpublishinggroup.com/pharmacology-therapeutics/fulltext/ajpt-v9-id1149.pdf\n\nIt (ivermectin) is being repurposed as a therapeutic agent for COVID-19, after in vitro studies in Vero/hSLAM cells, showed that it caused a 5000-fold inhibition of SARS-CoV-2,\n \nThe mechanisms of action of Ivermectin against SARS-CoV-2: An evidence-based clinical review article (Journal of antibiotics)\n\nhttp://dhakes.com/wp-content/uploads/2021/08/20210615-The-mechanisms-of-action-of-Ivermectin-against-SARS-CoV-2-An-evidence-based-clinical-review-article.pdf\n\nOne such enzyme, 3 chymotrypsin-like proteases (3’cl pro/ Mpro) is responsible for working on this polyprotein causing other proteins to “librate” and carry out viral replication. Ivermectin binds to this enzyme and disrupts it.\n\nBut the same is true of  PF-07321332\n\nExploring the Binding Mechanism of PF-07321332 SARS-CoV-2 Protease Inhibitor through Molecular Dynamics and Binding Free Energy Simulations (20th August 2021)\n\nhttps://pubmed.ncbi.nlm.nih.gov/34502033/\n\nThe crystal structure of 3CLpro in complex with PF-07321332, lopinavir, and ritonavir is not yet available. Therefore, the docked complex of PF-07321332, lopinavir, and ritonavir with 3CLpro was generated using the Molecular operating environment (MOE) software.\n\nFB post\n\n“Looks like Merck is repackaging the ‘horse drug’ and making it much more expensive! It will be the ‘new’ treatment for C. in pill form,” \n\nThe Food and Drug Administration has warned people against self-medicating with easier-to-access formulations of ivermectin for livestock, which are highly concentrated and also may include other ingredients that have not been tested in people. \n\nAs a result, there is no basis for claiming that either the Pfizer or Merck drugs are similar to ivermectin in any way.\n\nPfizer also denies any connection. “Pfizer’s protease inhibitor is not similar to that of an animal medicine and is not the same mechanism,” a company spokesperson said in an email\n\nThat post uses the phrase “Pfizermectin,” \n\nEditor’s note: SciCheck’s COVID-19/Vaccination Project is made possible by a grant from the Robert Wood Johnson Foundation. \n\nFinal fact\nFluvoxamine also has 3 fluorine atoms as does PF-07321332", "link": "https://www.youtube.com/watch?v=ObTAOvgd_JE", "date_published": "2021-11-11 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCF9IOB2TExg3QIBupFtBDxg", "title": "Pericarditis after vaccine", "description": "Kyle's statement before US Senate expert panel on federal vaccine mandates and vaccine injuries\nKyle starts at 53 minutes\nhttps://www.youtube.com/watch?v=lepqvdXoA2E\n\nOur previous video with Kyle\nhttps://www.youtube.com/watch?v=H7inaTiDKaU\n\nDr Patterson video\nhttps://www.facebook.com/watch/live/?ref=watch_permalink&v=486953922413886\n\nKyle's YouTube channel\nhttps://www.youtube.com/c/KyleAprilRideMtb", "link": "https://www.youtube.com/watch?v=7rZZTPp-eYU", "date_published": "2021-11-10 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]