[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Immanuel Wilkins: Tiny Desk (Home) Concert", "description": "NPR Music's Tiny Desk series will celebrate Black History Month by featuring four weeks of Tiny Desk (home) concerts and playlists by Black artists spanning different genres and generations each week. The lineup includes both emerging and established artists who will be performing a Tiny Desk concert for the first time. This celebration highlights the beautiful cornucopia of Black music and our special way of presenting it. We hope you enjoy.\n\nSuraya Mohamed | February 3, 2021\nCandles and books rest on a trunk at the bottom right corner of the wide shot. There, too, are special photographs of alto saxophonist Immanuel Wilkins with family in his childhood home in Philadelphia. \"One of the brightest things about this pandemic was going home to spend time with my mother, father and grandmother after being on the road for a while,\" Wilkins told NPR recently.\n\nHe also had time to meet up with his long time bandmates — Micah Thomas on piano, Daryl Johns on bass, Kweku Sumbry on drums —in Manhattan's Sear Sound studio to record this set. The quartet has been playing together for years, which is remarkable considering Wilkins is only 23 years old. In 2019, they recorded Wilkins' debut album, Omega, and released it last year to high acclaim. The project is all about Blackness, Black theory, the Black experience and the struggle and triumph that go with it all.\n\nWith a carefully crafted form and melody, \"Grace and Mercy\" is a lyrical story about peace, forgiveness and humility. \"Warriors\" is a driving, dynamic tune that conveys the shield of protection provided by our inner circles. \"The Dreamer\" is a tender piece that honors the Black writer and activist James Weldon Johnson and is based on his poem \"A Midday Dreamer.\" The opening lines are played effortlessly on bass by Johns and when Wilkins joins in, his melodic saxophone exudes the rhythm of the poem's first stanza: \"I love to sit alone, and dream, and dream, and dream...\"\n\nSET LIST\n\"Grace and Mercy\"\n\"Warriors\"\n\"The Dreamer\"\n\nMUSICIANS\nImmanuel Wilkins: saxophone\nDaryl Johns: bass\nMicah Thomas: piano\nKweku Sumbry: drums\n\nCREDITS\nVideo and Audio: Brandon Unpingco, Alessio Romano for Studio 42 Brooklyn and Chris Allen\nCreative Direction: Sekai Abeni, Machel Ross\nScenic Design: Frank Oliva, Rodrigo Fernandez\nLighting Consultant: Cheyenne Sykes\n\nTINY DESK TEAM\nProducer: Suraya Mohamed\nVideo Producer: Morgan Noelle Smith\nAudio Mastering: Josh Rogosin\nArt Director: CJ Riculan\nAssociate Producer: Bobby Carter\nTiny Production Team: Bob Boilen, Kara Frame, Maia Stern\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann", "link": "https://www.youtube.com/watch?v=aRgJlYnlJCM", "date_published": "2021-02-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "JLCO Septet with Wynton Marsalis: Tiny Desk (Home) Concert", "description": "NPR Music's Tiny Desk series will celebrate Black History Month by featuring four weeks of Tiny Desk (home) concerts and playlists by Black artists spanning different genres and generations each week. The lineup includes both emerging and established artists who will be performing a Tiny Desk concert for the first time. This celebration highlights the beautiful cornucopia of Black music and our special way of presenting it. We hope you enjoy.\n\nSuraya Mohamed | February 2, 2021\nWynton Marsalis and the Jazz At Lincoln Center Orchestra Septet recorded their Tiny Desk (home) concert at Dizzy's Club, or what they call \"the house of swing.\" It begins with \"Sloganize, Patronize, Realize, Revolutionize (Black Lives Matters),\" a bold statement about humanity and the consequences of racism. Marsalis says this piece — as well as the rest of the music on his new album, The Democracy! Suite -- deals with the timeless human issues we see exacerbated during the times of the pandemic, like social challenges and matters of the heart.\n\n\"Deeper than Dreams\" is a reverential piece Marsalis wrote for those who have lost loved ones during the pandemic. Marsalis knows this kind of pain all too well; he lost his father, the legendary pianist and jazz patriarch, Ellis Marsalis, to complications from COVID-19 last spring, and speaks affectionately of \"the times when our old folks come and sit with us in the spirit realm when we are sleeping.\"\n\nTo close, \"That Dance We Do (That You Love Too)\" is playful and funky and inspires a hopeful message, one that Marsalis says is \"for everybody who got out and got down during this time on behalf of freedom.\"\n\nMarsalis has been writing music about democracy and the call for justice for decades. \"I hope that the social and political corruption and turmoil of these times cast a light on the individual investment required to maintain a libertarian democracy,\" he wrote on his blog in January. \"May the events of these times inspire us all to engage even more deeply in the rights and responsibilities we have as citizens.\"\n\nSET LIST\n\"Sloganize, Patronize, Realize, Revolutionize (Black Lives Matters)\"\n\"Deeper Than Dreams\"\n\"That Dance We Do (That You Love Too)\"\n\nMUSICIANS\nWynton Marsalis: trumpet\nTed Nash: saxophone\nWalter Blanding: saxophone\nElliot Mason: trombone\nDan Nimmer: piano\nCarlos Henriquez: bass\nObed Calvaire: drums\n\nCREDITS\nVideo: Adam Meeks, Chloe Jury-Fogel, Arianna Shining Star Pane, James Sapione, Andrew Trost\nAudio: Rob Macomber, Todd Whitelock at Amplified Art and Sound\nCovid Compliance Officer: Domingo Cabrera\nMusic Supervisor: Christianna English\nProduction Coordinator: Michael Leslie\nLine Producer: Justin Bias\nLighting Director: Zakaria Al-Alami\n\nTINY DESK TEAM\nProducer: Suraya Mohamed\nVideo Producer: Morgan Noelle Smith\nAudio Mastering: Josh Rogosin\nArt Director: CJ Riculan\nAssociate Producer: Bobby Carter\nTiny Production Team: Bob Boilen, Kara Frame, Maia Stern\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann", "link": "https://www.youtube.com/watch?v=vWQTzN_Nj1A", "date_published": "2021-02-02 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]