[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Joy Oladokun: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nNikki Birch | August 20, 2021\nClad in a denim jacket, Joy Oladokun shines a light on the subjects of grief, politics and life in America via the lens of someone who looks and loves differently. Standing firmly in her vulnerability, the first-generation Nigerian American opens her studio performance with \"if you got a problem,\" a sweet ballad that pledges unconditional friendship through the lonely and the messy times. After a charming introduction, she picks up her guitar and begins \"taking the heat,\" which she dedicates to the late Mac Miller. The song examines the way we, as consumers, treat the artists who create the music that resonates with us: \"Does anybody ever wonder when the legends die young / If there's anything we could have done...\"\n\nOladokun's songwriting is brutally honest, yet inviting, as she fearlessly tackles tough topics. Musically, her folk-soul vibe is reminiscent of other great storytellers: Sam Cooke, John Lennon, Tracy Chapman. After cautioning us that we're strapped in for a \"deep dive into my mental health, or lack thereof,\" Oladokun continues to lance festering boils in \"i see america,\" a melancholic and optimistic exploration written as a response to the low value placed on American lives, be they Black or other. This Tiny Desk (home) concert concludes with \"sunday,\" a tale of identity crisis: \"Bury me under the weight of who you need me to be.\" While the theme is heavy, the delivery is uplifting, once again demonstrating how Oladokun's penetrating gaze into the human psyche yields beautiful storytelling in spite of the pain that surely inspired it.\n\nSET LIST\n\"if you got a problem\"\n\"taking the heat\"\n\"i see america\"\n\"sunday\"\n\nMUSICIANS\nJoy Oladokun: vocals, guitar\nTerence Clark: drums:\nJoshua Blaylock: keys\nJaime Woods: vocals\nEdison Lo: bass\nSolomon Dorsey: guitar, vocals, music director\n\nCREDITS\nDirector: Josh Kranich\nProducer: Maddy Hayes\nDirector of Photography: Seth Dunlap\nCamera Operator: Paris Silver\nGaffer: Ben Voorheen\nGrip: Cobi Noblin\nAudio: Jarrod Bright, Dustin Richardson, Pedro Calloni\nHair & Make Up: Cindy Rich\nProduction Assistants: Kevin Cecil, Lucas Eytchison\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bobby Carter, Kara Frame, Gabrielle Pierre\nExecutive Producer: Keith Jenkins\nSenior VP, Programming: Anya Grundmann\n\n#nprmusic #tinydesk #joyoladokun", "link": "https://www.youtube.com/watch?v=Ea9_egtJYMg", "date_published": "2021-08-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Tiny Desk Contest Top Shelf: Episode 5 with Jewly Hight", "description": "NPR Music received thousands of submissions to this year's Tiny Desk Contest, our annual search for the next great undiscovered artist to play a Tiny Desk concert. Before we announce this year's winner, this year's Contest judges are sharing their favorite entries in our weekly Tiny Desk Contest Top Shelf livestream series.\n\nEpisode 5 was hosted by Tiny Desk creator Bob Boilen and Jewly Hight of WNXP in Nashville.\n\nFeatured entries:\n\"Black\" by Calvin the II\n\"Jesus From Texas\" by Semler\n\"Ruby/Ruby Whistle Song\" by George Lovett\n\"Delorean\" by MI$HNRZ\n\"NEW LOVE\" by June Magnolia\n\nLearn more about the Tiny Desk Contest: https://npr.org/tinydeskcontest.\n\n\n#tinydesk #tinydeskcontest #tinydeskcontesttopshelf", "link": "https://www.youtube.com/watch?v=vvp2zUAS-fE", "date_published": "2021-08-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]