[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "12 Minutes of Black Myth: WuKong Official Unreal Engine 5 Gameplay Trailer", "description": "Check out 12 minutes of new gameplay for Black Myth: WuKong, the action-adventure game developed by Game Science, reveals its newest gameplay test collection today. The video is recorded real-time in Unreal 5 Engine, and supported by NVIDIA DLSS technology. \n\nBlack Myth: Wukong is an upcoming action role-playing game by Chinese indie developer Game Science, based on the classical 16th-century Chinese novel Journey to the West. Game Science hopes to release the game in 2023.\n\n#blackmythwukong #blackmyth #wukong", "link": "https://www.youtube.com/watch?v=m6T-YPdyttM", "date_published": "2021-08-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Ghost of Tsushima Director's Cut | Japanese Lip Sync Comparison", "description": "The PS5 version of Ghost of Tsushima now features proper Japanese lip sync. But how does it compare to the original PS4 version?\n\nA point of contention for some players during the release of Ghost of Tsushima was the lack of lip sync when playing with Japanese audio. Considering the game’s setting and how playing it in Japanese is featured as a selling point when you start the game, this exclusion did hurt those looking to experience the game this way.\n\nThis is because the original PS4 release of Ghost of Tsushima used pre-rendered cutscenes, which were so big, they could barely fit on the game disc. This didn’t leave the space for alternate cutscenes with different lip sync. In the PS5 version, The Director's Cut, the cutscenes rendered are in real-time. This allows room for Sucker Punch to add in Japanese lip sync.\n\nAs someone who played Ghost of Tsushima in Japanese this is by far my favorite new addition, it’s still not perfect in a few spots but it’s a massive improvement. Playing in Japanese, you don’t find yourself distracted by the lip sync the way you might have been previously. Watch this video for yourself to see the differences between the two versions.\n\n#ghostoftsushima", "link": "https://www.youtube.com/watch?v=jszehvdyGEQ", "date_published": "2021-08-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Halo Infinite Development Update (August)", "description": "Join members of the 343 Industries team for a discussion on key takeaways from the recent Multiplayer Technical Preview, updates on Halo Infinite’s overall development, and what to expect at launch.  \n\nSome key updates included campaign co-op and Forge getting delayed to post-launch, with the former tentatively arriving around three months after launch and the latter coming six months after launch. The game is still scheduled for a holiday release but no date has been confirmed.\n\n#haloinfinite #halo", "link": "https://www.youtube.com/watch?v=W7n1r2ftBKw", "date_published": "2021-08-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Naraka Bladepoint Review", "description": "In this video, we go over the GameSpot Review for Naraka Bladepoint which was done by Justing Clark. \n\nNaraka Bladepoint's sharp new take on the Battle Royale formula gets off to a promising, but slightly awkward start. \n\nIf absolutely nothing else, be grateful to Naraka Bladepoint for being one of a scant few battle royale titles where getting one-shotted by someone hiding in a shrub three football fields away isn't a danger. That by itself makes it welcoming in a way the genre tends to ignore. But lurking beneath that relative ease and approachability is a shrewd game of wuxia-inspired combat that demandsfar more steelfrom its players--and we're not just talking about swords and spears.\n\n#naraka #narakabladepoint", "link": "https://www.youtube.com/watch?v=NI-lVQi-r1I", "date_published": "2021-08-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "QuakeCon 2021 Day Two | Deathloop Dev Panel, ESO Dungeon Speed Runs, And More", "description": "QuakeCon continues with a Deathloop Developer Panel, an Elder Scrolls Online Dungeon Speed Run Competition, more Quake talk, Skyrim 10th Anniversary Panel, And More!\n\nSchedule:\n11:00AM PT - DEATHLOOP Meet its Makers\n12:30PM PT - WeRateDogs and Pete Hines Dog Chat\n1:00PM PT - Code Orange vs Quake\n2:00PM PT - Alienware - Fundraising and Raising Heck\n3:30PM PT - The Elder Scrolls Online Dungeon Speed Run Competition\n5:00PM PT - Exclusive Musical Performance by Trivium\n6:00PM PT - Skyrim 10th Anniversary - Interactive Fun Run with Gus Johnson\n\n#quakecon #bethesda", "link": "https://www.youtube.com/watch?v=X8DnknyOvvo", "date_published": "2021-08-20 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty Vanguard - Everything We Know", "description": "After checking out a preview event of Call of Duty Vanguard, (releasing November 5th) we're here to bring you everything we know about Sledgehammer's upcoming title. This includes the look and feel of the environments running on the MW engine, as well as what you can expect for campaign, zombies mode, multiplayer. \n\nWith Call of Duty Vanguard officially announced, GameSpot was able to check out a hands-off, digital event with loads of information about this year's Call of Duty title. Unfortunately, GameSpot wasn't able to capture footage or gameplay of the event, so this video will mostly feature captured footage and assets from previous Call of Duty games. \n\nCall of Duty Vanguard will be set in World War II but will not have ties to 2017's \"WWII\" story line. It'll feature a new story surrounding four allied soldiers across the globe, who eventually team up at the tail end of the second World War. The game will run on an updated version of the Modern Warfare engine and will feature new and returning modes and ways to play. A new mode that was discussed was \"Battle Hill\"- a mix of battle royal and gunfight modes. Zombies return with production led by Treyarch studios, and plans for an expansive origin story to Cold War's Zombies mode. Not much was mentioned in regards to multiplayer, but a separate even was announced for another time. Call of Duty Vanguard releases on November 5th 2021.\n\nAs more news surfaces about Call of Duty Vanguard, stick with GameSpot for the latest coverage, including dates for alpha and beta tests, trailers and more. GameSpot will also keep you up to date with the latest information about the ongoing California lawsuit against Activision/Blizzard.\n\n#cod #callofduty #callofdutyvanguard", "link": "https://www.youtube.com/watch?v=ThBtYsJh-RQ", "date_published": "2021-08-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty Vanguard Reveal Trailer", "description": "Check out the Call of Duty Vanguard Reveal Trailer unveiled during the in game Warzone event on 8.19.21.\n\n#CallOfDuty #Vanguard #CallOfDutyVanguard", "link": "https://www.youtube.com/watch?v=LE9ZqVo1NYc", "date_published": "2021-08-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty Vanguard Reveal in Warzone", "description": "See the first look at the new Call of Duty Vanguard, revealed in a special Warzone event. \n\n#callofduty #vanguard #warzone", "link": "https://www.youtube.com/watch?v=miXd0FUa_Ps", "date_published": "2021-08-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Did Call Of Duty: Vanguard Change Our Minds On WW2?", "description": "Call Of Duty: Vanguard will take players back to World War II when it releases on November 5, packing a whopping 20 maps, a new Warzone location, and the mysterious Champion Hill mode. In this video, Aaron and Richie talk over whether their initial apprehension for another WWII game was changed after the first developer reveal. \n\nCall Of Duty: Vanguard is Sledgehammer’s latest game and will take players back to World War II to experience the creation of special forces. Despite the rumors of being rushed, the game will launch with 20 maps, a new Warzone location, and a competitive Champion Hill mode. \n\nIn this video, we talk over the first Vanguard reveal event, where we saw a campaign mission, components of multiplayer, and some future competitive modes we can’t talk about yet. Richie and Aaron discuss the general community sentiment against a World War II setting and whether their own minds have been changed after this reveal. Some of the important points include the fact that Vanguard appears to channel the spirit of 2019’s \n\nModern Warfare with a huge focus on gunplay, gun modding, ammo conversions, and attachments. Multiplayer will include more destructible environments with lots of bullets tearing up levels and opening up sightlines as matches progress. Vanguard will also run on the Modern Warfare engine, meaning a smooth transition between the main game and Warzone. \nCall Of Duty: Vanguard releases on November 5 on all major platforms and will have a reveal in Warzone. We’re looking forward to a beta, a multiplayer-focused preview, and more information to come.\n\n#callofduty #vanguard #cod", "link": "https://www.youtube.com/watch?v=Q8lHPtX06JM", "date_published": "2021-08-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "First 10 Minutes of Ghost of Tsushima Iki Island Expansion PS5 Gameplay", "description": "Check out the first 10 minutes of Ghost of Tsushima Director's cut on the PS5 in 4K. We take on a group of mongels who are being controlled by a shaman. In doing so we find out why we must head to Iki Island. \n\nHe’s been there once before. And in confronting a new and dangerous enemy, he will be forced to face old fears, and unearth deeply buried traumas. As you explore a new island and battle new threats, you’ll also delve into the dark past of clan Sakai.\n\n#ghostoftsushima", "link": "https://www.youtube.com/watch?v=P_ydisw7jz0", "date_published": "2021-08-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Full Call of Duty: Vanguard - Warzone Reveal Event Gameplay", "description": "Call Of Duty: Warzone's Battle Of Verdansk event saw players chase an armored train, run from carpet bombing, and reveal the first Vanguard trailer.\n\n#vanguard #cod #callofduty", "link": "https://www.youtube.com/watch?v=0Gwne2wA4t4", "date_published": "2021-08-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Ghost of Tsushima Iki Island Expansion Review", "description": "The new chapter of Ghost of Tsushima adds to Jin's backstory in a way that makes it feel essential, while adding even more of the best stuff from the vanilla game.\n\nPhil Hornshaw spent about 12 hours exploring Iki Island, where he made sure to work through every dad issue, climb every mountain, and pet every animal. Review code was provided by the publisher.\n\n#ghostoftsushima #ikiisland", "link": "https://www.youtube.com/watch?v=zLWk0g3eRNk", "date_published": "2021-08-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Quake 2021 Full Presentation | Quakecon 2021", "description": "Kevin Cloud and Marty Stratton from id Software and Jerk Gustafsson from MachineGames help breakdown whats to come in the new Quake 2021. Learn more about multiplayer, local play, mods, and more.\n\n#quake #quakecon", "link": "https://www.youtube.com/watch?v=3Cs6orB5euE", "date_published": "2021-08-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Quake Official Trailer 2021", "description": "Experience the authentic, updated, and visually enhanced version of the original dark fantasy first-person shooter that inspires today’s retro-style FPS games. Play the full Quake campaign, including original and new expansion packs, plus enjoy online and local multiplayer and co-op with full crossplay support. Fight corrupted knights, deformed ogres and an army of twisted creatures and defeat the ancient evil that threatens all of humanity.\n\n#quake #quakecon", "link": "https://www.youtube.com/watch?v=8D8m-c6U8ew", "date_published": "2021-08-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "QuakeCon 2021 Day One | Quake, Deathloop, Doom Eternal Panels, And More", "description": "QuakeCon kicks off with a celebration of 25 years of Quake, a deep dive into Deathloop, panels on Fallout 76 and The Elder Scrolls Online, and an update on Doom Eternal from Marty and Hugo.\n\nSchedule:\n11:00 AM PT - Welcome to Quakecon 2021\n11:05 AM PT - Celebrating 25 years of Quake with id Software and Machine games\n11:30 AM PT - Deep Dive into DEATHLOOP with Arkane Lyon\n12:00 PM PT - Fallout 76: Making Appalachia\n12:30 PM PT - Inside the Award-Winning ZeniMax Online Studios\n1:00 PM PT - Reliving the Opening of Skyrim with the creators from BGS\n1:30 PM PT - DOOM Eternal Studio Update with Marty and Hugo\n\n#quakecon #bethesda", "link": "https://www.youtube.com/watch?v=6ZtUZKGCDew", "date_published": "2021-08-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]