[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Buck Meek: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nBob Boilen | March 25, 2021\nThe back of a van on a sunny day holding an acoustic guitar is a far cry from the usual setting where I'd see Buck Meek. More likely, I'd be in a dark club; Buck's intense electric guitar and backing vocals are a part of what makes up my favorite rock band these days, Big Thief. But here, home is Buck's Toyota Land Cruiser in Topanga Canyon, Calif.; Buck Meek is singing about the clouds and his favorite new word, pareidolia, which also happens to be the opening track to his 2021 album, Two Saviors.\n\nPareidolia is, as Buck Meek explains, \"this human instinct to put symbol to stimulus.\" He says, \"I've been spending this time of solitude in the canyon here spending a lot of time observing the clouds and things\" — in other words, finding shapes and objects in clouds and objects where none intended to exist and perhaps turning them into stories or songs or just letting your mind wander. The Texas native has a tender voice with a bit of a yodel and a resplendent way with words. After three songs from Two Saviors, Buck treats us to a new song written in quarantine titled \"The Undae Dunes,\" once again drawing pictures in the sky, this time of rockets and perhaps an astronaut and a love, all from the back of a Cruiser.\n\nSET LIST\n ▪ \"Pareidolia\"\n ▪ \"Two Saviors\"\n ▪ \"Halo Light\"\n ▪ \"The Undae Dunes\"\n\nMUSICIANS\n ▪ Buck Meek: vocals, guitar\n\nCREDITS\n ▪ Video and Audio: Scott Cornish\n\nTINY DESK TEAM\n ▪ Producer: Bob Boilen\n ▪ Video Producer: Maia Stern\n ▪ Audio Mastering: Josh Rogosin\n ▪ Associate Producer: Bobby Carter\n ▪ Tiny Production Team: Kara Frame\n ▪ Executive Producer: Lauren Onkey\n ▪ Senior VP, Programming: Anya Grundmann\n\n#buckmeek #tinydesk #nprmusic", "link": "https://www.youtube.com/watch?v=bOf3tD0sMxQ", "date_published": "2021-03-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]