[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Does Sony Care About Its Back Catalog? | Console Crew", "description": "Kurt Indovina joins the Console Crew to talk about the week that was for both Xbox and PlayStation, specifically in regards to Microsoft changing the name of Xbox Live and the reports that Sony will be shutting down the PS3, PSP, and PS Vita stores.\n\nThe Console Crew is back, with a new face temporarily joining its ranks. Kurt Indovina steps in to host the show while Lucy is away, joining Tamoor and Jordan to discuss the biggest console-related events of the week.\n\nThe trio start with a discussion about Xbox Live, which is now called Xbox network. The name change seems to precede plans that Microsoft has for transforming Xbox Live Gold, as Xbox Insiders are reporting that they've begun testing online multiplayer for free-to-play games, Looking 4 Groups, and party chat without the need to pay for them.\n\nFollowing all the Xbox talk, the group dives into a conversation about video game preservation, especially in the light of reports that Sony may be closing the online stores for PS3, PSP, and PS Vita. Tamoor gets a tad heated about it.\n\nConsole Crew is your weekly Friday roundup of the biggest news from PlayStation, Xbox, and Nintendo, hosted by Lucy James, Tamoor Hussain, and Jordan Ramée. Subscribe to youtube.com/GameSpot to never miss an episode.\n\n00:00 - Intro\n00:44 - Xbox Live is being renamed Xbox Network\n06:57 - Sony is reportedly shutting down the PSP, PS3, and Vita stores\n17:05 - Outro", "link": "https://www.youtube.com/watch?v=bmaV5buDiig", "date_published": "2021-03-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "How to Take Down the Tetranadon in Monster Hunter Rise", "description": "(Presented by Capcom) Monster Hunter Rise is aiming to be one of the most accessible entries in the series, but that doesn't mean you won't face a hearty challenge along the way! Here are our beginner tips for getting you on your monster hunting way!", "link": "https://www.youtube.com/watch?v=q_KC71zcW3M", "date_published": "2021-03-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "ID@Xbox Indie Showcase Livestream", "description": "Tune in as ID@Xbox teams up with Twitch Gaming to present a showcase with over a 100 games. The stream begins on March 26 at 9AM PT., when you'll see more of S.T.A.L.K.E.R 2 and The Ascent, among other games. DrinkBox, Curve Digital, Devolver Digital, Dear Villagers, and others will also show off their latest games.", "link": "https://www.youtube.com/watch?v=0L8_GAB3Efg", "date_published": "2021-03-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "If You Enjoyed Monster Hunter World You Need To Play Rise", "description": "Monster Hunter Rise is out, and Jean-Luc has already spent 30 hours with it. Here are his early thoughts on the latest entry in Capcom's series.", "link": "https://www.youtube.com/watch?v=JF9hMbDXwLs", "date_published": "2021-03-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Tony Hawk's Pro Skater 1 + 2 | PS4 Pro Vs PS5 Graphics and Loading Comparison", "description": "Check out the differences in visuals and loading times of the PS4 Pro and PlayStation 5 versions of Tony Hawk's Pro Skater 1 + 2.", "link": "https://www.youtube.com/watch?v=iK6ZrXpiNaw", "date_published": "2021-03-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "BAFTA Games Awards 2021", "description": "Tune into the 2021 BAFTA Game Awards to find out who wins Best Animation, Artistic Achievement, Audio Achievement, Best Game, British Game, Debut Game, Evolving Game, Family, Game Design, Game Beyond Entertainment, Multiplayer, Music, Narrative, Original Property, Performer in a Leading Role, Performer in a Supporting Role, Technical Achievement, and Game of the Year. The BAFTA Game Awards will be streamed on March 25, 12pm PDT.", "link": "https://www.youtube.com/watch?v=0cF_h6QN4Ww", "date_published": "2021-03-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "The Lord of the Rings: Gollum - Sneak Peek Trailer", "description": "Check out the official sneak peak trailer for The Lord of the Rings: Gollum presented by Daedalic Entertainment. The Lord of the Rings: Gollum is set to release sometime in 2022! \n\n#LOTR #Trailer #Gollum", "link": "https://www.youtube.com/watch?v=tIUaWAMUjSQ", "date_published": "2021-03-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Total War: Rome Remastered Announcement Trailer", "description": "Check out the Total War: Rome Remastered announcement trailer available for pre-order now on Steam. Total War: Rome Remastered is slated to come out April 29th, 2021! \n\n#Trailer #TotalWar #Steam", "link": "https://www.youtube.com/watch?v=RYhM04n7tvE", "date_published": "2021-03-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]