[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Apex Legends Season 8 – Mayhem Gameplay Trailer", "description": "Check out the all new Mayhem Gameplay Trailer for Apex Legends Season 8 coming this February, 2021!", "link": "https://www.youtube.com/watch?v=RPgFhhh3o38", "date_published": "2021-01-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Cyberpunk 2077 SPOILER Chat - Cyberpunk Update", "description": "The GameSpot staff shares their unfiltered thoughts on CD Projekt Red's latest RPG, Cyberpunk 2077.\n\nNow that Cyberpunk 2077 has been out in the wild for a few months, the GameSpot team is ready to dig in and give our full impressions of everything the game has to offer. Cyberpunk represents a huge world that changes somewhat based on your path through it, and Kallie, Jake, and Lucy come together on this Spoilercast to discuss how they went through the game, what they found, and what their impressions were as they got lost in the world of Night City.\n\nCheck out the video above for the full discussion, but be warned that nothing is off-limits--including side-missions and endings. Kallie, Jake, and Lucy go through their favorite moments in the game, what they liked and disliked about the characters, and how each of the endings struck them based on the story they uncovered. They also talk about the ways their lifepath choices impacted the game--or didn't.", "link": "https://www.youtube.com/watch?v=MRsmvhpsZto", "date_published": "2021-01-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Zelda BOTW Expert Breaks Down High Level Combat", "description": "Max “RinHara5aki” Blumenthal with over 2300+ hours experience with Breath of the Wild combat, breaks down a battle sequence so the technicals can be shown and explain the complexities of what is happening. His combat glossary in progress explains a great deal about the vastness of advanced combat in Breath of the Wild. https://docs.google.com/document/d/1qtYT06sxweRW3tRnovcCc-f4xIOGFNsD02pG1TzloHc/edit?usp=sharing\n\nBreath of the Wild still to this day continues to have new discoveries of techniques and secrets in combat, so we get our in-house expert to completely breakdown this crazy Lynel fight and explain what is going on.\n\nIn the video above Max runs down quick explanations of difficult techniques such as Daruk’s Shield Block Reset, Thunderclap Rushes, Perfect Daruk’s Rushes, and more. And also a bit of homework so you can do some simpler techniques for yourself at home.\n\nAs Peter Brown stated in The Legend of Zelda: Breath of the Wild’s review back in 2017, “Given the myriad enemies and weapons you're up against, mastery feels almost unattainable even with substantial practice. However, that also means you are constantly learning in the face of unforeseen challenges.”, giving Breath of the Wild a 10 out of 10.", "link": "https://www.youtube.com/watch?v=99iUK141o2o", "date_published": "2021-01-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]