[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Sevana: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nAbby O'Neill | January 26, 2021\nThese days it's nice to have an audience cheer you on, even if it's just the lighting crew. Burgeoning Jamaican soul singer Sevana and her six-piece band shot and recorded this Tiny Desk (home) concert at the Kingston Creative Hub back in September 2020 (the interludes you'll hear about the pandemic are reflective of that time). Sevana, a member of Protoje's In.Digg.Nation collective, showcases her vocal range by jumping delicately between traditional R&B, Caribbean gospel and soul, with touches of reggae interspersed.\n\nSevana was nervous for this shoot, but her humility and honesty shone through. On \"Blessed,\" an infectious ode about the miracle of life and faith, she welcomes us with open arms into her church and demonstrates the wide range of her multi-octave voice. She closes out the four-song set with her most recognizable tune, \"Mango,\" a dancehall-influenced love song. These Tropical percussive vibes are sure to send a surge of warmth and joy out to the masses, especially for all of those immersed in below-freezing temperatures in the dead of winter.\n\nSET LIST\n\"If You Only Knew\"\n\"Blessed\"\n\"Be Somebody\"\n\"Mango\"\n\nMUSICIANS\nSevana: vocals\nNicolas Groskoef: electric guitar\nAlmando 'Mundo Don' Douglas: electric guitar\nJean- Andre Lawrence: samples, effect\nRhoan Johnson: keys\nKawain Williamson: bass\nMark Reid: percussion\n\nCREDITS\nVideo: Yoram Savion Jik-Reuben Pringle Dennis Fyffe Shanice Mitchell Travis-John \"Habibi\" Bailey\nAudio: Fumiaki \"Superman\" Ogata, Whitson Williams, Keinotain Johnson, STT Entertainment and Production\n\nTINY DESK TEAM\nProducer: Abby O'Neill\nVideo Producer: Morgan Noelle Smith\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Bob Boilen, Kara Frame, Maia Stern\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann", "link": "https://www.youtube.com/watch?v=LMQp9x3hkMc", "date_published": "2021-01-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Future Islands: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nBob Boilen | January 25, 2021\nIt's been 10 years since the band Future Islands performed its first Tiny Desk concert. Now its four members are gathered not too far from their Baltimore base in Carroll Baldwin Memorial Hall, sans desk. \"We lost the desk,\" singer Sam Herring tells us with a smile. With drummer Michael Lowry on the tiny stage, the rest of the band — including bassist William Cashion and Gerrit Welmers on electronics — took to the floor, allowing Sam Herring to make his moves and sing his heart out. This music is clearly for the head and the feet.\n\nThe songs are from their sixth and very recent album, As Long As You Are. Along with themes of loneliness and love, we also hear songs about race, which is most evident in \"The Painter,\" a song about how we can all look at the same thing and see it so differently. We end with a song that came out shortly after visiting NPR in 2011 called \"Balance.\" It's one of those tunes that feels repurposed for the 2020s: \"This is a song for anybody who's struggling through their lives,\" Sam Herring says, \"and I know there are a lot of you all out there, just trying to get by, but it's going to take a little bit more time.\"\n\nSET LIST\n\"Hit the Coast\"\n\"The Painter\"\n\"Thrill\"\n\"Balance\"\n\nMUSICIANS\nSam Herring: vocals\nWilliam Cashion: bass\nGerrit Welmers: keyboards\nMichael Lowry: drums\n\nCREDITS\nVideo: Marisa Gesualdi\nAudio: Steve Wright of Wright Way Studios\nDirector: Marisa Gesualdi\nDirector of Photography: Jake DeNicola\nCameras: Jake DeNicola, Hil Steadman, Marisa Gesualdi\nEngineer: Paul Mercer\nMonitors Engineer: Matthew Ricchini\nCovid-19 Compliance Officer: Tosha Potter\nCovid-19 Compliance Assistant: Jerry Potter\nProduction Assistant: Melany Rochester\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Kara Frame, Morgan Noelle Smith\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann", "link": "https://www.youtube.com/watch?v=A8fbjYgGouM", "date_published": "2021-01-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]