[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Jazmine Sullivan: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nBobby Carter | January 8, 2021\nI don't recall any other artist at the Tiny Desk harmonizing their own introduction, but Philadelphia's own Jazmine Sullivan didn't waste a second, greeting us all by flexing those once-in-a-generation chops from the jump. The singer-songwriter, draped in a trench coat while her band sports all black, are nestled in the corner of a dimly lit space resembling a cabaret.\n\nWe don't see or hear much from Jazmine Sullivan until she has something to get off her chest. She drops a body of work every five years or so, shakes up the world of R&B with each offering, then quietly goes back to minding her own business. Her latest project, Heaux Tales, is a bold and timely conversation piece addressing truths regarding relationships, sex, social norms, self-worth and a myriad of other topics that women graple with. Each song is masterfully connected to another through unique yet familiar testimonies by women from all walks of life.\n\nShe starts her Tiny Desk (home) concert with three extended and reworked selections from Heaux Tales, squeezes in thee fan favorite from 2015's Reality Show, then invites Tiny Desk alum H.E.R. to the stage to close with \"Girl Like Me.\" Ms. Sullivan, her background vocalists and H.E.R. ate this performance up and left not a crumb on the floor.\n\nSET LIST\n\"Bodies (Intro)\"\n\"The Other Side\"\n\"Lost One\"\n\"Let It Burn\"\n\"Girl Like Me\" (featuring H.E.R.)\n\nMUSICIANS\nJazmine Sullivan: vocals\nH.E.R.: vocals\nAlisa Joe: vocals\nNatalie Curtis: vocals\nAyana George: vocals\nDave Watson: drums\nSimon Martinez: guitar\nJermaine Blandford: bass\nEric Wortham: keys\n\nCREDITS\nVideo: Mansa Twin Johnson, Mignotae Kebede, Evan Morsell\nAudio: Chauncey Burney\nCreative Director: Amaya Segura\nSet Design: Matthew Englebert\nExecutive Producer: Omari Williams\n\nTINY DESK TEAM\nProducer: Bobby Carter\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nTiny Production Team: Bob Boilen, Kara Frame, Morgan Noelle Smith\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann", "link": "https://www.youtube.com/watch?v=KgrCYvVYSRE", "date_published": "2021-01-08 00:00:00+00:00", "persistent": false, "user": "rumpel", "language": "en-US"}]