[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "9 Things We Want In Zelda: Breath Of The Wild 2", "description": "A sequel to The Legend of Zelda: Breath of the Wild is confirmed to be coming, so we take the time to look back at the series as a whole and think about what we'd want to see from the next installment.\n\nWe don't know much about the sequel to The Legend of Zelda: Breath of the Wild--we still don't even have a name for it yet. After releasing an announcement trailer for the game during E3 2019, Nintendo went radio silent. We'll hear more about the game once Nintendo is ready, but there's no indication of how soon that might be.\n\nIn the meantime, it's always fun to speculate and talk about what we hope to see in the new game. In the video above, Max Blumenthal details nine dreams for the Breath of the Wild sequel, ranging from who we want to play as to where we hope the game is ultimately set. It would be pretty cool to see the return of notable Legend of Zelda enemies and allies as well.\n\nIf you haven't yet seen the announcement trailer for Breath of the Wild's sequel, it's worth checking out. The trailer seems to imply that at least part of the game will take place in an underground-looking setting or perhaps a more traditional Legend of Zelda dungeon environment. You can also see Link and Zelda working side by side as opposed to Link soloing the adventure and Zelda tagging along as a disembodied voice. The withered husk of what looks like Ganon is present as well, as is imagery and sounds that may suggest a connection to the events and characters of Twilight Princess--one of the many Legend of Zelda games referenced in Breath of the Wild. But, admittedly, that's all conjecture.\n\nLike we said before, we don't really know anything about this game other than that it exists. So what are your hopes and dreams for Breath of the Wild's sequel? Leave your answers in the comments section below.\n\nTimestamps:\n0:00 Intro\n0:24 Partnerable Zelda\n0:56 Bring Back Traditional Items\n1:14 Nero Mechanics?\n1:35 Bring Back Traditional Dungeons\n1:56 More Story Focus \n2:50 New Explorable Areas\n3:19 Swimming Upgrades\n3:45 Return The Darknut\n4:05 Pet Dogs\n4:18 Outro", "link": "https://www.youtube.com/watch?v=wNUjaLb_YPM", "date_published": "2021-01-09 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Hitman 3 Gameplay - Assassination Mission", "description": "Hitman 3 is rapidly approaching its January 20 release date. Ahead of the game's launch, we had the opportunity to play a few sections of the game, and in a new video, you can watch as we infiltrate the gorgeous Burj Al-Ghazali and take down a series of targets in style.\n\nCheck out the full video to watch us sneak through the level's lovely-looking environments and do our best to go unnoticed as we track down targets and slip away. As with any good Hitman experience, things get tense and nerve-wracking at times, as the action escalates to a dramatic conclusion. \n\nHitman 3 launches on January 20 for PS4, Xbox One, and PC, while the game will also be available on PlayStation 5 and Xbox Series X. Keep checking back with GameSpot for more, including additional written and video content, along with our full review.", "link": "https://www.youtube.com/watch?v=Fw-eMSfBefU", "date_published": "2021-01-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Hitman 3 Is More Hitman, And That's Bloody Great", "description": "Jean-Luc and Phil got hands-on with the first two missions of Hitman III, the first major release of 2021.\n\nThe final game in the Hitman World of Assassination trilogy is nearly upon us. Hitman 3 will be hitting all major platforms, including the PS5 and Series X/S, on January 20, but Jean-Luc Seipke and Phil Hornshaw got an early hands-on preview with the game.\n\nIn this video, they talk about their experience with the first two levels, one taking place in a luxurious skyscraper in Dubai and the other involving a classic murder mystery in a European mansion. At its core, Hitman 3 doesn't stray far from what's come before, but our experience with these levels show that IO Interactive still knows how to craft some fantastic sandboxes for Agent 47 to play in.\n\nIf you’re interested in reading more about Hitman 3, check out Phil’s written preview, where he goes more in depth on the game’s second mission. And make sure to stay tuned to GameSpot for our full coverage of Hitman 3 when the game releases in a few weeks.", "link": "https://www.youtube.com/watch?v=e5CRrnvRS5I", "date_published": "2021-01-08 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]