[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "KDE Connect on Windows and iOS, Nvidia open sources stuff, and FOSS can be profitable - Linux News", "description": "Get your free proof of concept for TuxCare: https://www.tuxcare.com\n\n\n\nGet your free SysAdmin ebook: https://bit.ly/SysAdmin-Day-2021\n\n\n\nGet your Linux desktop or laptop here: https://slimbook.es/en/\n\n\n\nIn this one, we have Nvidia open sourcing more of their toolchain, Odoo proving that open source software can be not only profitable, but also successful, KDE connect expanding on Windows, and on iOS, and the Linux gaming landscape being quite redefined by the steam deck's announcement. \n\n\n\nBecome a channel member to get access to a weekly patroncast and vote on the next topics I'll cover:\nhttps://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nSupport the channel on Patreon: \nhttps://www.patreon.com/thelinuxexperiment\n\nFollow me on Twitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\nFollow me on ODYSEE: https://odysee.com/@TheLinuxExperiment:e\nOr join ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\n\n\n\n00:00 Intro\n01:57 Linux News\n03:24 Open Source News\n05:20 Apps News\n06:40 Privacy News\n08:10 Gaming News\n\n\n\n\n## Linux\n\nThe open3D engine, donated by Amazon to the Linux foundation, is making progress towards Linux support.\nhttps://www.gamingonlinux.com/2021/07/didnt-take-long-the-linux-editor-for-the-open-3d-engine-sees-great-progress\n\nThe Kythera AI system also announced that they would support this open engine\nhttps://www.gamingonlinux.com/2021/07/open-3d-engine-o3de-gets-real-close-to-properly-working-linux-support-free-kythera-ai\n\nIf you like the idea behind Flatpak, now you can directly contribute to it, to help it move faster.\nhttps://opencollective.com/flatpak#category-BUDGET\n\n## Open Source\nNvidia has open sourced more of their gameworks tools, including the RTX Memory Utility SDK, which allows to manage memory when using DirectX ray tracing or Vulkan ray tracing, or NVRHI, which is a library that implements a common abstraction layer for Windows and Linux, over multiple graphic APIs, like DirectX and Vulkan. \nhttps://www.gamingonlinux.com/2021/07/nvidia-has-open-sourced-more-of-gameworks-with-linux-support\n\nAdobe joined the Blender Development fund, as a corporate gold member, which means they're giving at least 30 000 dollars a month to help fund the development of the open source 3D modeling, and rendering tool.\nhttps://www.blender.org/press/adobe-joins-blender-development-fund/\n\nOdoo, an open source ERP and CRM solution, has received 180 Million dollar in funding from Summit Partners. \nhttps://www.odoo.com/blog/odoo-news-5/odoo-is-now-a-unicorn-so-what-784\n\n## Apps\n\nKDE Connect is now available directly from the Windows store. \nhttps://www.omgubuntu.co.uk/2021/07/kde-connect-windows-app\n\nIt looks like KDE Connect on iOS might be a thing in the future.\nhttps://lucaswangzx.xyz/kde_list/kde_0_restarting_kde_connect\n\n## Privacy\nDuck Duck go launched a new service designed to protect your email address from trackers. It's called email protection, and it works by giving you a @duck.com email address that basically just forwards all email you get to your real email address, after removing all the email trackers.\nhttps://www.spreadprivacy.com/introducing-email-protection-beta/\n\nAmazon got slapped with a huge fine of 887Million dollars, for not complying with the EU's GDPR, their set of laws to ensure that companies don't collect and use data that users haven't opted in to communicate. \nhttps://thenextweb.com/news/eu-fines-amazon-record-887m-ad-targetting-gdpr-violation\n\n## Gaming\nAt their annual press conference, Ubisoft got asked about the Steam Deck. They didn't commit to anything, but they did say that if the Steam Deck became big, they would definitely port their software to it. \nhttps://www.gamingonlinux.com/2021/07/ubisoft-are-keeping-an-eye-on-the-steam-deck-will-release-on-it-if-its-big-enough\n\nWine 6.13 was released\nhttps://www.winehq.org/announce/6.13\n\nA few days later, Wine 6.14 was released\nhttps://www.winehq.org/announce/6.14\n\nValve talked about the Steam Deck a bit more in a video interview on IGN, saying that all the games they wanted to be playable, were running at 30fps and more at the device's native resolution of 1280x800. \nhttps://arstechnica.com/gaming/2021/07/valve-promises-steam-deck-will-run-the-entire-steam-library-at-30-fps/\n\nDXVK 1.9.1 was released, fixing a bunch of performance and stability issues that they had introduced with the rewrite of some DirectX9 implementations previously.\nhttps://github.com/doitsujin/dxvk/releases\n\nFeral, a well know game developer that has ported a lot of games to Linux, including the Tomb Raider series, and a lot of Total War games, has announced that they wouldn't work on a port of Total War Troy to Linux.\nhttps://www.gamingonlinux.com/2021/07/feral-no-longer-porting-a-total-war-saga-troy-to-linux-citing-less-demand-since-proton", "link": "https://www.youtube.com/watch?v=ZMFoI9RtYf8", "date_published": "2021-08-01 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]