[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "47 Ways To Hit Men In Hitman 3", "description": "We round up 47 of the best ways to take down your targets (as well as anyone else who gets in your way) in Hitman 3.\n\nHitman 3 is out now, bringing IO’s World of Assassination trilogy to a close. So to celebrate we’ve rounded up 47 of our favourite ways for Agent 47 to take down his targets.\n\nLet us know your favourites in the comments below!", "link": "https://www.youtube.com/watch?v=c7UizHVauaQ", "date_published": "2021-01-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Nobody Is Happy With Call Of Duty Right Now", "description": "How a great idea to merge Call Of Duty: Black Ops Cold War, Warzone, and Modern Warfare lead to confusing purchases, overpowered guns, and challenges that didn’t please either audience.\n\nCall Of Duty recently merged progression, a season pass, and some guns across Cold War, Warzone, and Modern Warfare. In theory, it was a great idea that would allow any Call Of Duty player to engage in any mode and carry progress across games. In reality Call Of Duty: Black Ops Cold War is a more traditional Call Of Duty title with a different audience from the mil-sim inspired Modern Warfare, so the merger has resulted in Warzone challenges that don’t appeal to Cold War players, erased or made meaningless progress for Modern Warfare players, overpowered guns like the Mac-10 and DMR 14 in Warzone, and created unlocks that some players can’t use unless they purchased the other title. \n\nIn this video, we talk about what we feel Activision was trying to achieve, why it’s a good idea in theory, why it isn’t working yet, and what they can focus on next. Call Of Duty titles published by Activision are developed by multiple studios including Infinity Ward, Treyarch, Raven Software, and Sledgehammer Games. This is the first time progress has been linked across two separate games and a standalone free-to-play battle-royale. We have yet to see if this shared ecosystem will be used moving forward for all Call Of Duty titles, but there are lessons to be learned either way.", "link": "https://www.youtube.com/watch?v=VZKZ6EGMqbY", "date_published": "2021-01-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "What The Heck Is Going On With GameStop", "description": "GameStop's stock value has been all over the place the past few days. On this week's episode of GameSpot After Dark, the crew tries to make sense of it.", "link": "https://www.youtube.com/watch?v=-drUMk9btFs", "date_published": "2021-01-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Firebase Z Trailer | Season One | Call of Duty: Black Ops Cold War", "description": "Check out the all new Firebase Z Trailer for Call of Duty: Black Ops Cold War. \n\nOnly death awaits in \"Firebase Z.\" Following the events of \"Die Maschine,\" Requiem's next mission brings them deep into the jungles", "link": "https://www.youtube.com/watch?v=M87GiZMAd5A", "date_published": "2021-01-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil Village: Everything You Need to Know", "description": "Thanks to Capcom’s recent Resident Evil showcase, we learned lots of juicy details about the upcoming Resident Evil 8, known as Resident Evil Village. We got our first look at gameplay and have a clearer picture of the game’s plot as well as some of its villains.\n\nIn this video, Jean-Luc breaks down all the important details you need to know about Village. When is it coming out? How does this tie into Resident Evil 7? And what's the deal with that tall vampire lady that keeps showing up on my social media feed? All of these questions and more are answered.\n\nCapcom also released the PS5 exclusive Maiden demo, which acts as a visual showcase for Village. If you don’t own a PS5 and would like to see the demo for yourself, we captured the whole thing and you can watch it right here on our YouTube channel. Make sure to come back to GameSpot for more Resident Evil Village coverage as we get closer to the game’s May 7th release for PS5, Xbox Series X/S, PC as well as PS4 and Xbox One.", "link": "https://www.youtube.com/watch?v=rmoMVJIeAao", "date_published": "2021-01-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]