[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Muzz: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nBob Boilen | January 29, 2021\nMuzz are dear, old friends who make fuzzy, thoughtful songs. So when they gathered at Reade's Old Kingston Theater in New York's Hudson Valley after seven months of separation, minus hugs and wearing masks, I trust it was joyful but also kind of awkward.\n\nPaul Banks and Josh Kaufman have known each other since childhood. You likely know Paul Banks as the singer for Interpol; Josh Kaufman is a producer and one-third of Bonny Light Horseman. They are both friends with drummer Matt Barrick, who played a Tiny Desk concert in 2012 with his band The Walkmen.\n\nThe songs here come from the trio's excellent self-titled debut album. Josh Kaufman told me via email that \"Paul was stuck in Glasgow and Matt and I were quarantining with families in Philadelphia and Brooklyn, respectively. At the very end of a long couple of days of rehearsal and taping, we — very late at night, Paul jet-lagged and the rest plain exhausted — stayed awake a little longer to try a campfire style strum along to some of the songs from our new LP. The result here is our Tiny Desk.\"\n\nSET LIST\n\"Bad Feeling\"\n\"Knuckleduster\"\n\"Trinidad\"\n\"Summer Love\"\n\nMUSICIANS\nJosh Kaufman: guitar\nMatt Barrick: drums, percussion, keys\nPaul Banks: vocals, guitar\n\nCREDITS\nVideo/Recording/Mixing: D. James Goodwin\nColor: Derek Horani\nEditing: Paul Banks\n\nTINY DESK TEAM\nProducer: Bob Boilen\nVideo Producer: Morgan Noelle Smith\nAudio Mastering: Josh Rogosin\nAssociate Producer: Bobby Carter\nTiny Production Team: Kara Frame, Maia Stern\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann", "link": "https://www.youtube.com/watch?v=nIiR7Tsypo4", "date_published": "2021-01-29 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Miley Cyrus: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nMiley Cyrus has always understood that music is theater. So it's no surprise that, visiting the imaginative space that is the Tiny Desk, she transforms it into something both fantastical and true to her topsy-turvy Mileyness.\n\nCyrus ruled preteen hearts on the small screen before mastering pop stardom's big stages, and throughout her career she's played with sound and image in unexpected and even controversial ways. And she's never balanced pop's glorious artifice with her own soulful authenticity more self-assuredly than she does on her latest album, the rock and roll manifesto Plastic Hearts.\n\nHere, the scene opens with Cyrus, dressed head to toe in rock-star faux fur, in what looks like a teenage girl's bedroom. But the perspective in this pink-and-purple space feels a little ... odd. As Cyrus sings, it becomes clear that this is her Wonderland – like Alice full of magical cake, she's grown to exceed her surroundings. By the end of this three-song set, Cyrus reveals that it's the adolescent enclave that grew too small for her, not the other way around.\n\nThe songs Cyrus offers are as direct and affecting as the set is whimsical. Cyrus has lately proven herself one of pop's great interpretive vocalists, and she scores another triumph with her version of Mazzy Star's \"Fade Into You,\" a hazy psychedelic anthem that she infuses with just the edge of the next day's hangover. The two songs from Plastic Hearts that follow are her own bids at classic-rock timelessness. In \"Golden G-String\" Cyrus assesses her own life in the spotlight with Leonard Cohen-esque charm. And \"Prisoner\" is the power ballad that lets Cyrus really break out – as she leaves the tiny room — just a box, it turns out, on a soundstage – and joins her band, she's as free and self-confident as she's ever been.\n\nSET LIST\n\"Fade Into You\"\n\"Golden G-String\"\n\"Prisoner\"\n\nMUSICIANS\nMiley Cyrus: vocals\nStacy Jones: drums\nMike Schmid: keys\nMax Bernstein: guitar\nJamie Arentzen: guitar\nJoe Ayoub: bass\n\nCREDITS\nProducer: Johnny Pascucci\nDirector: Alana O'Herlihy\nAssistant Director: Steve Bagnara\nDirector of Photography: Jordan Ritz\nSet Design: Eamonn McGlynn\nSound Tech: Johnny Karlsson\nFOH/Broadcast Engineer: Paul Hager\n\nTINY DESK TEAM\nProducers: Bob Boilen, Bobby Carter\nVideo Producer: Morgan Noelle Smith\nAudio Mastering: Josh Rogosin\nTiny Production Team: Kara Frame, Maia Stern\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann", "link": "https://www.youtube.com/watch?v=W5-yezpcZNU", "date_published": "2021-01-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]