[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCmGSJVG3mCRXVOP4yZrU1Dw", "title": "How China Became So Powerful", "description": "It's a story of a certain type of capitalism \nIf you want to learn more,  check out this article from the WEF https://bit.ly/39s92kl or for a deeper dive, the full book was published yesterday (I've read it. it's good!): https://amzn.to/3ordkwC\nThis video is a story about China, past to present. But in telling the story of the Rise of China (and Asia generally), it's impossible to not talk about fundamental lessons that have emerged. In this video I try to tell the story but then also look back and at the result of it all. To examine the data and see what effects our global economic system has had on people and the planet. The data is clear that our model of capitalism has some major winners. But it also produces some important losers, those who have lost out or have been damaged by these trends. One major loser of the this system is the future generations of people who will live on a planet with more extreme and volatile weather and ocean patterns. All of this calls for a rethinking of our capitalism. Not to scrap it all together, but to upgrade it to a version that benefits all of society and doesn't threaten our planet and future generations. \nThanks for watching. \n-Johnny\n\n- ways to support - \nMy Patreon: https://www.patreon.com/johnnyharris\nOur custom Presets & LUTs: https://store.dftba.com/products/johnny-iz-luts-and-presets\n\n- where to find me -\nInstagram: https://www.instagram.com/johnny.harris/\nTiktok: https://www.tiktok.com/@johnny.harris\nFacebook: https://www.facebook.com/JohnnyHarrisVox\nIz's (my wife’s) channel: https://www.youtube.com/iz-harris\n\n- how i make my videos -\nTom Fox makes my music, work with him here: https://tfbeats.com/\nI make maps using this AE Plugin: https://aescripts.com/geolayers/?aff=77\nAll the gear I use: https://www.izharris.com/gear-guide\n \n- my courses - \nLearn a language: https://brighttrip.com/course/language/\nVisual storytelling: https://www.brighttrip.com/courses/visual-storytelling\n\n- about -\nJohnny Harris is a filmmaker and journalist. He currently is based in Washington, DC, reporting on interesting trends and stories domestically and around the globe. Johnny's visual style blends motion graphics with cinematic videography to create content that explains complex issues in relatable ways. He holds a BA in international relations from Brigham Young University and an MA in international peace and conflict resolution from American University.\n\n- press - \nNYTimes: https://www.nytimes.com/2021/11/09/opinion/democrats-blue-states-legislation.html\nNYTimes: https://www.nytimes.com/video/opinion/100000007358968/covid-pandemic-us-response.html\nVox Borders: https://www.youtube.com/watch?v=hLrFyjGZ9NU\nFinding Founders: https://findingfounders.co/episodes/johnny-harris-2esj3-c3pet-2pg4c-xbtwa-5gaaa\nNPR Planet Money: https://www.npr.org/transcripts/1072164745", "link": "https://www.youtube.com/watch?v=qw-FLc7Z01Q", "date_published": "2021-01-28 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]