[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Sampa The Great: Tiny Desk (Home) Concerts", "description": "NPR Music's Tiny Desk series will celebrate Black History Month by featuring four weeks of Tiny Desk (home) concerts and playlists by Black artists spanning different genres and generations each week. The lineup includes both emerging and established artists who will be performing a Tiny Desk concert for the first time. This celebration highlights the beautiful cornucopia of Black music and our special way of presenting it. We hope you enjoy.\n\nLaTesha Harris | February 23, 2021\n\"Freedom is what we feel when we perform. And freedom is what the world is in need of right now. In this pandemic it feels like we all need a sense of freedom.\" Sampa Tembo is in Lusaka, Zambia, her landlocked African home country. She's better known as Sampa The Great, an understated title. In her Tiny Desk (home) concert, the poet, rapper and singer-songwriter delivers evidence that it's more like Sampa the Greatest.\n\nHer set is rich with earth's abundances. She performs \"Rhymes To The East,\" \"Mwana,\" \"Freedom\" and \"Final Form\" — the latter three off 2019's The Return — surrounded by life. Warmth pours in from exuberant trilling, zealous drums and her seven-piece band's loose movements. Dressed in warm oranges and muted browns and wearing a crown resembling red clay, Sampa is Mother Earth herself.\n\nInitially raised in Botswana, Sampa moved to Australia as a young adult and established herself in Sydney's hip-hop scene. There, she released two mixtapes, 2015's The Great Mixtape and 2017's award-winning Birds and the BEE9, all the while generating buzz. She had been based in Melbourne for the last four years, but the next chapter of her musical journey will find her at home in Zambia.\n\nAs displayed in her Tiny Desk, Sampa's artistic strength comes from the ease with which she cultivates connectivity. Music becomes a mode of generative healing that she shares with her bandmates, some of Lusaka's best musicians, collaborators and audience. It's the type of energy people need in this moment: precious and infinite.\n\nSET LIST\n\"Rhymes To The East\"\n\"Mwana\"\n\"Freedom\"\n\"Final Form\"\n\nMUSICIANS\nSampa The Great: vocals\nLazarus \"Lalo\" Zulu: keys\nKasonde \"Tek1\" Sunkutu: drums\nMapalo \"Mapskeys\" Mapalo: bass\nSamuel Masta: guitar\nMwanje Tembo: vocals\nTio Nason: vocals\nJoy Tusankine Namwila: vocals\n\nCREDITS\nVideo: Carl Pires, The Nativez Media, Geo Musiwa, Isaac Tuba, Andrew Zulu\nAudio: Ben Kalulu, Andrei Eremin\n\nTINY DESK TEAM\nProducers: Abby O'Neill\nVideo Producer: Morgan Noelle Smith\nAudio Mastering: Josh Rogosin\nArt Director: CJ Riculan\nAssociate Producer: Bobby Carter\nTiny Production Team: Bob Boilen, Kara Frame, Maia Stern\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann", "link": "https://www.youtube.com/watch?v=svxhRbzGpMU", "date_published": "2021-02-23 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC4eYXhJI4-7wSWc8UNRwD4A", "title": "Bartees Strange: Tiny Desk (Home) Concert", "description": "The Tiny Desk is working from home for the foreseeable future. Introducing NPR Music's Tiny Desk (home) concerts, bringing you performances from across the country and the world. It's the same spirit — stripped-down sets, an intimate setting — just a different space.\n\nLars Gotrich | February 22, 2021\nBartees Strange and his band are in a basement, surrounded by electrical wiring and DIY sound-proofing, but also green plants that no doubt have names. In Falls Church, Va., the indie rocker is a stone's throw from the much-missed Tiny Desk space in D.C., yet offers a set just as cozy and crammed.\nJust a cursory listen of Live Forever, one of NPR Music's 50 Best Albums of 2020, reveals a seeker with several destinations in mind: hip-hop bombast meets sprawling indie-rock riffs and mind-numbing electronic beats. \"Sonically it doesn't make sense,\" Bartees Strange told NPR Music, \"but it makes sense because it's me and I think that's like an important part of music – the person.\"\nFor his Tiny Desk, Bartees Strange keeps the bluesy rock and roll bravado of \"Boomer\" and the loping smooveness of \"Mustang,\" stripping down the drum kit to include a sheet music stand as an extra cymbal. In between songs, he shouts out the musicians giving him joy lately: Yves Tumor and The National's Aaron Dessner, whom he calls \"the indie rock Michael Jordan.\"\nIt's in the back half where Bartees Strange does the switch-up, as \"In A Cab\" flows seamlessly into \"Flagey God.\" On record, these are louder and noisier songs that explore very different sides of his 20-sided die, but here, they become laid-back jazz club jams, deceptive in their ease, but beautifully ornate as the arrangements open up to his world.\nSET LIST\n\"Boomer\"\n\"Mustang\"\n\"In A Cab\"\n\"Flagey God\"\nMUSICIANS\nBartees Strange: vocals, guitar\nGraham Richman: keys\nJohn Daise: bass\nDan Kleederman: guitar\nCarter Zumtobel: drums\nCREDITS\nVideo: Britain Weyant\nAudio: Chris Connors, Bartees Strange\nAssistant Camera Op: Luke Piotrowski\nTINY DESK TEAM\nProducers: Lars Gotrich, Bobby Carter\nVideo Producer: Maia Stern\nAudio Mastering: Josh Rogosin\nArt Director: CJ Riculan\nTiny Production Team: Bob Boilen, Kara Frame, Morgan Noelle Smith\nExecutive Producer: Lauren Onkey\nSenior VP, Programming: Anya Grundmann", "link": "https://www.youtube.com/watch?v=8xoYo-rU_Xs", "date_published": "2021-02-22 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]