[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty Vanguard - Everything We Know", "description": "After checking out a preview event of Call of Duty Vanguard, (releasing November 5th) we're here to bring you everything we know about Sledgehammer's upcoming title. This includes the look and feel of the environments running on the MW engine, as well as what you can expect for campaign, zombies mode, multiplayer. \n\nWith Call of Duty Vanguard officially announced, GameSpot was able to check out a hands-off, digital event with loads of information about this year's Call of Duty title. Unfortunately, GameSpot wasn't able to capture footage or gameplay of the event, so this video will mostly feature captured footage and assets from previous Call of Duty games. \n\nCall of Duty Vanguard will be set in World War II but will not have ties to 2017's \"WWII\" story line. It'll feature a new story surrounding four allied soldiers across the globe, who eventually team up at the tail end of the second World War. The game will run on an updated version of the Modern Warfare engine and will feature new and returning modes and ways to play. A new mode that was discussed was \"Battle Hill\"- a mix of battle royal and gunfight modes. Zombies return with production led by Treyarch studios, and plans for an expansive origin story to Cold War's Zombies mode. Not much was mentioned in regards to multiplayer, but a separate even was announced for another time. Call of Duty Vanguard releases on November 5th 2021.\n\nAs more news surfaces about Call of Duty Vanguard, stick with GameSpot for the latest coverage, including dates for alpha and beta tests, trailers and more. GameSpot will also keep you up to date with the latest information about the ongoing California lawsuit against Activision/Blizzard.\n\n#cod #callofduty #callofdutyvanguard", "link": "https://www.youtube.com/watch?v=ThBtYsJh-RQ", "date_published": "2021-08-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty Vanguard Reveal Trailer", "description": "Check out the Call of Duty Vanguard Reveal Trailer unveiled during the in game Warzone event on 8.19.21.\n\n#CallOfDuty #Vanguard #CallOfDutyVanguard", "link": "https://www.youtube.com/watch?v=LE9ZqVo1NYc", "date_published": "2021-08-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Call of Duty Vanguard Reveal in Warzone", "description": "See the first look at the new Call of Duty Vanguard, revealed in a special Warzone event. \n\n#callofduty #vanguard #warzone", "link": "https://www.youtube.com/watch?v=miXd0FUa_Ps", "date_published": "2021-08-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Did Call Of Duty: Vanguard Change Our Minds On WW2?", "description": "Call Of Duty: Vanguard will take players back to World War II when it releases on November 5, packing a whopping 20 maps, a new Warzone location, and the mysterious Champion Hill mode. In this video, Aaron and Richie talk over whether their initial apprehension for another WWII game was changed after the first developer reveal. \n\nCall Of Duty: Vanguard is Sledgehammer’s latest game and will take players back to World War II to experience the creation of special forces. Despite the rumors of being rushed, the game will launch with 20 maps, a new Warzone location, and a competitive Champion Hill mode. \n\nIn this video, we talk over the first Vanguard reveal event, where we saw a campaign mission, components of multiplayer, and some future competitive modes we can’t talk about yet. Richie and Aaron discuss the general community sentiment against a World War II setting and whether their own minds have been changed after this reveal. Some of the important points include the fact that Vanguard appears to channel the spirit of 2019’s \n\nModern Warfare with a huge focus on gunplay, gun modding, ammo conversions, and attachments. Multiplayer will include more destructible environments with lots of bullets tearing up levels and opening up sightlines as matches progress. Vanguard will also run on the Modern Warfare engine, meaning a smooth transition between the main game and Warzone. \nCall Of Duty: Vanguard releases on November 5 on all major platforms and will have a reveal in Warzone. We’re looking forward to a beta, a multiplayer-focused preview, and more information to come.\n\n#callofduty #vanguard #cod", "link": "https://www.youtube.com/watch?v=Q8lHPtX06JM", "date_published": "2021-08-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "First 10 Minutes of Ghost of Tsushima Iki Island Expansion PS5 Gameplay", "description": "Check out the first 10 minutes of Ghost of Tsushima Director's cut on the PS5 in 4K. We take on a group of mongels who are being controlled by a shaman. In doing so we find out why we must head to Iki Island. \n\nHe’s been there once before. And in confronting a new and dangerous enemy, he will be forced to face old fears, and unearth deeply buried traumas. As you explore a new island and battle new threats, you’ll also delve into the dark past of clan Sakai.\n\n#ghostoftsushima", "link": "https://www.youtube.com/watch?v=P_ydisw7jz0", "date_published": "2021-08-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Full Call of Duty: Vanguard - Warzone Reveal Event Gameplay", "description": "Call Of Duty: Warzone's Battle Of Verdansk event saw players chase an armored train, run from carpet bombing, and reveal the first Vanguard trailer.\n\n#vanguard #cod #callofduty", "link": "https://www.youtube.com/watch?v=0Gwne2wA4t4", "date_published": "2021-08-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Ghost of Tsushima Iki Island Expansion Review", "description": "The new chapter of Ghost of Tsushima adds to Jin's backstory in a way that makes it feel essential, while adding even more of the best stuff from the vanilla game.\n\nPhil Hornshaw spent about 12 hours exploring Iki Island, where he made sure to work through every dad issue, climb every mountain, and pet every animal. Review code was provided by the publisher.\n\n#ghostoftsushima #ikiisland", "link": "https://www.youtube.com/watch?v=zLWk0g3eRNk", "date_published": "2021-08-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Quake 2021 Full Presentation | Quakecon 2021", "description": "Kevin Cloud and Marty Stratton from id Software and Jerk Gustafsson from MachineGames help breakdown whats to come in the new Quake 2021. Learn more about multiplayer, local play, mods, and more.\n\n#quake #quakecon", "link": "https://www.youtube.com/watch?v=3Cs6orB5euE", "date_published": "2021-08-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Quake Official Trailer 2021", "description": "Experience the authentic, updated, and visually enhanced version of the original dark fantasy first-person shooter that inspires today’s retro-style FPS games. Play the full Quake campaign, including original and new expansion packs, plus enjoy online and local multiplayer and co-op with full crossplay support. Fight corrupted knights, deformed ogres and an army of twisted creatures and defeat the ancient evil that threatens all of humanity.\n\n#quake #quakecon", "link": "https://www.youtube.com/watch?v=8D8m-c6U8ew", "date_published": "2021-08-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "QuakeCon 2021 Day One | Quake, Deathloop, Doom Eternal Panels, And More", "description": "QuakeCon kicks off with a celebration of 25 years of Quake, a deep dive into Deathloop, panels on Fallout 76 and The Elder Scrolls Online, and an update on Doom Eternal from Marty and Hugo.\n\nSchedule:\n11:00 AM PT - Welcome to Quakecon 2021\n11:05 AM PT - Celebrating 25 years of Quake with id Software and Machine games\n11:30 AM PT - Deep Dive into DEATHLOOP with Arkane Lyon\n12:00 PM PT - Fallout 76: Making Appalachia\n12:30 PM PT - Inside the Award-Winning ZeniMax Online Studios\n1:00 PM PT - Reliving the Opening of Skyrim with the creators from BGS\n1:30 PM PT - DOOM Eternal Studio Update with Marty and Hugo\n\n#quakecon #bethesda", "link": "https://www.youtube.com/watch?v=6ZtUZKGCDew", "date_published": "2021-08-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "12 Minutes and Psychonauts 2 | Xbox Game Pass Show", "description": "Learn about what's new, what's leaving, and what you should be playing on Game Pass. \n\nThis is your Game Pass digest for August 17, 2021. Game Pass has a lot of games, and twice a month there's more coming, and some leaving. It can be a lot to keep track of, not to mention figuring out what to play from its massive library. That's why we created the Game Pass Show. Join Kurt and Persia to learn what's new, what's leaving, and what you should consider playing. Over the next couple of weeks, Game Pass sees the arrival of Humankind, Need for Speed Heat, Twelve Minutes, Psychonauts 2, and more. Persia also takes the time to elaborate on what she's been playing: Zoo Tycoon. Also, make sure to stick to the end for the pick of the week.\n\n#Psychonauts2", "link": "https://www.youtube.com/watch?v=k7HiisiNFi8", "date_published": "2021-08-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokemon Brilliant Diamond Shining Pearl Full Presentation (Trailer + Gameplay Breakdown)", "description": "Check out the full presentation from Pokemon Presents 8.18.21 showing off both the trailer as well as a gameplay breakdown of some of the features in Pokemon Brilliant Diamond / Shining Pearl, coming November 19, 2021!\n\n#pokemonpresents #pokemon #pokemonbrilliant", "link": "https://www.youtube.com/watch?v=Ds-q9mQXDdY", "date_published": "2021-08-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokemon Brilliant Diamond Shining Pearl Official Trailer #2", "description": "Check out the latest trailer unveiled for Pokemon Brilliant Diamond / Shining Pearl! Pokemon Brilliant Diamond / Shining Pearl is the remaster of a fan favorite in the series and officially is coming out on November 19, 2021!\n\n#pokemon #pokemonbrilliantdiamond #pokemonshinngpearl", "link": "https://www.youtube.com/watch?v=CzpvTP-zbdw", "date_published": "2021-08-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokemon Legends: Arceus Full Presentation (Trailer + Gameplay Breakdown)", "description": "Check out the full presentation for Pokemon Legends: Arceus featuring both a trailer and gameplay breakdown for the game now set to release in January of 2022. This content was unveiled during Pokemon Presents 8.18.21.\n\n#pokemonlegends #pokemon #pokemonarceus", "link": "https://www.youtube.com/watch?v=v_PtWy2bZf0", "date_published": "2021-08-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Legends: Arceus Trailer - Pokemon Presents", "description": "Check out the all new Pokemon Legends: Arceus trailer that was unveiled during the 8.18.21 Pokemon Presents presentation.\n\n#pokemon #pokemonlegends #pokemonarceus", "link": "https://www.youtube.com/watch?v=wOEHUANP-vo", "date_published": "2021-08-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Pokémon Presents Presentation 8.18.21", "description": "Check out the full Pokemon Presents presentation from 8.18.21 featuring new trailers for Pokemon Brilliant Diamond & Shining Pearl, Pokemon Legends: Arceus, and brand new gameplay breakdowns for each.\n\n#pokemon #pokemonpresents #pokemonlegends #pokemonarceus", "link": "https://www.youtube.com/watch?v=LVQOErg_FvU", "date_published": "2021-08-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Twelve Minutes Review", "description": "Twelve Minutes is a point-and-click adventure in a clockwork world that's as expertly crafted  as a Swiss watch.\n\nAndrew played six hours of Twelve Minutes, eventually breaking the loop. Code was provided by the publisher.\n\n#twelveminutes", "link": "https://www.youtube.com/watch?v=oyHbgqsnGfU", "date_published": "2021-08-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]