[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCmKurapML4BF9Bjtj4RbvXw", "title": "Anyone - Justin Bieber (Piano & Cello Cover) The Piano Guys", "description": "GET OUR LATEST ALBUM: https://smarturl.it/TPG_LATEST_ALBUM \n“Anyone” by Justin Bieber piano & cello cover from The Piano Guys.\nSTREAM THIS SONG & GET SHEET MUSIC: https://smarturl.it/TPGAnyone | WE’RE ON TOUR: https://smarturl.it/the10tour | SUBSCRIBE: https://bit.ly/subTPG | NEWEST videos: https://youtube.com/watch?v=IkBGhMUGtuA&list=PL7j5iXGSdMwc6hOknjuRsk6x8UieRRngh&index=2\n  \nHi all, Jon here – My family was my motivation to arrange “Anyone”.  We all have huge respect for the special talent of Justin Bieber.  The writer of the tune is another exceptionally gifted artist that our family greatly admires, namely Jon Bellion. The collaboration of these two produced what I feel is one of the greatest pop tunes ever… a true family favorite.  (The Bieber recording even made it onto my son’s wedding video).  Lots of love went into the arrangement with up to dozens of piano options for certain phrases until it felt perfect.  It was fun to do some of the work on the textures with my exceptionally talented son Spencer who contributed greatly.  What a payoff to play the final mix to the rave reviews of the fam! Special thanks to all of the people who contributed!\n \nLearn about our beliefs here: https://smarturl.it/TPG_Beliefs\n\nFollow The Piano Guys:\nFacebook: https://facebook.com/ThePianoGuys/\nInstagram: https://instagram.com/thepianoguys/\nTwitter: https://twitter.com/thepianoguys\n \nWatch More of The Piano Guys:\nOfficial Music Videos: https://youtube.com/playlist?list=PL7j5iXGSdMwfDukj_bIIB_1JhbYtaWRYg&playnext=1&index=2\nNewest Videos: https://youtube.com/playlist?list=PL7j5iXGSdMweO0HJlfOWtI2693vu23r_C&playnext=1&index=2\nMost Popular: https://youtube.com/playlist?list=PL7j5iXGSdMwc3F_u0P8QDpINSrsG_a5Tl&playnext=1\n \nListen to The Piano Guys:\nSpotify: https://open.spotify.com/artist/0jW6R8CVyVohuUJVcuweDI?si=8GgyFRhiTz6POs8b0ir2IA&dl_branch=1\nApple Music: https://music.apple.com/us/artist/the-piano-guys/498030399\nAmazon Music: https://amazon.com/The-Piano-Guys/e/B00BXLTTI4\n\nCredits:\n- Piano: Jon Schmidt\n- Cello: Steven Sharp Nelson\n- Vocals: Al van der Beek\n- Percussion Al van der Beek and Jon Schmidt\n- All other instrumentation: Al van der Beek\n- Arranged by: Jon Schmidt, Steven Sharp Nelson, Al van der Beek, Chuck Myers, Jake Bowen, Spencer Schmidt, Eric Shumway & Michelle Schmidt \n- Produced by: Jon Schmidt & Chuck e. Myers \"sea\" (Big Idea Music Productions inc.)\n- Co-Produced at: TPG Studios and Eric Shumway’s home studio by Al van der Beek, Steven Sharp Nelson,  Spencer Schmidt & Eric Shumway\n- Engineered by: Jake Bowen, Al van der Beek & Eric Shumway\n- Mixed & Mastered by: Al van der Beek (TPG studios)\n- Recorded at: Big Idea Music Studios (Sandy, UT), TPG Studios & Eric Shumway’s home studio\n- Cinematography & Editing by: Nick Sales (Aevium Films)\n- Piano Tuning & Regulation by: Rick Baldassin (Baldassin Performance Piano)\n- Piano: Yamaha C7 Disklavier Pro\n- Sheet Music - Craig Knudsen\n \nAbout The Piano Guys:\nBillions of views. Millions of followers. Wonders of the World. Concerts in every corner of the globe. Who knew all this could have started in a little Yamaha Piano Store in a tiny town of Southern Utah? But that’s what happened. Paul, a Yamaha dealer who dabbled in videography, Jon, a professional pianist, Al, a music producer and studio engineer, and Steve, a cellist with a creative superpower called ADHD, all serendipitously joined forces to create the most successful YouTube instrumental music group in history. The Piano Guys are watched and streamed over 3 million times EVERY DAY.\n \nThey’ve made their mark by taking the piano and cello out of their concert hall context and putting them in places you’d never expect to see them: On a speeding train, a cliff’s edge, a beach, or in front of the Seven Wonders. The Piano Guys’ mission is to inspire and spread hope through incomparably imaginative music videos filmed all over the world.\nLearn more online at ThePianoGuys.com\n \n#JustinBieber #PianoCover #CelloCover", "link": "https://www.youtube.com/watch?v=sLgU2-f1j2U", "date_published": "2021-08-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]