[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "New Guilty Gear Strive High-Level Gameplay For Ky, Sol, Axl", "description": "Get a look at high-level play for Axl Low, Ky Kiske, and Sol Badguy as they take on Zato-1 and Nagoriyuki from the Guilty Gear Strive dev team. In this exclusive clip we get to see brand new moves for Axl, Ky, and Sol.\n\nGuilty Gear Strive is the next core entry in Arc System Works' groundbreaking fighting game series, and it continues with the franchise's fusion of slick anime-style visuals and heavy-metal infused action. Ahead of the fighting game's upcoming beta starting later this month on February 17, GameSpot has exclusive new gameplay showing off some high-level matches with Sol Badguy, Ky Kiske, and Axl Low. In these fights, we also get a first look at each character's particular super move, which leans heavily into their fighting style and personality.\n\nAxl Low's One Vision  (timestamp - 0:45) \nInput: 632146 + P\nOne Vision is a move that temporarily freezes the opponent by controlling time. After inputting the command to ready the move, inputting the command again releases the attack that freezes the opponent. The freezing attack can be cancelled into from any move even in the air, including special moves.\n\nKy Kiskes Dragon Install (timestamp - 4:19)\nInput: 214214 + HS (When at low Health)\nKy transforms, strengthening each of his special moves significantly. On activation, it sends out a shockwave that knocks the opponent back. It will also cause an Area Shift on hit in the corner.\n\nSol Badguy's Heavy Mob Cemetery (timestamp - 8:30)\nSol transforms, performing an invincible lunge attack. It has long range and does incredible damage. Due to its great range, it's an excellent way to punish a vulnerable opponent.\n\nAxl Low vs Zato-1 0:07\nAxl Low One Vision - 0:45\nKy Kiske vs Nagoriyuki - 2:03\nKy Kiske Dragon Install - 4:19\nSol Badguy vs Zato-1 - 5:10\nSol Badguy Heavy Mob Cemetery - 8:30", "link": "https://www.youtube.com/watch?v=F9Wy1k-Rrko", "date_published": "2021-02-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "We Found Call of Duty Zombies In Cyberpunk 2077: Worst Way To Play Ep. 3", "description": "Jake and Rob return to boot up their Xbox One disc with the 1.0 version of Cyberpunk 2077, and continue their journey to try and beat the game through the bugs and jankiness— Can you finish Cyberpunk in it's worst possible condition?\n\n\nRound 3! Jake and Rob fight through Cyberpunk 2077 bugs and glitches as they attempt to play through the game on a base Xbox One, with no updates--version 1.0 all the way!\n\nAs you’re probably well aware of by now, CD Projekt Red’s role-playing game has had an infamously rocky launch. Over time it has been patched and updated, but we’re ignoring all that to go back to vanilla experience to showcase how this game was shipped on day one.\n\nIn order to do so, Jake and Rob have declined updates to the Xbox One disc version of Cyberpunk 2077 so they can live life on the edge. What you’ll witness in this video are immersion shattering bugs, game and loading stuttering, texture pop-ins, and unresponsive A.I.  Suffice it to say… it ain’t pretty. It’s fun and funny, but not pretty.\n\nWhat’s also worth noting is that this is a series in which Jake and Rob double down on the premise of encouraging “The Worst Way To Play.” That means they’re also role-playing as the worst character possible, so expect obnoxious and rude dialogue choices, as well as completely unnecessary physical altercations.\n\nAnd that’s what Episode 3 of The Worst Way to Play Cyberpunk 2077 has in store for you, so sit back and watch as our duo suffer to give you 8-ish minutes of fun and mischief. If you’d like to see more of this challenge, let us know in the comments below. And if you have specific ideas of how to make the experience even more miserable, let us know that too. Thanks for watching.", "link": "https://www.youtube.com/watch?v=AGMHemCY564", "date_published": "2021-02-07 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]