[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCTTZqMWBvLsUYqYwKTdjvkw", "title": "Co oprócz kurzu zbierają roboty sprzątające? Roborock, Dreame i mikrofon laserowy z Lidaru.", "description": "Roboty sprzątające mają coraz więcej różnych czujników. Czujniki podczerwieni, zderzeniowe, kamery i LIDARy. W tym filmie pojawią się badania na temat:\n- Danych przesyłanych do chmury przez odkurzacz Xiaomi,\n- Podejrzanych skryptów, które są dostępne w robotach Dreame a mogą służyć do tego by dostać się do waszej sieci\n- Podsłuchiwania za pomocą laseru\n\n0:00 Wstęp\n0:22 Więcej sensorów to większe możliwości.\n1:38 Jakie dane przechowuje i wysyłał robot odkurzający Roborock\n3:42 Dlaczego mój odkurzacz automatyczny wysyła tyle danych?\n4:00 TCPdump jako narzędzie do podsłuchu ruchu sieciowego\n4:20 Dreame i tunel SSH do chmury Huawei\n5:07 Podsłuch mikrofonem laserowym w ambasadzie w Londynie\n6:10 Podsłuchiwanie dźwięków za pomocą LIDAR-u w robotach.\n8:09 Co robić i jak żyć?\n\nW sekcji jak żyć zachęcam ceniących prywatność i odważnych do skorzystania z Valetudo jako zamiennika dla firmware dreame i firmware roborock. Bezpieczeństwo robotów wzrasta co jasno pokazują badania przeprowadzane na przestrzeni lat. Warto jednak wiedzieć jakie ryzyka są związane z korzystaniem z tak skomplikowanego sprzętu. \n\nLinki:\n------\nAlgorytmy sprzątania dla autonomicznych robotów: https://bit.ly/30irxW\nWykorzystanie LIDARU w poruszaniu się autonomicznymi pojazdami: https://bit.ly/3aB32Wa \nZdjęcie Roborock s6max: https://bit.ly/3lHafKQ\nLidarPhone czyli jak podsłuchiwać dźwięk robotem za pomocą LIDARU: https://bit.ly/3AOa5FS\nWątek na Reddicie związany z wysyłaniem dużej ilości danych przez roborock: https://bit.ly/3AIxtob\nMetody przeciwdziałania mikrofonom laserowym: https://bit.ly/3aFBxL2\nStrona Dennisa Giese z jego projektami i prezentacjami: https://dontvacuum.me/\nProjekt Valetudo umożliwiający odłączenie robotów od chmury: https://github.com/Hypfer/Valetudo\nLista robotów wspieranych przez Valetudo: https://valetudo.cloud/pages/general/supported-robots.html\nStrona, dzięki której można zbudować firmware dla wybranego robota: https://builder.dontvacuum.me/\n\nNa stronie 42 pracy magisterskiej na temat ekosystemu iot jest lista domen, które możecie dodać do waszego blockera typu pihole lub blokady by uniemożliwić łączność z chmurą. Minusem będzie brak zdalnego zarządzania: https://dontvacuum.me/thesis/Security_Analysis_of_the_Xiaomi_IoT_Ecosystem.pdf", "link": "https://www.youtube.com/watch?v=rbuKPEHzDIY", "date_published": "2021-10-15 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]