[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "Can you REPLACE CHROME OS with this Linux distro that runs ANDROID APPS?", "description": "The first 1000 people to use the link will get a free trial of Skillshare Premium Membership: https://skl.sh/thelinuxexperiment03211\n\nChrome OS has been getting more and more popular, as chromebooks prices are relatively low, and many people just need a browser to work. But this system is still completely owned by Google, tied into their services, and as such, not very private. FOrtunately, there is an alternative on the horizon, and it's called Ubuntu Web Remix. let's see if it's actually ready to replace Chrome OS\n\nBecome a channel member to get access to a weekly patroncast and vote on the next topics I'll cover:\nhttps://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\n\nSupport the channel on Patreon: \nhttps://www.patreon.com/thelinuxexperiment\n\nFollow me on Twitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\n\nFollow me on LBRY: https://lbry.tv/@TheLinuxExperiment:e\n\nThe Linux Experiment merch: get your goodies there! https://teespring.com/en-GB/stores/the-linux-experiment\n\nThis video is sponsored by Skillshare.\n\n## The Interface\n- Uses GNOME-Shell, with the dash2panel extension to mimic what Chrome OS looks like\n- It has a main menu, a favorites list, date and time indicator, and the regular system stuff\n- It uses the Adapta theme and the papirus icons\n- It all give it some kind of older Android look and feel, but it's not unpleasant\n- The GNOME shell doesn't seem themed at all\n\n## The apps\n- Very minimal installation by default:\n- only a few web apps, a local file manager, Nautilus\n- An archive manager, calculator, document scanner, and screenshot tool, plus the GNOME settings. You also have the system monitor, and GNOME boxes for some reason\n- No GNOME software, but you have a terminal, so you can install it\n- There are a bunch of webapps preinstalled though, including all the /e/ services\n- /e/ has online services based on Nextcloud, including cloud storage, but only 1Gb of it, a calendar, a contact directory, en email address, notes, photos, and tasks\n- All of these apps will just take you to the corresponding tab in your /e/ nextcloud account, that you can create directly by launching any of these apps\n- If you don't want to use /e/ services, you can decide not to use them, or remove them\n- There is a super simple tool to let you remove installed web apps. it's not pretty, but it works\n- You also get Firefox, of course, which is the base for all of these webapps, as they'll open in a Firefox window, without any of the toolbars\n- You also get a link to Mastodon, and Soundcloud, as well ad Dtube, so you have alternatives for social media, youtube, and music\n- No Snap or Flatpak installed: They're really not pushing you towards installing native apps, they'd rather you use webapps\n- Curiously, it lacks any way to create your own webapp out of a website: Firefox doesn't support that out of the box, and although you can enable site-specific browsers in the about:config page, it's not enabled by default\n- For now, your only way to install new apps is through the web store, and you have no way of just creating your own, which seems like a big omission for Ubuntu Web remix.\n\n## The web Store\n- It's a first implementation\n- Look and feel wise, it's still super simple\n- There is virtually nothing in there for now, apart from a few social networks like Facebook, YouTube, or Instagram\n- You can download these webapps, and you get a file, that you can install by double clicking it in the file manager, after you make it executable. Not very simple.\n- You can also use the installer and go fetch the file from there.\n- There is a wapp format that the developer created, that lets people package their own webapps, and submit them to the store through the project's gitlab page, but for now, nothing seems to have been added\n\n## Anbox and Android apps\n- Ubuntu web remix uses Anbox to allow running Android apps\n- It ships with a few android apps preinstalled, including the default calculator, calendar, clock, contacts, email, files, gallery, music, and settings from Android\n- You have the F Droid store by default, and you can sideload APK with an adb command line, although once again, an installer would be nice, since F-Droid won't have every Android app you might want\n- Uses a pretty old and insecure version of Android by default, so it's not a perfect solution\n- It doesn't seem to have many limits, as you could even install the Google Play Store, though it wouldn't allow me to connect at all, I think it might need Google Play Services support", "link": "https://www.youtube.com/watch?v=ugAB_ug9MZg", "date_published": "2021-03-13 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]