[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCoOjH8D2XAgjzQlneM2W0EQ", "title": "Divorces are getting out of hand...", "description": "📹 Get unlimited stock video, photos, music, & more at http://storyblocks.com/jaketran \n\n😈 Watch exclusive 40+ minute documentaries that are too controversial to ever be released to the public: https://jake.yt/join \n\n📹 Take a peak at all the private documentaries here: https://jake.yt/hidden-vids\n\n💸 Win $1,000! https://jake.yt/1000 \n\n🎥 Business is complicated. Subscribe to curiosity: http://bit.ly/jt-sub\n✨ Follow us on TikTok: https://jake.yt/tiktok\n🎙️ Subscribe to the 2nd channel, Intellectual Dropouts: https://jake.yt/id\n✉ Be the first to watch new videos with email notifications: http://bit.ly/jt-inbox\n📸 Follow me on IG for a chance to win $1,000: @jaketran // http://bit.ly/jt-ig\nPlease watch out for fake accounts. I will never message you asking for money or to invest. As of right now, it's spelled exactly like this: @jaketran\n💬 Join the community Discord: http://discord.gg/BmK8EnQ\n\nSupport this channel monetarily:\n💻 𝗟𝗮𝗽𝘁𝗼𝗽 𝗟𝗶𝗳𝗲𝘀𝘁𝘆𝗹𝗲 𝗔𝗰𝗮𝗱𝗲𝗺𝘆: Learn exactly how I landed my $40/hr work from home job ($83k/yr) at 19 years old: https://jake.yt/LLAd\n📜 The exact resume I used to get my $40/hr remote web dev job + a lot of bonuses: https://jake.yt/DRBd\n\n✉️ Email me: jake@jaketran.io\n\n📰 Sources & visuals: https://bit.ly/33NrRuE\n\n-----------------------\nBack in April 2019, the greatest stock trade in the history of the world was completed: MacKenzie Scott bought Amazon stock in 1993 - an entire year before the company was founded and sold in 2019, twenty-six years later for a staggering $35 billion in profit. But instead of buying and selling Amazon stock - it was through marrying Jeff Bezos (without a prenup) - and divorcing Jeff Bezos. \n\nThen there’s poor ol’ Elon - who didn’t go through just one pricey divorce - but three! The first was with Justine Musk. Elon had to pay at least $4 million dollars in legal and accounting fees, which comes out to $170,000 per month. \n\nThen came his second marriage with actress Talulah Riley. They divorced in 2012, leaving Riley with $4.2 million dollars. Then they made up, got married again and then divorced again a year later, leaving Riley with a much more respectable $16 million. \n\nWhich brings us to Bill and Melinda Gates. Bill married Melinda on a Hawaiian Island around the same time as Bezos in 1994. Twenty-seven years later in 2021, they file for divorce and are still working out how much of the $130 billion dollar empire Melinda is gonna get. Bill has already given her $2.4 billion dollars worth of shares. \n\nBefore you go calling all women gold diggers, unless you’re divorcing the ultra wealthy, usually neither the groom nor the bride comes out on top. Usually, in America, the real gold diggers that profit off of a divorce - are the divorce lawyers, the judges, the family courts.\n\nWell, what most people don’t realize is that in America, marriage is not just a vow of love, but a financial contract.\n\nYou hire a divorce lawyer to protect yourself against your spouse taking your stuff. You pay maybe $600/hr, $700/hr, and maybe even more insane numbers. Why do people pay such high rates? Bc they’re desperate!\n\nAs a lawyer, you’re paid hourly, therefore, it’s in your best interest to keep the fighting going bc if your client’s divorce is settled, you lose your income stream.\n\nThe lawyers aren’t alone in this industry though, the other major players are the judges. And with great power - comes great opportunities to be bribed.\n\nSo if you do get married, maybe don’t follow in the steps of Jeff Bezos and Elon Musk and get a prenup.\n-----------------------\n\nNo Spirit - Careless https://chll.to/b9af7f36 \n\nAll materials in these videos are used for educational purposes and fall within the guidelines of fair use. No copyright infringement intended. If you are or represent the copyright owner of materials used in this video and have a problem with the use of said material, please send me an email, jake@jaketran.io, and we can sort it out.\n\nCopyright © 2021 Transcend Visuals, LLC. All rights reserved.\n\nDISCLAIMER:\n\nThis video does not provide investment or economic advice and is not professional advice (legal, accounting, tax).  The owner of this content is not an investment advisor.  Discussion of any securities, trading, or markets is incidental and solely for entertainment purposes.  Nothing herein shall constitute a recommendation, investment advice, or an opinion on suitability.  The information in this video is provided as of the date of its initial release.  The owner of this video expressly disclaims all representations or warranties of accuracy.  The owner of this video claims all intellectual property rights, including copyrights, of and related to, this video.\n\nAFFILIATE DISCLOSURE: Some of the links in this video's description are affiliate links, meaning, at no additional cost to you, the owner may earn a commission if you click through, make a purchase, and/or opt-in.", "link": "https://www.youtube.com/watch?v=HsWPm-rzQnc", "date_published": "2021-05-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]