[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Deathloop Preview (4K)", "description": "Deathloop is some parts a natural evolution of past Arkane games, and something else altogether. It's an exciting, complicated premise, but one that has a lot of promise. Lucy breaks down what you need to know.  \n\nDeathloop's premise sounds pretty simple, right? Two assassins caught in a time loop. Except when you factor in eight different targets, four different districts to visit at four different times of day, some sort of magic abilities, a player-controlled assassin hunting you, oh, and a time loop, it starts to get a little more complicated.\n\nLucy recently got to see Deathloop in action and while the premise is pretty layered, the execution (no pun intended) looks to be an exciting, natural evolution of previous Arkane games. In the video above she breaks down what you need to know about the game, its main characters Colt and Julianna, and just how the time loops on the mysterious island of Blackreef will work.\n\nDeathloop will be a timed PlayStation 5 exclusive and is launching on September 14. For more, check out Tamoor Hussain's written preview on gamespot.com.", "link": "https://www.youtube.com/watch?v=O1ohc1BcqV4", "date_published": "2021-05-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Everything To Know About Call Of Duty: Cold War’s Mid-Season 3 Update", "description": "Call of Duty’s mid-season 3 update is dropping new game modes, 80s action stars Rambo and John McClane, as well as a limited-timed Die Hard location to Warzone.\n\nCall of Duty’s mid-season 3 update is dropping new game modes, 80s action stars, and limited-timed changes to Warzone. The John Rambo Pack includes the operator with two finishing moves, special blueprints for the Combat Knife, an LMG, and assault rifle. Die Hard’s John McClane also joins season 3 with his own operator bundle. It’ll include blueprints for the Fara 83, MP5, and one for an undisclosed tactical rifle that could be the AUG.\n\nLimited time events and locations are coming to Warzone including Die Hard’s Nakatomi Plaza with missions such as disarming C4 on the building’s roof, finding special supply boxes and “interrupting an arms deal gone wrong.” The location will also include the Nakatomi Plaza vault that can be opened by players using special keycards. Also coming to Warzone is a smaller battle-royale mode called Power Grab with 100 players and no Gulag. Players can be revived with a Kill-Confirmed like system. \n\nCold War is getting new content including two new maps, Duga and Black Ops 2’s Standoff remake, the new killstreak Combat Bow, a new weapon the Ballistic Knife. Keeping in them, new game modes Die Hardpoint and Rambo’s Gun Game will be added to the mix. New secondary weapons that will also crossover to Warzone are the Baseball Bat and AMP63: Pistol. Finally there is a new Main Quest for Zombies. Make sure to head on over to GameSpot as the Season 3 progresses to find out more.", "link": "https://www.youtube.com/watch?v=bZjfcrzuGv8", "date_published": "2021-05-19 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Biomutant Developer Explanation Trailer", "description": "Check out the all new developer trailer for Biomutant explaining what Biomutant is and various aspects of the game and story. This trailer also teases different aspects like character customization that you can expect to see in the game upon release. Biomutant is developed by THQ Nordic. \n\n#Biomutant", "link": "https://www.youtube.com/watch?v=xc93HHNk65s", "date_published": "2021-05-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Mass Effect 1 Liara Romance Scene - Original VS Legendary Edition Comparison", "description": "See the differences in Liara's romance scene between the original release of Mass Effect, and the newly remastered version in Mass Effect Legendary Edition.", "link": "https://www.youtube.com/watch?v=NeqQ743h75A", "date_published": "2021-05-18 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]