[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UC5UAwBUum7CPN5buc-_N1Fw", "title": "MATE is not a complete desktop environment... MATE Applications tour", "description": "Wanna get your own Linux server? Visit https://www.linode.com/linuxexperiment for a 100$ credit ! \n\nGet your Linux desktop or laptop here: https://slimbook.es/en/\n\n\nIt's time to continue our trip down memory lane with MATE. As I've said in a previous video, I spent a lot of time on GNOME 2 when it was the default on Ubuntu, and I know most of its default apps like the back of my hand. It's been 10 years since I've used GNOME 2 though, and MATE has evolved past that, so let's see you get out of the box, and if that's any good.\n\n\n👏 SUPPORT THE CHANNEL:\nGet access to an exclusive weekly podcast, vote on the next topics I cover, and get your name in the credits:\n\nYOUTUBE: https://www.youtube.com/channel/UC5UAwBUum7CPN5buc-_N1Fw/join\nPatreon: https://www.patreon.com/thelinuxexperiment\n\n\n🏆 FOLLOW ME ELSEWHERE:\nTwitter : http://twitter.com/thelinuxEXP\n\nMy Gaming on Linux Channel: https://www.youtube.com/channel/UCaw_Lz7oifDb-PZCAcZ07kw\nFollow me on ODYSEE: https://odysee.com/@TheLinuxExperiment:e\nOr join ODYSEE: https://odysee.com/$/invite/@TheLinuxExperiment:e\n\n\n\n00:00 Intro\n01:34 File Manager\n03:41 Terminal\n05:16 Text Editor\n06:18 Utilities\n07:47 Missing Parts\n10:00 Parting Thoughts\n\nThe FIle manager is a fork of Nautilus, which was the default GNOME 2 file manager, and is also the name for GNOME 3's file Wanna get your own Linux server? Visit https://www.linode.com/linuxexperiment for a 100$ credit ! \n\n\nGet your Linux desktop or laptop here: https://slimbook.es/en/.\n\nIt supports the basics:\ntabs, for opening multiple folders at once,\nIcon view, list view, and compact view, with per folder display preferences\nA nice sidebar, that displays your favorite places, but can also be changed to an information panel, a tree view that you can navigate, a history of the places you visited recently, some notes on the current folder, or a list of emblems\n\nCaja will also let you open 2 panes, to have 2 folders open at the same time, select any column you want to display in the list view, or compress, share, encrypt, or sign any file or folder.\n\nPreferences are plentiful here, with the ability to change the default view parameters, use single click or double click to open items, open each folder in its own window, change the behavior when opening executable files, select what thumbnails you want or don't want to see, and even access some extensions.\n\nTerminal\nAnother very important app for a desktop environment, is the terminal emulator.\nMate ships with MATE terminal, a fork of GNOME 2's terminal app.\n\nHere again, you have your basics, like tabs, customizable profiles, search, and size management.\n\nOf course all the colors are changeable as well, and you can put any background you want, whether it's a color, an image, or simply a transparent background, although there is no blur by default.\n\nYou also don't get task completion notifications, if you have multiple tabs open, or any indicator in the tab itself to show that the job is done, which is shame, cause that's super practical.\n\nText Editor\n\nMATE comes with the Pluma text editor. It's a fork of GNOME 2's GEDIT, and it bears considerable familiarity with it. \nIt's a simple text editor, with tabs, printing support, search and replace tools, spellcheck, or statistics on the document you're currently editing.\n\nIt also has a side pane that lets you move from document to document, or navigate the filesystem, so you could even use it to write and edit code since it supports syntax coloration for a lot of languages.\n\nThe Utilities\n\nMATE does ship with a bunch of utilities, including an image viewer, a document viewer, an archive manager, a calculator, a font viewer, a search tool, a color selection utility, a dictionary, a disk usage analyser, and a system monitor.\n\nThese are all forks of GNOME 2's equivalent utilities\n\nWhat's lacking\n\nMATE, like XFCE, lacks a few applications to complete its desktop environment though.\nFirst, there is no default app store: GNOME has GNOME Software, KDE has Discover, Pantheon has the AppCenter, but MATE doesn't have anything of its own.\n\nThere is also no default media player, either for video, or audio, which is also a pretty big deal: distros have to cover that themselves as well.\n\nOn Fedora, they use the Parole Media player, from XFCE, and dnfdragora as a package manager. The former is fine, the latter is definitely not user friendly enough for a beginner.\n\nI think desktops that stick to the menubar paradigm should pull their forces and maybe work on some common applications to fill in these gaps.\n\nYou also won't find a default calendar app, or email client.\n\n\nConclusion\n\nTo conclude, the application set for MATE is good. The file manager is definitely a highlight, with its tight integration with the places menu, and its multi purpose side panel.", "link": "https://www.youtube.com/watch?v=jg_be5GZyp0", "date_published": "2021-08-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]