[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCAKcSON6PSG_JkTbXh2WdIg", "title": "Allan Kingdom - two songs at The Current (2014; 2017)", "description": "Four years ago this week, Allan Kingdom visited The Current to record a session for The Local Show and for MPR News' Summer Music Series.\n\nBorn in Winnipeg and raised in St. Paul, Minn., Allan Kingdom started writing songs as early as age 16. Kingdom first thought he would rap exclusively, but when he couldn't find a producer with a sound that matched what he had imagined, Kingdom decided to produce his own tracks out of necessity — attending the Minneapolis Institute of Production and Recording certainly helped in that pursuit. Since launching his career, Allan Kingdom has been nominated for three Grammy Awards, and has collaborated with the likes of Justin Vernon, Kanye West and Paul McCartney. More recently, Allan Kingdom founded the nonprofit Yebo Life, which works to solve short-term problems for disenfranchised and low-income communities, as well as invests in those communities to provide long-term solutions to systematic oppression.\n\nWatch these performances by Allan Kingdom, accompanied by DJ Tiiiiiiiiiip, recorded in The Current studio in 2014 and 2017. \n\nSONGS PERFORMED\n0:00 \"Evergreen\"\n3:37 \"Know About It\"\n\nPERSONNEL\nAllan Kingdom – vocals\nDJ Tiiiiiiiiiip – beats\n\nCREDITS\nVideo & Photo: Leah Garaas; Evan Frost\nAudio: Michael DeMark; Zach Rose\nProduction: Julie Siple; David Campbell\n\nFIND MORE:\n2014 studio session: https://www.thecurrent.org/feature/2014/10/21/allan-kingdom-performs-live-in-the-current-studio\n2017 studio session: https://www.thecurrent.org/feature/2017/08/03/allan-kingdom-2017\n\nSubscribe to our channel:\nhttp://www.youtube.com/user/893TheCurrent?sub_confirmation=1\nLike/Follow:\nhttps://www.facebook.com/TheCurrent/\nhttps://twitter.com/TheCurrent\nhttps://www.instagram.com/thecurrent/\n\n#thecurrent #allankingdom", "link": "https://www.youtube.com/watch?v=PwCDFOimkX0", "date_published": "2021-08-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCAKcSON6PSG_JkTbXh2WdIg", "title": "Listen to Looch: 'No No: A Dockumentary' is a baseball story unlike any other", "description": "This week, Mary Lucia talks about a 2014 documentary, \"No No: A Dockumentary,\" about Major League Baseball pitcher Dock Ellis. \"Dock Ellis was a pitcher for the Pittsburgh Pirates who struggled his entire life with drugs and alcohol,\" Mary explains, \"but performed while under the influence and then most famously pitched a no-hitter while tripping on LSD.\"\n\nThe story of Ellis is certainly one about baseball — including Ellis's role as one of baseball's Black pioneers in the 1960s and 70s. It had been 20 years since Jackie Robinson broke the Major League Baseball's color barrier, but the sport still had strides to make. When the Pirates fielded an all-Black lineup, it was a milestone. Unfortunately, when Ellis showed up to practice with hair rollers — simply following a Black hair fashion of the time — reactions were at best fastidious, at worst, racist. \"It was a style,\" Mary says. \"What's the big deal? Like 'first guy to get an earring,' you know, this is crazy, right?\"\n\nIn his later years, Ellis took on his substance use disorder and became a counselor to younger baseball players and to men in prison. \"The no-hitter was great,\" says Operation New Hope counselor Victor Beecham, \"but the latter days were greater.\"\n\n\"No No: A Dockumentary\" is directed by Jeffrey Radice and is available for streaming on Amazon Prime and other platforms. It can also be rented from DVD.com. \n\nSubscribe to our channel:\nhttp://www.youtube.com/user/893TheCurrent?sub_confirmation=1\nLike/Follow:\nhttps://www.facebook.com/TheCurrent/\nhttps://twitter.com/TheCurrent\nhttps://www.instagram.com/thecurrent/\n\n#marylucia #dockellis #baseball", "link": "https://www.youtube.com/watch?v=ZKtpQO6s710", "date_published": "2021-08-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCAKcSON6PSG_JkTbXh2WdIg", "title": "Jim Lauderdale - two songs at The Current (2018)", "description": "Last Friday, prolific singer-songwriter Jim Lauderdale released \"Hope,\" his 34th album to date! Three years ago, Lauderdale visited The Current's studio to record a session for Radio Heartland; at that time, the two-time Grammy Award-winner, North Carolina Music Hall of Fame inductee and Americana-music icon was touring in support of \"Time Flies,\" his album from that year. Watch two songs from that 2018 session.\n\nSONGS PERFORMED\n0:00 \"Violet\"\n3:41 \"Time Flies\"\n\nPERSONNEL\nJim Lauderdale – vocals, guitar\n\nCREDITS\nVideo & Photo: Nate Ryan, Minju Kim\nAudio: Michael DeMark\nProduction: Mike Pengra\n\nFIND MORE:\n2018 studio session: https://www.thecurrent.org/feature/2018/10/08/jim-lauderdale-performs-songs-from-time-flies-at-radio-heartland\n\nSubscribe to our channel:\nhttp://www.youtube.com/user/893TheCurrent?sub_confirmation=1\nLike/Follow:\nhttps://www.facebook.com/TheCurrent/\nhttps://twitter.com/TheCurrent\nhttps://www.instagram.com/thecurrent/\n\n#thecurrent #jimlauderdale #yeproc", "link": "https://www.youtube.com/watch?v=jtYeu1C7dlY", "date_published": "2021-08-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]