[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "7 Reasons to Try Call of Duty Mobile", "description": "Since its launch in 2019, Call of Duty Mobile has separated itself from its console counterparts. Let's take a look at a few reasons why you might want to try it out for yourself.\n\n\nCall of Duty Mobile is a sleeping giant. Even with more than 500 million downloads, it’s fan base is a relatively quiet bunch. For a game packed to the brim with content (much of it for free) it’s astounding how little COD Mobile hits the radar of Call of Duty fans as a whole. Everything from fan-favorite maps to every operator you can think of, there’s more than enough to satisfy fans of the series. In this video Richie Bracamonte discusses seven reasons why you should try Call of Duty Mobile.   \n\n\nThere’s a lot to love about COD mobile. Most of which gets little love in the world of FPS and Mobile gaming. Whether you’re partial to Apple, Android or even PC, COD Mobile is a free-to-play game. Not only does it contain multiplayer with classic maps, but also included is a Battle Royale mode and rebooted Zombies siege mode. Whichever mode you play, you’re rewarded with loads of weapon skins, XP, and even COD credits that let you choose from a store of more unlockable goodies. \n\n\nMainline Call of Duty games on consoles and PC will always get exposure. Every year they’re highly marketed and have no trouble making headlines. But maybe after checking out Richie’s list, you’ll consider taking Call of Duty with you on the go, too. Stay up to date with Call of Duty and other upcoming FPS games like Halo Infinite and Battlefield 2042 on GameSpot.com and Gamespot’s YouTube page.\n\n#cod #callofduty #codmobile", "link": "https://www.youtube.com/watch?v=yAh0DrS9LEo", "date_published": "2021-08-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Hades, Katamari Damacy Reroll, Skate | Xbox Game Pass Show", "description": "Learn about what's new, what's leaving, and what you should be playing on Game Pass. This your Game Pass digest for August 3, 2021. \n\nGame Pass has a lot of games, and twice a month there's more coming, and some leaving. It can be a lot to keep track of, not to mention figuring out what to play from its massive library. \n\nThat's why we created the Game Pass Show. Join Kurt to learn what's new, what's leaving, and what you should consider playing. Over the next couple of weeks, Game Pass sees the arrival of Hades, Skate, Katamari Damacy Reroll, and more. Kurt also takes the time to elaborate on what she's been playing: Last Stop. Also, make sure to stick to the end for the pick of the week.\n\n#GamePass #Xbox", "link": "https://www.youtube.com/watch?v=cv2dHboCW9s", "date_published": "2021-08-04 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Street Fighter V Summer Update 2021", "description": "Tune in for updates and behind the scenes looks on Street Fighter V including Oro, Akira, and more!\n\n#streetfighterV", "link": "https://www.youtube.com/watch?v=KpacAdYgbd0", "date_published": "2021-08-03 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]