[{"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Apex Legends Legacy Preview", "description": "After going hands-on with Apex Legends Legacy, Persia, Jordan, and Max sat down to talk about Season 9's Arenas mode, new playable legend Valkyrie, Bocek Bow weapon, Olympus map changes, and more.", "link": "https://www.youtube.com/watch?v=Wo9CSF9Ff0w", "date_published": "2021-04-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Apex Legends – Legacy Gameplay Trailer", "description": "Check out the all new Apex Legends - Legacy Gameplay trailer showing off some of the new features, modes, and weapons coming to Apex Legends - Legacy! Apex Legends - Legacy follows season 8 of the popular battle royale title! \n\n#ApexLegends #Legacy", "link": "https://www.youtube.com/watch?v=iol6Qs3uHs8", "date_published": "2021-04-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Dying Light 2 - Developer Ask Me Anything", "description": "The developers behind Dying Light 2 just released an ask me anything taking a look at all the questions from fans after the most recent Dying Light 2 update! \n\nDying Light 2 is the long-awaited sequel to Dying Light and this is the first episode of the developers breaking down some of your most asked questions! \n\n#DyingLight2 #DyingLight #Techland", "link": "https://www.youtube.com/watch?v=GgrR018SXbQ", "date_published": "2021-04-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Fortnite - Neymar Jr. Outfit Cinematic Reveal Trailer", "description": "Check out the official Fortnite Neymar Jr. outfit cinematic reveal trailer! This marks the first official entrance of a full real-life athlete skin entering Fortnite Battle Royale! \n\n#Fortnite #Neymar", "link": "https://www.youtube.com/watch?v=4Rg2otpUf3A", "date_published": "2021-04-26 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Apex Legends & Titanfall Timeline Explained", "description": "As the Legacy season of Apex Legends approaches, it's important to know how it intertwines with Titanfall to understand what's on the way for Respawn Entertainment's Sci-Fi universe. Join Persia as she goes into a deep dive on the connections between Apex Legend and Titanfall that occur over the course of over 700 years and major connections within the titles such as Kuben Blisk, Ash, and Viper. \n\nIn this video, Persia goes into a deep dive on the various connections between Apex Legends and the Titanfall universe. Season 9 of Apex Legends is right around the corner and will be bridging its gap between Titanfall 2 more than ever with the introduction of Viper's daughter as the newest legend to join the Apex Games.\n\nPersia runs through the entire timeline beginning in the 2100s and leading to the present-day in Apex which is 2735. The beginnings of this ever-expanding universe were controlled by the rise of Hammond Engineering and the IMC who become one of the biggest connections besides Kuben Blisk, the leader of the Apex Predators and the commissioner of the Apex Games.\n\nOther notable connections that Persia mentions are Ash, the doctor or Apex Predator depending on who you're asking, and  Bangalore who has a family history within the IMC as soldiers and scientists.\n\nPlenty more lore from Respawn Entertainment's Sci-Fi universe is on the way, so if you want to stay up to date on everything Apex and Titanfall, then be sure to leave a like and subscribe!", "link": "https://www.youtube.com/watch?v=OWaQNdqedXc", "date_published": "2021-04-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}, {"source": "https://www.youtube.com/feeds/videos.xml?channel_id=UCbu2SsF-Or3Rsn3NxqODImw", "title": "Resident Evil Village | Castle Demo Gameplay (PS5)", "description": "Enjoy a look at the Castle portion of the Resident Evil Village demo, running on PS5.", "link": "https://www.youtube.com/watch?v=JQ6mv73GTQM", "date_published": "2021-04-25 00:00:00+00:00", "persistent": false, "user": null, "language": "en-US"}]